{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 54, "rating": 3.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Not Peter Carey's best, which can be to me amazingly good, but I thought quite entertaining in the main. A ffurther pursuit of Carey's ongoing fascination with counterfeiting of anything from currency to master paintings to, in this case, poetry in all its cloaks from truth to plagiarism."}, {"review_sentiment": 5.0, "review_text": "Peter Carey based My Life as a Fake on a real incident in Australia where a writer perpetrated a hoax by publishing the poems of an individual he claimed was dead, but never really existed. While the actual incident would be interesting enough, Carey takes this further by have the supposedly imagined poet show up in the life of the individual who created the hoax.The story is told by Sarah - the editor of a London Lit journal who has followed another writer, Slater to Malaysia. Slater, knew Sarah's mother and part of her reason to go there is because she wanted to know what really happened between Slater and her mother. That subplot is a perfect subtle way of getting the reader to question the narrator's reliability. Added to that, a layering of stories told to the narrator that sometimes include another told to them. The reader receives conflicting stories through this technique and one finds oneself wonder which is true.Sarah, while in Malaysia, she runs into Christopher Chubb, the man who created the poetry hoax. He shows her a poem he insists is the work of Bob McCorkle, the supposedly made up poet. She realizes it is a brilliant piece of writing, but Chubb says he must tell her his story. His story is also told by Slater, giving the reader two different sides. As the story continues, Chubb tells his story, and the story of the hoax, of Bob McCorkle come to life, of his daughter, his lover, and the stories of others who help or hinder him along the way, as well as telling the stories they have told to him. We also hear directly from the daughter through the narrator and Slater tells Sarah versions of some events he participated in, heard, or witnessed that differ to the point that the are sometimes in direct conflict with what we learn before or after. The narrator herself begins to question things, but her own desires color what she chooses to believe. Slater also tells her what really happened to her own mother, even though she remembers it differently.In the end, the narratives weave in and out, closer and further from the narrator and the reader is left to question what did or didn't happen - and is left to the reality that none of the characters are all that likable. Does a character's likability make it more like we believe their version? Sarah starts as likable, but as the story progresses I found her less and less so. Her obsession reflects that of Chubb and at least one version of McCorkle, and while the end is of course in question, one imagines she end up similarly.It is rare to find a book where the characters aren't especially likable, yet My Life as a Fake is wonderfully engrossing. Carey does an excellent job at recreating post-war Australia, and 1950's and 70's Malaysia for the readers, and in creating engaging characters that are fully drawn if not particularly sympathetic. I found that even though the story was being told to the narrator, each of the characters in any given story had their own voice. He also has created a sort of literary Frankenstein in Bob McCorkle that keeps the plot moving and building to the shocking end. The story is action packed and full of vivid details — an impressive feat when you realize that during the course of the narration, only a short time passes in opposition to the decades the stories told to her take, and, other than moving from place to place where characters meet and the story is revealed, there is little real-time action.Carey's characters are epically flawed - they are greedy, selfish, amoral, and vengeful (often for slights perceived as far worse than most of us would see them) and more often than not under the sway of one of those flaws, although they cannot see it, even when reflected in others they accuse of the same. While the end is shocking, it feels inevitable and unavoidable, and the sadness is not for the consequences, but rather for the fact that they couldn't see it coming."}, {"review_sentiment": 2.0, "review_text": "BORING AND CONFUSING"}, {"review_sentiment": 3.0, "review_text": "Interesting novel on the magical realism genre, but nothing especially appealing or innovative about it."}, {"review_sentiment": 2.0, "review_text": "Although a Booker Prize winner in 1988 with “Oscar and Lucinda” and “True History of the Kelly Gang” in 2001 Carey’s book is a disappointment insomuch as it is set in the somewhat arcane world of poetry and suffers from having too many sub plots which lack fluidity and indeed credulity.A lesbian poetry magazine editor accepts a holiday in Malaya funded by the man she holds responsible for the suicide of her mother and during which she uncovers a convoluted hoax involving a “magical” giant, which in turn exposes another previous suicide and a subsequent fratricide.Based on a true event in Australia in 1943 the narrative is disjointed and lacks any literary cohesion with the various strands of the story creating a confusion which given the potential for a more substantial plot only serves to distract from what should have been a more interesting read.Carey makes the mistake of naming districts and locations within Kuala Lumpur in the assumption that they will set the scene for much of the novel, without realising that a more descriptive prose would achieve his purpose with greater effect.Carey is an author of some renown however this effort falls short of his previous high standard."}, {"review_sentiment": 5.0, "review_text": "Peter Carey's brilliant novel takes it's title from the earnestly authentic autobiography in verse of one Bob McCorkle, a strange antipodean ubermensch who was born, \"at the age of twenty four\" as the literal brainchild of a literary hoaxer. Christopher Chubb, a highbrow, anglophiliac poet who can turn a correct villanelle, has written mock modernist verses in an effort to discredit modernism in Australia. In so doing he has unwittingly played Dr. Frankenstein to a literary monster--an authentic, perhaps the authentic--Australian poet, McCorkle. Even though McCorkle is--must be--a fake, the genius of Carey's novel is that he is made to come to life. Born of Chubb's indignant, reactionary imagination, McCorkle's reality challenges the sanity of the other characters. Indeed, for a colonized imagination like Chubb's the idea of an Australian poet must seem as impossible as Frankenstein's monster. Yet, so it is. My Life as a Fake is an ambitious novel has many points to make--this is one of them: Aussie literature is alive!How ironic then that the narrative is given over to an English woman, Sarah Wode-Douglass, the precocious and eccentric scion of minor English aristocracy. Half Australian herself, on her mother's side, she hopes to recover McCorkle's work for the poetry review she edits. To do so, she has to go through Chubb, now a broken man, middle-aged, \"in a dirty sarong,\" with tropical ulcers on his legs and \"close-cropped hair\" that makes Sarah \"think of both a prisoner and a monk.\" He is working in a bicycle shop in Kuala Lumpur, Malaysia, where the novel takes place. He reads Rilke: The Sonnets to Orpheus--in German no less. Not your usual bicycle mechanic.The whole story is told long after the fact from the vantage of an English parsonage; just the sort of place where English literati have ever retired to pen their tart and ironic memoirs. The effect of this distanced boxed narrative is a Conrad-like series of stories within stories. This impression is strengthened by many jungle scenes that are reminiscent of Lord Jim. Sarah writes in a state of recovery from her own quest--not only for McCorkle's magical poems, but for her own self, her own past. She has found that the assumptions that had grounded her own self-narrative-- how she had understands the suicide of her glamorous mother and the life of her rakish father--have been false. Her's is a kind of recovery narrative; she is putting her mental house in order. Through Sarah, we readers are forced to look back from the land of supposed sanity, England, to the upside down world of south Asia and Australia--where anything can happen and in this novel, does. For a highly literary detective story, Carey's novel is packed with action. McCorkle is large, athletic and violent; he is boastful, unsure and very, very angry. My Life as a Fake has its share of violence and death and colorful characters: the Boho hot-box  Noussette, a Tamil poisoner,  Vogelsang the gumshoe, the ferocious Mrs. Lim, and the beautiful Tina, Chubb's daughter, whose inner thighs are calloused and scarred from climbing jungle trees.Carey has always had a weakness for slightly over-sized male heroes, especially when they embody Australian virtues. Bob McCorkle is in the tradition of Carey's  Jack Maggs and Ned Kelly. That said, Carey's deepest loyalty is to his resourceful battlers--Tristan Smith and Benny Catchprice and Oscar Hopkins and that epic liar and indomitable fictioneer Herbert Badgery of Illywhacker, to say nothing of his many courageous female characters--including our intrepid narrator. Christopher Chubb is one of these battlers, a strangely maternal and insistent figure. His life is given over to pursuit of the \"creature' he has made and for the daughter he has lost. We dislike Chubb at first, but he ends up winning our love, and in the end he may even win the book.  He does so because his narrative--faithfully recorded by the alternately eager and impatient Sarah--is told in a very distinctive voice indeed: his Aussie English soaked in the down-under version of the English public school and sauced by years of living in Malaysia. Here he is on Modernist poetry as promoted by Personae, the modernist organ of David Weiss, the young editor he will hoax and destroy:But then I read [the poetry] he had chosen, and what I felt was not jealousy but...how pathetic, Mem. It was so fake, so half-past six. No head, no tail. I truly could not bear it--sick in my gut. I will tell you the feeling--exactly like listening to my mother in the Church of England. in Haberfield. Always the smell of something false about her. Holy, holy, holy. Bellowing the responses more loudly than anyone else, making an exhibition of herself. Samah-samah, all the same--fake is fake no matter where you find it.Chubb is so anxious not to be taken in, not to be fooled by European fashions, that he is willing to destroy Australian poetry in order to save it.Readers with some knowledge of Australian cultural history will already have caught on that Carey must be revisiting the notorious case of Ern Malley, the hoax-poet created by a pair of irritated literary reactionaries in 1944. One afternoon during the war, two poet soldiers James McAuley and Harold Stewart sat down over some beer and cobbled together a dozen or so poems from whatever was available--from they're own well-schooled minds and random papers found on their desks such as the U.S. Army anti-mosquito manual.  The hoaxers gave Malley a plausible biography, then sent the poems out under the cover of letters from Malley's supposed sister, telling the editor that the poems had been found after the young poet's untimely death. The package came to Max Harris, the young editor of Angry Penguins--a lively little magazine credited with introducing surrealism and other dubious modernist notions into the Australian cultural desert. Harris recognized the poems as good and published them. Later, in a lugubrious and unintended aftermath, Harris was charged with peddling pornography on the basis of certain obscurities in the poems, which had stirred the moralistic sludge that lay deep in the uptight and puritanical hearts of the tabloid press and provincial constabulary. Harris was humiliated and ruined, his promising literary life tainted and according to some, modernism in Australia was set back half a century. It must be some comfort to his ghost that Ern Malley's poems are now canonical and included in their entirety in anthologies of Australian poetry, while the \"serious\" work of McAuley and Stewart is not read. Carey acknowledges his debt to Harris in an \"Author's Note\" and one way to read this book is as a tribute to a courageous young man who had the temerity to believe that his countrymen could produce great art. (One of his comrades at Angry Penguins was Sydney Nolan who would eventually emerge as Australia's greatest painter--but only after years of struggle, internal exile and abuse.) In his note, Carey also let's us know that certain poems attributed to McCorkle are in fact Ern Malley's. He has also read some of the Harris trial's actual testimony into his narrative. So if McCorkle's poems are Ern Malley's and Malley's are McAuley's and Stewart's, who went out of their way to disavow them as poems at all. Whose poem's are they?--permissions must have been a poser for Carey and his publishers!  Fakes upon fakes! Like those turtles on which the cosmos is supposed to stand, My Life as a Fake would seem to be fakes all the way down.But before we throw ourselves into the playful post-modern abyssal sublime, this is a deeply earnest as well as entertaining book.  My Life as a Fake is a quest to discover great Australian poetry-- and not only poetry but great Australian writing, which will be like no writing ever read, but \"outside the law of taste and poesy.\" Without giving the game away I can say that we are allowed to glimpse this literary Grail; but of course, like most quests, it's the journey, not the destination that matters; along the way we experience great Australian writing in every sentence. When found, McCorkle's work is poetry Sarah finds \"worth being born for\"; significantly, it sends the sound of her \"own blood singing in [her] ears.\" Her blood--English and Australian--is awakened by this antipodean music, the song of an improbable, indeed impossible, Orpheus. Sarah records that McCorkle \"had ripped up history and nailed it back together with its viscera on the outside, all that glistening green truth showing in the rip marks\"--the poem itself is another sort of Frankenstein's monster.Nothing could be clearer than that one subject of My Life as a Fake is the existence of Australian literature as such. High stakes indeed. Yet, one might also think that Australian Literature already existed--not least in Carey's own diverse and well-regarded oevre--work that has already netted him two Booker Prizes. But as American writers as different as Emerson and Ezra Pound (who is a persistent source of allusion in the book) would tell you, the anger and anxiety provoked by our vexed and ineluctably colonized relation to England, is locked into the damned and delicious language itself, and is a constant goad for writing. Carey's great novel, The True History of the Kelly Gang, is, we remember, a novel in dialect. There, Carey puts true Aussie speech on the page. Here Carey imagines a language as green and verdant as the Malayan jungle, as grotesque and visceral as history itself. Chubb's Malay-English, laced with Pidgin, even when refracted through Sarah Wode-Douglass's impeccably literary voice is yet another new thing under the sun. It sounds like the real McCorkle."}, {"review_sentiment": 4.0, "review_text": "Confusing at times but the excellent writing leads you through a wonderful read."}, {"review_sentiment": 1.0, "review_text": "I hate this book... I am sad that I wasted my mony on ording it. It was boring and incoherant!"}, {"review_sentiment": 3.0, "review_text": "The problem with a 5 point scale for reviews is that scores are so unrefined. I never thought that `i would be awarding such a celebrated author 3 stars. However, Amazon reviewers can only score against a measure that is relevant to the kind of work, or the kind of author. In this case, 3 stars represents my opinion of this novel in comparison with Peter Carey's others.Early on, the narrator is shown to have had the cheek to send critical suggestions to famous poets when she was a schoolgirl of fourteen. What a cheek! And I find myself showing the same 'cheek' in criticising this novelist.The structure is that of the Russian dolls, a narrator narrating a narrator's story, and that story frequently quoting the story of another and another. This is masterly, but spoiled for me by the relative lack of speech marks. It meant I had to keep checking, sometimes unsuccessfully, who was speaking. I became irritated by the excessive delay in revelations. The author intended this, playing with the fake within a fake concept. The origin of the literary fake was a fact.The narrator is a woman editor of strong character, and she does come over clearly despite spending most of her time listening, and reluctantly recording the story of Chubb, the faker.She is constantly interrupted and invaded by her companion, also a character who shone out clearly. John turns out to be less heinous than originally thought, but by that time, the reader hates him.I did admire the images Peter Carey summons up, such as the moving black bin liner outside the narrator's window, which turns out to be Chubb waiting in pouring rain for her attention.The focus of all the action is Chubb's book, or rather some poetry within it. Who has written it, can Chubb's account of events be believed, despite its extravagant inter weavings?I have probably increased the likelihood of attracting further readers, rather than the reverse. They will be those who enjoy sitting with someone else's knitting, unravelling its knots and waverings without getting irritated. I am not of this orientation. `i did get irritated and if the morality of the end satisfied me, not much else did."}, {"review_sentiment": 4.0, "review_text": "This is one of those books that can leave a reader quite dissatisfied, or thoroughly captivated, depending on what one was expecting. I landed somewhere in between the two extremes. The story is told by a Sarah Wode-Douglass, editor of a London poetry magazine in the 1970s. While in Kuala Lumpur (vividly depicted, reminding me of the best of Joseph Conrad) she meets Christopher Chubb, a second-rate poet who is famed for having perpetrated a literary hoax that drove Weiss, another magazine editor, to suicide. Chubb is getting old now, suffering from various physical ailments brought on by spending too much time in the tropics, and possibly insane.He tells her the story of his hoax: how, in order to humiliate Weiss, who was once his friend, he wrote some intentionally bad poetry, attributed it to someone named Bob McCorkle, an uneducated mechanic whom he invented, and submitted it to the poetry magazine. The unsuspecting Weiss thought the nonsense writing was a work of genius and published it, leading to eventual prosecution for publishing an indecent work, and his suicide. The irony is that Weiss refused to believe that it was Chubb who wrote what he thought was great poetry. The further irony is that Chubb, unhappy about not getting the credit that is due to him, eventually comes face to face with his own fictitious creation, McCorkle himself, who then kidnaps Chubb’s baby daughter and raises her as his own. She then, in turn, refuses to accept that Chubb is her father, devoting her whole life to McCorkle, who had once been nothing more than a figment of Chubb’s imagination.If all this seems confusing, it is, and I’m leaving out several subplots and side tangents on which the story goes off from time to time. This, and the fact that the story is told by multiple narrators, only makes it that much harder to follow. For the most part, it’s worth the effort. I was fascinated by how the story kept presenting the frauds as real. There are no great reveals or conclusions here; certainly there is little in the way of explanation for much of what transpired. A few hours after finishing the book I had to go back and read the ending again to be sure I hadn't missed something. I probably did.Still, not every book needs to be a straightforward narrative, with an ending that ties everything up in a neat bow. If that is what you like, then avoid this book like the plague. The poet is a fake, his writing is a fake, and maybe the story in this book is as well. But, it is a beautifully written fake, and I was rarely bored watching the narrator grow obsessed with getting her hands on a great work that she should have known was nothing of the sort. She convinces herself that it is, the way Chubb convinced himself that McCorkle was real, and so on. Perhaps that is the (not entirely obvious) point of the book: to show the lengths that people will go to believe what they know to not be true, because this somehow gives a meaning that is otherwise lacking in their lives. Or, then again, maybe not."}]}, "authors": ["Peter Carey"], "isbn": "1400030889", "longitude": 151.2164539, "periods": ["1900s"], "title": "My Life as a Fake", "word_cloud": "not best amazingly good think quite entertaining main further pursuit ongoing fascination counterfeit anything currency master painting case poetry cloak truth plagiarism base real incident writer perpetrate hoax publishing poem individual claim dead never really exist actual incident enough take supposedly imagined poet show individual create story tell editor journal follow writer know part reason go want know really happen mother subplot perfect subtle way get question narrator reliability layering story tell narrator sometimes include tell receives conflict story technique find wonder run man create poetry hoax show poem insists work supposedly make poet realize brilliant piece write say story story also tell give different side story continue tell story story hoax come daughter lover stories others help along way well tell story tell also hear directly daughter narrator tell version event participate heard witness differ point sometimes direct conflict learn narrator begin question thing desire color chooses believe also tell really happen mother even remembers end narrative weave closer narrator leave question happen leave reality none character likable character likability make believe version start likable story progress find le le obsession reflect least version end course question imago end rare find character especially likable yet wonderfully engross excellent job recreate reader create engage character fully draw particularly sympathetic find even story tell narrator character give story voice also create sort literary keep plot move building shock end story action pack full vivid detail impressive feat course narration short time pass opposition decade story tell move place place character meet story reveal little character apically flaw greedy selfish amoral vengeful often slight perceive far worse often sway flaw see even reflect others accuse end shock feel inevitable unavoidable sadness consequence rather fact come boring confusing interest magical realism genre nothing especially appeal innovative winner disappointment insomuch set somewhat arcane world poetry suffers many sub plot lack fluidity indeed lesbian poetry magazine editor accepts holiday fund man hold responsible suicide mother uncovers convolute hoax involve magical giant turn expose previous suicide subsequent true event narrative disjoint lack literary cohesion various strand story create confusion give potential substantial plot serf distract interesting make mistake naming district location assumption set scene much realize descriptive prose purpose greater author renown however effort fall short previous high standard brilliant take title earnestly authentic autobiography verse strange antipodean ubermensch bear age twenty literal brainchild literary hoaxer highbrow anglophiliac poet turn correct write modernist verse effort discredit modernism unwittingly play literary monster authentic perhaps authentic poet even genius make come indignant reactionary imagination reality challenge sanity character indeed colonized imagination idea poet impossible monster ambitious many point make literature alive ironic narrative give woman precocious eccentric scion minor aristocracy mother side hop work poetry edits broken man dirty sarong tropical ulcer legs hair make prisoner work bicycle shop take place read le not usual bicycle whole story tell long fact vantage english parsonage sort place literati ever retire pen tart ironic memoirs effect distance boxed narrative series story story impression strengthen many jungle scene reminiscent write state recovery quest magical poem self find assumption ground understands suicide glamorous mother father false kind recovery narrative put mental house order reader force look back land suppose sanity upside world south anything highly literary detective story pack action large athletic violent boastful unsure angry share violence death colorful character poisoner gumshoe ferocious beautiful daughter inner thigh callous scarred climb jungle always weakness slightly male hero especially embody australian virtue tradition say deepest loyalty resourceful battler epic liar indomitable fictioneer say nothing many courageous female character include intrepid narrator battler strangely maternal insistent figure give pursuit creature make daughter lose dislike first end win love end even narrative faithfully record alternately eager impatient tell distinctive voice indeed soak version public school sauce year live here poetry promote modernist organ young editor hoax destroy poetry choose felt jealousy pathetic head tail truly sick gut tell feel exactly listen smell something false holy holy responses loudly anyone else make exhibition matter find anxious take fooled european fashion willing destroy australian poetry order save knowledge australian cultural history already catch revisit notorious case create pair irritated literary reactionary afternoon war poet soldier sit beer cobble together dozen poem available mind random paper find desk manual hoaxer give plausible biography send poem cover letter suppose sister tell editor poem find young poet untimely death package come young editor angry lively little magazine credit introduce surrealism dubious modernist notion australian cultural desert recognize poem good publish later lugubrious unintended aftermath charge peddle pornography basis certain obscurity poems stir moralistic sludge lay deep uptight puritanical heart tabloid press provincial constabulary humiliate ruin promising literary taint accord modernism set half century ghost poems canonical include entirety anthology australian poetry serious work acknowledge debt way tribute courageous young man temerity believe countryman great art comrades angry eventually greatest painter year struggle internal exile abuse note also let certain poem attribute fact also trial actual testimony narrative poems go way disavow poem poem permission publisher fake turtle cosmos suppose fake way throw playful abyssal sublime deeply earnest well entertain quest discover great australian poetry poetry great australian write write ever outside law taste poesy give game away say allow glimpse literary course quest journey destination matter way experience great australian writing sentence found work poetry find worth bear significantly send sound blood singing ears blood awaken antipodean music song improbable indeed impossible record rip history nail together viscera glisten green truth show rip mark poem sort subject existence australian literature stake indeed yet also australian already exist least diverse oeuvre work already net american writer different persistent source allusion anger anxiety provoke vexed ineluctably colonize relation lock damn delicious language constant goad write great remember dialect put true speech page here imago language green verdant jungle grotesque visceral history lace even refract impeccably literary voice yet new thing sun sound real confuse time excellent write lead wonderful hate sad waste money lord boring incoherent problem point scale review score unrefined never think award celebrate author star however reviewer score measure relevant kind work kind author case star represent opinion comparison narrator show cheek send critical suggestion famous poet schoolgirl fourteen cheek find show criticizing structure dolls narrator narrate narrator story story frequently quote story masterly spoil relative lack speech mark mean keep check sometimes unsuccessfully speak become irritated excessive delay revelations author intend play concept origin literary narrator woman editor strong character come clearly spending time listen reluctantly record story constantly interrupt invaded companion also character shone clearly turn le heinous originally think time hat admire image summons move black bin liner narrator window turn wait pour rain focus action rather poetry write account event believe extravagant inter weaving probably increase likelihood attract reader rather reverse enjoy sit someone else knit unravel knot wavering get irritated orientation irritated morality end satisfy much else leave quite dissatisfied thoroughly captivate depend expect land somewhere extremes story tell editor poetry magazine vividly depict remind best meet poet famed perpetrated literary hoax drive magazine editor suicide get old suffer various physical ailment bring spend much time tropic possibly tell story hoax order humiliate friend write intentionally bad poetry attribute someone name uneducated mechanic invent submit poetry magazine unsuspecting think nonsense write work genius publish lead eventual prosecution publishing indecent work suicide irony refuse write think great poetry irony unhappy get credit due eventually come face face fictitious creation kidnap baby daughter raise turn refuse accept father devote whole nothing figment seem confuse leave several subplots side tangent story go time time fact story tell multiple narrator make much harder follow part worth effort fascinate story keep present fraud real great reveals conclusion certainly little way explanation much transpire hour finish go back end sure miss something probably need straightforward narrative end tie everything neat bow avoid plague poet write maybe story well beautifully write rarely bore watch narrator grow obsess get hand great work know nothing sort convince way convince real perhaps entirely obvious point show length people go believe know true somehow give mean otherwise lack life maybe", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Fiendishly devious and addictively readable, Peter Carey’s My Life as a Fake is a moral labyrinth constructed around the uneasy relationship between literature and lying. In steamy, fetid Kuala Lumpur in 1972, Sarah Wode-Douglass, the editor of a London poetry journal, meets a mysterious Australian named Christopher Chubb. \r\n\r\nChubb is a despised literary hoaxer, carting around a manuscript likely filled with deceit. But in this dubious manuscript Sarah recognizes a work of real genius. But whose genius? As Sarah tries to secure the manuscript, Chubb draws her into a fantastic story of imposture, murder, kidnapping, and exile–a story that couldn’t be true unless its teller were mad. \r\n\r\nMy Life as a Fake is Carey at his most audacious and entertaining.\r\n\r\n“Ingenious . . . Carey is as diabolical as the hoaxes that his book includes.” The New York Times \r\n", "asin": "1400030889", "rank": "1158510", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51-3YE4yLhL.jpg", "country": "Australia", "story_arc": ["Tragedy", "Things only get worse"]}