{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 96, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "I haven’t read it yet, but it was a brand new book."}, {"review_sentiment": 4.0, "review_text": "Capture what the book is about. A series of stories revolving around the dew breaker rather a straight line of a story. Hard to put down once you, the story moves in an interesting, intersecting fashion."}, {"review_sentiment": 5.0, "review_text": "Very interesting!"}, {"review_sentiment": 4.0, "review_text": "The Dew Breaker, written by Edwidge Danticat, was published in the United States by Vintage Books and copyrighted in 2004. Edwidge Danticat is famous for many works: Breath, Eyes, Memory, an Oprah book club selection; Krik? Krak!, a National Book Award finalist; and The Farming of Bones, an American Book Award winner. The Dew Breaker is similar to her other novels, like Breath, Eyes, Memory, as they focus a lot on Haiti in general. The Dew Breaker is also similar to a Thousand Splendid Suns, as it is split into multiple parts with no explicit explanation as to how these parts are connected. This fiction novel is comprised of 9 short stories that connect loosely to one another. The overlaying commonality is about a man, his wife, and the journey of their daughter, Ka, learning about her father’s past. The plot is well thought-out, original, and unpredictable. It is interesting as it causes you to read in between the lines and connect the stories by piecing together information by yourself. The story is authentic and relates to geography as there are details about escaping to New York from other countries, a connection to U.S. history of Ellis Island being an extremely busy immigration inspection station up until 1954, and Italians living in basements to avoid being caught. The characters are also well-developed and relatable as Ka and her father are mentally lost and confused at times (like most). Ka also struggles internally with keeping calm and not acting on impulses. This is shown in a scene where she mistakes a man for someone he is not and almost confronts him. Ka also experiences other inner struggles of not knowing what to do with the newfound information she is receiving throughout the novel. Readers should be aware of potential things of controversy on the topics of religion, judgmentalism of others, and morals in The Dew Breaker. The theme I have found within this novel is forgetting the past, looking toward the future, and accepting the world around you. A moral that readers will discover is that all is not as it may seem in life and there are many truths to still be uncovered. I would recommend this novel to mature readers that like to think and analyze text. Women and men would both benefit and enjoy from reading as it takes the perspective of both in mind and also causes you to ponder about how other genders may interpret the thoughts of the characters. The Dew Breaker is a memorable book due to the different accounts taken throughout the novel and how you must use investigative skills to fully comprehend the text."}, {"review_sentiment": 5.0, "review_text": "This seller was fast with shipping! The book is a great read"}, {"review_sentiment": 2.0, "review_text": "I thought this was going to be a great story.  She introduces many, and I mean many, characters.  I was thinking they are all going to come together at the end with a great ending.  But no.  They just knew a bad man.  That is all!  Then it ends."}, {"review_sentiment": 5.0, "review_text": "Excellent book! I couldn't guess what's next"}, {"review_sentiment": 4.0, "review_text": "Still working on class project, I wish I had more to say."}, {"review_sentiment": 5.0, "review_text": "Had to buy the book for an English class. Starts off quite confusing but is very colorful and does a great job of incorporating characters despite chapters not being in chronological order. It definitely helps if you know some background about Haiti, or have a class that will be discussing the background of the book."}, {"review_sentiment": 5.0, "review_text": "Awesome"}]}, "authors": ["Edwidge Danticat"], "isbn": "1400034299", "longitude": 0.0, "periods": ["1900s"], "title": "The Dew Breaker", "word_cloud": "yet brand new capture series stories revolve rather straight line story put story move interest intersecting fashion very interesting write publish copyright famous many work club selection finalist winner similar novel focus lot general also similar split multiple part explicit explanation part connect fiction comprise short story connect loosely overlay commonality man wife journey daughter learn father plot well original unpredictable interesting cause line connect story piece together information story authentic relates geography detail escape country connection history extremely busy immigration inspection station live basement avoid catch character also repeatable father mentally lose confused time also struggle internally keep calm act impulse show scene mistake man someone almost confronts also experience inner struggle know newfound information receive aware potential thing controversy topic religion judgmental ism others morals theme find forget look future accept world moral reader life many truth still uncover mature reader think analyze text men enjoy read take perspective mind also cause ponder gender thought character memorable due different account take investigative skill fully comprehend text seller fast ship great think go great story introduce many mean many character think go together end great end know bad man then end excellent next still work class project wish say buy class quite confuse colorful great job incorporate character chapter chronological order definitely help class discussing background", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "In this award-winning, bestselling work of fiction that moves between Haiti in the 1960s and New York in the present day, we meet an unusual man who is harboring a vital, dangerous secret. \r\n\r\nHe is a quiet man, a good father and husband, a fixture in his Brooklyn neighborhood, a landlord and barber with a terrifying scar across his face. As the book unfolds, we enter the lives of those around him, and his secret is slowly revealed. \r\n\r\nEdwidge Danticat’s brilliant exploration of the “dew breaker”-- or torturer-- is an unforgettable story of love, remorse, and hope; of personal and political rebellions; and of the compromises we make to move beyond the most intimate brushes with history. \r\n\r\nIt firmly establishes her as one of America’s most essential writers.", "asin": "1400034299", "rank": "223966", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51Uw8UDp4sL.jpg", "country": "Haiti", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}