{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 25.7742658, "ratings": {"num_ratings": 28, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "This is a book that grows on you. Slow pace but the writing is so good that you just want to sit back and enjoy. Hoke is not your typical police detective because he doesn't always get the better of a criminal. But, he's smart and solves his crimes more times than not. He's very likeable, down to earth, funny and believable. Give this one a try."}, {"review_sentiment": 3.0, "review_text": "2nd book I have read in the series. Will probably read more from this author."}, {"review_sentiment": 5.0, "review_text": "Simply a classic.  The Hoke Moseley series is one of the great American crime series that speaks to us on many levels."}, {"review_sentiment": 5.0, "review_text": "This is the third book in Charles Willeford's excellent series featuring Miami homicide detective Hoke Moseley. As the book opens, Hoke, although still only in his forties, wakes up to a full-blown mid-life crisis. He's completely unable to function irrespective of his responsibilities to his two teenage daughters who live with him, to his department, and to his partner, Ellita Sanchez, who is eight months pregnant (not by Hoke) and who also lives in Hoke's home.Unable to cope, Hoke takes a leave of absence from his job and retreats to Singer Island, where his wealthy father lives. He takes a job running a small apartment building for his father and vows that he will never leave the island again.In the meantime, Stanley Sinkiewicz, an elderly retiree who has moved to Florida from Detroit has a brush with the law and, although he is completely innocent, he is briefly forced to share a jail cell with a man claiming to be Robert Smith.\"Smith\" is really a psychopathic career criminal named Troy Louden. He has a gift for reading people and immediately pegs Stanley for the sad, lonely man he is at heart. Louden befriends Stanley, schooling him in the way to best deal with the authorities, and before long, Stanley is convinced that Troy is his new best friend.Louden is desperately hoping to have the charges against him dropped before a fingerprint check is returned and the police discover his real identity. To this end, he asks Stanley to do him a \"small favor\" once he is released, and, totally won over by his new buddy, the old man agrees. The ploy works and Louden, now free, enlists Stanley to help him pull off a big job he is planning.Meanwhile, Hoke Mosley is discovering that it's a lot harder to simplify his life than he had hoped. His father is determined to help him get a new job with the local police force, although Hoke has absolutely no interest in the job. His younger daughter joins him on the island further complicating matters, and the tenants in the apartment house generally prove to be a major pain in the butt.The Mosley story and the Stanley/Louden story proceed along parallel tracks and for a while the reader is left to wonder how Willeford is ever going to link them up. But it really doesn't matter because both stories are very entertaining.Willeford has populated this book with a number of unique and very interesting characters and between the lines, he has a great deal to say about the nature of family and about the workings of the capitalist system in the United States. All in all, it's a very entertaining book that should appeal to large numbers of readers."}, {"review_sentiment": 5.0, "review_text": "Charles Willeford is the man who invented Miami crime fiction, starting with Lust is a Woman (aka Made in Miami) in 1958. His laconic style is incomparable and probably his biggest talent, but he is also a master of plot and character.Most writers can't help but try to impress us with their clever prose techniques and florid descriptions, but Willeford did something far more difficult: He told a story like he was showing us a photograph. Yet, at the same time, the \"Willefordisms\" are identifiable--the deadpan presentation of absurdity and human weirdness. I really can't think of anyone to compare Willeford to. He is truly one of a kind.I think the Moseley novels should be read in order. They're all masterpieces of hard-boiled black humor. Sideswipe is especially dark, yet the humor is frequently laugh-out-loud.As Elmore Leonard said, \"Nobody writes a better crime novel.\" He meant that, so get busy and read Willeford."}, {"review_sentiment": 4.0, "review_text": "Love willeford and have read almost all his novels."}, {"review_sentiment": 5.0, "review_text": "Willeford may be the most undeservedly unknown master of crime fiction anywhere. Spot-on dialog, quirky plots, and laugh-out loud comedic surprises. Sideswipe is five-star fiction."}, {"review_sentiment": 2.0, "review_text": "Boring, that's what this book is. During the first, say, 80% of the book nothing much happens, except for an introduction of the characters and their backgrounds. Sadly, most of the characters are flat and uninteresting. In particular the main person Hoke Moseley is hard to identify with; he is not very likable, not funny, and does not possess any other qualifications that makes him stand out as the hero of the story.The psychology of the characters is also weird and often unconvincing, for instance the scene where Hoke drives his own daughter to the airport with handcuffs on, in order to \"ship her\" to an out-of-state hospital. What father does that and which daughter would not scream murder?When the action finally kicks in (the robbery of a mall) it is described in two pages flat, with the kind of detachment that is more befitting to a newspaper item. The story then finally limps towards an end which is equally uninspiring and uninvolving. I love the \"Florida crime novels\" which have become something of a genre of its own, but Mr. Willeford unfortunately misses the wit of Carl Hiaasen, the poignant description of characters of Lawrence Shames or the suspense of Randy Wayne White. I was relieved when I finished the book and could finally put it down."}, {"review_sentiment": 5.0, "review_text": "Willeford is one of the best of all time."}, {"review_sentiment": 4.0, "review_text": "I enjoyed it, but it'd not the best of the Hoke Mosely books."}]}, "authors": ["Charles Willeford"], "isbn": "1400032482", "longitude": -80.1936589, "periods": ["1900s"], "title": "Sideswipe: A Hoke Moseley Detective Thriller", "word_cloud": "grow slow pace write good want sit back enjoy typical police always better criminal smart solves crime time likable earth funny believable try series probably author classic series great american crime series speak many level third excellent series feature homicide open still forty wake crisis completely unable function irrespective responsibility teenage daughter live department partner month pregnant also live cope take leave absence job retreat wealthy father live take job run small apartment build father vow never leave island meantime elderly retiree move brush law completely innocent briefly force share jail cell man claim really psychopathic career criminal name gift read people immediately peg sad lonely man heart befriend school way best deal authority long convince new best desperately hop charge drop fingerprint check return police discover real identity asks small favor release totally new buddy old man agree ploy work free enlists help big job discover lot harder simplify life hop father determine help new job local police force absolutely interest job younger daughter join island complicate matter tenant apartment house generally prove major pain story story proceed parallel track leave wonder ever go link really matter story populate number unique interesting character line great deal say nature family working capitalist system entertain appeal large number reader man invent crime fiction start aka laconic style incomparable probably biggest talent also master plot writer clever prose technique florid description something far difficult tell story show photograph time identifiable deadpan presentation absurdity human weirdness really anyone compare truly think novel order masterpieces black humor especially dark yet humor frequently say nobody write better crime mean busy willeford almost novel undeservedly unknown master crime fiction anywhere dialog quirky plot loud comedic surprise fiction bore first say nothing much happen introduction character background sadly character flat uninteresting particular main person hard identify likable funny posse qualification make stand hero psychology character also weird often unconvincing instance scene drive daughter airport handcuff order ship hospital father daughter murder action finally kick robbery mall describe page flat kind detachment befit newspaper item story finally limp towards end equally uninspiring involve love crime novel become something genre unfortunately miss wit poignant description character suspense relieve finish finally best time enjoy best mosley", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Hoke Moseley has had enough. Tired of struggling against alimony payments, two teenage daughters, a very pregnant, very single partner, and a low paying job as a Miami homicide detective, Hoke moves to Singer Island and vows never step foot on the mainland again. But on the street, career criminal Troy Louden is hatching plans of his own with a gang including a disfigured hooker, a talentless artist, and a clueless retiree. But when his simple robbery results in ruthless and indiscriminate bloodshed, Hoke quickly remembers why he is a cop and hurls himself back into the world he meant to leave behind forever.\r\n\r\nA masterly tale of both mid-life crisis and murder, Sideswipe is a page-turning thriller packed with laughs, loaded with suspense, and featuring one of the truly original detectives of all time.\r\n\r\n“No one writes a better crime novel than Charles Willeford.” Elmore Leonard \r\n", "asin": "1400032482", "rank": "741860", "city": "Miami", "image": "https://images-na.ssl-images-amazon.com/images/I/51MWApW0hBL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}