{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 25.7742658, "ratings": {"num_ratings": 26, "rating": 3.9, "reviews": [{"review_sentiment": 2.0, "review_text": "An overview of end life care in Ireland and England, very different interventions and negative interpretation of Hospice care."}, {"review_sentiment": 5.0, "review_text": "Terrific!!  Willeford at his best"}, {"review_sentiment": 5.0, "review_text": "\"We have lost the ability to deal with death\" reads the super-title on the dustcover.The author is a gastroenterologist at a large (he calls it busy) university hospital in Cork, Ireland. Death is part of his daily routine.He posits that about half of all deaths occur in hospital, less than 20% in nursing homes, a similar figure \"at home\" and a tiny 5% in hospices. The unmentioned miscellaneous rest is presumably unanticipated death, which is not relevant to the theme of this book.Hospice care is a fairly new phenomenon, dating back only as far as the eighties of the previous century. Some physicians as well as patients oppose it as they see it as \"giving up.\" O'Mahony endorses hospices. They are equipped to provide the kind of end-of-life care that in former times was provided by the family, but today’s families can often not cope at home. He refers to a study that found that moribund patients cared for in a hospice rather than in a hospital lived, on average, 25% percent longer, which apparently means that the treatments employed in the hospital are more likely to shorten than extend life. However, in spite of his enthusiasm for hospices, the author believes that \" 'palliative care’ should be at the centre of what *all* doctors do.\" (his italics)Hospital deaths are highly medicalized. That is what hospitals are for. You cannot expect the - usually young, overworked, and under-experienced - physician confronted with a dying patient in the emergency room to refrain from initiating the invasive procedures that rob the dying of a peaceful death. S/he is simply doing what s/he was trained to do. Not doing it could result in disciplining. One of the reasons for so many medicalized deaths in hospital is that patients, physicians, and family entertain delusions of death being defeatable, that all illness is potentially curable.Intensive Care Units are considered the epitome of technology, but actually, the author points out, they are a relatively pleasant place to die, with their high level of attention. Much worse is death in the messy, squalid, chaotic, noisy, unprivate hospital corridor.Nursing homes send their elderly dying tenants to hospital to spare themselves the hassle of filling out the forms, facing the family, and taking responsibility.O'Mahony asks a general practitioner who complained about the way her dying patient was treated in hospital, then why did you send her there? Why didn’t you stay by her bedside yourself and look after her the way you saw fit?Hospitals, he posits,  \"have become a dustbin for all sorts of societal problems, not just dying ... Ireland has a long and unedifying tradition of medicalizing social problems. At one period in the mid twentieth century, the country had proportionately more people (2 per per cent of the entire adult population) in longterm psychiatric care than Stalin’s Soviet Union. Many of these ?patients’ had no psychiatric illness as such.\"Though not directly related to his subject of medicalized death, this gastroenterologist's offhand position on psychiatry is worth mentioning because it is by the (dis)grace of somatic medicine which tolerates it that the shameful sham of psychiatry continues to exist.Elsewhere he writes,  \"We are now also expected to police lifestyles that others disapprove of.\"Refreshingly, he follows,  \"... a doctor’s role is limited: our job should be the treatment of illness.\"I would change that to the healing of illness. When illness cannot be healed, treatment other than palliative is not appropriate, which is precisely the main tenet of his book.An entire chapter is devoted to cancer, a disease which in spite of Nixon’s \"War on Cancer\" remains resistant to cure. Most cancer treatment is futile, causes unnecessary additional suffering and enormously wastes resources. The cancers that seem to be cured were not life-threatening to begin with. He quotes Richard Smith, former editor of the British Medical Journal who suggested that \"we should ?stop wasting billions trying to cure cancer’.\" I cannot help but agree with this sentiment. At the same time I have heard firsthand of cancer patients in my country (Netherlands) who were given up and refused further treatment, whereupon the family moved them to another hospital, where they were sufficiently patched up to be able to return to their former lives for another several years.He states that  \"despite all the advances in genetics, including the sequencing of the entire human genome, there have been precious few applications for treatment of cancer and other serious diseases.\"I suspect that \"precious few\" is a euphemism for no. His further contention that  \"basic science has benefited from the Human Genome Project\"can probably be read as people who earn their livings in the field of science have benefited...Advance directives are commonly ignored and \"provide endless potential opportunity for conflict.\" Furthermore, what seems unwanted at the moment such a directive is composed may be fathomable when the time actually comes.Many of O'Mahony's dying patients are alcoholics younger than 50. He is as concerned about their dignity as he is about that of every other patient.He has no need for euthanasia or its variants.  \"I cannot recall a single patient, in over thirty years of practice at the front line, who wished I had been able to ?assist’ [him to die].\"Some of his observations apply not only to medical care around death, but to medicine in general. For instance, he states,  \"Doctors, by the nature of their selection and training, are conformist... a good doctor sometimes has to tell a patient things they do not want to hear. ... it is much easier ... to order another scan than to have the Difficult Conversation.\"He speaks of  \"a deluded optimism about the benefits of medical treatment ... disguised as ?giving hope’\" which abounds among lay people as well as physicians. \"Irrationality pervades all aspects of medicine.\"He discounts the idea that physicians can have or be taught the skill of informing a patient or family of the hopelessness of his/her health in a way that will make the bad news palatable, nor can empathy be taught. He rejects advice for physicians to \"stray from their core professional duties into uncharted waters, to take on roles such as spiritual adviser, social worker, life-coach, friend.\"He is surely right that \"Families and patients ... may lack the necessary education and medical knowledge to make truly informed decisions\" and \"informed consent is a legalistic fantasy.\" However, physicians are not necessarily in a better position given the pressures under which they operate. \"[D]octors routinely subject their patients to treatments that they wouldn’t dream of having themselves.\" MeTZelf advocates inclusion of medical education in the general school curriculum.For the sake of brevity I have not covered all of the thought-provoking subjects O’Mahony discusses, for example his views on longevity. I can but highly recommend reading this book. The language is comfortable, not clogged with medical jargon. To handle the few medical terms used, a glossary is provided. Some of the news stories to which he refers will be unfamiliar to the non-UK reader, but in this age of the Internet anyone wishing to know more about them can readily find the information.Copyright © MeTZelf"}, {"review_sentiment": 3.0, "review_text": "zmeh"}, {"review_sentiment": 2.0, "review_text": "Filled with anecdotes but the style isn't very reader-friendly"}, {"review_sentiment": 5.0, "review_text": "This is the fourth and, sadly, the last entry in Charles Willeford’s series featuring Miami homicide detective Hoke Moseley. Hoke, to put it mildly, does not remotely resemble the homicide detectives that one usually encounters in crime fiction. Certainly, he’s nothing like Sonny Crockett and the other detectives of the television show, Miami Vice, which was so wildly popular at the same time this series was written.Hoke is middle-aged and overweight; he dresses in leisure suits that be buys on the cheap. He has no teeth and is plagued by an ill-fitting set of dentures that constantly cause him problems. He lives in a small home that he shares with his two teenage daughters, the woman who was once his partner, and the ex-partner’s infant son. Hoke and his ex-partner are not romantically involved; they are both challenged financially and are sharing the house as a way of saving money. It’s a difficult arrangement which severely limits Hoke’s sex life, assuming that he had one. Obviously, it’s nothing like living alone on a great bachelor-pad houseboat with an alligator named Elvis.Hoke is now working cold cases and is pursuing the case of a doctor who was murdered several years ago. He’s enjoying the challenge and is reasonably content until a man named Donald Hutton leases the house directly across the street. Years earlier, Hoke had arrested Hutton for first-degree murder. On the basis of the Hoke’s testimony, Hutton was sentenced to life in prison and publicly swore revenge against Hoke. But then ten years down the road, the conviction was overturned on a technicality; Hutton was freed and the D.A. decided not to retry the case. So now Hutton is living across the street from Hoke, sitting out in the yard all day, watching the comings and goings of Hoke’s daughters and his ex-partner, Ellita.Hoke is obviously concerned about Hutton’s intentions, but there isn’t much he can do about the situation. Then, in the middle of all this, his boss assigns him to a very dangerous, one-man undercover operation in a neighboring county. Haitian immigrants are disappearing and the local sheriff fears that a particularly nasty farmer is employing the Haitians as migrant labor and then killing them rather than paying them off at the end of the season. As a favor to the sheriff, Hoke’s boss agrees to loan Hoke out to investigate.All of these diverse strands come together to create another very entertaining story. Willeford invented some truly unique characters; the story is well-plotted, and there’s a fair amount of humor. The question that hangs over it all is whether Hoke will weather all the threats he suddenly faces to produce a solution to any of the crimes on his plate.Charles Willeford toiled in the crime fiction genre for a number of years without getting the attention and respect that he genuinely deserved. That changed, finally, when he began the Hoke Moseley series. The books were critically acclaimed and sold much better than his earlier efforts. Sadly, though, Willeford died in 1988, the same year that this book appeared and didn’t get the chance to enjoy this success for very long. His passing was a loss for fans of crime fiction as well; it would have been great fun to follow Hoke Moseley through at least a few more books. But we are fortunate to have these four, and readers who haven’t yet discovered Willeford and Hoke Moseley might want to look for Miami Blues, the book that introduced this great character."}, {"review_sentiment": 2.0, "review_text": "First Thought when Finished: Dear God, I am glad that’s over, this book was incredibly boring.Story & Characters: While the characters were believable and I liked them. The story was full of build ups that fell pretty flat when you got to the resolution. The different sub-plots were resolved but it was just unremarkable. Once you got to the resolution it took so long, and the rest of the book was so boring that you didn’t even really care. We spend hours leading up to the part where he get’s to his under-cover assignment and then nothing happens, there’s no investigation, basically he kills the 2 guys and leaves after setting the place on fire.I don’t know, I was expecting something really good based on the reviews on goodreads and amazon but just like the book there was a lot of build up but it didn’t deliver. I wouldn’t read it again, I wouldn’t really recommend it to anyone either.Audio Thoughts: The narration was in my opinion the best part of the book. Stephen Bowlby has a pleasant reading voice and did pretty believable voices for each characters.*I received this book as a review copy from http://audiobookjukebox.squarespace.com/"}, {"review_sentiment": 5.0, "review_text": "One of the master's best."}, {"review_sentiment": 4.0, "review_text": "Classic Willeford"}, {"review_sentiment": 3.0, "review_text": "My first Charles Willeford book was Sideswipe and I read this back in the late 1980's. Since then I have maintained a fondness for the Hoke Moseley books and perhaps have placed them on a pedestal of greatness that is unwarranted.Charles Willeford wrote in a very low-key style where his characters would be perfectly normal and then suddenly do something that is very unexpected. The detailing of how Moseley leads his life is done in such a fashion as to shock the reader when something happens to him that is out of the blue (without going into spoilers, Hoke has a bad time in a barn and loses someone later - both very shocking happenings).To be honest, I think this is the weakest of the Moseley books. It just seemed to lack that certain something that the earlier books had.I have read it twice now and do enjoy the style, the characters and the pacing but this novel was just lacking.The book is a divisive novel as the reviews on this site can demonstrate, you either loved it or thought it was ok. Doesn't seem much in between."}]}, "authors": ["Charles Willeford"], "isbn": "1400032504", "longitude": -80.1936589, "periods": ["1900s"], "title": "The Way We Die Now", "word_cloud": "overview end life care different intervention negative interpretation care best lose ability deal death read author gastroenterologist large call busy university hospital part daily posit half death occur hospital le nursing home similar figure home tiny hospices unmentioned miscellaneous rest presumably unanticipated death relevant theme care fairly new phenomenon date back far eighties previous century physician well patient oppose see give endorses hospice equip kind care former time provide family today family often cope home refer study find patient cared hospice rather hospital live average percent longer apparently mean treatment employ hospital likely shorten extend life however spite enthusiasm hospice author believe care center doctor italics hospital death highly radicalize hospital expect usually young overwork physician confront die patient emergency room refrain initiate invasive procedure rob die peaceful death simply train not discipline reason many radicalize death hospital patient physician family entertain delusion death def eatable illness potentially consider epitome technology actually author point relatively pleasant place high level attention much worse death messy squalid chaotic noisy unprivate hospital home send elderly dying tenant hospital spare hassle filling form face family take asks general practitioner complain die patient treat hospital send stay look saw fit posit become dustbin sort societal problem die long unedifying tradition radicalize social problem period mid twentieth century country proportionately people cent entire adult population long term psychiatric care patient psychiatric illness directly relate subject radicalize death gastroenterologist offhand position psychiatry mention dis grace somatic medicine tolerates shameful sham psychiatry continue write also expect police lifestyles others disapprove refreshingly follow doctor role limit job treatment illness heal illness illness heal treatment palliative appropriate precisely main tenet entire chapter devote cancer disease spite remain resistant cure most cancer treatment futile cause unnecessary additional suffering enormously waste resource cancer seem cured begin quote former editor suggest stop wasting billion try cure cancer help sentiment time hear firsthand cancer patient country give refuse treatment family move hospital sufficiently patch able return former live several state advance genetics include sequence entire human genome precious application treatment cancer serious disease suspect precious euphemism contention basic science benefit probably people earn living field science benefit directive commonly ignore provide endless potential opportunity conflict seem unwanted moment directive compose fathomable time actually die patient alcoholic younger concern dignity need euthanasia variant recall single patient thirty year practice front line wish able assist observation apply medical care death medicine general instance state doctor nature selection training conformist good doctor sometimes patient thing want hear much easier order scan speak delude optimism benefit medical treatment disguise give hope abound lay people well physicians pervades aspect medicine discount idea physician teach skill inform patient family hopelessness health make bad news palatable empathy taught reject advice physician stray core professional duty uncharted water take role spiritual adviser social worker friend surely right family patient necessary education medical knowledge make truly informed decision inform consent legalistic fantasy however physicians necessarily better position give pressure operate doctor routinely subject patient treatment dream advocate inclusion medical education general school sake brevity cover subject discuss example view longevity highly recommend read language comfortable clog medical jargon medical term use glossary provide news story refers unfamiliar age anyone wish know readily find meh fill anecdote style fourth sadly last entry series feature homicide detective put mildly remotely resemble homicide detective usually encounter crime fiction certainly nothing detectives television show wildly popular time series overweight dress leisure suit buy cheap teeth plague set denture constantly cause problem live small home share teenage daughter woman partner infant son romantically involve challenge financially share house save money difficult arrangement severely limit sex life assume obviously nothing live alone great houseboat alligator name work cold case pursue case doctor murder several year ago enjoy challenge reasonably content man name lease house directly street year earlier arrest murder basis testimony sentence life prison publicly swore revenge year road conviction overturn technicality freed decide retry case living street sit yard day watch coming going daughter obviously concerned intention much situation then middle assigns dangerous undercover operation neighbor county haitian immigrant disappear local sheriff fear particularly nasty farmer employ migrant labor kill rather pay season favor sheriff agree loan diverse strand together create entertaining story invent truly unique character story fair amount humor question hang weather threats suddenly face produce solution crime toil crime fiction number year get attention respect genuinely deserve change finally begin series critically acclaim sell much better earlier effort sadly die year appear chance enjoy success long passing loss fan crime fiction well great fun follow least fortunate reader yet discover look introduce great character first glad incredibly character believable like story full build ups fell pretty flat get resolution different resolve unremarkable get resolution take long rest bore even really spend hour lead part assignment nothing happen investigation basically kill guy leaf set place know expect something really good base review goo dreads amazon lot build really recommend anyone narration opinion best part pleasant reading voice pretty believable voice character receive review copy http master best classic first back late maintain fondness perhaps place pedestal greatness write style character perfectly normal suddenly something unexpected detail lead life do fashion shock something happen blue go spoiler bad time barn lose someone later shock happening honest think weakest moseley seem lack certain something earlier twice style character pace divisive review site demonstrate love thought ok much", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "When Miami Homicide Detective Hoke Moseley receives an unexplained order to let his beard grow, he doesn't think much about it. He has too much going on at home, especially with a man he helped convict ten years before moving in across the street. Hoke immediately assumes the worst, and considering he has his former partner, who happens to be nursing a newborn, and his two teenage daughters living with him, he doesn't like the situation on bit. It doesn't help matters when he is suddenly assigned to work undercover, miles away, outside of his jurisdiction and without his badge, his gun, or his teeth. Soon, he is impersonating a drifter and tring to infiltrate a farm operation suspected of murdering migrant workers. But when he gets there for his job interview, the last thing he is offered is work.\r\n\r\nIn this final installment of the highly acclaimed Hoke Moseley novels, Charles Willeford's brilliance and expertise show on every page. Equally funny, thrilling, and disturbing, The Way We Die Now is a triumphant finish to one of the most original detective series of all time.\r\n\r\n“If you are looking for a master’s insight into the humid decadence of South Florida and its polyglot tribes, nobody does that as well as Mr. Willeford.” The New York Times ", "asin": "1400032504", "rank": "806897", "city": "Miami", "image": "https://images-na.ssl-images-amazon.com/images/I/51eL820Hu2L.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}