{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 18, "rating": 3.6, "reviews": [{"review_sentiment": 4.0, "review_text": "This story has several layers: the story of a writer who wants to be an author,who finds a writing circle to help with his writer's block, and it becomes a ghoststory without a ghost, which becomes a whodunit. The reader follows PatrickRush through a maze. An interesting read"}, {"review_sentiment": 3.0, "review_text": "It took me a while to get into the book. Not as good as I thought it would be. I like to \"love a book and this didn't make the grade. Sorry"}, {"review_sentiment": 3.0, "review_text": "Patrick Rush is a single father who was recently demoted at his newspaper job from well-respected book reviewer to writer of a frivolous column called \"The Couch Potato,\" all about painfully inane reality TV shows with exclamatory names like, Falling From Buildings! and Animals That Kill!Miserable at work, and grieving the still-fresh death of his wife, he decides it's time he look into pursuing one of the goals of his youth -- writing a novel.  To that end, he joins a writing group he sees advertised in the local paper.  Each group member spends a week writing something -- anything -- and then they meet to read their work aloud and get feedback from the others.  After a few weeks spent struggling to get even the most banal prose down on paper, though, Patrick decides his life just hasn't been interesting enough. He has nothing to say, because nothing has ever happened to him.  The old adage \"write what you know\" only works if you know something, he decides.Thankfully, nobody else in the group is producing anything good either, so Patrick continues to coast through each meeting, mostly hanging around out of curiosity for his fellow failed would-bes.Then he hears chapter one of Angela's story, and everything begins to shift.Angela is a young, pretty woman whose story is strange, scary, and engrossing.  It's about a little girl stalked by a killer she describes only as \"a terrible man who does terrible things,\" and later dubs \"the Sandman.\"  As Angela tells more and more of the tale, Patrick notices  parallels between what she's writing and recent crimes reported in the news.  Just as he's begun to suspect her story is more autobiographical than fictitious, members of the group start disappearing -- some found dead, others simply vanishing into thin air.  Patrick, obsessed with both Angela and the Sandman, becomes convinced one of the group's members, a big, ugly guy who writes disturbing stories about killing animals, is the Sandman, and when someone starts following him and then Angela herself disappears, Patrick realizes his life has not only gotten interesting enough to turn into a book, the book it's turned into is \"a bloody page-turner.\"This is a pretty entertaining little thriller, with an interesting running theme about the nature of stories and storytelling.  By the end of the novel, it's hard to tell how much of the story we're hearing, narrated by Patrick, is actually true, and how much is simply a fictionalized version of his life -- not necessarily fictionalized on purpose.  This is a common issue with memoirs, after all; no memoir is ever pure truth, right?  Can we ever look at our life objectively enough to report only facts?  And, maybe more importantly, should we even try?The writing here isn't anything special -- it's well-enough crafted but not stand-out -  but the story was suspenseful enough to make me want to look for more by the author. Definitely recommended if you're in the mood for a dark little mystery."}, {"review_sentiment": 4.0, "review_text": "Writing professors, almost unanimously, counsel their writing students to avoid \"writing about writing\" as \"writers writing about writing\" can be, well, less-than-compelling to readers who don't (necessarily) write. I brought all of this academic baggage to \"The Killing Circle,\" but enjoyed it nonetheless. It's schticky, but atmospheric and, you know what? I'm a writer who sometimes likes to read about how other writers navigate the writing life. (Even if those writers are fictitious characters in books by writers I admire.) I'm a huge fan of mysteries, thrillers, and Toronto, so this novel was a triple-word-score for me (having attended a fiction workshop, myself, years ago at Humber College in Toronto(-ish)).Back in March, I attended Andrew Pyper's last reading in the \"Literature for Our Time\" Series at The University of Toronto. I had recently read \"Lost Girls\" and was then looking forward to reading \"The Killing Circle.\" His advice to all of the aspiring writers in the audience was something along the lines of: \"Be the author of your life rather than the actor in the play about your life that is being directed by someone else.\" (He conveyed this with far fewer words, however.)In retrospect, this was some good advice for writers from an author who has successfully published a tricky (yet highly compelling) novel about a writer caught somewhere between fact and fiction."}, {"review_sentiment": 1.0, "review_text": "The reviewer of this book for the Richmond Times-Dispatch (see back-cover blurb) was of the view that TKC is \"head and shoulders above most thrillers out there now.\"  Assuming this reviewer's assessment is an honest one, formed on the basis of his own comparative reading of \"most thrillers out there now\", then I can only imagine that most thrillers out there now are truly awful, and extend my sympathies to all the professional book reviewers whose unhappy job it is to slog through them.  To highlight the best things about TKC: the writing is decent in a creative writing class sort of way and it's a very fast read.  To highlight the bad: the story is mediocre in the extreme.  Its shocks are all predictably unpredictable.  You might not know exactly whodunnit it from the outset, nor exactly how the story will resolve in the end (or rather -- naturally -- not resolve), but by the time you get there you'll pretty much have run through all the possibilities (there aren't that many).  And along the way, you'll be served up a hash of writer/protagonist-going-mad musings, horrific (though for the most part under-described) set pieces, black sedans and/or vans trailing at a distance, ghostly apparitions, shadowy figures, faceless persons (presumably all one and the same), all with a jagged glass of things-you-fear-the-most (cue to reader: you are supposed to bring your own worst fears to your reading of TKC; for my part, I couldn't be bothered).  TKC grinds endlessly -- albeit, thankfully, quickly -- to a lame conclusion.  It is paint-by-numbers from start to finish.  If it really is \"head and shoulders above most thrillers out there now\", then I know exactly what genre I'll be steering clear of in the future."}, {"review_sentiment": 3.0, "review_text": "The Killing Circle was an exciting, gripping thriller. Pyper keeps the reader hooked, needing to know what will happen next, and while I tried to guess as to where the story was going, I always got it wrong. I love books like that."}, {"review_sentiment": 4.0, "review_text": "Pyper is an immensely talented writer, as evidenced in The Wildfire Season, a master of the dark, haunting rhythms that draw characters into a netherworld of secrets and shameful deeds. Reeling after the death of his wife a few months after the birth of their son, Patrick Rush seeks a distraction from his grief and a downward-spiraling job at a local Toronto newspaper. Once the paper's book critic, Rush is being gradually demoted, barely clinging to a profession in the throes of technical revolution and downsizing. Thinking to discover his novel-in-waiting, or at least some inspiration in an otherwise difficult life, Rush answers an ad for membership in a limited writing circle. Strangers all, the group is chaired by a controversial novelist with plans for weekly meetings and discussion of each session's work.At best, the quirky figures in the group are talented, although one, a giant man who reeks of menace, offers only tales of escalating violence (\"blood tattooed on the curtains\"). But Patrick is most caught up in Angela Whitmore's unfolding story of The Sandman, \"a terrible man who does terrible things\". Drawn into Angela's scenario, Rush is further distraught by a series of violent murders occurring in his neighborhood. Obviously a serial killer is on the loose, eerily similar to Angela's Sandman. In a juxtaposition of fact and fiction, Patrick is immersed in a nightmare as, one by one, members of the writing circle die and even his beloved son, Sam, is kidnapped. Followed by an ominous stranger, Patrick is trapped in a world of real danger and increasing paranoia, finally learning the consequences of his own pretensions.Is this a ghost story? Maybe. At least Patrick embraces that concept when he uses his experience in the circle as a bridge to fame. But as the story evolves, it is clear that Rush is no innocent, no stranger to self-deception. Yet even more troubling is Pyper's attempt, as a writer, to construct a novel about writers, a lumpy porridge that is less than satisfying, if an interesting plot contrivance. Pyper fails to exercise sufficient discipline. More than the writer-on-writers angel, I had trouble with motive. For all the ghastly, confusing events that happen, I cannot identify a logical motive. There are murders, threats, creeping fears and untrustworthy characters, but to what purpose? Making matters worse, Pyper handles a cloudy resolution with a question to the \"Dear Reader\". I know Pyper is an enormously gifted storyteller; I just don't think this novel fulfills his purpose. Luan Gaines/2009."}, {"review_sentiment": 5.0, "review_text": "Every Labor Day, father (Patrick) and son (Sam) would go to the drive in to watch the last movie of the summer. Before they can settle down with their food and enjoy the movie however, Sam goes missing. It's the Sandman.This beginning to the book ties you in as you have a name of the person you are looking for. Who is this \"Sandman\"? Why does he want Sam? How does Patrick know it's the \"Sandman\"?We then get taken back to 4 years before and how it all began. Patrick, failed writer, joins a writing group known as the \"Kensington Circle\". It's a small group of wanna-be writers and none of them really holds his attention. Except for one. Angela. A shy, quiet woman who shares a haunting story called \"The Sandman\". Patrick is so mesmerized by her story he secretly records it.Patrick isn't the only one taken by the story, everyone in the group is enthralled. Then it so happens a serial killer emerges on the streets of Toronto, re-enacting the same scenes from Angela's story, Patrick (and other members of the group) is worried that there might be a serial killer in the writing group. However, once the group stops meeting, the killings stop.That is until somehow \"The Sandman\" story gets published and the killings start again. I don't want to give away too much of this book, as there are many twists and turns that will constantly keep you at the edge of your seat.This book is a gem. It has been a while that I have wanted to put everything on hold just to sit and read through the day. This is an easy read that yanks any of your ideas of who \"The Sandman\" is after every couple of pages. Excellently written."}, {"review_sentiment": 3.0, "review_text": "I enjoyed Pyper's first novel because it was off the beaten track. I admire any writer who has the guts to venture solo in the thriller/suspense genre.  With The Killing Circle, Pyper delivers. I absolutely loved trying to pinpoint the killer from a cast of characters who are part of a writers' circle. Authentic and imaginative."}, {"review_sentiment": 5.0, "review_text": "The Killing Circle by Andrew Pyper is a great book.  I am lucky to have stumbled across this book at the store because it is well worth the money and time.  The engaging and entertaining plot is one of the best that I have read in quite a while.  Pyper installs a sense of creepiness throughout the story . . . it kept me reading on to find out what in the world was going on.  I felt that Pyper was very accurate in delivering a psychological toll that the main character would be going through with an intense story such as this.  This book is for anyone who enjoys reading dark mystery/suspense.  I will be reading more of Andrew Pyper."}]}, "authors": ["Andrew Pyper"], "isbn": "1400026083", "longitude": -79.387207, "periods": ["2000s", "Recent Releases"], "title": "The Killing Circle", "word_cloud": "story several layer story writer want author find write help writer block become ghost story ghost becomes whodunit follow interesting take not good think love make grade single father recently demote newspaper job reviewer writer frivolous column call painfully inane reality tv show exclamatory name fall work grieve death wife decides time look pursue goal youth write join write group see advertise local paper group member spend week write something anything meet work aloud feedback others week spend struggle even banal prose paper decide life interest nothing say nothing ever happen old adage write know work know something nobody else group produce anything good continue coast meeting mostly hang curiosity fellow fail hears chapter story everything begin young pretty woman story strange scary engross little girl stalk killer describe terrible man terrible thing later dub tell tale notice parallel write recent crime report news begin suspect story autobiographical fictitious member group start disappear find dead others simply vanish thin air obsess become convinced group member big ugly guy writes disturb story animal someone start follow disappears realize life gotten interesting enough turn turn bloody pretty entertaining little thriller interest run theme nature story storytelling end hard tell much story hearing narrate actually true much simply fictionalize version life necessarily fictionalize purpose common issue memoir memoir ever pure truth right ever look life objectively enough report fact maybe importantly even write anything special craft story suspenseful enough make want look author recommend mood dark little mystery write professor almost unanimously counsel write student avoid write write writer write write well reader necessarily write bring academic baggage enjoy sticky atmospheric know writer sometimes like writer navigate write life even writers fictitious character writer admire huge fan mystery thriller attend fiction workshop year attend last reading recently lose look forward read advice aspire writer audience something line author life rather actor life direct someone else convey far fewer word however retrospect good advice writer author successfully publish tricky yet highly compelling writer catch somewhere fact fiction reviewer see blurb view head shoulder thriller assume reviewer assessment honest form basis comparative reading thriller imagine thriller truly awful extend sympathy professional reviewer unhappy job slog best thing write decent creative write class sort way fast bad story mediocre extreme shock predictably unpredictable exactly whodunit outset exactly story resolve end rather naturally time pretty much run possibility many along way serve hash musing horrific part set piece black sedan van trail distance ghostly apparition shadowy figure faceless person presumably jag glass cue suppose bring worst fear read part grind endlessly albeit thankfully quickly lame conclusion start finish really head shoulder thriller know exactly genre steer clear future excite grip thriller keep hooked need know happen try guess story go always get wrong love immensely talented writer evidence master dark haunt rhythm draw character netherworld secret shameful deed reel death wife month son seek distraction grief job local newspaper paper critic gradually demote barely cling profession throe technical revolution downsize discover least inspiration otherwise difficult life answer ad membership limit write group chair controversial novelist plan weekly meeting discussion session best quirky figure group talented giant man reek menace offer tale escalate violence blood tattooed curtain catch unfolding story terrible man terrible thing scenario distraught series violent murder occur neighborhood obviously serial killer loose eerily similar juxtaposition fact fiction immerse nightmare member write even beloved son kidnap ominous stranger trap world real danger increase paranoia finally learn consequence story maybe least embrace concept us experience bridge fame story evolves clear innocent stranger yet even trouble attempt writer construct writer lumpy porridge le satisfy interest plot contrivance fail exercise sufficient discipline more angel trouble motive ghastly confuse event logical motive murder threat creep fear untrustworthy character purpose make matter worse handle resolution question know enormously gift storyteller think fulfills purpose luna father son drive watch last movie summer settle food enjoy movie however go miss begin tie name person look want know get take year begin fail writer join write group know small group writer none really hold attention shy quiet woman share haunt story call mesmerize story secretly record take story everyone group enthral then happen serial killer emerge street scene story member group worry serial killer write group however group stop meet killing somehow story get publish killing start want away much many twist turn constantly edge gem want put everything hold sit day easy yank ideas couple page excellently write enjoy first beat track admire writer gut venture solo genre delivers absolutely love try pinpoint killer cast character part writer imaginative great lucky stumble store well money time engage entertaining plot best quite install sense creepiness story keep read world go felt accurate deliver psychological toll main character go intense story anyone enjoy read dark read", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "From acclaimed, bestselling author Andrew Pyper, a suspenseful page-turner that explores the repercussions of that most dishonest of thefts: stealing another’s story and calling it your own.\r\n\r\nPatrick Rush, a former bright light at the National Star now demoted to the reality TV beat, is still recovering from his wife’s death when he joins a writers’ group in Toronto. His goal: to write the book he’s always felt lived within him. Trouble is, Patrick has no story to tell. And while the circle’s members show similarly little literary promise, there is one exception: Angela. Her unsettling readings tell of a shadowy childhood tragedy and an unremitting fear of the Sandman, a “terrible man who does terrible things.” It’s the stuff of nightmares or horror films. Or is it? \r\n\r\nOver the weeks that follow, a string of unsolved murders seem increasingly connected to Patrick. And then the circle’s members start to go missing, one by one. Still haunted by loss–and by a crime only those in the circle could know of–Patrick finds himself in a fictional world made horrifically real. But nothing will put him in greater danger than that ancient curse of natural born readers: the need to know how the story ends.\r\n\r\nAt once a complex and compulsive read, The Killing Circle explores the side effects of an increasingly fame-mad culture, where even the staid realm of literature can fall prey to ravenous ambition and competition.\r\n\r\n“If Andrew Pyper scripted our collective nightmares, we’d all be dreaming and screaming like the narrator of his gorgeously written and thoroughly unnerving suspense thriller…. This is a terrific yarn.” The New York Times", "asin": "1400026083", "rank": "712240", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51rocXBnhrL.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}