{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 15, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "A wonderful, lively and enjoyable stroll through Venice as seen and experienced by notable Englishmen and famous authors and artists- Richard Wagner, Lord Byron, John Singer Sargent for example.. Sometimes we are just reading interesting things about interesting people who happen to have spent time in Venice. I don't care. The thread of the concept works; talking about Venice after the fall of its great days and the rise of Venice as a tourist attraction; the charm or Venice with it's art filled churches and myriad canals. If you like other books by John Julius Norwich you will also enjoy this one. Recommended."}, {"review_sentiment": 4.0, "review_text": "I enjoyed this book but wish the author had included more 19th century Venetian history or at least the 19th century from a Venetian point of view. It mostly deals with foreigners' observations and experiences."}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 5.0, "review_text": "Great resource, narrative style is enjoyable to read."}, {"review_sentiment": 5.0, "review_text": "Norwich is the man to read for all things Venice - his history of the Republic is recommended - this book is as erudite but of a different order - a gossip's gallery..stories told in the piazzi... and speculative...a reading of the bones.A great read."}, {"review_sentiment": 5.0, "review_text": "A wonderful book full of endless stories about famous travelers to this magical city in its tourist heyday (not that that heyday has ever ended).  Delicious background about a place that has justly lured and fascinated more people than almost anywhere in the world.  I've given it to dozens of friends.  I reread it annually, and it always makes me want to go back yet another time."}, {"review_sentiment": 5.0, "review_text": "Great book that explains 19th century Venice in a vivid and incredibly readable fashion. You can almost visualize the sufferings of the city, once so proud and powerful, still colorful and exotic at times. Highly recommend it."}, {"review_sentiment": 5.0, "review_text": "Well written well organised beautiful old illustrations and well selected excerpts from the written words of the persons described.Unfortunately, the footnotes are not readily accessible."}, {"review_sentiment": 5.0, "review_text": "This book is not essential, it's more like an encore, another chance for us to experience  Norwich's take on Venetian history. It's very different from his previous tomes, and the reviewers that complain about the more relaxed tone and structure of this book should have read the author's introduction, where Norwich tells a reader what to expect from the pages that follow.The book is becoming a history twice - while describing the end of republic and Napoleon's rape of Venice and later - in the chapter about the Revolution of 1848-49.  The first part is indispensable if one wants to understand how and why Venice slipped into lethargy, the second is an absolutely unmissable testimony to the Venetians' yearning for their republic's rebirth.The text about the Revolution is an insertion, yes, but without it the nineteenth century Venice would have looked just like a picturesque ruin inhabited by docile natives.The texts about Venice in XIX-XX are a delicasy for these who are already familiar with the much more researched and written about periods of La Serenissima's  life. Finishing it's story with the year 1797 is like cutting short someone's biography when and because a person grows older and becomes less entertaining.I wouldn't recommend anyone to start his or her reading about Venice with this book, but also I have no doubt that as your 15th or 30th book on the subject Paradise Of The Cities will be a delight.After introduction you can make your own...playlist of chapters, I've proceeded to the last, about \"Baron Corvo\", then skipped to Ruskin, followed with the one about Layards (just because I haven't heard of them before), enjoyed the text about Whistler and Sargent, was a bit disappointed by the pages with the story of Byron (Christopher Hibbert tells it better, I think),  it's a pleasure to zigzag through this book choosing the next chapter on a whim - something that's absolutely impossible when you read Norwich's best known history."}, {"review_sentiment": 5.0, "review_text": "I have this book in hard cover but bought this inexpensive paperback to keep w/ me as I wander Venice and to mark up and take notes in w/out hesitation.  So no surprises here and the package arrived well-packaged and in the shape I expected - no small thing for cheaper used books."}]}, "authors": ["John Julius Norwich"], "isbn": "1400032377", "longitude": 12.3345898, "periods": ["1700s", "1800s", "1900s"], "title": "Paradise of Cities: Venice in the Nineteenth Century", "word_cloud": "wonderful lively enjoyable stroll see experience notable famous author read interesting thing interest people spent time care thread concept work talk fall great day tourist attraction charm art fill church myriad canal also enjoy recommend enjoy wish author include history least venetian point view mostly deal foreigner observation experience excellent resource narrative style enjoyable man thing history recommend erudite different order gossip tell piazza speculative reading great wonderful full endless story famous traveler magical city tourist heyday heyday ever end background place justly lure fascinated people almost anywhere world give dozen friend reread annually always make want back yet time explain vivid incredibly readable fashion almost suffering city proud powerful still colorful exotic time recommend well write well organize beautiful old illustration well select excerpt write word person footnote readily accessible essential encore chance venetian history different previous tome reviewer complain relaxed tone structure author introduction tell expect page become history twice describe republic rape later chapter first part indispensable want understand slip lethargy second absolutely unmissable testimony yearn republic text insertion yes picturesque ruin inhabit docile text delicacy already familiar much research write period life story year cut short someone biography person grow older becomes le anyone start reading also doubt subject introduction make playlist chapter proceed last skip follow hear enjoy text bit disappointed page story tell better think pleasure choose next chapter whim something absolutely impossible best know history hard cover bought inexpensive paperback keep wander mark take note hesitation so surprise package arrive shape expect small thing cheaper use", "genres": ["History"], "summary": "John Julius Norwich’s A History of Venice has been dubbed “indispensable” by none other than Jan Morris. Now, in his second book on the city once known as La Serenissima, Norwich advances the story in this elegant chronicle of a hundred years of Venice’s highs and lows, from its ignominious capture by Napoleon in 1797 to the dawn of the 20th century.\r\n\r\nAn obligatory stop on the Grand Tour for any cultured Englishman (and, later, Americans), Venice limped into the 19th century–first under the yoke of France, then as an outpost of the Austrian Hapsburgs, stripped of riches yet indelibly the most ravishing city in Italy. Even when subsumed into a unified Italy in 1866, it remained a magnet for aesthetes of all stripes–subject or setting of books by Ruskin and James, a muse to poets and musicians, in its way the most gracious courtesan of all European cities. \r\n\r\nBy refracting images of Venice through the visits of such extravagant (and sometimes debauched) artists as Lord Byron, Richard Wagner, and the inimitable Baron Corvo, Norwich conjures visions of paradise on a lagoon, as enduring as brick and as elusive as the tides.", "asin": "1400032377", "rank": "1176965", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51mUAd0tViL.jpg", "country": "Italy", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}