{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 35, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "I learn from LC, I don't review him. Right. As if I could."}, {"review_sentiment": 5.0, "review_text": "Interesting book"}, {"review_sentiment": 5.0, "review_text": "Lenny is the best!"}, {"review_sentiment": 5.0, "review_text": "It's hard to choose words that describe this novel, as it is totally unique.  There is always a dark side with this writer, and there is humor as well."}, {"review_sentiment": 5.0, "review_text": "Good youth novel of Leonard Cohen"}, {"review_sentiment": 4.0, "review_text": "Interesting more because the authors music is appreciated. Adds depth to the author. His mind. Worth reading if interested in the authors background."}, {"review_sentiment": 5.0, "review_text": "Wish I'd read this 40 years ago but glad to have read it now. Timeless capture of the moment in a young man's life."}, {"review_sentiment": 5.0, "review_text": "I loved this book.  It was perfect for the time and place in my life.  I was living in Montreal for the summer and was looking for something and came across this.  It is set in Montreal and is written beautifully.  After skimming through it for a minute in the used book store, I bought it.  After seeing how few reviews there are, it goes to show me that I could still fall in love with a book regardless of its popularity."}, {"review_sentiment": 5.0, "review_text": "I love Cohen's artistry. Wonderful romp, so funny."}, {"review_sentiment": 4.0, "review_text": "As a female reader, I appreciated the insights into the male mind.  It helped me understand a great deal more about the differences of motivation and mindset between young men and young women.  I wish I had read it earlier in my life."}]}, "authors": ["Leonard Cohen"], "isbn": "1400033624", "longitude": -73.6103642, "periods": ["1900s"], "title": "The Favorite Game", "word_cloud": "learn review right interest best hard choose word describe totally unique always dark side writer humor well good youth interest author music appreciate depth author mind read interested author wish year ago glad capture moment young man life love perfect time place life live summer look something come set write beautifully skim minute use store buy see review go show still regardless popularity love artistry romp funny female appreciate insight male mind help great deal difference motivation mindset young men young woman wish earlier life", "genres": ["Fiction & Literature"], "summary": "In this unforgettable novel, Leonard Cohen boldly etches the youth and early manhood of Lawrence Breavman, only son of an old Jewish family in Montreal. Life for Breavman is made up of dazzling colour – a series of motion pictures fed through a high-speed projector: the half-understood death of his father; the adult games of love and war, with their infinite capacity for fantasy and cruelty; his secret experiments with hypnotism; the night-long adventures with Krantz, his beloved comrade and confidant. \r\n\r\nLater, achieving literary fame as a college student, Breavman does penance through manual labour, but ultimately flees to New York. And although he has loved the bodies of many women, it is only when he meets Shell, whom he awakens to her own beauty, that he discovers the totality of love and its demands, and comes to terms with the sacrifices he must make.\r\n\r\n\"He is a writer of terrific energy and color, a Rabelaisian comic and a visualizer of memorable scenes.\" The Observer", "asin": "1400033624", "rank": "309103", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/3164TBPK5VL.jpg", "country": "Canada", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}