{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 25.7742658, "ratings": {"num_ratings": 21, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Charles Willeford is a GREAT WRITER and this book is part of one of his greatest writing series.  it's as much film noir as it is detective writing. If you are a fan of Ellmore Leonard you've got to read Willeford.  Leonard was a big fan of his."}, {"review_sentiment": 3.0, "review_text": "First time reader. Will read more from this author."}, {"review_sentiment": 4.0, "review_text": "New Hope for the Dead is the second novel in Charles Willeford’s Hoke Moseley series, following Miami Blues. Hoke is a middle-aged Miami P.D. homicide detective who’s been gutted financially by a divorce and has been reduced to living in a tiny room in a run-down residential hotel that is inconveniently located just outside the Miami city limits. Inconveniently, because Hoke’s boss has just laid down the law and announced that the department will begin rigorously enforcing the requirement that all city police officers must actually live in Miami. Hoke has only a couple of weeks to find a new place to live, a herculean task given his financial straits and the scarcity of affordable housing in the city.To compound his difficulties, Hoke’s ex-wife has decided to move from Florida to California to live with a major league baseball player who’s just signed a huge new contract. The ball player is not enamored of Hoke’s fourteen and sixteen year-old daughters and so, with no forewarning, the ex-wife packs up the girls and ships them off to live with Hoke who hasn’t had any contact with his daughters in years.Things are almost as bleak on the job front. Hoke’s ambitious boss is bucking for a promotion and as a part of his campaign, he details Hoke, Hoke’s former partner Bill Henderson, and Hoke’s new partner Ellita Sanchez to compromise a three-person cold case squad and assigns them fifty old cases. The Major figures that even if the team only solves a few of them it will make him look good and assure his promotion. But these cases are virtually all dogs with very little hope of solutions.Meanwhile, Hoke and Ellita have caught a death call that appears to be a simple heroin O.D. The young male victim is found the house of his shapely stepmother with whom he has been rooming. The case itself seems a slam dunk, but it’s going to take time and effort to get the case processed and the paper work done. On the bright side, though, Hoke sees romantic possibilities with the stepmother who owns a flower shop and who readily agrees that she might enjoy lunching with Hoke someday soon.Complications ensue as they usually do, on virtually every front of Hoke’s life. In and around working his cases and training his new partner, he’s got to find a new home and the days are dwindling down to a precious few on that front. All in all, it’s a very entertaining story with a lot of humor. Willeford was a master at this sort of thing and he develops both the plot and his characters with a sure hand. A very good sequel to the novel that introduced Hoke Moseley."}, {"review_sentiment": 4.0, "review_text": "Read, liked"}, {"review_sentiment": 4.0, "review_text": "It is a shame the author only wrote four novel in the series."}, {"review_sentiment": 5.0, "review_text": "Re-read an old favourite now on Kindle.This writer deserves a much wider audience. Highly recommended."}, {"review_sentiment": 5.0, "review_text": "Amazingly realistic book about Miami.  A great author, Charles Willeford."}, {"review_sentiment": 5.0, "review_text": "He is one of the best. Always."}, {"review_sentiment": 5.0, "review_text": "The Hoke Moseley novels bring a gritty, yet human, realism to the US \"hard-boiled\" detective genre. Charles Willeford is a master of intricate detail, engaging storyline, rounded characters, and all set against a background of wit and tension. Perfect."}, {"review_sentiment": 5.0, "review_text": "great dialogue, great characters.  reminds me of elmore leonard, somewhat.  that is good, by the way.  I recommend it highly"}]}, "authors": ["Charles Willeford"], "isbn": "1400032490", "longitude": -80.1936589, "periods": ["1900s"], "title": "New Hope for the Dead", "word_cloud": "part greatest write series much film nor detective write fan get big fan first time author second series follow homicide detective gutted financially reduce live tiny room residential hotel inconveniently locate city limit bos lay law announce department begin rigorously enforce requirement city police officer actually couple week find place live herculean task give financial strait scarcity affordable housing compound difficulty decide move live major league baseball player sign huge contract ball player enamor fourteen sixteen daughter forewarn pack girl ship live contact daughter almost bleak job front ambitious bos buck promotion part campaign detail former partner partner compromise cold case squad assigns fifty old case figure even team solves make good assure promotion case virtually dog little catch death call appear simple young male victim find house shapely stepmother room case seem slam dunk go take time effort case process paper work do bright side see romantic possibility stepmother own flower shop readily agree lunch someday usually virtually front life work case train partner get find home day dwindle precious front entertain story lot humor master sort thing develop plot character sure hand good sequel introduce like shame author write series old favorite writer deserves much wider audience recommend amazingly realistic great author best always novel bring gritty yet human realism detective genre master intricate detail engage story line round character set wit tension great dialogue great character remind elm ore leonard somewhat good way recommend highly", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Miami homicide detective Hoke Moseley is called to a posh Miami neighborhood to investigate a lethal overdose. There he meets the alluring stepmother of the decedant, and begins to wonder about dating a witness. \r\n\r\nMeanwile, he has been threatened with suspension by his ambitious new chief unless he leaves his beloved, if squalid, suite at the El Dorado Hotel, and moves downtown. With free housing hard to come by, Hoke is desperate to find a new place to live. His difficulties are only amplified by an assignment to re-investigate fifty unsolved murders, the unexpected arrival of his two teenage daughters, and a partner struggling with an unwanted pregnancy. With few options and even fewer dollars, he decides that the suspicious and beautiful stepmother of the dead junkie might be a compromised solution to all of his problems.\r\n\r\nPacked with atmosphere and humor, New Hope for the Dead is a classic murder mystery by one of the true masters of the genre. Now back in print, Charles Willeford’s tour de force is an irresistible invitation to become acquainted with one of the greatest detective characters of all time.\r\n\r\n\"Pure pleasure... Mr. Willeford never puts a foot wrong.\" The New Yorker\r\n", "asin": "1400032490", "rank": "703225", "city": "Miami", "image": "https://images-na.ssl-images-amazon.com/images/I/51SQfpNQ7YL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}