{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 4.5980772, "ratings": {"num_ratings": 80, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "The best thing about this book is discovering the story behind the stories in his other work. Stories involving his family, specially his mother, are the most interesting, but you will learn about his siblings and papa also. Chapters about his student days are also interesting but his life as a reporter and editorial writer lack the intimate details much of the time. He moves back and forth between Bogata and several other Colombian towns and is sometimes confusing. The ongoing civil wars make up much of the background. My feeling is that the biography of Marquez by another author will provide a more organized account of his life. He says very little about his future wife and it is not explained when they married. The story ends somewhat abruptly when he leaves Columbia for Switzerland."}, {"review_sentiment": 5.0, "review_text": "okay"}, {"review_sentiment": 4.0, "review_text": "I once had a friend, a Cuban/American professor of governance at Georgetown. We would meet occasionally for lunch in the elegant faculty lounge to discuss the affairs of the day in Latin America; what the future of his imprisoned birth island would be; how the changes of the 21st century would sweep across the continent after the ‘pink tide’ was spent.“The problem with Americans,” he would often tell me, as we talked about the waves of communism and dictatorship that never cease to buffet the continent’s shores, “is that they don’t understand Latin American culture is not ‘western’, at least not in the way you think.” It’s a hard concept – we have so much of Latin America running through our veins; through our history and our imagination. The Spanish Mission of San Xavier sitting like a shining pearl in the desert south of Tucson; signs in Miami declaring proudly “English Also Spoken Here” – didn’t American soldiers also fight beside Simon Bolivar? Isn’t the United States the world’s 5th largest Spanish speaking country?North America – at least the northern part (excluding the American South, which was partially the cause of our great war) – has never been feudal. Great families controlling land and with it the destinies of their ‘peasants’. Latin America, on the contrary and up until recently, has been a feudal place. In Venezuela they were called the ‘Amos del Valle’ – the Lords of the Valley (of Caracas) – thick and rich, and white: they are still there, despite Venezuela’s own modern ‘Violencia’. In Venezuela it was the pitiless dictatorship of Juan Vicente Gomez that transformed the country from its feudal agrarianism to the makings of a modern nation. That, and the discovery of oil, kept Venezuela from descending into a confrontation between the landed aristocracy and the peasants – between the rich and the poor – between the white and the afro-indigenous – between the past, and the future. At least till Hugo Chavez.For Colombia, this reckoning came earlier; and it was bloodier because there was nothing to smooth over the carnage. It came in the form of a 1000 days war at the center of five decades of simmering conflict – lasting even through today. It pitted Colombia’s ruling families – Restrepos and Santos and Pastranas and others – against a restive peasantry itching for opportunity.Gabriel Garcia Marquez was part of this peasantry. And “Living to Tell the Tale”, the autobiography of the first half of his life (I think he planned a 2nd part – one that never came), is the story of a young man, journalist and writer who was straddling this tumultuous period in Colombian history. He was trying to cover it as a journalist; he was trying to understand it and write about it; and he was trying to survive it. The assassination of Jorge Eliécer Gaitán; “La Violencia”, a decade of violence following this event. Coups and counter-coups. The beginnings of Colombian communism – which spawned the FARC when the war between the Conservatives and the Liberals was not conclusively won; a communism like that of the Soviet Union, not the proletariat against the bourgeois but a peasant uprising against the nobles.Gabo lived all of it – and that’s what makes this story incredible. It’s the story of the coming of age of a great writer born of poverty in the course of the coming of age of his country.Gabo had communist sympathies – because he was from peasant stock and revolution seemed the only way out. Not that he was a revolutionary himself (he was not quick to pick up a gun after witnessing the murder of Gaitan); he was, first and foremost, a writer. And anything that got in the way of that calling was discarded. He probably had bad ideas – certainly communism was not the answer to Colombia’s nasty oligarchy (as it hasn’t been the answer in Venezuela). But I can see how a poor boy would have a soft place for those who tormented his oppressors.“Living to Tell the Tale” did give me a better understanding of Gabo’s writing. He is, above all, extremely provincial. He is a village boy from pre-modern Colombia; and even as he traveled – Paris and Mexico and farther – he could not shake his roots: they were everything he was. Which I suppose makes his success that much more astounding just as it makes his writing that much more genuine.I’m still not a fan of “100 Years” – and Gabo isn’t my favorite novelist – but I’m immensely glad I read his auto-biography. It is the story of a writer, told by a writer, and has given me tremendous encouragement for my own writing. For that, I thank him."}, {"review_sentiment": 4.0, "review_text": "It is certainly not as riveting as One Hundred Years of Solitude but offers many hours of engaging pleasure-reading."}, {"review_sentiment": 5.0, "review_text": "Great book!!!!"}, {"review_sentiment": 4.0, "review_text": "The most engaging portions fo Marquez autobiography are those parallel to the village tales of A Hundred Years of Solitude, that is, his childhood memories, interactions with his mother, and the settings for both.  When he grows into a world of journalists yakking over bar stools, the pace slows and your interest fades."}, {"review_sentiment": 5.0, "review_text": "Perhaps all these one-star \"critics\" should read the book in Spanish. English translations are notoriously poor."}, {"review_sentiment": 4.0, "review_text": "reading it now"}, {"review_sentiment": 5.0, "review_text": "The key to understanding Gabo and truly appreciating his art."}, {"review_sentiment": 1.0, "review_text": "boring and just looooooong.. read more books of him but this one.. I was unable to finish."}]}, "authors": ["Gabriel García Márquez"], "isbn": "140003454X", "longitude": -74.0761028, "periods": ["1900s"], "title": "Living to Tell the Tale", "word_cloud": "best thing discover story story work story involve family specially mother interest learn sibling papa also student day also interest life reporter editorial writer lack intimate detail much time move back forth several colombian town sometimes confuse ongoing civil war make much feeling biography author provide organize account life say little future wife explain marry story end somewhat abruptly leave okay friend professor governance occasionally lunch elegant faculty lounge discus affair day future imprison birth island century continent pink problem often talked wave communism dictatorship never cease buffet continent shore understand latin american culture western least way hard concept much run vein history imagination spanish sit shin pearl desert south sign declare proudly also here american soldier also fight beside world largest spanish speaking country least northern part exclude partially cause great war never feudal family control land destiny peasants contrary recently feudal place call thick rich white still modern pitiless dictatorship transform country feudal agrarianism making modern nation discovery oil keep descend confrontation land aristocracy peasant rich poor white past future least till reckon come earlier nothing smooth carnage come form day war center decade simmer conflict last even today pit rule family others restive peasantry itch part peasantry autobiography first half life think plan part never come story young man journalist writer straddle tumultuous period colombian history try cover journalist try understand try assassination decade violence follow event beginning colombian communism spawn war conclusively communism proletariat bourgeois peasant uprise live make story incredible story come age great writer bear poverty course come age communist sympathy peasant stock revolution seem way not revolutionary quick pick gun witness murder first foremost writer anything get way call discard probably bad idea certainly communism answer nasty oligarchy answer see poor boy place tormented give better understand write extremely provincial boy even travel farther root everything suppose make success much astound make write much still fan favorite novelist immensely glad story writer tell writer give tremendous encouragement write thank certainly rivet year offer many hour engage great engaging portion few autobiography parallel village tales year childhood memory interaction mother setting grow world journalist yak bar stool pace slow interest fade perhaps critic spanish translation notoriously poor reading key understanding truly appreciate art bore unable finish", "genres": ["Memoir"], "summary": "No writer of his time exerted the magical appeal of Gabriel García Márquez. In this long-awaited autobiography, the great Nobel laureate tells the story of his life from his birth in1927 to the moment in the 1950s when he proposed to his wife. The result is as spectacular as his finest fiction. \r\n\r\nHere is García Márquez’s shimmering evocation of his childhood home of Aracataca, the basis of the fictional Macondo. Here are the members of his ebulliently eccentric family. Here are the forces that turned him into a writer. Warm, revealing, abounding in images so vivid that we seem to be remembering them ourselves, Living to Tell the Tale is a work of enchantment.", "asin": "140003454X", "rank": "166401", "city": "Bogota", "image": "https://images-na.ssl-images-amazon.com/images/I/51qlCCLTCSL.jpg", "country": "Colombia", "story_arc": ["Tragedy", "Things only get worse"]}