{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 45.5202471, "ratings": {"num_ratings": 65, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "really makes you wish you lived in Portland! super interesting"}, {"review_sentiment": 5.0, "review_text": "I love weird & this man has astounded me from the gate. He is so brilliant that there are just no words to convey."}, {"review_sentiment": 5.0, "review_text": "What a fun bit of history for Portland! I enjoyed the intermittent 'postcards' with interesting anecdotes which tied nicely with the information about Portland. Having never been to Portland I expect a trip will be coming soon after reading this."}, {"review_sentiment": 3.0, "review_text": "Read a cool travel guide for Chuck's hometown of Portland. Interesting quick read with some very profound facts. Now I gotta travel to Portland"}, {"review_sentiment": 4.0, "review_text": "It was an interesting book with a lot of recommendations. Loved the stories!"}, {"review_sentiment": 5.0, "review_text": "This is a really wonderful book for anyone living in or interested in Portland.  I've probably bought 4 copies by now to give to people.  Tons of stories about Portland's history and personal stories.  As I was reading it, I realized that the house I was living in at the time was directly behind and 2 houses down from one of his houses.  So cool!"}, {"review_sentiment": 5.0, "review_text": "I have purchased this book 4 times now because every time someone comes to visit me, they take it! It's a wonderful and weird look into the city of Portland. If you have lived here your whole life, or are just visiting I guarantee that you will learn something you never knew about the City of Roses. BUY THIS BOOK!!"}, {"review_sentiment": 5.0, "review_text": "What can i say its palahniuk...."}, {"review_sentiment": 3.0, "review_text": "This is, by far, by favorite book by Palahniuk.  I've read several of his other books and they mostly confound and confuse me with some amazing literary skill creeping in at the edges of the weirdness.This book is just straight up weird and doesn't pretend to be anything else.  It doesn't pretend to be high literature.  It's just an incredibly strange man writing about his love affair with an incredible strange city, Portland.  Because I write travel books and blogs and articles myself, I am always interested to read the travelogues of others.  While I wouldn't visit most of the places in the book, I found it to be a very interesting and funny read.  Most of the book focuses on gay bars and drug hangouts, which is maybe not the way to promote tourism but that isn't really the author's intention.  His intention is just to give a shout out to the uniqueness and quirkiness of Portland.  If you like smatterings of history thrown in with smatterings of fact and travel, you'll probably like this."}, {"review_sentiment": 4.0, "review_text": "I grew up in the Portland area, but hadn't heard of most of the stories in this book. Palahniuk writes about Portland weirdness and beauty, from haunted places to secret apocalypse-themed dinners to the shanghai tunnels. It's a short, pre-Portlandia look at what makes Portland unique."}]}, "authors": ["Chuck Palahniuk"], "isbn": "1400047838", "longitude": -122.6741949, "periods": ["1900s", "2000s"], "title": "Fugitives and Refugees: A Walk in Portland, Oregon", "word_cloud": "really make wish live super interesting love weird man astound gate brilliant word convey fun bit history enjoy intermittent interest anecdote tie nicely information never expect trip come soon read read cool travel guide hometown quick profound fact now get ta travel interest lot recommendation love story really wonderful anyone living interested probably buy copy give people story history personal story read realize house live time directly house house so cool purchase time time someone come visit wonderful weird look city live whole life visit guarantee learn something never know say palahniuk far favorite several mostly confound confuse amaze literary skill creep edge straight weird pretend anything else pretend high literature incredibly strange man write affair incredible strange city write travel blog article always interest travelogue others place find interest funny most focus gay bar drug hangout maybe way promote tourism really author intention intention shout uniqueness quirkiness like smattering history thrown smattering fact travel probably grow area heard story write weirdness beauty haunt place secret dinner shanghai tunnel short look make unique", "genres": ["History", "Travel Writing"], "summary": "Want to know where Chuck Palahniuk’s tonsils currently reside? Been looking for a naked mannequin to hide in your kitchen cabinets? Curious about Chuck’s debut in an MTV music video? What goes on at the Scum Center? How do you get to the Apocalypse Café?\r\n\r\nIn the closest thing he may ever write to an autobiography, Chuck Palahniuk provides answers to all these questions and more as he takes you through the streets, sewers, and local haunts of Portland, Oregon. According to Katherine Dunn, author of the cult classic Geek Love, Portland is the home of America’s “fugitives and refugees.” Get to know these folks, the “most cracked of the crackpots,” as Palahniuk calls them, and come along with him on an adventure through the parts of Portland you might not otherwise believe actually exist. No other travel guide will give you this kind of access to “a little history, a little legend, and a lot of friendly, sincere, fascinating people who maybe should’ve kept their mouths shut.”\r\n\r\nHere are strange personal museums, weird annual events, and ghost stories. Tour the tunnels under downtown Portland. Visit swingers’ sex clubs, gay and straight. See Frances Gabe’s famous 1940s Self-Cleaning House. Look into strange local customs like the I-Tit-a-Rod Race and the Santa Rampage. Learn how to talk like a local in a quick vocabulary lesson. Get to know, I mean really get to know, the animals at the Portland zoo. \r\n\r\nOh, the list goes on and on.", "asin": "1400047838", "rank": "162377", "city": "Portland", "image": "https://images-na.ssl-images-amazon.com/images/I/41ViGh2nX7L.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}