{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 35.6828378, "ratings": {"num_ratings": 35, "rating": 3.1, "reviews": [{"review_sentiment": 5.0, "review_text": "a brief memoir by a novelist.  a vacation in more than one sense of the word.  a vacation in the sense that carey and his son travel to a foreign country, and a vacation from novel writing—here irony enters in the guise of the tools which make carey a novelist of note, observation and writing style, as they are put to use in writing the factual Wrong About Japan.  and along with observation and writing style, if carey's remarks about a person within his memoir actually being a fictional character made-up by the author, well, keep in mind the writers who mixed fiction with non-fiction.  carey seemed to want to know if his powers were up to the task of creating a character different from his experience.  rather than letting the reader in on what he was doing from the start, he waited until the early reviews were in to see if the character passed the readers' test of believability.keeping in mind that it was gertrude stein who, while in france, said that there is no there there in reference to a city in california.  that her comment fits the western writer’s conception of japan in a way so varied no two writers come back from a visit to japan with the same impression was not lost on roland barthes.  roland barthes returned from his trip to japan to put together a book of photos from his trip, his tourist experiences, and historical and geographical facts described as a lecture on signs, images and objects.like barthes’ Empire of Signs, carey’s book is illustrated.  but for inspiration, carey follows the lead of his twelve year old son, his interest, the imaginary world manga, japanese comic books.being a novelist of note has its perks.  once father and son are into their journey among the hi-tech mish mash of eclectic, electronic tokyo, carey’s connections link them to the creators of manga, the famous and the historical legends, while young carey hooks up with a japanese fan his own age, making for a trip of impressions from the youth cultural viewpoint of an adolescent and a glimpse into the world of professionals, the working adults, often boring to the young, and for a book both young and older readers can enjoy."}, {"review_sentiment": 2.0, "review_text": "This reader was drawn to this small easy to read book for two reasons. First, this reader absolutely loves Peter Carey books. His prose is just unique and he rarely wastes sentences, let alone paragraphs when he gets into full swing with his books. Secondly, this reader was also drawn to reading it because he has lived in Japan for a very long time and still continues to live there even today. So, he was very keen to read the book, but strangely enough, this reader thought it was only average. It took this reader more than half of the short book for Carey's writing to drag him along and apart from the finish to the book there was only one other part that really caught the readers attention. He thought it was a meander down memory lane rather than the powerful prose of Peter Carey. It was an unmoving and disappointing account by Carey.This reader was so disappointed with Carey's, \"Wrong about Japan\" that he thought about so many other really good books that he has read about Japan. The absolute best book about Japan that you could read (in this persons' opinion) would be: Alex Kerr's, \"Dogs and Demons\". A fabulous read that underpins the structural, social and some economic problems that exist in Japan. Some other Kerr's of books are worth a read too such as, \"Lost Japan\" and \"Living in Japan\". For a light hearted entertaining read you could try Simon May's, \"Atomic Sushi\" or \"The Accidental Office Lady\" by Laura Kriska; For an almost polar opposite account of Japan read you could try, \"Peasants, Rebels and Outcasts\" by Mikaso Hane or the fabulous Kaplin and Dubro's, \"Yakuza\" about the nasty seedy underside of Japan. Of course, there are books on its' politics, history, Bushido, WW2 (of course), cook books, travel books and language books just to name a few topics available about Japan.This reader just thought Carey's, \"Wrong about Japan\" was strangely average. A person who has won numerous literature awards seemed to have mocked up or slapped sticked a quick yarn about his son to no great effect. It scrapes in for a mere two stars."}, {"review_sentiment": 4.0, "review_text": "I love Shogun and books about ancient Japan. I have never read manga, but was intrigued by the idea of a father and son visit because I want to go myself. The author gives such good details and uses self-deprecating humor to allow us to know what it feels like to be a foreigner in a land where social rules are so different, even in modern times, to westerners. I related to raising a child in the digital age when I almost hate my smart phone.I didn't like some of the repetitive information and the author at times was a little harsh about the supposed superiority of the Japanese. However, the interview with a man who talked about living through the bombing during WWII was of great value and I will never forget it.This is a fun, quick read with precious nuggets throughout."}, {"review_sentiment": 1.0, "review_text": "Absolute garbage. Never has a book make me feel so ill about it's author and their perspectives."}, {"review_sentiment": 4.0, "review_text": "\"Wrong About Japan is by Peter Carey, an Australian writer whose novel, \"Oscar and Lucinda,\" won the Booker Prize. I've never read anything by him before, but was intrigued when I saw the title at a local library.  I've had a lifelong fascination with Japan since I lived there for a year in 1960 when my dad had a Fullbright Scholarship that financed the trip for our family.This book is an entertaining nonfiction account of a middle school-aged New York City boy named Charlie who has a fascination with Japanese manga (visually told stories, like comics with a distinctly Japanese flavor), and anime, or Japanese animation films. His dad Peter, who narrates the story, wants to visit Japan with his son. Charlie agrees only on the condition that they don't just visit temples, Noh dramas, Kabuki theater, and the usual traditional spots. The boy wants to visit manga authors and publishers, and anime studios and directors.Although, much to the chagrin of Charlie, his dad does take him to some of the more traditional tourist sites, including a four-hour Noh drama Charlie suffers through and later claims to have been the worst experience of his life, they also visit the manga and anime worlds. Peter, through his contacts with the Japanese publisher of his books, is able to line up dates with some very famous and talented manga and anime artists.The absolute topper of their trip is that they actually arrange a visit with Hayao Miyazaki, the revered animation genius who created and directed such films as \"Spirited Away\", \"My Neighbor Totoro\", and \"Castle in the Sky\". If you have not seen any of these films, do! Comically, when they actually meet Miyazaki, whom they catch somewhat unexpectedly while touring the studio on a day it is shut down, they have no interpreter and wind up communicating largely through gestures and some flip books Miyazaki shares with them.The book is quite charming, and it's fun to see a father and son having such a great time together as they bicker in between adventures with exotic food and Japanese culture both traditional and contemporary. There's a kind of running gag throughout the book that every time Peter asks the manga and anime artists a question, they shake their heads and state vaguely that the question is so off-the-mark, if not downright moronic, that they really can't be bothered to answer it. Handled politely, of course. This is Japan after all.At 158 pages, it's a fun and quick read, and you'll learn a bit about Japan in the 21st century in the process."}, {"review_sentiment": 5.0, "review_text": "This is a very enjoyable book.  It affords a good look at Japanese culture and anime and manga."}, {"review_sentiment": 3.0, "review_text": "Interesting observations about modern Japanese culture"}, {"review_sentiment": 4.0, "review_text": "This is a great and short book on Japanese pop-culture and its' fascination with many things, including robotics.  I wish this book could have been a bit longer and more detailed, as it seemed short-lived after reading it.  Through Carey's very personal encounters with some Japanese artists and people, one gets first-hand kind of insight into the pace and style of life in Japan."}, {"review_sentiment": 3.0, "review_text": "I am very much a fan Carey's fictional works but found this one very hard to get into. Whilst I can appreciate much of what is written from, 1) The point of trying to connect with a somewhat estranged teenager (being a parent of one), and, 2) some of his insights (having lived in Japan for some time), I think there are other more worthy tomes that could be read before this one."}, {"review_sentiment": 1.0, "review_text": "The author is clearly arrogant, demeaning, and uneducated.  How did this author win awards?  He tells a simpleton's view of Japanese culture while seemingly forgoing fact-checking altogether."}]}, "authors": ["Peter Carey"], "isbn": "1400078369", "longitude": 139.7589667, "periods": ["2000s"], "title": "Wrong About Japan", "word_cloud": "brief memoir novelist vacation sense word vacation sense carey son travel foreign country vacation irony enters guise tool make carey novelist note observation write style put write factual observation write style carey remark person memoir actually fictional character author well mind writer mixed fiction carey seem want know power task create character different experience rather let wait early review see character pass reader test mind gertrude stein france say reference city california comment fit western writer conception way vary writer come back impression lose roland barthes roland barthes return trip put together photo trip tourist experience historical geographical fact describe lecture sign image barthes carey illustrate inspiration carey follow lead twelve year old son interest imaginary world manga japanese comic novelist note perk father son journey mush mash eclectic electronic tokyo carey connection link creator manga famous historical legend young carey hook japanese fan age make trip impression youth cultural viewpoint adolescent glimpse world professional work adult often bore young young older reader enjoy draw small easy reason absolutely love prose unique rarely waste sentence alone paragraph get full swing also draw read live long time still continue live even today keen strangely enough thought average take half short write drag apart part really catch reader attention think meander memory lane rather powerful prose unloving disappointing account disappoint think many really good absolute best opinion fabulous underpins structural social economic problem exist worth light heat entertaining almost polar opposite account fabulous nasty seedy course politics history course cook travel language name topic available think strangely average person numerous literature award seem mocked slap stocked quick yarn son great effect scrap mere star love ancient never manga intrigue idea father son visit want author give good detail use humor know feel foreigner land social rule different even modern time westerner relate raise child digital age almost hate smart repetitive information author time little harsh suppose superiority japanese however interview man talk live bomb great value never forget fun quick precious nugget garbage make feel ill author perspective writer never anything intrigued saw title local library lifelong fascination live year dad finance trip entertain nonfiction account middle boy name fascination manga visually tell story comic distinctly japanese flavor anime japanese animation film dad narrate story want son agree condition visit temple drama theater usual traditional spot boy want visit manga author publisher anime studio much chagrin dad traditional tourist site include drama suffers later claim worst experience life also visit manga anime world contact japanese publisher able line date famous talented manga anime absolute topper trip actually arrange visit revere animation genius create directed film spirit see film actually meet somewhat unexpectedly touring studio day shut interpreter wind communicate largely gesture flip share quite charm fun see father son great time together bicker adventure exotic food japanese culture traditional contemporary kind run gag time ask manga anime artist question head state vaguely question downright moronic really answer politely course page fun quick learn bit century process enjoyable afford good japanese culture anime manga interest observation modern japanese culture great short japanese fascination many thing include robotics wish bit longer detailed seem read personal encounter japanese artist people get kind insight pace style life much fan fictional work find hard get appreciate much write point try connect somewhat estrange teenager parent insight live time think worthy tome author clearly arrogant demean uneducated author win award tell simpleton japanese culture seemingly forgo altogether", "genres": ["Memoir", "Travel Writing"], "summary": "When Peter Carey offered to take his son to Japan, 12-year-old Charley stipulated no temples or museums. He wanted to see manga, anime, and cool, weird stuff. His father said yes. \r\n\r\nOut of that bargain comes this enchanting tour of the mansion of Japanese culture, as entered through its garish, brightly lit back door. Guided–and at times judged–by an ineffably strange boy named Takashi, the Careys meet manga artists and anime directors, the meticulous impersonators called “visualists,” and solitary, nerdish otaku. \r\n\r\nThroughout, the Booker Prize-winning novelist makes observations that are intriguing even when–as his hosts keep politely reminding him–they turn out to be wrong. \r\n\r\nFunny, surprising, distinguished by its wonderfully nuanced portrait of a father and son thousands of miles from home, Wrong About Japan is a delight.\r\n\r\n\"Manga and anime . . . become not only a key for unlocking Japanese culture, but a bridge over the generational divide between the author and his son. . . . Moving.\" The New York Times", "asin": "1400078369", "rank": "1538962", "city": "Tokyo", "image": "https://images-na.ssl-images-amazon.com/images/I/51W3N0CXZZL.jpg", "country": "Japan", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}