{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 6.2443382, "ratings": {"num_ratings": 54, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "Very interesting look at the Escobar terror periodJournalistic but very engaging"}, {"review_sentiment": 5.0, "review_text": "Well written.... I could not put it down"}, {"review_sentiment": 5.0, "review_text": "The story was well written and translated.  It was so interesting to read about the kidnappings from the perspective of those who lived through the unfortunate events"}, {"review_sentiment": 5.0, "review_text": "Great book"}, {"review_sentiment": 5.0, "review_text": "i little slow and probably would be really interesting if you knew what else was going on at the time."}, {"review_sentiment": 5.0, "review_text": "The kidnappings and protracted negotiations around Escobar's surrender are brilliantly told. An amazing story that I'm amazed I didn't know about before reading the book."}, {"review_sentiment": 4.0, "review_text": "I read it and liked it."}, {"review_sentiment": 2.0, "review_text": "A"}, {"review_sentiment": 4.0, "review_text": "good price, fast delivery"}, {"review_sentiment": 5.0, "review_text": "good"}]}, "authors": ["Gabriel García Márquez"], "isbn": "1400034930", "longitude": -75.573553, "periods": ["1900s"], "title": "News of a Kidnapping", "word_cloud": "very interesting look terror period journalistic engaging well write story well write translate interesting kidnapping perspective lived unfortunate event great little slow probably really knew else go time kidnapping protract negotiation surrender brilliantly tell amazing story amaze know read like good price fast delivery good", "genres": ["History", "True Crime", "Politics"], "summary": "n 1990, fearing extradition to the United States, Pablo Escobar – head of the Medellín drug cartel – kidnapped ten notable Colombians to use as bargaining chips. With the eye of a poet, García Márquez describes the survivors’ perilous ordeal and the bizarre drama of the negotiations for their release. He also depicts the keening ache of Colombia after nearly forty years of rebel uprisings, right-wing death squads, currency collapse and narco-democracy. \r\n\r\nWith cinematic intensity, breathtaking language and journalistic rigor, García Márquez evokes the sickness that inflicts his beloved country and how it penetrates every strata of society, from the lowliest peasant to the President himself.\r\n\r\n“Fascinating. . . . Possesses all the drama and emotional resonance of García Márquez’s most powerful fiction.” The New York Times", "asin": "1400034930", "rank": "97320", "city": "Medellin", "image": "https://images-na.ssl-images-amazon.com/images/I/51FlARXKP2L.jpg", "country": "Colombia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}