{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 34.5260131, "ratings": {"num_ratings": 103, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "This is a work of fiction that reads like the truth because it is the truth told with fake names and characters.  This is about what life is/was like under the rule of the Taliban.  One of the most chilling things I've ever read.  Unforgettable.  Highly recommend.  Would definitely give as a gift to others."}, {"review_sentiment": 5.0, "review_text": "This story touches the core of our humanity.  Insightful and profound, it left many lingering emotions. Haunting yet necessary to ponder if we are to remain in touch with our collective \"world sanity\"."}, {"review_sentiment": 5.0, "review_text": "Mezmerizing writing. I felt like I was in Kabul. How blessed we are as Americans not to have to live in world like the one described."}, {"review_sentiment": 3.0, "review_text": "This is a grim story of the horrendous conditions in Afghanistan from 1996 to 2001 after the Taliban took over control from the Soviets.While there is a story and a plot, the book is really about the desolate conditions in the war-scarred capital of Kabul: a dying city in a dying landscape of desert heat and dryness hemmed in by mountains. Half of the buildings are destroyed, including mosques. Some structures are simply fronts of buildings; business is conducted in pieces of buildings.The brutality of the social and political conditions parallels the physical desolation. The Taliban regime has banned “pleasure.” There can be no music. As if the war did not do enough damage, they destroy historic monuments. You can be clubbed for laughing on the street; passersby are whipped into prayers in the mosques. You look around every corner before speaking.Order is maintained with whips, fists and clubs. Public executions are a weekly occurrence. There are hangings, stonings of women, rifle executions, throat slittings. Sometime relatives of the victim conduct the execution. A mentally ill man who wanders the streets talking to himself is whipped to death for blasphemy. Women can only go out in public in full burka (“the swallows”) and accompanied by a man.The toll of years of war is seen in the population. There are widows, war wounded, orphans. Men who lost arms and legs in the war beg from wheelbarrows. Parents have lost children. Kids roam the streets like packs of dogs, begging, feeding on garbage and stealing food. Important men carry a whip on the street to lash their way through the rabble.The story focuses on two married couples who aren’t connected to each other. One man is the jailer to those being held for execution. In a way, he is a simple man who loves his wife. But he can’t help himself from tormenting her even though she is dying. Seeing him depressed, his only friend tells him, in effect “Divorce her; she’s only a woman; get another one.”A college-educated man and woman form the other couple. They were well-off before the Taliban but his family fell out of favor for political reasons. Now they live by selling off their furniture. She was a progressive woman who supported women’s rights. Now she is home in a burka and she hates men for it. Her husband admits to her that, carried away by the frenzy of the mob, he helped stone a woman. After she and her husband are whipped for laughing on the streets, she transfers her hatred for the regime to her husband, realizing these are MEN who have created this absurd situation.The two families interact finally at the end in a creative but implausible ending.The author is a pen name for an Algerian army officer who used a feminine name to by-pass submitting his book to review and censorship while in the military. His real name, used on later books, is Mohammed Moulessehoul. Translated from the French."}, {"review_sentiment": 5.0, "review_text": "Extremely well written book that provides tremendous insight into what it was like living under the taliban. You will however learn that author is a man not a women. Do not understand need for change. Otherwise very well written !"}, {"review_sentiment": 5.0, "review_text": "great read for someone that doesn't like to read. I read every page and really enjoyed it."}, {"review_sentiment": 1.0, "review_text": "undeserving of the praise it's gotten; not a surprise to learn he was never in Afghanistan before writing this"}, {"review_sentiment": 3.0, "review_text": "Supposedly interesting topic but somehow it is a slow read for me that i abandoned half-way.."}, {"review_sentiment": 4.0, "review_text": "This is a short and shocking novel that probably deserves to be read twice to do it justice. It took me a while to sort out who the various characters were, but then Yasmina Khadra's account of the horrors of life in Afghanistan under the Taliban takes over and it demands huge resolve to read on to the end.  \"The Swallows of Kabul\" is a terrifying presentation of the devastation wrought by fanaticism which drives normal human values and feelings underground.  And yet, how even in the very worst of times, sacrifice, courage and love can triumph."}, {"review_sentiment": 5.0, "review_text": "Gripping"}]}, "authors": ["Yasmina Khadra"], "isbn": "1400033764", "longitude": 69.1776476, "periods": ["1900s", "2000s"], "title": "The Swallows of Kabul", "word_cloud": "work fiction read truth truth tell fake name character life rule chill thing ever recommend definitely give gift others story touch core humanity profound leave many linger emotion haunt yet necessary ponder remain touch collective world sanity mesmerize write felt bless live world described grim story horrendous condition take control story plot really desolate condition capital die city die landscape desert heat dryness hem mountain building destroy include mosque structure simply front building business conduct piece brutality social political condition parallel physical desolation regime ban music war enough damage destroy historic monument club laugh street passersby whip prayer mosque look corner maintain whip fist club public execution weekly occurrence hanging stoning woman rifle execution throat slitting relatives victim conduct execution mentally ill man wanders streets talk whip death blasphemy go public full burka accompany toll year war see population widow war wound orphan lose arm leg war beg wheelbarrow parent lose child roam street pack dog beg feed garbage steal food men carry whip street lash way story focus married couple connect man jailer hold execution way simple man love wife help torment even die see depressed friend tell effect woman man woman form couple taliban family fell favor political reason now live sell furniture progressive woman support woman right now home burka hate men husband admits carry away frenzy mob help woman husband whip laugh street transfer hatred regime husband realize create absurd family interact finally creative implausible author pen name algerian army officer use feminine name submit review censorship military real name use later extremely well write provide tremendous insight live taliban however learn author man woman do change well write great someone page really enjoy undeserving praise gotten surprise learn never write supposedly interesting topic somehow slow abandon short shocking probably deserve twice justice take sort various character account horror life take demand huge resolve end terrify presentation devastation work fanaticism drive normal human value feeling underground yet even worst time sacrifice courage love triumph grip", "genres": ["Fiction & Literature"], "summary": "\"Surprisingly tender.\" The New York Times \r\n \r\nSet in Kabul under the rule of the Taliban, this extraordinary novel takes readers into the lives of two couples: Mohsen, who comes from a family of wealthy shopkeepers whom the Taliban has destroyed; Zunaira, his wife, exceedingly beautiful, who was once a brilliant teacher and is now no longer allowed to leave her home without an escort or covering her face. Intersecting their world is Atiq, a prison keeper, a man who has sincerely adopted the Taliban ideology and struggles to keep his faith, and his wife, Musarrat, who once rescued Atiq and is now dying of sickness and despair. \r\n\r\nDesperate, exhausted Mohsen wanders through Kabul when he is surrounded by a crowd about to stone an adulterous woman. Numbed by the hysterical atmosphere and drawn into their rage, he too throws stones at the face of the condemned woman buried up to her waist. With this gesture the lives of all four protagonists move toward their destinies.\r\nThe Swallows of Kabul is a dazzling novel written with compassion and exquisite detail by one of the most lucid writers about the mentality of Islamic fundamentalists and the complexities of the Muslim world. \r\n\r\nYasmina Khadra brings readers into the hot, dusty streets of Kabul and offers them an unflinching but compassionate insight into a society that violence and hypocrisy have brought to the edge of despair.", "asin": "1400033764", "rank": "384041", "city": "Kabul", "image": "https://images-na.ssl-images-amazon.com/images/I/51RmM9fV26L.jpg", "country": "Afghanistan", "story_arc": ["Tragedy", "Things only get worse"]}