{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 259, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "A good, thoughtful page-turner."}, {"review_sentiment": 4.0, "review_text": "Sad story with a happy ending. Well written."}, {"review_sentiment": 5.0, "review_text": "A truly engrossing novel from a great writer. The sad, and at times teetering on implausible, story kept me hooked throughout and I am pretty sure that was becauuse Gutterson is such a great writer."}, {"review_sentiment": 4.0, "review_text": "Stick with it....while the plot is a bit morbid, the writing is good and the story well written."}, {"review_sentiment": 5.0, "review_text": "One of my favorites from the author of Snow Falling on Cedars, a great narrative of fiction about a retired surgeon facing death, only to find out that in giving life he has cheated death. Very strong details in the writing, colorful descriptions of the area and characters. Has a good ending, I have ready more than once."}, {"review_sentiment": 4.0, "review_text": "The book has two interwoven themes:  life in the apple growing country of eastern Washington and the struggle of a man trying to deal with the pain and suffering of  incurable cancer.  Guterson's prose presents the action and the setting in mesmerizing detail. Details that paint the picture and record the action with fascinating realism.  The reader gets caught up in the life story of only real character of the book and how he came to be \"east of the mountains' coping with approaching death.  Guterson presents his two serious themes with a light touch."}, {"review_sentiment": 3.0, "review_text": "A very sad story even though it describes a beautiful area"}, {"review_sentiment": 5.0, "review_text": "An American doctor's misadventures on the way to learning compassion with no guru required. The sentences flow short and vivid. The prose clean, at times poetic. I'm better for reading this book."}, {"review_sentiment": 4.0, "review_text": "Nice end of life story that manages to be reminiscent and decent without sentiment. Wonderful portrait of Washington State, literally, East of the Mountains. As a non-Hunter and a gun control advocate I found understanding and sympathy with that culture...lived with a pure ethic by the main character at least.An enjoyable coming of age with the grim- reaper."}, {"review_sentiment": 5.0, "review_text": "The plot of this beautifully written book is about a retired, widowed doctor, Ben Givens, who is dying of colon cancer and decides to commit suicide. He tells his daughter he is gong hunting, and leaves with his two faithful hunting dogs for a trip in Washington state’s apple country where he lives. Because of a car accident, he is left with an eye injury and on the road.. He meets up with a young couple, a veterinarian, a mean-spirited man who kills his dog, a young migrant worker whom he helps, and finally—as his pain and spirit are killing him—delivers a baby just in time. He decides to return home, and does so.The plot reflects his inner self—his worthiness, integrity, abilities, and particularly, his compassion and humanity. It is a book about love and caring, including oneself. Throughout the story, apples prevail: their types, colors, cycle of life, symbols of life. Guterson  paints a masterful landscape of  mountain and woods, of sky and rivers, and as well as hearts of his characters."}]}, "authors": ["David Guterson"], "isbn": "1400032652", "longitude": -122.3300624, "periods": ["1900s", "2000s"], "title": "East of the Mountains", "word_cloud": "good thoughtful story happy end well write truly engrossing great writer sad time teeter implausible story keep hooked pretty sure great writer plot bit morbid write good story well write favorites author great narrative fiction retire surgeon face death find give life cheat death strong detail write colorful description area character good end ready interwoven theme life apple grow country eastern struggle man try deal pain suffer incurable cancer prose present action set mesmerize detail paint picture record action fascinate realism get caught life story real character come cop approach death present serious theme light touch sad story even describes beautiful area american doctor misadventures way learn compassion guru require sentence flow short prose clean time poetic better read nice end life story manage reminiscent decent sentiment portrait literally gun control advocate find understand sympathy culture live pure ethic main character enjoyable come age reaper plot beautifully write retire widow doctor die colon cancer decide commit suicide tell daughter gong hunt leaf faithful hunt dog trip state apple country live car accident leave eye injury meet young couple veterinarian man kill dog young migrant worker help spirit kill baby time decide return home plot reflect inner worthiness integrity ability particularly compassion humanity love care include story apple prevail type color cycle life symbols life paint masterful landscape mountain wood sky river well hearts character", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "From the author of Snow Falling on Cedars comes this bestselling novel about a dying man’s final journey through a landscape that has always sustained him and provided him with hope and challenges.\r\n\r\nWhen he discovers that he has terminal cancer, retired heart surgeon Ben Givens refuses to simply sit back and wait. Instead he takes his two beloved dogs and goes on a last hunt, determined to end his life on his own terms. But as the people he meets and the memories over which he lingers remind him of the mystery of life’s endurance, his trek into the American West becomes much more than a final journey.", "asin": "1400032652", "rank": "502441", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/419TafidzPL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}