{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 481, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Read this book for book club and was quite taken with this 1940’s version of what is the meaning of life and what is a successful life. I always appreciate social commentary of the times or geography and this is quite interesting to read of the organized religion, depression, war, and Europe in contrast with America."}, {"review_sentiment": 5.0, "review_text": "Could not put the book down Writing was so eloquent and beautiful Enjoyed it so much."}, {"review_sentiment": 4.0, "review_text": "good"}, {"review_sentiment": 5.0, "review_text": "One of the best books I've read in years. So good in fact, that I plan to re-read it one year later."}, {"review_sentiment": 5.0, "review_text": "This book is a classic for a reason.  I saw the movie and couldn't wait to get the book.  I highly recommend it as a fascinating read."}, {"review_sentiment": 5.0, "review_text": "Marvelous character development"}, {"review_sentiment": 5.0, "review_text": "The narrator is a charming wit and the true hero of the story. He bore mankind’s excesses, embodied variously by Larry, Isabel, Elliot, etc., with levity. The man who kept assuring us he had nothing to say in fact said the most."}, {"review_sentiment": 3.0, "review_text": "The book to me is not as satisfying as it could of been. First person narration can sometimes kill of any real attempt to relateto the characters."}, {"review_sentiment": 5.0, "review_text": "Liked the story of this book. This was a book for my English class"}, {"review_sentiment": 5.0, "review_text": "Loved the movie, love the book even more.  thanks!"}]}, "authors": ["W. Somerset Maugham"], "isbn": "1400034205", "longitude": 2.3514992, "periods": ["1900s"], "title": "The Razor's Edge", "word_cloud": "club quite take version mean life successful life always appreciate social commentary time geography quite interesting organize religion depression war contrast put eloquent beautiful much good best year so good fact plan year later classic reason saw movie highly recommend fascinate marvelous character development narrator charm wit true hero story bore mankind excess embody variously levity man keep assure nothing say fact say satisfying person narration sometimes real attempt relate to character like story english class love movie even thanks", "genres": ["Fiction & Literature"], "summary": "Larry Darrell is a young American in search of the absolute. The progress of his spiritual odyssey involves him with some of Maugham's most brilliant characters - his fiancée Isabel whose choice between love and wealth have lifelong repercussions, and Elliott Templeton, her uncle, a classic expatriate American snob.  Maugham himself wanders in and out of the story, to observe his characters struggling with their fates.", "asin": "1400034205", "rank": "28687", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/41DR84CJ8oL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}