{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 36.9008783, "ratings": {"num_ratings": 337, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book! read it!"}, {"review_sentiment": 5.0, "review_text": "Fine writer. Elegant entertaining prose."}, {"review_sentiment": 5.0, "review_text": "Not sure why I like this book.  But I love it.  It is a story about simple people who live in troubled times way beyond their understanding or ability to control them.  It is a sad story filled with love that endures even after tragedy.  Written so beautifully that it draws you into their hearts, their community, their sorry lives.  Thank you."}, {"review_sentiment": 5.0, "review_text": "Loved this book. It had sweetness, history, and a clear message all wrapped in a place during the Turkish-Greek conflict of the early 1900s."}, {"review_sentiment": 5.0, "review_text": "So much research must have gone into it but it is never dull.  Louis de Bernieres has a wonderful sense of humour and his characters are touching, some funny, some so real that it is hard to let them go after spending so much time with them.  In the Book Club I am in we all loved it.  We all thought it a little long but could not figure out what should have been cut out.  so we gave it 9.5 out of 10!!!"}, {"review_sentiment": 5.0, "review_text": "While a sad history of empire in decline, deprivation of war and horrors of senseless retribution against fellow citizens because of religion and ethnicity, this story tells a deeply personal story of many participants whom you grow to love and admire."}, {"review_sentiment": 2.0, "review_text": "I tried but I couldn't get past chapter 14."}, {"review_sentiment": 5.0, "review_text": "I read this book several times. A fantastic story."}, {"review_sentiment": 4.0, "review_text": "I first encountered Louis de Bernières through his novel “War of Don Emmanuel’s Nether Parts”; a playful romp through revolutionary Colombia – with magic. I read this, Bernières first novel a long time ago – while I was still an adolescent. But decades later, as a magical realist novelist myself, I hearkened back to Don Emmanuel as I sought some of the tools I would use to write my own two-part “San Porfirio” series on socialist Venezuela. To a certain extent I identify with Bernières; who also was first inspired to write by what he saw in his time living in Latin America and processing the juxtaposition of the bizarre with the macabre up against the truly hopeful.For this reason I set about the process of reading “Birds Without Wings”, Bernières 2004 novel with a certain amount of expectation. Bernières did not disappoint. “Birds Without Wings” is a true epic – taking us through the life of a Turkish/Greek village in the early 1900s as the Ottoman Empire, the “sick man of Europe” is in the final stages of its spectacular demise. There are myriad characters – a potter, a harlot, a crazy man they call “The Dog”. Above it all, interjected evenly throughout the narrative is the story of Mustafa Kemal Ataturk; the man who would mark the end of the Ottoman Empire and the beginning of modern Turkey.The story is not a good one – because it cannot be. The crumbling of the Ottoman Empire was extraordinarily bloody. Bernières plunges into the trench-war in great, gory detail. He does not polish over the agony and heartache that is heralded by the end of a world order. Genocide, fratricide, inter-religious strife. The mass-movements of people hither and thither at the whims of sultans and dictators; crusaders and jihadists.The world is a terrible place; politics is often winner-take-all and does not consider the poor, the peasants. Armies march across lands friendly and unfriendly; and the expulsion of Christians and Muslims from ancestral homes does not contemplate old relationships and connections that go beyond faith, to the land and the trees and the waters in which are nestled people’s ideas of “home”.Americans increasingly tend to see the world as a history-less place; a past too bloody to visit, heroes too flawed to know, stories too complex that do not fit into our clean vacuous narratives. I don’t know if it has always been thus; but it seems nowadays that we prefer to live in a world without a past, not recognizing the currents that brought us to where we are and therefore expecting people near and far to live up to our own nouveau-prejudices regarding race and religion and correctness. Reminding ourselves that history is an edifice built deep, layer upon layer upon layer of the stories of strife and blood and suffering helps remind us of what it means to be human; and to make common cause with the worries and fears – the plight – of civilizations that came before.This book will help us do that; and that is why we should read it."}, {"review_sentiment": 5.0, "review_text": "This is a beautiful book about a historical circumstance (the war between Turkey and Greece, and Atatürk's rise to power in Turkey) that I knew little about. It centers on the lives of many people of both Greek/Christian and Turkish/Muslim background, who live together in a village called Eskibahçe (in present-day Turkey), and whose lives are slowly deconstructed as a result of the political events. The characters are richly developed and likeable, and I was completely drawn in to the story of the people of Eskibahçe and their hopes, dreams, and tragedies. Highly recommended."}]}, "authors": ["Louis de Bernieres"], "isbn": "1400079322", "longitude": 30.6937117, "periods": ["1900s"], "title": "Birds Without Wings", "word_cloud": "great fine writer entertain prose not sure like love story simple people live trouble time way understanding ability control sad story fill love endures even tragedy beautifully draw heart community sorry live love sweetness history clear message wrap place conflict early so much research go never dull wonderful sense humor character touch funny real hard let spend much time love think little long cut give sad history empire decline deprivation war horror senseless retribution fellow citizen religion ethnicity story tell deeply personal story many participant grow admire try past chapter several time fantastic story first encounter playful romp revolutionary magic bernières first long time still adolescent decade later magical realist novelist hearken seek tool write series socialist certain extent identify bernières also first inspire write saw time live process juxtaposition bizarre macabre reason set process reading certain amount expectation disappoint true epic take life village early sick man final stage spectacular demise myriad character potter harlot crazy man interject evenly narrative story man begin modern story good crumble extraordinarily bloody plunge great gory detail polish agony heartache herald end world order fratricide strife people hither thither whim sultan dictator crusader world terrible place politics often consider poor peasant march land friendly unfriendly expulsion ancestral home contemplate old relationship connection go faith land tree water nestle people idea home increasingly tend see world place bloody visit hero flaw know story complex fit clean vacuous narrative know always thus seem nowadays prefer live world past recognizing current bring therefore expect people far live regard race religion correctness remind history edifice build deep layer layer layer story strife blood suffering help mean human common cause worry fear plight civilization come help beautiful historical circumstance war rise power know little center live many people background live together village call life slowly deconstruct result political event character richly develop likable completely draw story people hop dream tragedy recommend", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "In his first novel since Corelli’s Mandolin, Louis de Bernières creates a world, populates it with characters as real as our best friends, and launches it into the maelstrom of twentieth-century history. \r\n\r\nThe setting is a small village in southwestern Anatolia in the waning years of the Ottoman Empire. Everyone there speaks Turkish, though they write it in Greek letters. It’s a place that has room for a professional blasphemer; where a brokenhearted aga finds solace in the arms of a Circassian courtesan who isn’t Circassian at all; where a beautiful Christian girl named Philothei is engaged to a Muslim boy named Ibrahim. But all of this will change when Turkey enters the modern world. \r\n\r\nEpic in sweep, intoxicating in its sensual detail, Birds Without Wings is an enchantment.", "asin": "1400079322", "rank": "60258", "city": "Antalya", "image": "https://images-na.ssl-images-amazon.com/images/I/51HMLVFhRwL.jpg", "country": "Turkey", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}