{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 59.3251172, "ratings": {"num_ratings": 559, "rating": 4.0, "reviews": [{"review_sentiment": 2.0, "review_text": "The author introduces the reader to a  strong, gruesome and compelling plot and a bunch of people who could be interesting, but  instead  do nothing to enhance the story........and it's soo slow.  A one and a half would have been better!"}, {"review_sentiment": 4.0, "review_text": "Great surprising intelligent"}, {"review_sentiment": 2.0, "review_text": "This book seemed like it might be interesting when it started but the writing is very poor, and the attempts at plot twists fell flat. The writing was similar to the style of a teen-aged writer."}, {"review_sentiment": 4.0, "review_text": "A tale of meandering intrigue, where family secrets blend with the growing challenges of immigration integration in Southern Sweden. A dark and evocative novel."}, {"review_sentiment": 5.0, "review_text": "great read"}, {"review_sentiment": 5.0, "review_text": "If you love Henning Mankell's other novels you'll love this one. You can just picture the stark landscape of Sweden and the characters are well developed."}, {"review_sentiment": 3.0, "review_text": "Good story but a bit slow in parts. Ending wasn't that great. Honestly didn't seem to fit with the rest of the book. Liked it overall though."}, {"review_sentiment": 3.0, "review_text": "I liked this book, but it isn't one of the nest in the series.  Wallander is always somewhat depressed and flawed...one of the reasons he is so realistic.  The story line was a bit all over the place.  But these books are generally good and they give a glimpse into Swedish culture so they are interesting in that way as well."}, {"review_sentiment": 4.0, "review_text": "Always enjoy Mankell's books.  And I can picture Kenneth Branagh  as I read.  This is one of the early books and I wish I had read it earlier."}, {"review_sentiment": 5.0, "review_text": "Awesome"}]}, "authors": ["Henning Mankell"], "isbn": "1400031575", "longitude": 18.0710935, "periods": ["1900s"], "title": "Faceless Killers", "word_cloud": "author introduce strong gruesome compelling plot bunch people instead nothing enhance story sew half surprising intelligent seem like interest start write poor attempt plot twist fell flat write similar style writer tale meander intrigue family secret blend grow challenge immigration integration dark evocative great love novel love picture stark landscape character well develop good story bit slow part end great seem fit rest like overall like nest series always somewhat depressed flaw reason realistic story line bit place generally good glimpse swedish culture interest way well always enjoy picture early wish earlier", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "First in the Kurt Wallander series.\r\n\r\nIt was a senselessly violent crime: on a cold night in a remote Swedish farmhouse an elderly farmer is bludgeoned to death, and his wife is left to die with a noose around her neck. And as if this didn’t present enough problems for the Ystad police Inspector Kurt Wallander, the dying woman’s last word is foreign, leaving the police the one tangible clue they have—and in the process, the match that could inflame Sweden’s already smoldering anti-immigrant sentiments.\r\n\r\nUnlike the situation with his ex-wife, his estranged daughter, or the beautiful but married young prosecutor who has peaked his interest, in this case, Wallander finds a problem he can handle. He quickly becomes obsessed with solving the crime before the already tense situation explodes, but soon comes to realize that it will require all his reserves of energy and dedication to solve.", "asin": "1400031575", "rank": "37797", "city": "Stockholm", "image": "https://images-na.ssl-images-amazon.com/images/I/41q%2B73djGRL.jpg", "country": "Sweden", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}