{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 9, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "This was the first book by Naipaul that I read, decades ago, and I fell in love with it.  A beautiful book about a truly terrible subject.  Nothing else by Naipaul quite lives up to this amazing book."}, {"review_sentiment": 1.0, "review_text": "Surprisingly bad book, boring,"}, {"review_sentiment": 2.0, "review_text": "Not up to Naipaul's standard."}, {"review_sentiment": 5.0, "review_text": "Product and delivery exactly as promised!"}, {"review_sentiment": 4.0, "review_text": "In The Loss of El Dorado (1969), V.S. Naipaul traces the history of his homeland of Trinidad from its days under the Spanish to it takeover by the British in the 18th century and the years immediately following. It is a history dominated by a succession of dominant personalities and reads best as a kind of short story cycle. The island, located at the mouth of the Orinoco River off the coast of Venezuela, was perfectly positioned as a landing stage for expeditions to the interior of South America, especially for those seeking the legendary city of gold, El Dorado. Trinidad itself, however was basically seen as a backwater in this period, a dead-end assignment for governors unfortunate enough to be assigned there by the Spanish and then English monarchies."}, {"review_sentiment": 5.0, "review_text": "V.S. Naipaul has always attracted me because he is a Trinidadian, like I am. I've read quite a few of his books, and he is undoubtedly one of the best. The Loss of El Dorado, I am pleased to say, shows off his skills.The book is original because it dwells on Trinidadian history preceding the arrival of indentured servants from India. Specifically, Naipaul explores two events in which this small island attracted national headlines: the first recounts the frantic but fruitless quest for the mythical city of El Dorado by Ralegh, Berrio, and others; the second story relates the illegal torture of a young girl named Luisa Calderon and the accompanying scandal surrounding the culprit General Thomas Picton. Neither of these are mainstream stories. In Trinidad schools today, they are not even taught or included in textbooks. Thus, I give Naipaul credit. The research and care that went into this book's development was substantial and undoubtedly exhausting.He says in the Foreword that this story \"ends in 1813. Indians from India began to arrival in 1845; but the colony was created long before that.\" This quote is, essentially, the thesis of the book. Most Trinidadian historians focus on the arrival of indentured servants from India, but Naipaul here says that the colony was created before that. In Naipaul's thinking, the stories played a bigger role in the development of Trinidad than the Indians from India did. Naipaul's book is then mandatory reading for all Trinidadians interested in their history.The story tellingly contains some depressing lines or occurrences to shape the perception of Trinidad. Antonio de Berrio pursued El Dorado with zest, but by age 75, he was insane and lonely after his failure to achieve the goal. He would die in obscurity, as the tale of El Dorado became Raleigh's. At the end of the first section, the book declares that the El Dorado propaganda had died and that consequently, \"No one would look at Trinidad ... with the eye of Raleigh, Dudley, or Wyatt ever again.\" In other words, no one placed value on the island ever again. Indeed, later on the book relates the difficulties of trying to place a governor of Trinidad -- no one wanted the job. The final section, the Epilogue, states outright: \"Port of Spain dropped out of history.\" As a Trinidadian, such statements made me a little sad. The country comes off as unimportant, negligible, and expendable. To overcome these depressing sentiments, just remember the Foreword, which explains the importance, relevance, and worth of these people and their deeds.The second section, the Luisa Calderon portion, goes heavily into law. People get arrested every few pages, and trials are given utmost attention. At times, I felt like I was studying for law school, which I enjoyed! Naipaul, indeed, got the material here by investigating court records, as he says in appendix.The writing is quality, as all of Naipaul's prose is, but know that at times he will get deeply poetical or ornate. Some passages (ie. - the one about Robinson Crusoe in the first chapters) will puzzle you and force you to think hard just to understand it. Basically, you get good writing that is also hard writing.Overall, I recommend this book, especially for Trinidadians but also for anyone who loves good, provocative writing."}, {"review_sentiment": 5.0, "review_text": "I think it's fair to say V.S. Naipaul is one of the finer writers of our time.  Here his compressed, simple sentence structure, matched with fascinating details and copious research, works nearly as well for history as it does for his works of fiction.Turning his attention to his homeland, Trinidad, Naipaul reveals a lost history of Spanish, French and English colonialism, all fueled by the frantic, bloody search for El Dorado.Naipaul's three-part structure makes sense and is filled with remarkable anecdotes of greed, folly, slavery, barbarity, and one or two glimpses of decency and humanity.I had trouble putting this one down."}, {"review_sentiment": 5.0, "review_text": "This is the historical counterpart to Naipaul's \"A Way in the World\", even though it was written more than two decades earlier - these books should ideally be read back-to-back. It provides a history of Trinidad from the original discovery by the Spaniards until the early nineteenth century. The canvas covered is vast - the early Spanish attempts at colonisation, Raleigh's poorly-organised and squalid search for an El Dorado on the Orinoco, the arrival of French refugees escaping from the slave-uprisings on Haiti and the establishment of British control, with a leading but hardly-creditable role being played by Sir Thomas Picton, later a hero of the Peninsula and Waterloo, and the use of the island as a springboard for fomenting revolution in Latin America. It is from beginning to end a ghastly story, dominated by greed, cowardice and cruelty. There is hardly a single character who emerges with credit and at times the reader is all but overwhelmed by the catalogue of mean-minded exploitation, atrocities and treachery. As always in his non-fiction writing, Naipaul uses a novelist's eye to bring colour and life to the narrative - adding not just to the immediacy but also to the horror of much of the material. This work goes beyond historical narrative however and presents simultaneously an extended meditation on the nature of power at its most basic level. It is a terrible and disturbing work - but a great one."}, {"review_sentiment": 4.0, "review_text": "THis is a great book, a history of the founding of a place - where Naipaul was born - that virtually no one cares about.  As such, there is nihilism at the very core of the book, which Naipaul emphasizes by beginning with a tribe (just a name) whose only existing reference was that it was annihilated during the colonization.And yet, this book is brilliantly written, full of drama of torture and interminable trials, great and bitter ironies that lead to what Trinidad became (or didn't), all of it adding up to a sense of the passage of human life and striving.  I loved this book:  it is a fascinating rumination by a highly talented writer, a dark essay on futility and non-history.It may seem obscure, but then, so is much of the Third WOrld's history.  That is one of Naipaul's points.  He is a true master."}]}, "authors": ["V.S. Naipaul"], "isbn": "1400030765", "longitude": 0.0, "periods": ["1800s", "1900s"], "title": "The Loss of El Dorado: A Colonial History", "word_cloud": "first decades fell beautiful truly terrible subject nothing else quite life amaze surprisingly bad boring not standard product delivery exactly promise trace homeland day spanish takeover british century year immediately follow dominate succession dominant personality read best kind short story cycle island locate mouth coast perfectly position landing stage expedition interior especially seek legendary city gold however basically see backwater period assignment governor unfortunate enough assign spanish monarchy always attract trinidadian quite undoubtedly best please say show original dwells trinidadian precede arrival indenture servant explore event small island attract national headline first recount frantic fruitless quest mythical city others second story relate illegal torture young girl name accompany scandal surround culprit mainstream story school today even teach include textbook give credit research care go development substantial undoubtedly say story end begin arrival colony create long quote essentially thesis most trinidadian historian focus arrival indentured servant say colony create think story play bigger role development mandatory reading interested story tellingly contain depress line occurrence shape perception pursue zest age insane lonely failure achieve goal obscurity tale become end first section declare propaganda die consequently one eye ever word place value island ever indeed later relates difficulty try place governor want job final section state outright drop trinidadian statement make little sad country come unimportant negligible expendable depress sentiment explain importance relevance worth people second section portion go heavily law people get arrest page trial give utmost attention time felt study law school enjoy indeed get material investigate court record say write quality prose know time get deeply poetical ornate passage ie first chapter puzzle force think hard understand good writing also hard recommend especially also anyone love good provocative writing think fair say finer writer time here compress simple sentence structure match fascinate detail copious research work nearly well work attention homeland reveal lose spanish french colonialism fuel frantic bloody search structure make sense fill remarkable anecdote greed folly slavery barbarity glimpse decency trouble put historical counterpart even write decade earlier ideally provide original discovery early nineteenth century canvas cover vast early spanish attempt colonization squalid search arrival french refugee escape establishment control lead role play later hero use island springboard foment revolution begin ghastly story dominate greed cowardice cruelty hardly single character emerge credit time overwhelmed catalogue exploitation atrocity treachery always write use novelist eye color life narrative add immediacy also horror much material work go historical narrative however present simultaneously extend meditation nature power basic level terrible disturb work great great found place bear virtually care nihilism core emphasize begin tribe name exist reference annihilate yet brilliantly write full drama torture interminable trial great bitter irony lead become add sense passage human life strive love fascinate rumination highly talented writer dark essay futility obscure much point true master", "genres": ["History", "Politics"], "summary": "The history of Trinidad begins with a delusion: the belief that somewhere nearby on the South American mainland lay El Dorado, the mythical kingdom of gold. In this extraordinary and often gripping book, V. S. Naipaul–himself a native of Trinidad–shows how that delusion drew a small island into the vortex of world events, making it the object of Spanish and English colonial designs and a mecca for treasure-seekers, slave-traders, and revolutionaries.\r\n\r\nAmid massacres and poisonings, plunder and multinational intrigue, two themes emerge: the grinding down of the Aborigines during the long rivalries of the El Dorado quest and, two hundred years later, the man-made horror of slavery. An accumulation of casual, awful detail takes us as close as we can get to day-to-day life in the slave colony, where, in spite of various titles of nobility, only an opportunistic, near-lawless community exists, always fearful of slave suicide or poison, of African sorcery and revolt. \r\n\r\nNaipaul tells this labyrinthine story with assurance, withering irony, and lively sympathy. The result is historical writing at its highest level.", "asin": "1400030765", "rank": "1145181", "city": "Trinidad and Tobago", "image": "https://images-na.ssl-images-amazon.com/images/I/517NTG5MFFL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}