{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 101, "rating": 4.4, "reviews": [{"review_sentiment": 1.0, "review_text": "Can't help but think this was written for \"young adults\" or younger audience. Flat, thin plot, characters are one dimensional. If you are a reader, don't bother."}, {"review_sentiment": 5.0, "review_text": "Huge fan of Poppy Z. Brite!  What I like most about this particular gay story line is that she depicts Rickey & G-Man as average Joe's.  As you read the series, you are lead into a believable assimilation of life in New Orleans."}, {"review_sentiment": 5.0, "review_text": "This was a great story well written. Loved the well developed characters, the concept of the development of the restaurant and the fit for the setting.Mostly  I loved the treatment of Rickey and G-Man. I look hard to find books that have strong gay characters, but stories that are about something else. I know what it is like to be gay. I don't need anyone to explain it. I want to hear well told stories about people I can relate to"}, {"review_sentiment": 3.0, "review_text": "What more could you want?A fun read for foodies and wannabe chefs & restaurateurs . Easy reading a bit of suspense and likable characters."}, {"review_sentiment": 5.0, "review_text": "To read the Rickey and G-Man Series is a trip, a journey falling in love with the characters falling in love with each other, finding their way through Life, restaurants and the pursuit of happiness."}, {"review_sentiment": 5.0, "review_text": "This tells the story of two partners who have known each other since grade school. They open a restaurant together, suspense, humor and ideas for recipes follow. The recipes are all made with booze, but they sound delicious!"}, {"review_sentiment": 5.0, "review_text": "This amazing, character-driven novel has a sizable bonus: It's about food and restaurants and a couple of cooks in the food capital of America, New Orleans. This is a big, easy (See what I did there?) looping, VIVID yarn that draws you in and keeps you till the heart-stopping end.  Recommended."}, {"review_sentiment": 4.0, "review_text": "Billy continues to be one of my favorite authors.  Have almost all of his books and short stories!  I've been wanting to read Liquor since picking up The Value of X, definitely wasn't let down!"}, {"review_sentiment": 4.0, "review_text": "Loved the idea for this book! No rambling on and on, which I find in so many books today. Story caught my attention right off the bat and kept it throughout. Hats off to this author!"}, {"review_sentiment": 5.0, "review_text": "All I can say is Poppy Z. Brite is a brilliant author and I wanted to have all her books, so I got this one.  Actually haven't read it yet because i have so many books, plus I listen to books from Audible all the time.  Hoping to get around to actually reading it some day because I heard so many great things about it."}]}, "authors": ["Poppy Z. Brite"], "isbn": "1400050073", "longitude": -90.0701156, "periods": ["2000s"], "title": "Liquor: A Novel (Rickey and G-Man Series)", "word_cloud": "help write young adult younger audience thin plot character dimensional bother fan like particular story line depict rickey average series lead believable assimilation life great story well write well develop character concept development restaurant fit love treatment look hard find strong gay character story something else know gay need anyone explain want hear well told story people relate fun foodie wannabe chef restaurateur read bit suspense likable character trip journey fall love character fall love find way restaurant pursuit happiness tell story partner know grade school open together suspense humor idea recipes recipe make booze sound delicious amazing sizable bonus food restaurant couple cook food capital big easy loop yarn draw keep till end recommend billy continue favorite author have almost short story want pick definitely love idea rambling find many today catch attention right bat keep author say poppy brilliant author want get yet many listen audible time hop actually read day hear many great thing", "genres": ["Fiction & Literature", "LGBT", "Humour"], "summary": "Book 2/5 in the Rickey and G-Man Series\r\n\r\nTwo line cooks decide to open their own restaurant in New Orleans in the second book in the Rickey and G-Man series by novelist Poppy Z. Brite.\r\n\r\nNew Orleans natives Rickey and G-man are lifetime friends and down-and-out line cooks desperate to make a quick buck. When Rickey concocts the idea of opening a restaurant in their alcohol-loving hometown where every dish packs a spirited punch, they know they’re on their way to the bank. With some wheeling and dealing, a slew of great recipes, and a few lucky breaks, Rickey and G-man are soon on their way to opening Liquor, their very own restaurant. But first they need to pacify a local crank who doesn’t want to see his neighborhood disturbed, sidestep Rickey’s deranged ex-boss, rein in their big-mouth silent partner before he runs amok, and stay afloat in a stew of corruption in a town well known for its bottom feeders.\r\n\r\nA manic, spicy romp through the kitchens, back alleys, dive bars, and drug deals of the country’s most sublimely ridiculous city, author Poppy Z. Brite masterfully shakes equal parts ambition, scandal, cocaine, and murder, and serves Liquor straight up, with a twist.", "asin": "1400050073", "rank": "820718", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51-%2B6yya2SL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}