{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 27, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "I like Travanian. Writes with a great vocabulary. Always has an interesting story filled with fully-fleshed characters."}, {"review_sentiment": 4.0, "review_text": "Strange, different, interesting.  Not as good as some of his other books."}, {"review_sentiment": 5.0, "review_text": "Happy to have found this again"}, {"review_sentiment": 5.0, "review_text": "What's not to like about a Trevanian story. Great characters, plot and mulitple storylines going at the same time. A view of Montreal only an insider would know and be able to bring to life for the rest of us."}, {"review_sentiment": 2.0, "review_text": "I gave it a chance but just couldn't get into it.  Too much description, not enough narrative punch, plot moves as slowly as cold molasses, cheesy dialogue.  Perhaps the author had pretensions of taking up where George Simenon left off with his marvelous Magritte novels  (Simenon stopped writing in 1973), with this meandering tale of a French detective covering one of Montreal's seedy areas.  Unfortunately, it comes off as third-rate Simenon.  Even the weakest or lame of the Magritte novels is a far more enjoyable read."}, {"review_sentiment": 5.0, "review_text": "Trvanian is a great writer."}, {"review_sentiment": 5.0, "review_text": "I keep coming back to this book every couple of years. A great character and a setting that is so well described (but not over described) that you are immersed from page one. I only wish Trevanian had written more books! maybe Don Winslow will pick u0p this character too!"}, {"review_sentiment": 5.0, "review_text": "I highly recommend this book."}, {"review_sentiment": 5.0, "review_text": "Slow character study.  Good read. The pace is different than his other books."}, {"review_sentiment": 4.0, "review_text": "An Excellent eBay Seller > Reasonably Priced * Fast Shipping * As Described * * Quality Product *"}]}, "authors": ["Trevanian"], "isbn": "1400098238", "longitude": -73.6103642, "periods": ["1900s"], "title": "The Main: A Novel", "word_cloud": "like travanian great vocabulary interest story fill character strange different interest not good happy find trevanian story character plot multiple story lines go time view insider able bring life rest give chance much description enough narrative punch plot move slowly cold molasses cheesy dialogue perhaps author pretension take leave marvelous novel stop write meander tale french detective cover seedy area unfortunately come even weakest lame novel far enjoyable trvanian great writer keep come back couple year great character set well describe describe immersed page wish trevanian write maybe pick character highly recommend slow character study good pace different excellent ebay", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "The Main is Montreal’s teeming underworld, where the dark streets echo with cries in a dozen languages, with the quick footsteps of thieves and the whispers of prostitutes. It is a world where violence and brutality are a way of life. To the people of the Main, police lieutenant Claude LaPointe is judge and jury, father confessor and avenging angel. \r\n\r\nMontreal’s police force has changed over time, but LaPointe has not. His commitment to justice is total, as is his devotion to the Main and its underworld community. But when a cold-blooded murderer invades LaPointe’s territory, he is forced to examine his long-held beliefs and secrets and to confront his own loneliness and mortality. With a cast of unforgettable supporting characters and an unusual and remarkable hero, The Main is another gripping tale of death and danger, of action and mystery, by the incomparable Trevanian.\r\n", "asin": "1400098238", "rank": "787546", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/41Btd5GnWKL.jpg", "country": "Canada", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}