{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 38, "rating": 4.4, "reviews": [{"review_sentiment": 2.0, "review_text": "I had this for my Kindle and got about a third of the way through but deleted it. It was boring."}, {"review_sentiment": 5.0, "review_text": "Interesting, good writing, some humor, Fascinating insight into rural African mentality."}, {"review_sentiment": 5.0, "review_text": "Anyone who loves books has certainly had this happen. You buy a book and put it in the to-read pile/shelf/shelves, and for one reason or another it slips through the cracks. That happened to this book for me, but in a way I am glad, as I could go on line and see if the company were still in business and how they were doing, like having a 4 years later epilogue.I can't say enough positives about this book. It is funny, extremely readable, and more important it is about a guy who didn't just think he had an idea but instead acted on it, in a less than easy environment, and did good for the people he marketed to.I also learned far more about business and making things happen Thani ever did getting my business degree. This is a phenomenal book, that is told by the brother of the man who brought quality affordable batteries to rural Ghana, which is most of the country.This is not some charity or NGO, with people spending millions, driving around in brand new Land Rovers, and accomplishing nothing like most projects that involve Africa do. It touches on what a mess European and western guilt has done to Africa by turning it into a massive welfare state.I could go on forever about why this book should be read by everyone, but instead I will just say,Read this book!"}, {"review_sentiment": 4.0, "review_text": "A great picture of day-to-day life in Ghana. Interesting business story. Max Alexander has the ability to find humor in the ordinary. A very entertaining read."}, {"review_sentiment": 5.0, "review_text": "As someone that has lived in Ghana and done business locally, this book hits the nail dead on. Max Alexander brilliantly and humorously details what life is like in Ghana through American eyes better than any other guidebook I've read - true he doesn't list top restaurants in Accra, but he covers a lot. He intertwines all the necessary facts and explains how it is to work with the local culture. If you are travelling to anywhere in West Africa, I highly recommend this book before you go."}, {"review_sentiment": 5.0, "review_text": "Wonderful story about a person who wants to help people help themselves."}, {"review_sentiment": 5.0, "review_text": "Interesting read.  Humorous but also shows the complexities of working in a developing country.  Makes you think and laugh.  I appreciated Burro's philosophies and it spurred me to challenge my endeavors more.  Well worth the time."}, {"review_sentiment": 5.0, "review_text": "Whit Alexander cofounded Cranium, Inc., the company which produces the popular board game Cranium, with a fellow ex-Microsoft employee in 1998. The pair sold the company to Hasbro in 2008 for $77.5 million. Instead of retiring at this point, Whit decided to try to start a new company. Bright Lights, No City is the story of his efforts to start a business, Burro, which sells affordable goods and services to low-income villagers in Ghana.  The story is told by his brother Max, who visits Whit in Ghana and works with the team at Burro to help get the company started. Whit Alexander does not see traditional work done by charities and NGO's in Africa as being a good way of battling poverty, and improving the lives of the people living there. Too often, he has found, a charity will fund a project and then leave the area. If, for example, the project is build a well, after a few months the well could become damaged. Since the charity has already left, there is no one to help fund repairs for the well, so in the end the villagers are left with no well, and the charity has wasted the time and money building the well. Instead, Whit believes that for-profit businesses will help to improve the lives of villagers. These ventures are able to employ local people long-term, providing them with more, and often more reliable, income. Additionally, the businesses will remain and operate in the area, creating a mechanism for sustainable change. With this in mind, Whit decided to invest his personal savings in starting Burro, instead of just donating his money to a charity or NGO. While the cities in Ghana have been electrified, there are many rural villages that are not hooked up to the electrical grid. Because of this, the people in these villages rely on battery powered devices such as flashlights and radios. The most common battery in these rural areas is a battery called Tiger Head, a cheap Zinc-Carbon battery that is quite weak and prone to leaking. The fluid that leaks out of these batteries is both toxic and causes irreparable damage to the devices they are in. It is not uncommon for a rural Ghanaian to spend upwards of 20% of their annual income on purchasing these batteries. This is the market Whit hopes to enter with his company Burro. The initial idea for Burro was to provide an alternative to the cheap Tiger Head batteries in the form of rechargeable batteries. These batteries would be just as powerful, but more reliable and safer to use. Rechargeable batteries, however, are much more expensive than Tiger Head batteries. For this reason, Whit envisioned a rental system for his renewable batteries. He would hire agents to service rural villages and supply them with freshly charged batteries, and collect depleted batteries. The depleted batteries would then be returned to the Burro office where they would be recharged, and subsequently rented out again. Initially Whit envisioned this rental system as a subscription service. Villagers would pay a fixed monthly rate and receive unlimited recharges per month for this price. There would be a slightly higher initial cost when compared to buying Tiger Head batteries,  but over time the villagers would have savings of 30%. (SPOILERS AHEAD) This higher initial cost proved to be difficult to overcome, however. After harvesting their crops, when villagers had extra money, they were quite willing to buy into the Burro rental system. After one month, however, when their money ran out, many people would cancel the service. Upwards of 45% of customers would cancel at the end of a month. By listening to his customer base, Whit decided to change the model. Instead of offering a monthly service, he decided to sell people single charges. This allowed him to offer a much lower price than just buying Tiger Head batteries, and greatly improved the popularity of the Burro battery. Whit also made a lot of changes from his initial system in order to get people to put their trust in the Burro brand, and to spread the brand. In each village they visited, they would organize a meeting with village elders. They would work with the village elder to identify locals in the village who would be responsible and have enough influence within the village to be able to sell batteries. They would then approach these individuals to become agents, and offer them a commission per battery they sold. Since these people were respected in their village, Burro was able to gain a good reputation, and overcome the liability of newness. In addition to using locals to sell his batteries, Whit also tried to get the brand known using advertising. He chose a distinct green color for the brand, and painted the companies headquarters, located in the middle of a city, that color green. He also branded the cars they rode in, and created radio advertisements in many of the tribal languages in order to spread the idea of Burro. Finally, he organized raffles when first introducing Burro batteries to a village. This not only encouraged people to come to the meeting to learn about the advantages of Burro, but made the Burro branded items coveted. After getting battery rentals up, Whit looked at other needs that would fill additional needs in the villages as well as help push his battery rentals. He realized there was a need for better flashlights, as the common flashlights were not very powerful. He worked with a manufacturing company in order to make a light that would run off of his batteries, and had multiple brightness settings, so people would not only be able to replace their flashlights, but also their kerosene lamps. Additionally, he realized people were spending a lot of time and money getting their cellphones charged at diesel generators. To help with this, he started selling cellphone chargers that would run off of the Burro batteries. Not only did both of these products help improve life for the villagers by saving them money and time, but they also improved the image of the Burro brand name, and increased battery rental rates. Throughout the development and establishment of his company in Ghana, Whit remained flexible and open to criticisms. Since he was means driven and not goals driven, he was able to take criticism into account, and shift his rental system and add new products. Had he been set on his original rental plan, his business would not have been sustainable and he would have had to shut it down. As he worked to add products to the Burro brand aside from just batteries, he started working with other companies who had similar goals; mainly to bring high quality, sustainable products to Africa. Working with these new design and manufacturing partners allowed him to create new partnerships, which were beneficial both to Burro and to the other company. Whit Alexander's journey getting Burro established in Ghana was not an easy one. He had to be open to change his business model, make partnerships, and struggle with the difficult conditions (such as those of roads) in Ghana. By focusing on the doing, being determined not giving up when faced with a challenge, and being willing to make significant changes to his company's business model, Whit was able to make his business work. He was able to transform his means and who he knew into a company, and expand into new markets and areas by making important partnerships. Whit's journey characterizes his entrepreneurial mindset of being determined to make things work, and being flexible and open to change."}, {"review_sentiment": 4.0, "review_text": "This is a fascinating look at Ghana from a perspective not seen by many in the US. The author helps his brother begin and develop a startup in Ghana embracing the notion  that the way to help a country and its people is to start profitable businesses that hire people and allow them to earn money. He sees a need in Ghana for reusable batteries and develops the product and more importantly in this country the infrastructure to distribute and recharge the batteries. He and his brother live in the country and by so doing share the common life of the people they serve. There are descriptions of trying new foods, the struggle to adapt to less than ideal living conditions and an optimism and desire for the enterprise to succeed. With two years of life in Ghana he shares  insights that few Westerners glean on a quick trip through a developing country. I had the privilege of spending ten days in Ghana and I read this book after the trip. It added so much to my understanding of the infrastructure I observed and sometimes struggled with and often marveled at how it all seems to work .It is a view of the country apart from that seen by most tourists (there is not much tourist infrastructure in Ghana). It is an insightful view of people struggling yet often happy without the benefits of our more advanced culture. It is a description of the challenges of dealing with a culture more \"relaxed\" than our own and one where getting by is on the one hand hard but on further examination aided by a communal effort. There is a community structure depicted so different from our own small towns. The author often glances  humorously at the foibles he deals with. The terrible roads, the challenges of water, the worry about disease, dealing with employees whose culture, and strivings are often different from his own. It is an easy read that on one level is profound in its description of situations and people while  avoiding the ponderous or preachy. On one level it describes Ghana. On another it describes the hard work, tenacity and perseverance required to get any start up going especially in a country so different from the US. Hard work is required, success is not certain and rewards are not guaranteedFor one  entertaining the notion of starting a business in a developing country it is a cautionary tale. For one wanting an insiders look at Ghana in its villages and countryside it is a welcome respite from travel guides.An interesting and informative journey."}, {"review_sentiment": 5.0, "review_text": "For a Ghanaian in the diaspora this was very encouraging of possibilities for entrepreneurs. I like the presentation because it's very realistic, based on what I knew of the country decades back.  But it shows that with determination and the right cause success is possible, despite the challenges typical of Ghana."}]}, "authors": ["Max Alexander"], "isbn": "1401324177", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Bright Lights, No City", "word_cloud": "get third way delete bore interest good writing humor insight rural mentality anyone love certainly reason slip crack happen way glad line see company still business year later enough positive funny extremely readable important guy think idea instead act le easy environment good people market also learn far business make thing ever get business degree phenomenal told brother man bring quality affordable battery rural charity people spend million drive around brand new accomplish nothing project involve touch mess european western guilt do turn massive welfare forever everyone instead say read great picture life business story ability find humor ordinary entertaining someone live do business locally hit nail dead brilliantly humorously detail life eye better guidebook true list top restaurant accra cover lot intertwine necessary fact explain work local culture travel anywhere highly recommend wonderful story person want help people help interest also show complexity work develop country think appreciate philosophy spur challenge endeavor time confound company produce popular board game fellow employee pair sell company instead retire point decide new company story effort start business sell affordable good service villager ghana story tell brother visit work team help company start see traditional work do charity good way battle poverty improve life people live often find charity fund project leave area example project build well month well damage charity already leave help fund repair well end villager leave well charity waste time money build well instead believe business help live villager venture able employ local people provide often reliable income business remain operate area create mechanism sustainable change mind decide invest personal saving start instead donate money charity city electrify many rural village hook electrical grid people village rely battery powered device flashlight radio common battery rural area battery call cheap battery quite weak prone leak fluid leak battery toxic cause irreparable damage device uncommon rural spend upwards annual income purchasing battery market hop enter company initial idea provide alternative cheap battery form rechargeable battery battery powerful reliable safer use rechargeable battery however much expensive battery reason envision rental system renewable battery agent service rural village supply freshly charge battery collect deplete battery depleted battery office subsequently rent envision rental system subscription service fix monthly rate receive unlimited recharges month price slightly higher initial cost compare buying battery time villager higher initial cost prove difficult overcome however harvest crop villager extra money quite willing buy rental system month however money run many people service customer month listen customer base decide change model instead offer monthly service decide sell people single charge allow offer much lower price buying battery greatly improve popularity battery also make lot change initial system order get people trust brand spread brand village visit meeting village elder village identify local village responsible enough influence village able sell battery individual become agent offer commission battery sell people respect village able gain good reputation overcome liability newness addition use local battery also try brand know use advertising choose distinct green color brand paint company headquarters locate middle color green also brand car create radio advertisement many tribal language order spread idea organize raffle first introduce battery village encouraged people come meeting learn advantage make brand item covet get battery rental look need additional need village well battery rental realize need better flashlight common flashlight powerful work manufacture company order make light battery multiple brightness setting people able flashlight also kerosene lamp additionally realize people spend lot time money get cellphone charge diesel generator start sell cellphone charger battery not product help life villager save money time also improve image brand name increase battery rental rate throughout development establishment company remain flexible open criticism mean drive goal driven able criticism account shift rental system new product have set original rental plan business worked add product brand aside battery start work company similar goal mainly bring high quality sustainable product new design manufacture partner allow create new partnership beneficial company journey get establish easy open change business model make partnership struggle difficult condition road focus determine give faced challenge willing make significant change company business model able make business work able transform mean knew company expand new market area make important partnership journey characterize entrepreneurial mindset determine make thing work flexible open change fascinating look perspective see many author help brother begin startup embrace notion way help country people start profitable business hire people allow money see need reusable battery develop product importantly country infrastructure distribute recharge battery brother live country share common life people serve description try new food struggle adapt le ideal living condition optimism desire enterprise year life share insights glean quick trip develop country privilege spend ten day trip add much understanding infrastructure observe sometimes struggle often marveled seem work view country apart see tourist much tourist infrastructure insightful view people struggle yet often happy benefit advanced culture description challenge deal culture relax get hand hard examination aid communal effort community structure depict different small town author often glance humorously foible deal terrible road challenge water worry disease deal employee culture striving often different easy level profound description situation people avoid ponderous preachy level describe describes hard work tenacity perseverance require start go especially country different work require success certain reward guaranteed for entertaining notion start business develop country cautionary tale want insider look village countryside welcome respite travel interesting informative journey ghanaian diaspora encourage possibility entrepreneurs presentation realistic base know country decade back show determination right cause success possible challenge typical", "genres": ["Memoir", "Business & Finance", "Travel Writing"], "summary": "An African Adventure on Bad Roads with a Brother and a Very Weird Business Plan\r\n\r\nAt age forty-seven, Whit Alexander, the American cofounder of the Cranium board game, decided to start a new business selling affordable goods and services to low-income villagers in Ghana, West Africa. His brother, Max, a journalist, came along to tell the story. Neither of them could have anticipated just how much of an adventure they’d find there. \r\n\r\nIn Ghana, Whit’s initial goal is to market a high-quality, rechargeable AA battery for off-grid villagers. If successful, he planned to grow a larger for-profit business based on those batteries: creating a trusted brand that would provide life-enhancing products, services, and jobs, without relying on charity. \r\n\r\nGhana, however, presents extraordinary challenges, and the brothers wage daily battles against deadly insects, insane driving conditions, unspeakable food, voodoo priests, corrupt officials, counterfeiters, and ethnic rivalries on their way to success. From signing up customers who earn a few dollars a month at most to training employees with no Western-style work experience, the brothers quickly learn that starting a business in Africa requires single-minded focus, a sense of humor, and a lot of patience. \r\n\r\nAlong the way, Whit and Max relive their own childhood, bickering across the African bush and learning a great deal about Africans as well as themselves. Irreverent, hilarious, and ultimately inspiring, Bright Lights, No City challenges accepted notions of charity; shows the power of broadening your horizons; and suggests that there is hope and opportunity in Africa.\r\n\r\n“Mr. Alexander combines a high-energy travelogue with an insightful exploration of what it takes to turn an idea into a profitable enterprise. The result is a wonderfully entertaining business book.” Wall Street Journal\r\n", "asin": "1401324177", "rank": "477568", "city": "Ghana", "image": "https://images-na.ssl-images-amazon.com/images/I/411Wm2slpiL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}