{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 47, "rating": 3.8, "reviews": [{"review_sentiment": 3.0, "review_text": "This is a nice, somewhat sad little book with no real emotional power. Someone has compared Holleran to Hemingway and Fitzgerald and I would say that comparison is way way off. It's an easy read and a somewhat engaging story. The fact that it is about gay characters, and gay men getting older, makes it resonate with a particular group of readers, both straight and gay, as it does with me.  But it is not a read of exceptional depth or insight. And not one that explores the subject any more effectively than many others. There is much much more engaging gay literature out there."}, {"review_sentiment": 3.0, "review_text": "This writer is one of my favorites, but his writings of late are very negative and sometimes hard to read, but coming from the years of coming out and Gay Liberation, it isn't hard to see his reasons.  It's a good book, well written, a great writer ... I only wish he would see things in a more positive light.  Perhaps the next book?"}, {"review_sentiment": 5.0, "review_text": "In perfect condition and a wonderful read."}, {"review_sentiment": 5.0, "review_text": "Brilliant as always,  Andrew Holleran has more than lived up to my expectations with his book, \"Grief.\"  In this book he displays his usual deep insights and sensitivity.  The last page is devastating.  I highly recommend this book."}, {"review_sentiment": 5.0, "review_text": "I have always had Andrew Holleran at the top of my favourite gay authors and \"Grief\" continues the high standard of his work.  Not a long novel but a beautifully written observation of life and death and ageing, ,penned by one of the keenest literary minds out there.  Ever since reading \"Dancer From the Dance\" (I am the proud owner of a 1978 Morrow first edition), his ground breaking first novel which surely must be on the short list for greatest American  gay novel, I have loved his books and this is no exception.  The inclusion of Mary Todd Lincoln and the Washington D.C. locale add unusual interest to this fine book.  Only about six books in thirty years but all quality efforts."}, {"review_sentiment": 3.0, "review_text": "I first read Andrew Holleran in the late '70's, with his first novel, Dancer From the Dance, as a young and rather naïve undergraduate. It gave me a glimpse of a world that I was about to enter myself, though I grew up and continue to live in the Midwest, so the experience has been somewhat different than that described by Mr. Holleran. In the meantime, I have read most of his work, and have finally come to his novel, Grief, a very slight novel at a mere 150 pages.And that may be part of the problem. This book reads more essayistic than novelistic. It is essentially plotless: The unnamed narrator, having recently lost his paralyzed mother who resided in a Florida nursing home, comes north to Washington, D.C., to teach a class on Literature and AIDS for a colleague who is on sabbatical. He rents a room from an unnamed landlord who is also a lawyer and runs a shop selling antiques and movie props. When not teaching or wandering the city, the narrator is essentially holed up in room, where he finds and reads a book on the life and letters of Mary Todd Lincoln, a ghostly, grief-stricken presence who is unable to move on after losing her husband and children. The narrator also has occasional chats with a friend named Frank, a cancer survivor with a stronger will to live, and the only source of humor in an otherwise grim book.And yet, as thin as the plot is, the book is rather thoughtful. The middle-aged narrator grieves for his mother. The middle-aged lawyer/landlord grieves for many friends lost to AIDS, as well as his youth. Like Mary Todd Lincoln, they are frozen in grief. One senses that they are grieving for a passing lifestyle, while observing the start of something new in the younger generation. Rather than being full-fledged characters, the narrator and his landlord, along with the other, mostly unnamed, characters, seem to be more archetypes, survivors of a generation mostly lost to AIDS and hedonism. The narrator, having arrived at the house where he is renting a room, wanders the empty house \"like a ghost.\" He wanders the city in much the same way--ghostly, spectral, observing, for the most part not interacting with anyone else. At one point, he sees himself in the mirror--\"The pale silvery figure staring back at me looked so tentative and sad.\" Meanwhile, the landlord/lawyer collects the detritus of the lives of other people, to resell in his shop. Even Frank's boyfriend is largely a spectator, reading travel guides, but afraid to travel by himself, while suggesting to others where they should go on vacation.I could not help but think of Christopher Isherwood's A Single Man while reading this. Published some 40 years before Grief, Isherwood's novel comes across as more compassionate, braver, and more life-affirming. Even at the end of that book, with the main character, George, alone, drunk in bed and masturbating, before falling to sleep, and with the final vivid image of his impending death, he is more socially and intellectually engaged than any of the characters in Mr. Holleran's book. Here's to hoping that next time, Mr. Holleran is able to produce a more substantial book."}, {"review_sentiment": 3.0, "review_text": "I had no expectations picking up this book but, if I had, my reaction would likely have been disappointment.  It is a dirge in novel form... unremitting bleakness from cover to cover.  I became tired of it pretty quickly, though the vain hope that something would \"happen\" to the protagonist kept me going dutifully through it to the end.  It isn't that I wanted spine-tingling action or some sensational denouement, but rather that there would be nuance and beauty -- the way a surprising ray of sunshine poking through thick storm clouds adds drama, depth and charm to an otherwise desolate landscape.  But perhaps the author was too stuck in sadness, or feared it would be too pedestrian to have love show up in his protagonist's life.... whatever the cause of his decision to keep things covered in the heaviest crepe, that choice leads to tedium and leaves unexplored many possibilities that would have enriched the book."}, {"review_sentiment": 3.0, "review_text": "Mr. Hollerans overwhelming negativity sucks the life out of me, but his books are captivating in that they are so well written.  I could only give three stars though."}, {"review_sentiment": 2.0, "review_text": "I am an aging gay man.  I have lost both my parents and have buried two lovers.  I know well what grief is--and this is not it."}, {"review_sentiment": 5.0, "review_text": "This short novel by Andrew Holleran is an emotionally intense first-person narrative of a man coming to grip with the emptiness of his life and his sheltered, withdrawn existence.  The narrative that follows the storyteller's life through about a six month period gives a stark portrayal of what (unfortunately) many single, middle-aged, gay men face...a gradual withdrawing from social interactions, crippling aloneness and the walls they build around themselves to protect them.Highly recommend reading this book if you or someone you know is slipping into mid life.  I believe you will find Holleran's approach to this novel fascinating.  We never learn the name of any of the characters, except for the narrator's friend, who is the only one that seems to have a well adjusted view of his life.This is an excellent selection for a book club or reading group."}]}, "authors": ["Andrew Holleran"], "isbn": "1401302505", "longitude": -77.0366456, "periods": ["2000s", "Recent Releases"], "title": "Grief", "word_cloud": "nice somewhat sad little real emotional power compare comparison way way easy somewhat engaging story fact gay character gay men get older make resonate particular group reader straight gay exceptional depth insight explores subject effectively many others much much engage gay literature writer favorites writing late negative sometimes hard come year come hard see reason good well write great writer wish thing positive light perhaps next perfect condition wonderful always live expectation display usual deep insight sensitivity last page devastate highly recommend always top favorite gay author continue high standard work not long beautifully write observation life death age pen keenest literary mind ever read proud owner first edition ground break first surely list greatest american gay love exception inclusion locale add unusual interest fine only thirty year quality effort first late first young rather nave give glimpse world enter grow continue live experience somewhat different describe meantime work finally come slight mere part problem read essayist novelist essentially plot less unnamed narrator recently lose paralyzed mother reside nursing home come north teach class colleague sabbatical rent room unnamed landlord also lawyer run shop sell antique movie prop teach wander city narrator essentially hole room find read life letter ghostly presence unable move losing husband child narrator also occasional chat friend name cancer survivor stronger live source humor otherwise grim yet thin plot rather thoughtful narrator grieve grief many friend lose well youth frozen sense grieve pass lifestyle observe start something new younger generation character narrator landlord along mostly unnamed character seem archetype survivor generation mostly lose hedonism narrator arrive house rent room wanders empty house ghost wander city much way ghostly spectral observe part interact anyone else point see mirror pale silvery figure star back look tentative sad meanwhile collect detritus life people resell shop even boyfriend largely spectator read travel guide afraid travel suggest others read publish year come compassionate braver even end main character alone drink bed masturbate fall sleep final vivid image impend death socially intellectually engaged character here hop next time able produce substantial expectation pick reaction likely dirge form unremitting bleakness cover cover become tired pretty quickly vain hope something protagonist go dutifully want action sensational denouement rather beauty way surprising ray sunshine poke thick storm cloud add drama depth charm otherwise desolate landscape perhaps author stuck sadness fear show protagonist life cause decision thing cover heaviest crepe choice lead tedium leaf unexplored many possibility holler ans overwhelming negativity suck life captivate well write star age gay man lose parent bury lover know well short emotionally intense narrative man come grip emptiness life shelter withdrawn existence narrative follow storyteller life month period give stark portrayal unfortunately many single gay men face gradual withdraw social interaction cripple aloneness wall build protect recommend read someone know slip mid life believe approach fascinate never learn name character narrator friend seem well adjust view excellent selection club read group", "genres": ["Fiction & Literature", "LGBT"], "summary": "In the tradition of Michael Cunningham's The Hours, a beautiful novel destined to become a classic\r\nReeling from the recent death of his invalid mother, a worn, jaded professor comes to our nation's capital to recuperate from his loss. What he finds there -- in his repressed, lonely landlord, in the city's mood and architecture, and in the letters and journals of Mary Todd Lincoln -- shows him new, poignant truths about America, yearning, loneliness, and mourning itself.\r\n\r\nSince Andrew Holleran first burst onto the scene with 1978's groundbreaking Dancer from the Dance, which has been continuously in print, he has been dazzling readers and critics with his haunting, brilliant prose. The Publishing Triangle ranks Dancer from the Dance at #15 on its list of the 100 best lesbian and gay novels ever, along with titles by Marcel Proust and Virginia Woolf. \r\n\r\nA new Andrew Holleran book is a major literary event; with Grief, Holleran is poised to reach a wider audience than ever before.", "asin": "1401302505", "rank": "1956736", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/411MNMG3HHL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}