{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 25.7742658, "ratings": {"num_ratings": 38, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book."}, {"review_sentiment": 1.0, "review_text": "Endless novel with no theme whatsoever. Single paragraphs took up whole pages. Near the finish, it felt like the author wandered aimlessly for 20 chapters trying to find an ending for this book and never found one. POV changed whenever it suited the author. Never got to care about the main character."}, {"review_sentiment": 5.0, "review_text": "Although it's been several years since I read Mambo Kings, this book does a wonderful job tying the two together.  Now it's time for me to reread Mambo Kings."}, {"review_sentiment": 1.0, "review_text": "I would have enjoyed this book if the author spent more time on character development, instead of Maria's perfect \"assets\". If I had a nickel for every time he mentioned her beauty, the lust men felt for her, or her physical interactions with an unattracitve and temperamental sugar daddy, I would be rich. I only read about 40% of the book before giving up, so it is possible they developed the characters more and I just didn't suffer through it long enough."}, {"review_sentiment": 5.0, "review_text": "excellent"}, {"review_sentiment": 4.0, "review_text": "Having visited Cuba in July 2013 I looked forward to reading this book and was pleased to find it mentioned many of the places we had visited.  Imagine my surprise to find that this was all fiction! What a delightful book - not a page turner but certainly of interest for its depcition of what we will do to survive!"}, {"review_sentiment": 4.0, "review_text": "I would have preferred to get the Spanish edition.I have met women like this. You can't get them outof your mind for the rest of your life."}, {"review_sentiment": 1.0, "review_text": "The first half of the book went on forever about how beautiful Maria was. The second half of the book improved somewhat, but I would not recommend this book. Its only redeeming value to me was that it gave me a feel for life in Cuba and for one side of the atmosphere in Havana."}, {"review_sentiment": 5.0, "review_text": "A tale well told with music and color and dare I say passion.  This copy is now in the hands of its third reader who has sworn an oath to return it."}, {"review_sentiment": 4.0, "review_text": "This was a really good book and especially interesting because it related to people I've known about and watched on television in the past."}]}, "authors": ["Oscar Hijuelos"], "isbn": "1401310516", "longitude": -80.1936589, "periods": ["1900s", "Recent Releases"], "title": "Beautiful Maria of My Soul", "word_cloud": "great endless theme paragraph take whole page finish felt author wander aimlessly chapter try find end never find change whenever suit author get care main character several year wonderful job tie together now time reread author spent time character development instead perfect asset nickel time mention beauty lust men felt physical interaction unattractive temperamental sugar daddy give possible developed character suffer long enough excellent have visit look forward read pleased find mention many place visit surprise find fiction delightful page turner certainly interest depiction survive spanish meet woman out of mind rest life first half go forever second half improve somewhat redeem value give feel life side atmosphere tale well tell music color dare say passion copy hand third sworn oath return really good especially interesting related people know watch television", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "\"I fell instantly in love with the glorious soul of Beautiful María of My Soul. Hijuelos has created and brought to life two beloved characters, a heart-stealing heroine and Havana during an epoch of changing fate.\" Amy Tan, bestselling author of The Joy Luck Club\r\n\r\nIn Beautiful María of My Soul, Oscar Hijuelos returns to the passionate tale he began twenty years ago in The Mambo Kings Play Songs of Love.\r\n\r\nMaría is the great Cuban beauty who stole musician Nestor Castillo's heart and broke it, inspiring him to write the Mambo Kings' biggest hit, \"Beautiful María of My Soul.'\" Now in her sixties and living as an exile in Miami, María remains a beauty, still capable of turning heads. But while she left Cuba decades ago, she has never forgotten Nestor. As she thinks back to her days--and nights--in Havana, an entirely new perspective on the Mambo Kings story unfolds. Beautiful María of My Soul is a stunning act of reinvention, and another contemporary classic from an extraordinarily talented writer.\r\n\r\n\"Savor the mysterious power of a master's pentimento.\" Los Angeles Times", "asin": "1401310516", "rank": "1388390", "city": "Miami", "image": "https://images-na.ssl-images-amazon.com/images/I/51TzkVdTHSL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}