{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 223, "rating": 4.6, "reviews": [{"review_sentiment": 4.0, "review_text": "The average reader need know no more than the information in this book on the Fall of Constantinople."}, {"review_sentiment": 5.0, "review_text": "Fantastic book! Crowley 's nonfiction reads like fiction, yet it's crammed with details and information it would years to find."}, {"review_sentiment": 5.0, "review_text": "One of my favorite books on this topic."}, {"review_sentiment": 5.0, "review_text": "Excellent book. Roger Crowley - please write more history books!!!"}, {"review_sentiment": 5.0, "review_text": "So often it's hard, especially in the time period in question and when dealing with conflicts involving major world religions, to find a book that is completely unbiased in it's reporting of the subject matter. This book and this author are the exception to that rule. That to begin with was what I enjoyed about this book. Mr. Crowley's position on the subject at hand is that of objective reporter of historical events. There is no personal or religious/Western bias of any kind (Not that I know anything of his personal beliefs) in this book or any sense that Mr. Crowley belongs to a \"side\" in the subject matter.As for the subject matter itself, the book starts as a general overview of the emergence of Islam, it's conquest of the Arab world and it's previous conflicts with the Byzantines. It then generally covers the Byzantines history in the area over the previous 400 years and the way thier policies and mutual interactions led up the events to be covered.The bulk of the book is a straight forward military history of the battle and the seige, covering historical documents as well as personal accounts of the battle from individuals who fought it. It covers the blood and guts details that you would expect to find in a medieval battle, detailing atrocieties committed with no attempt to whitewash or excuse, but also no attempt to judge from a modern perspective. All in all, one of the most enjoying and easy to read books I've read in some time."}, {"review_sentiment": 5.0, "review_text": "An excellent and objective account of the Ottoman siege and world-changing conquest of Constantinople, Well written, attention-grabbing, and a welcome addition to any collection of works on the Ottoman Empire and Byzantium. Caution -- the paperback has small type."}, {"review_sentiment": 5.0, "review_text": "Great work, highly recommend it, well worth the time."}, {"review_sentiment": 5.0, "review_text": "great history"}, {"review_sentiment": 4.0, "review_text": "While Roger Crowley is certainly a first rate historian, he possesses some flaws. 1453: The Holy War for Constantinople and the Clash of Islam and the West is by and far a great read but it may not be best choice for a novice to historical studies thanks to Crowley’s errors with the names of places and people. The most glaring naming error in this book was when Crowley referred to the Maritime Republic of Ragusa (Republica Marittima Ragusana) as Dubrovnik.While Dubrovnik is indeed the modern name of Ragusa, in 1453 Ragusa was still ruled by an Italian elite that spoke a language that was quite similar to Venetian. Indeed, eventually Ragusa became part of the Republic of Venice along with most of Dalmatian coast line. In deed, to this day ethnic Italians can be found in Slovenia and Croatia and according to some historical accounts Marco Polo was actually born in Split.In the case of the names of people, Crowley often annoyingly uses the Anglicized version of the name, or in the case of Giustiniani, fails to provide the full name; Giovanni Giustiniani Longo. While these may seems like minor errors, I would tend to believe that an historian of the caliber of Crowley would not be prone to such mistakes. This is a great book but it could have been edited better."}, {"review_sentiment": 5.0, "review_text": "If you are interested in the fall of Constantanople and the end of the Roman empire, this book is an absolutely riveting read. The final battle of several months is detailed incredibly well. Specific events often are pinpointed to an exact hour on a specific day. One day starts in a city named Constantinople  with a battle raging through the night, and at about 8:00 am the next day that city is Istanbul.  Incredible!"}]}, "authors": ["Roger Crowley"], "isbn": "1401308503", "longitude": 28.9651646, "periods": ["1600s", "1700s", "1800s", "1900s", "1500s", "500-1400s", "0-500s", "Pre Common Era"], "title": "1453: The Holy War for Constantinople and the Clash of Islam and the West", "word_cloud": "average need know information fantastic nonfiction read fiction yet cram detail information year favorite topic excellent write history so often hard especially time period question deal conflict involve major world religion find completely unbiased reporting subject matter author exception rule begin enjoy position subject hand objective reporter historical event personal bias kind not know anything personal belief sense belongs side subject subject matter start general overview emergence conquest world previous conflict byzantines generally cover history area previous year way policy mutual interaction lead event bulk straight forward military history battle sage cover historical document well personal account battle individual fight cover blood gut detail medieval battle detail atrocity commit attempt whitewash excuse also attempt judge modern perspective enjoy easy time excellent objective account siege conquest write welcome addition collection work small type work highly recommend well worth time great history certainly first rate historian possess flaw far great choice novice historical study thanks error name place people glare naming error refer indeed modern name still rule italian elite speak language quite similar indeed eventually become part coast line deed day ethnic find accord historical account actually bear case name people often annoyingly use version name case fail provide full name seem minor error historian caliber mistake great better interested fall end empire absolutely rivet final battle several month detail incredibly well specific event often pinpoint exact hour specific day day start city name battle rag night next day city", "genres": ["History", "Ancient Civilizations"], "summary": "Now in trade paperback, a gripping exploration of the fall of Constantinople and its connection to the world we live in today\r\n\r\nThe fall of Constantinople in 1453 signaled a shift in history, and the end of the Byzantium Empire. Roger Crowley's readable and comprehensive account of the battle between Mehmed II, sultan of the Ottoman Empire, and Constantine XI, the 57th emperor of Byzantium, illuminates the period in history that was a precursor to the current jihad between the West and the Middle East.", "asin": "1401308503", "rank": "55800", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51EMDSBEZXL.jpg", "country": "Turkey", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}