{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": -33.928992, "ratings": {"num_ratings": 6, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Brink deserves the Nobel prize he won.  This is a riveting story, based on fact, that teaches lessons well beyond the plot."}, {"review_sentiment": 5.0, "review_text": "One of the great novels of the 21st C. A must read."}, {"review_sentiment": 3.0, "review_text": "I'm a product of a very well-known writers' workshop in a state best known for corn ... and after reading this book, I wanted to firebomb all writers' workshops worldwide. Few things are sadder than a book that's only 20, 25 years old and already dated -- I don't mean historically dated, I mean the style, the prose, the whole Tortured Intensity of it all. Brink has a great story to tell, and he does many things very well. The police-report beginning whets the appetite, and I found myself often returning to it in order to sort out who's who, what happened when, and theories I was formulating about the plot. Some drama peters out to nothing much, and much of the sexual stuff (and there is plenty) is groan-worthy: all those stiff, erect members poking here and there, all that delicious wetness, blah blah blah. Grow up already!Also, this book needs to end about 100 pages sooner than it does -- the italicized ending drags on and on and on, and by that time you just want to see The End.Brink keeps talking after he has nothing left to say. Little laughter and no triumph. Even the most serious of novels needs some leavening. This one rises, rises, rises -- but is left with a semi-flattened crown none the less. Not half-baked, not by any means, but unevenly baked. Absorbing, but ultimately - meh."}, {"review_sentiment": 5.0, "review_text": "Andre Brink is well known in South Africa and less so in the US.  He writes in English, and that is a serious understatement.  He deals with that country's central problem, apartheid and its aftermath, which is a subject that most American's recognize as part of our on heritage as well though not so gravely.  The role of women also holds his attention as well.  But this is a literary work, not ideological, and it has tremendous merits.  Its structure and plot are refreshingly counterintuitive but not hard to grasp or distracting.  Its language is rich but not self-conscious, calling to mind recent works such as Cold Mountain or maybe Faulkner at times.  But the work offers an exotic and important opportunity for readers outside South Africa."}, {"review_sentiment": 4.0, "review_text": "Andre Brink is one of the leading lights of white South African literature, a writer with a strong commitment towards social justice in a country whose black majority until recently could not have a say in its daily life.  His celebrated 'A dry white season' stands as a monument of indictment of the 'apartheid' regime by exploring its consequences in the  social dynamics and psychology of a white South African schoolteacher who  takes upon himself to find out the whereabouts of his gardener's son and,  then, the gardener himself.  Anybody interested in 'apartheid' South Africa  and in Brink's ouvre of moral commitment should read that novel; it would  definitely be an excellent introduction to both.With 'A chain of  voices', Brink explores the dynamics of another oppresive regime:  slavery.  It is evident, however, that what Brink does in this novel is to go back  to the institution of slavery to explore 'apartheid' in a similar way to 'A  dry white season'.  And what he finds, again, is ugly.  At many levels,  Brink tells us that any oppresive regime corrupts all human relationships,  and that it can even transform--in a Frankenstein-like fashion--victims  into victimizers.  Not only is white pitted against black, but also wife  against husband, father against children, brother against brother, and  friend against friend.  Brink brilliantly accomplishes this feat by giving  voice to those that are senselessly involved in the oppresive dynamics of  slavery, in a true 'chain of voices'.The novel is set in the early 1800s  in the Western Cape, in the beautiful area around Tulbagh and Worcester.  From the very beginning, we know that three white men (two masters and one  schoolteacher) have been killed by a group of slaves in a small-scale  rebellion.  What the novel does so well is to go back through the forces  that led to that ending.  In the process, one finds that the oppressor  oftentimes is not aware of his oppression, that he is not enterely evil in  the naive way that he is almost always portrayed, and that, incredible as  it might seem, there is human side to him.  On the other hand, one also  finds that those that are oppressed are forced to commit acts of cruelty,  even against those they supposedly love, in an effort to assert some power.  In the end, however, everybody, but particularly the male characters, is a  victim and a victimizer.Even though I enjoyed the novel, with its deep  psychological analysis of the characters involved, I found that the  language seems too modern and sometimes too sophisticated for the 1800s  setting.  Also, there is some repetitiveness, particularly in the sexual  domination of women. Despite this, I thoroughly recommend  this novel to anyone interested in Brink's novels and the psychological  consequences of oppressive regimes."}, {"review_sentiment": 5.0, "review_text": "I read this novel in the eighties, when the power of the white minority regime in South Africa was still at its height. From the perspective of a liberal outsider there seemed to be nothing that could be said in favour of  these people - they were stuck somewhere in the Dark Ages where the rest of  the world could not reach them. A Chain of Voices put a somewhat more  complex slant on the whole issue, but because Brink is a liberal as well as  an Afrikaaner, refused to give an inch where apartheid was concerned. He  doesn't stereotype people as villains or victims, but nor does he make  excuses for them. He examines the evil of the system from the comparative  safety of the distant past - the novel is set sometime in the nineteenth  century and is based on a slave rebellion in which a slave owner had been  murdered.  Each chapter is taken from the perspective of a different  character, slaves and masters, and Brink never fails to draw the sympathy  of the reader to whichever character is being explored at any one time.  Reading this book taught me that no matter how brutalised someone is, no  matter how unpleasant they seem, they still have the capacity for finer  feelings. They can still fall in love, they never lose the capacity to be  hurt by those closest to them. You may find that this leaves you with even  fewer excuses for their behaviour than ever, but what it certainly does is  to bring their experience closer to our own. Modern-day evils such as  racism, sexism, homophobia and religious bigotry are no longer out there  being practiced by people who are not like us. They are much closer to home  and we share a responsibility for them and for eradicating them. The strong  moral ethos of the book aside, it is also a gripping read - all 500+ pages  of it, there is much lush description of the South African landscape and  there is a beautiful many-layered love story that doesn't have a cliche in  it. It made me cry. Enjoy!"}]}, "authors": ["Andre Brink"], "isbn": "1402208650", "longitude": 18.417396, "periods": ["1800s"], "title": "A Chain of Voices: A Novel", "word_cloud": "deserve rivet story base fact teach lesson well plot great novels product writer workshop state best know corn reading want firebomb writer workshops thing sadder year old already date mean historically date mean style prose whole great story tell many thing well begin whets appetite find often return order sort happen theory formulate plot drama peter nothing much much sexual stuff plenty stiff erect member poke delicious wetness blah blah blah already also need end page sooner italicized end drag time want keep talk nothing leave say little laughter triumph even serious novel need leaven rise rise rise leave none le not mean unevenly bake ultimately meh well know le write english serious understatement deal country central problem apartheid aftermath subject american recognize part heritage well gravely role woman also hold attention well literary work ideological tremendous merit structure plot refreshingly counter intuitive hard grasp distract language rich call mind recent work maybe time work offer exotic important opportunity reader lead light white south african literature writer strong commitment towards social justice country black majority recently daily life celebrated dry white season stand monument indictment regime explore consequence social dynamic psychology white south african schoolteacher take find whereabouts gardener son gardener interested moral commitment definitely excellent introduction voice explore dynamic oppressive regime slavery evident however go back institution slavery similar way dry white season find ugly many level brink tell oppressive regime corrupts human relationship even fashion victim victimizes not white pit black also wife husband father child brother brother friend friend brilliantly accomplish feat give voice senselessly involved oppressive dynamic slavery true set early western beautiful area begin know white men master schoolteacher kill group slave rebellion well go back force lead end process find oppressor oftentimes aware oppression entirely evil naive way almost always portray incredible human side hand also find oppressed forced commit act cruelty even supposedly effort assert power end however everybody particularly male character victim enjoy deep psychological analysis character involve find language seem modern sometimes sophisticated setting also repetitiveness particularly sexual domination woman thoroughly anyone interested novel psychological consequence oppressive regime eighties power white minority regime still height perspective liberal outsider seem nothing say favor people stick somewhere rest world put somewhat complex slant whole issue liberal well refuse give inch apartheid concern stereotype people villain victim make excuse examine evil system comparative safety distant past set sometime nineteenth century base slave rebellion slave owner murder chapter take perspective different character slave master never fail draw sympathy character explore time read taught matter brutalize someone matter unpleasant seem still capacity finer feeling still fall love never lose capacity hurt closest leaf even fewer excuse behavior ever certainly bring experience closer evils racism sexism homophobia religious bigotry longer practiced people much closer home share responsibility eradicate strong moral ethos aside also grip page much lush description african landscape beautiful story cliche make cry", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "On a farm near the Cape Colony in the early nineteenth century, a slave rebellion kills three and leaves eleven others condemned to death. The rebellion’s leader, Galant, was raised alongside the boys who would become his masters. His first victim, Nicholas van der Merwe, might have been his brother.\r\n\r\nAs the many layers of Andre Brink’s novel unfold, it becomes clear that the violent uprising is as much a culmination of family tensions as it is an outcry against the oppression of slavery.\r\n\r\nSpanning three generations and narrated in the voices of both the living and the dead, A Chain of Voices is reminiscent of William Faulkner’s Absalom, Absalom!; it is a beautiful and haunting illustration of racism’s plague on South Africa.\r\n\r\n“The story…will inevitably evoke comparisons with William Styron’s The Confessions of Nat Turner, a work to which it is substantially superior in insight and artistry.” New York Times", "asin": "1402208650", "rank": "2726482", "city": "Cape Town", "image": "https://images-na.ssl-images-amazon.com/images/I/41TCx34QZ1L.jpg", "country": "RSA", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}