{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 50.8465573, "ratings": {"num_ratings": 128, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "I have read this this novel several times and my enjoyment never diminishes. This is not a light, romantic historical novel. It is a detailed, solid, well researched story of the Battle of Waterloo and events surrounding that battle. This novel can be enjoyed by both male and female readers."}, {"review_sentiment": 5.0, "review_text": "The listing of which regiments fought where was a little dry but the battle scenes were gripping."}, {"review_sentiment": 4.0, "review_text": "I listened to this free on KU. I've previously avoided this book because I know it includes a lot of history about the run up to Waterloo. Anyway, I was in the mood and was travelling a lot so I listened. I'm going to be honest and say that if I'd read it, I'm sure I would have skimmed because there is a lot of history. I've read the other stories in the Alastair-Audley book by this author and so I really liked the H from previous books. He's a younger son who is a colonel in the army and he's 35 when he meets the \"h\". Let me just say I wasn't a fan of the wild and flirty h. She reminds me more of the mistress type who is a secondary character in HRs. She's a young widow, who damps her skirts and flirts and doesn't care what anyone thinks of her. At the beginning of the story the H falls head over heels for her and somehow gets her to agree to marry him. Later, they break the engagement and I must say I was relieved. There is then a lengthy bit of history with Waterloo happening and I ended up crying several times. Ms Heyer is a great writer and she gets you to believe."}, {"review_sentiment": 5.0, "review_text": "Another GEORGETTE HEYER! Another new favourite. So worth the read. I high recommend this book/ audiobook."}, {"review_sentiment": 4.0, "review_text": "War descriptions were too detailed story moves quite slowly. Hence only 4 stars from me. Will suggest to friends who likes these books"}, {"review_sentiment": 5.0, "review_text": "Heyer is noted for her romances, this is a good one. But the history included in this book is first rate. Her characterizations of historical figures, including Wellington is superb."}, {"review_sentiment": 4.0, "review_text": "Slow in the middle, but overall good.  A bit heavy on the troop movements during the actual fighting of Waterloo bogged things down for me.  I did enjoy the central characters and their interactions. I get they are real but far too many side characters for keeping track of.  Not my favorite Heyer"}, {"review_sentiment": 4.0, "review_text": "I am a great fan of Heyer's work, but this isn't one of my favorites.  Its heroine Lady Barbara Childe seems straight out of one of those \"tempestuous redhead who must be tamed by a manly man\" movies of the 1930s-1940s, and (for Heyer) quite cliched.  Much of the book is taken up with a detailed account of the Battle of Waterloo which makes the book more military history than romantic fiction.  However even Heyer I don't much like is head and shoulders above much that is being written today.Readers should be aware that this book is the fourth (or arguably the fifth) in a series following the same family (although the dates don't quite work out).  The sequence is The Black Moth; These Old Shades (in which the Duke of Andover, the villain of Black Moth, was reworked into the Duke of Avon); Devil's Cub (Avon's son Vidal); Regency Buck (the Earl of Worth is introduced); A Infamous Army (Charles Audley, the brother of the Earl of Worth, meets Lady Barbara, the granddaughter of Vidal)."}, {"review_sentiment": 3.0, "review_text": "a heavy read, unlike her other books, but great history."}, {"review_sentiment": 5.0, "review_text": "I've long been fascinated by the Duke of Wellington.  He was obviously what many call a \"natural born\" leader.  Whether one is truly born a leader is obviously in question, but it's true that inherent personality characteristics along with life's experiences can occasionally work together to produce a person who was literally made for their time in history.  In my opinion, Wellington was such a person.Of course, this book isn't exactly about Wellington, but since it focuses on the events leading up to, during, and following the Battle of Waterloo, it features Wellington in many of the scenes.  The fact it has a love story featuring Babs, the Duke of Avon's granddaughter and Charles Audley, brother to the Earl of Worth, whose story was featured in Regency Buck (Alastair-Audley Book 3), is a huge plus.  Whether or not you're reading this book for the historical details or for a sweet love romance, I doubt you'll be disappointed.  In fact, my expectations for the romance weren't that great until I actually got into the book and realized Charles Audley was an extremely likable character.  Babs, although fascinating, not quite so likable, except it eventually becomes apparent that Charles knew Babs better than anyone and what he believed about her eventually resulted in becoming the picture that the reader also became privy to, although I confess this reader had her doubts for most of the story.If you enjoy reading about historical events, including the description of military life and battle staging, along with some romance thrown in, this might be the book for you."}]}, "authors": ["Georgette Heyer"], "isbn": "1402210078", "longitude": 4.351697, "periods": ["1800s", "Recent Releases"], "title": "An Infamous Army: A Novel of Wellington, Waterloo, Love and War", "word_cloud": "several time enjoyment never diminish light romantic historical detail solid well researched story event surround battle enjoy male female reader listing regiment fought little dry battle scene grip listen free previously avoid know include lot history run mood travel lot listen go honest say sure lot history stories author really like previous younger son colonel army meet h say fan wild flirty remind mistress type secondary character young widow damp skirt flirt care anyone think begin story fall head heel somehow get agree marry break engagement relieve lengthy bit history happen end cry several time great writer get believe new favorite worth high recommend audio book description detail story move quite slowly star suggest friend like note romance good history include first rate characterization historical figure include superb middle overall good bit heavy troop movement actual fight bogged thing enjoy central character interaction get real far many side character keep track not favorite great fan work favorites heroine seem straight tempestuous redhead manly man movie quite cliched much take detailed account make military history romantic fiction however even much head shoulder much write aware fourth arguably fifth series follow family date quite work sequence villain rework son introduce brother meet granddaughter heavy great history long fascinate obviously many natural born leader truly born leader obviously question true inherent personality characteristic life experience occasionally work together produce person literally make time history opinion course exactly focus event lead follow feature many scene fact story feature granddaughter brother story featured huge read historical detail sweet romance doubt disappoint fact expectation romance great actually get realized extremely likable character fascinate quite likable eventually become apparent know better anyone believe eventually result become picture also become privy confess doubt enjoy read historical event include description military life battle stag along romance thrown", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "On the eve of battle, passions are running high...\r\n\r\nIN THE SUMMER OF 1815, with Napolean Bonaparte marching down from the north, Brussels is a whirlwind of parties, balls and soirees. In the swirling social scene surrounding the Duke of Wellington and his noble aides de camp, no one attracts more attention than the beautiful, outrageous young widow Lady Barbara Childe. On their first meeting, dashing Colonel Charles Audley proposes to her, but even their betrothal doesn't calm her wild behavior. \r\n\r\nFinally, with the Battle of Waterloo raging just miles away, civilians fleeing and the wounded pouring back into the town, Lady Barbara discovers where her heart really lies, and like a true noblewoman, she rises to the occasion, and to the demands of love, life and war...", "asin": "1402210078", "rank": "544469", "city": "Brussels", "image": "https://images-na.ssl-images-amazon.com/images/I/51-KO5EVUnL.jpg", "country": "Belgium", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}