{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 51, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "Just a heads up for those who intend to read the book based on seeing the movie of the same name:  two of the high level plot premises are different.  In the book the plot is based on smuggling an East German scientist to the west.  In the movie the plot is based on smuggling a Russian officer to the west.  The contents of the coffin is very different in the movie versus the book.  Without giving too much away these differences may sound petty, but as you pull the thread on the 2 plots they do go in different directions.  I tried to find information on why the movie plot was alter so much but came up empty.  If anyone has some info on why movie producers decided to alter the storyline please do share.  Otherwise I greatly enjoyed both the movie and book plots."}, {"review_sentiment": 5.0, "review_text": "On time and as advertised."}, {"review_sentiment": 5.0, "review_text": "The atmosphere of the book is quite realistic, and many of the characters are not only openly venal, or cowards but also at some point naïves. It describes the bureaucracy with its complicated relationship  and delicate power balance between departments at the inside of British Government at that time. It portrays a very understanding portrait of the Cold War and lets us see into these intricate plays between the actors."}, {"review_sentiment": 3.0, "review_text": "This was my first Deighton fiction book and for me it was just okay.  To be honest by the time I got to the end I didn't really get who did what or why to my satisfaction - and I thought I might go back and re-read some parts but then I figured it really wasn't worth it.  The characters are interesting but the constant \"witticisms\" and \"smart aleck\" dialogue from the main character got really old after awhile.  I used to very much enjoy this genre when I was in my teens and reading Ian Fleming but I suppose those times have passed for me.  I have some other Deighton stuff but I think I will pass as the payoff would not really be worth the time for me."}, {"review_sentiment": 3.0, "review_text": "This book seemed a bit of a basic story-line cold war thriller. The plot wasn't interesting to me and I had hard times going through the book."}, {"review_sentiment": 5.0, "review_text": "Len Deighton deserves a place among the greats of literate spy fiction like LeCarre and Furst.  And Funeral in Berlin is a classic must-read for fans of this genre."}, {"review_sentiment": 4.0, "review_text": "Deighton portrays Cold War Berlin in such detail that the reader creates his own film in his mind rather than watch the 1966 movie starring Michael Caine. The unnamed protagonist (\"Harry Palmer\") is a working class spy, the deliberate counterpoint to Connery's Bond. The plot is complicated and plausible. The bad guys come across as real people: you can smell the stale booze on their breaths. The tension builds without much need for slam-bang action. Twenty years later, the first Bernard Samson thriller \"Berlin Game\" covered much of the same ground with a little more verve and polish.Despite being over fifty years old, this espionage classic more than holds its own against contemporary entries. Recommended."}, {"review_sentiment": 5.0, "review_text": "A"}, {"review_sentiment": 3.0, "review_text": "My least favorite book by Len Deighton.  it didn't flow; the plot was weak.  I would recommend any other Deighton novel."}, {"review_sentiment": 2.0, "review_text": "Man I ordered this damn thing twice.  Didn't realize until i started reading again.  Kindle/Amazon should have something tell you that you already downloaded a book like itunes does.  Kind of ho hum story here.  His Berlin Game/Set/Match are the ones to get and read.  Really top notch spy stuff. This story, not so much."}]}, "authors": ["Len Deighton"], "isbn": "1402790643", "longitude": 13.3888599, "periods": ["1900s"], "title": "Funeral in Berlin (Secret Files)", "word_cloud": "just head intend base see movie name high level plot premise different plot base smuggle east german scientist west movie plot base smuggle russian officer west content coffin different movie versus give much away difference petty pull thread plot go different direction try find information movie plot alter much come empty anyone info movie producer decide alter story line please share greatly enjoy movie plot time advertise atmosphere quite realistic many character openly venal coward also point nave describe bureaucracy complicate relationship delicate power balance department british time portray understand portrait let intricate play actor first fiction okay time get end really satisfaction think back part figure really worth character interest constant witticism smart alack dialogue main character get really old awhile use much enjoy genre teens read suppose time pass stuff think pass payoff really worth time seem bit basic cold war thriller plot interest hard time go deserve place great literate spy fiction classic fan genre portray detail create film mind rather watch movie star unnamed protagonist work class spy deliberate counterpoint plot complicate plausible bad guy come real people smell stale booze breaths tension build much need action year later first cover much ground little verve year old espionage classic hold contemporary entry recommend least favorite flow plot weak man order damn thing twice start read something already download itunes ho hum story one get really top notch spy stuff story much", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "A ferociously cool Cold War thriller from the author of The Ipcress File.\r\n\r\nLen Deighton’s third novel has become a classic, as compelling and suspenseful now as when it first exploded on to the bestseller lists.\r\n\r\nIn Berlin, where neither side of the wall is safe, Colonel Stok of Red Army Security is prepared to sell an important Russian scientist to the West – for a price. British intelligence are willing to pay, providing their own top secret agent is in Berlin to act as go-between. \r\n\r\nBut it soon becomes apparent that behind the facade of an elaborate mock funeral lies a game of deadly manoeuvres and ruthless tactics. A game in which the blood-stained legacy of Nazi Germany is enmeshed in the intricate moves of cold war espionage…", "asin": "1402790643", "rank": "1224843", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/41fgG99firL.jpg", "country": "Germany", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}