{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 121, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "I have been a fan of Delderfield for over 40 years. I read his books over and over. The stories never disappoint."}, {"review_sentiment": 2.0, "review_text": "The story was tedious in many places and the views on homosexuality were bigoted, inaccurated and unfair."}, {"review_sentiment": 3.0, "review_text": "It's an interesting book if you really enjoy the mechanics of building up a wagon carter business. The family aspect wasn't quite as in-depth as I expected but it was enjoyable nonetheless."}, {"review_sentiment": 5.0, "review_text": "Thoroughly good read."}, {"review_sentiment": 3.0, "review_text": "Having read much of Delderfield this one was a disappointment. It dragged and didn't hold my sttention."}, {"review_sentiment": 5.0, "review_text": "For one that is not english, an excellent example of english language. I have not only enjoyed the book but have learne so much"}, {"review_sentiment": 5.0, "review_text": "This was a very interesting book.  I recommend it to all."}, {"review_sentiment": 5.0, "review_text": "Good condition."}, {"review_sentiment": 5.0, "review_text": "Pages of this book were tedious and detailed and exhaustive as life itself...but I kept turning the page and at the end realized what a genius Delderfield is; for there was value in every one of them."}, {"review_sentiment": 5.0, "review_text": "Read this book years ago and just wanted to read it again. Haven't gotten to do that yet. It will be my summer read."}]}, "authors": ["R. Delderfield"], "isbn": "1402218214", "longitude": -0.12574, "periods": ["1800s", "Recent Releases"], "title": "God Is an Englishman", "word_cloud": "fan year story never disappoint story tedious many place view homosexuality bigoted inaccurate unfair interest really mechanic build wagon carter business family aspect quite expect enjoyable nonetheless thoroughly good have much disappointment drag hold attention english excellent example english language enjoy learn much interesting recommend good condition page tedious detailed exhaustive life keep turn page end realize genius value year ago want get yet summer", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Book 1/3 in the Swann family saga Series\r\n\r\nFrom master author R. F. Delderfield, the first in the beloved classic God Is an Englishman series.\r\nThe first novel in the epic God Is an Englishman series, this book is a stirring saga of England in the 19th century, as the Industrial Revolution takes hold, forever changing the landscape of England and her people.\r\n\r\nAdam Swann, scion of an army family, returns home in 1858 after service with Her Majesty's army in the Crimea and India, determined to build his fortune in the dog-eat-dog world of Victorian commerce. Swann is soon captivated by Henrietta, the high-spirited daughter of a local mill owner. As Swann works to build his name, he and Henrietta share adventures, reversal, and fortune.\r\n\r\nA beloved novel by a beloved author, God Is an Englishman is a treasure both for Delderfield fans and the growing legion of fans of historical fiction.\r\n\r\n\"A book to get lost in... An epic historical novel artfully contructed.\" New York Times", "asin": "1402218214", "rank": "427800", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51XsTL9PnFL.jpg", "country": "England", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}