{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 2127, "rating": 4.4, "reviews": [{"review_sentiment": 3.0, "review_text": "An architect on the losing side when the Nazis take Paris compromises to survive. Then he finds a cause and becomes a mensch."}, {"review_sentiment": 5.0, "review_text": "It was great to see the transformation of Lucien into the reluctant hero in a horrible time during our history."}, {"review_sentiment": 5.0, "review_text": "Well written and I was Sorry when it ended."}, {"review_sentiment": 5.0, "review_text": "I like that the protagonist felt like an antihero in the beginning, but I enjoyed seeing him transform little by little."}, {"review_sentiment": 4.0, "review_text": "Really enjoyed this book. Finished it in 3 days, I couldn't put it down. My heart raced the whole time. 4 stars only because I would have preferred more detail oAt the end."}, {"review_sentiment": 3.0, "review_text": "This book was okay. It was not worthy of all the high 5-star reviews, though. WWII is my favorite time period and I've read many memoirs and novels from various viewpoints during the war. This one was just okay.There were a few things that made this story unbelievable:No way do I believe the blatant cockiness, disrespect, and arrogance shown by the Lucien toward his potential employer, Manet. Everyone but the Nazis lived in fear during that time, and this was a job for the Nazis. No was not an option, and hell no even less of an option.The unrealistic long-term plans for Pierre that Lucien made when  preparing a bedroom for him when he was only supposed to be there a short time, and was a total stranger to him.It was unrealistic for Schlegal to assume there were multiple specially-made secret hiding places for Jews based on his discovery of ONE, or that he and his mistress would have sex on the short flight of stairs that just happened to be above the hiding place, especially when the bedroom was right there.It was also very unrealistic for a Nazi officer to give his French mistress the exclusive use of a 30-room hunting lodge. No way would that happen.Alain's intense and immediate hatred and resentment towards Lucien, whom he'd just met and gotten job from, was unrealistic.The language used throughout the book sounded very 2017 American, not 1940's France.I also found it annoying that no time line was given and the years were not mentioned. That's especially important in historical fiction.Could have been a much better story. The author needs to do his homework if he's going to continue writing historical fiction."}, {"review_sentiment": 5.0, "review_text": "It was a great book and wonderful story."}, {"review_sentiment": 5.0, "review_text": "Between pausing reading to do what needed to be done I wasn't sure I wanted to start again. Not because it was a \"bad read\" but rather because it seemed it would surely end badly for the \"good guys\" as each page was turned. I highly recommend this remarkable book."}, {"review_sentiment": 4.0, "review_text": "Fast moving historical fiction .  A few anachronisms, figures of speech, stood out breaking the tensions on occasion.  Otherwise an absorbing tale: recommended."}, {"review_sentiment": 4.0, "review_text": "The author allows me to feel the terror and sadness experienced during the Holocaust caused by the Nazis. The only reason I did not give 5 stars is because I found it hard to identify with Lucien."}]}, "authors": ["Charles Belfoure"], "isbn": "1402294158", "longitude": 2.3514992, "periods": ["1900s"], "title": "The Paris Architect", "word_cloud": "lose side compromise survive then find cause become mensch great see transformation reluctant hero horrible time history well write end like protagonist felt antihero begin enjoy see transform little little really enjoy day heart race whole time star detail end okay worthy high review favorite time period many memoir novel various viewpoint war thing make story unbelievable way believe blatant cockiness disrespect arrogance show potential employer live fear time job option hell even le unrealistic plan make prepare bedroom suppose short time total stranger unrealistic assume multiple secret hiding place base discovery mistress short flight stair happen hide place especially bedroom right also unrealistic officer give french mistress exclusive use hunt lodge way immediate hatred resentment towards meet gotten job language use sounded also find annoying time line give year mention especially important historical much better story author need homework go continue write historical fiction great wonderful story pause read need do sure want start not bad rather seem surely badly good guy page turn highly recommend remarkable move historical fiction anachronism figure speech stand break tension occasion otherwise absorb tale recommend author allow terror sadness experience cause reason give star find hard identify", "genres": ["Fiction & Literature", "Mystery & Suspense", "Art & Architecture", "Historical Fiction"], "summary": "\"A beautiful and elegant account of an ordinary man's unexpected and reluctant descent into heroism during the second world war.\" --Malcolm Gladwell\r\n\r\nA thrilling debut novel of World War II Paris, from an author who's been called \"an up and coming Ken Follett.\" (Booklist)\r\n\r\nIn 1942 Paris, gifted architect Lucien Bernard accepts a commission that will bring him a great deal of money - and maybe get him killed. But if he's clever enough, he'll avoid any trouble. All he has to do is design a secret hiding place for a wealthy Jewish man, a space so invisible that even the most determined German officer won't find it. He sorely needs the money, and outwitting the Nazis who have occupied his beloved city is a challenge he can't resist.\r\n\r\nBut when one of his hiding spaces fails horribly, and the problem of where to hide a Jew becomes terribly personal, Lucien can no longer ignore what's at stake. The Paris Architect asks us to consider what we owe each other, and just how far we'll go to make things right.\r\n\r\nWritten by an architect whose knowledge imbues every page, this story becomes more gripping with every soul hidden and every life saved.", "asin": "1402294158", "rank": "14151", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51Y3TYivkAL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}