{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 5, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Wonderful book I had to read for class. Wasn't that hard to get into. I actually enjoyed reading it! It was in great condition. Thanks Amazon"}, {"review_sentiment": 5.0, "review_text": "Very good book, especially for someone who wants to know about the culture. Read it many years ago and had been searching for it again.  It leaves you to think about what happened to Brother man and the girl he took off the street and gave a life."}, {"review_sentiment": 5.0, "review_text": "This book puts you right in Jamaica in the 50's without feeling stuck in time. Very good read. Love the author's written use of the dialect."}, {"review_sentiment": 5.0, "review_text": "Roger Mais' novel laid the groundwork for other experimentation within the novel form and broke the mold of West Indian fiction with a Rasta protagonist. Good and evil, Sin and Redemption are localized and riffed on by the alternating characters. A breakthrough novel."}, {"review_sentiment": 4.0, "review_text": "It's a shame that the Caribbean Writers Series is out of print, for if the other 34 titles are like this, the world is at a loss. The sophomore effort from Jamaican author Mais, Brother Man embodies the best of modern literture of the immediate post-war era. Fundamentally a tale of good over evil, of piety over wickedness, the novel is lyrical, with characters and storylines interweaving like solos in jazz. Mais' style has an openness to it that - to further the jazz reference - is like third-stream jazz, where the silences are as important as the notes, allowing the imagination to flesh out what Mais has left unsaid.  And as a bonus for the reggae fan, the lead character is a Rasta. Well worth searching out."}]}, "authors": ["Roger Mais"], "isbn": "1405062967", "longitude": 0.0, "periods": ["1900s"], "title": "Brother Man", "word_cloud": "wonderful class hard get actually enjoy read great condition very good especially someone want know culture many year ago search leave think happen girl take street give life put right feel stuck time very good author write use dialect lay groundwork experimentation form break mold indian fiction protagonist evil localize riffed alternate character breakthrough shame print title world loss sophomore effort author embody best modern literature immediate era tale good evil piety wickedness lyrical character story lines interweave solo jazz style openness jazz reference jazz silence important note allow imagination flesh leave unsaid bonus reggae fan lead character search", "genres": ["Fiction & Literature"], "summary": "Originally published in 1954 and acclaimed around the world as one of the classics of Caribbean fiction, \"Brother Man\" is the tragic story of an honest Rastafarian healer caught up in a web of intrigue and betrayal in Jamaica's tough West Kingston slums. \r\n\r\nThe healer's name is John Power, but everybody calls him Brother Man - a cobbler whose ability to cure the sick and injured through a mystic force uplifts him to the status of a prophet. Throngs begin to trail him when he passes in the street. With each miracle performed his reputation spreads. Looking on with envy is the evil Papacita, a violent enforcer whose authority is threatened by Brother Man's message of peace and love. Papacita's jealousy is stirred in more ways than one. The brutal schemer also covets the attention of Minette, a young attractive girl that Brother Man has rescued from the streets. \r\n\r\nSet in the same rambunctious lanes that reggae icons like Bob Marley and Jimmy Cliff would later stroll and sing about, \"Brother Man\", is the unforgettable portrait of a ghetto saint - an ordinary man selected by the universe to bring enlightenment to poor belittled people. It's a story of compelling mythic power that has stood the test of time.", "asin": "1405062967", "rank": "1586123", "city": "Jamaica", "image": "https://images-na.ssl-images-amazon.com/images/I/41r1U3HZ9WL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}