{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 7, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "one of those minor ignored and forgotten classics.  Really gets into the you are their aspect and is very illuminating to counter a lots of wrong arguments made today"}, {"review_sentiment": 5.0, "review_text": "Amazing, unique first-person account of the Middle East in the tumultuous years surrounding the end of the British mandate. I didn't realize there was any author or reporter able to be embedded with groups in all sides of the conflict. That this was a personal quest in no way diminished his ability to assess. Where he saw worthy and likeable qualities, he gave credit, but also fairly described misfortune and monstrosity. History, adventure, travelogue, personal journey. A must-read for anyone interested in this subject."}, {"review_sentiment": 2.0, "review_text": "In the process of reading, not getting into it very well."}, {"review_sentiment": 4.0, "review_text": "I read a snippet about John Roy Carlosn's book in a U.S. online publication and the article piqued my interest. I ordered it and found a treasure of a book. Carlson was a journalist, an American Armenian who had researched and published about the spread of Fascism and Nazi's post World War two. He tracked them to his own country of the United States. He published what was apparently a best seller in the U.S. at that time. After this he headed to the middle east and explored what was then the post war hotspot of the British Mandate / Transjordan. He was there as an eye witness to the pull out of the British troops and the hand over to the United Nations forces. He observed first hand the activities of the Arab Legion trained and armed by the British and the birth of the state of Israel. He observed first hand the activities of the Jewish forces known as the Haganah. He bravely, if not foolishly travelled between both sides, crossing the hot zone in the midst of armed conflict. His work is clear concise and refreshingly free of hubris or hype. 1948 was a pivotal year in Middle East upheaval and Carlson gives a clear first person account of what went on. How he met German and Slav Fascists who were training the Arabs to fight the \"Jews\" and \"Zionists\". He meets escaped Nazi's in the care of Arab leaders and befrends them in order to gain an understanding of what their aims and motivations were. He reveals the extent to which the British were responsible for arming and quietly supporting the Arab forces against the Haganah. It is clear that he likes individuals on both sides of the conflict leading up to the creation of the State of Israel. He is open about how he mislead certain people as to his intentions as a U.S. journalist but explains his thinking behind what was essentially a brilliant piece of undercover journalism. His personal observations and insights into Islam at that time and how it was undergoing internal change is very revealing. This book will undermine those who argue that the Islam of today and its pressure points is simply a response to Western Imperialism or the arrival of the State of Israel. It is clear that Arab Islamic thinkers and leaders were trying to remove and semblance of Jewish identity in the Middle East, in the form of \"Zionism\" well prior to the creation of the State of Israel. The book is worth a read for any person who is genuinely interested in the sources of conflict in the Middle East today."}, {"review_sentiment": 5.0, "review_text": "I was expecting this to be a slower read for me but WOW!  I couldn't put it down!  The author makes you feel like you are right there with which ever side he is on at the time and he goes to all of them!  What a time of hatred, brutality, unrest and dedication to a new independent Israel!  Carlson was there and makes you feel like you are there as the war unfolds.  I love the way he writes- no fluff and a fast pace with vivid descriptions!"}, {"review_sentiment": 5.0, "review_text": "\"Cairo to Damascus\" by John Roy Carlson, (1951), 474 pgs.  The author had a knack in observing human nature throughout the Middle East as Israel was born.  The author noted the Arab communists  hated el-Banna's Ikhwan because they \"look backward...Egypt will never progress by looking back over its shoulder and trying to live in yesterday's world\" (79).  The author visited Cairo's slums:  \"At Aishash el Tourgoman thousands of agonized men, women, and children stared at me in living death.  Their hovels were built of earth, or of rotted wood creaking on tottering foundations.  They were dark caves, and the earthen floor was lined with dried dung.  People slept there...The odor of death and disease was everywhere....He was on crutches, a rag over his head, dressed in a patchwork of rags.  I caught a glimpse of his face.  It was horribly pockmarked, and his right eye was a molten grayish ball ringed with a perimeter of reddish sores....\"  (p. 102).  The author discussed how the Muslims were opposed to communism throughout the M.E., except for those who thought it would help expel the French and British colonialists.  The Arabs hated the U.S. because of its support for Israel.  The communists wanted to divvy up the agricultural lands that were owned by a few oligarchs.  In Cairo, \"Jews were imprisoned because they were Zionists, and beaten on the streets because they were Jews\" (138).  \"We saw women with their faces exposed.  Three trollops were sitting on the stoop, their legs wide apart.  It required no effort to see that they were shaven--in keeping with an Arab custom that is said to apply to all classes of women, and is intended to keep them clean in the hot climate\" (150).  As \"Jehad-crazed, hasheesh-maddened\" Muslims camped one night along the Nile, the author asked why so many men were still awake so late at night:  \"Were they praying?\", \"No, it was long past the hour of the last prayer.\" \"Maybe they were visiting with relatives,\" the author's friend replied.  \"Male or female?\" asked the author.  His translator \"looked at me strangely: `Male'\" (155).  \"To meet a Bedouin socially and not match his scratching [from lice] is a sign of uncleanliness\" (161).  The author describes the battles throughout Jerusalem after Ben-Gurion  declared Israel's independence.  Lacking food, after several days the author snuck through the Jerusalem city lines and moved into Jordan - where he was detained, before being taken to the Arab-controlled section of the city to witness the surrender and looting of the Jewish quarter (he also took and reprinted photographs of the Haganah defenders surrendering).  Regarding Amman, Jordan, the author noted: \"Amman was probably the only Arab capital that had not fallen victim to such iniquities as night-clubs, cabarets, and brothels. ...but was apparently unconcerned about homosexuality\" (366).  He visited anti-Israeli communists in Damascus who wanted to liberate women from their chadors.  Also, \"It would be unthinkable for an Arab to be seen walking with his arm around a lady's waist....On the other hand, no odium and no penalties are attached to similar homosexual demonstrations in public\" (389). ....\"But when men do not meet women, they go with young boys\" (390).  The author learned then that the Muslim birthrate was so high that eventually the Muslims would control then Christian-dominated  Lebanon (428), he quoted Pierre Gemayel: \"It is our aim to make Lebanon the Achilles heel of Arab-Moslem solidarity.  Otherwise it means that the Christians' cause is doomed in the Middle East\" (429).  He discusses the `Deutsches Hilfskomittee for den Nahen Ostern' (German Aid Committee for the Near East) which placed Nazi soldiers as military advisors to the Syrian government (435).  While not a book that deeply explores Islam theology or the politics of Islamism, the author reveals many informative insights of the Middle Eastern Arab mind of the 1940s."}, {"review_sentiment": 4.0, "review_text": "This is a gem of a book for those interested in Israel's War of Independence but who are tired of modern, contemporary authors 'walking us back' through a history that they never lived, much less reported on.Flush with accolades from his national 1940's bestseller, Under Cover, John Roy Carlson, an Armenian-American, decides to travel to Palestine in 1947 via England and Egypt, and chronicle the war between the Jews and the Arabs.But Carlson isn't content to travel with the herd of Western journalists and report along with them. He has to go undercover, at great personal risk, posing as an anti-Semitic, pro-Nazi, pro-Arab sympathiser to get the real story, close up and personal!He meets with upper class English Jew-haters, he meets with pro-Nazi arabs, he meet with Moslem Brotherhood religious fanatics and than Carlson has the audacity to travel to Palestine alongside Egyptian mercanaries of the Arab Liberation Army bent on destroying the nascent Jewish State in her infancy. He eats, sleeps, travels and picks lice with ordinary Arab fellahs and also meets with anti-Zionist notables including the verminous Grand Mufti himself.Carlson, with his ever present Leica camera, is in Jerusalem while it is under seige, visits Jericho and Amman, and witnesses the begining of the refugee crisis, finally ending up in Beirut by way of Damascus.What a story, and what personal courage as Carlson crosses enemy lines repeatedly and manages to stay one step ahead of suspicious Arab officials who might easily expose him as an American undercover journalist.Read this book.J. Evans"}]}, "authors": ["John Roy Carlson"], "isbn": "1406756628", "longitude": 31.243666, "periods": ["1900s"], "title": "Cairo to Damascus", "word_cloud": "minor ignore forgotten classic get aspect illuminate counter lot wrong argument make today amazing unique account tumultuous year surround end british mandate realize author reporter able embed group side conflict personal quest way diminish ability ass saw worthy likable quality give credit also fairly describe misfortune monstrosity adventure travelogue personal journey anyone interested subject process reading get well snippet online publication article pique interest order found treasure journalist research publish spread post track country publish apparently best seller time head middle east explored post war potshot british eye witness pull british troop hand force observe first hand activity train armed british birth state observe first hand activity jewish force know bravely foolishly travel side cross hot zone midst arm work clear concise refreshingly free hubris hype pivotal year upheaval give clear first person account go met german train fight zionists meet escape care leader befriend order gain understand aim motivation reveal extent british responsible arm quietly support arab force hannah clear like individual side conflict lead creation open mislead certain people intention journalist explains think essentially brilliant piece undercover journalism personal observation insight time undergo internal change reveal undermine argue today pressure point simply response western arrival clear thinker leader try semblance identity form well prior creation worth person genuinely interested source conflict today expect slower author make feel right ever side time go time hatred brutality unrest dedication new independent make feel war unfolds love way fluff fast pace vivid description pg author knack observe human nature bear author note arab communist hat backward never progress look back shoulder try live yesterday world author visit slum e thousand agonize men woman child star live death hovel build earth rot wood creak totter foundation dark cave earthen floor line dried dung sleep odor death disease everywhere crutches rag head dress patchwork rag catch glimpse face horribly pockmark right eye molten grayish ball ring perimeter reddish sores author discuss oppose communism thought french british colonialist hat support communist want divvy agricultural land own oligarch imprison zionist beat street saw woman face exposed trollop sit stoop leg wide require effort shaven keep arab custom say apply class woman intend keep clean hot climate camp night author ask many men still awake late night pray no long past hour last prayer maybe visit relative author friend replied female ask translator look strangely socially match scratch louse sign author describe battle declare independence lack food several day author snick city line move detain take section city witness surrender loot jewish quarter also take reprint photograph defender surrender regard author note probably capital fall victim iniquity cabarets brothel apparently unconcerned homosexuality visit communist want liberate woman chador also unthinkable see walk arm lady waist hand odium penalty attach similar homosexual demonstration public men woman young boys author learn birthrate high eventually quote aim heel solidarity mean cause doom discuss den place soldier military adviser syrian government deeply explores theology politics author reveals many informative insight mind gem interested tire modern contemporary author back history never live much le reported accolade national bestseller decide travel chronicle war content travel herd western journalist report undercover great personal risk pose sympathizer real story close personal meet upper class meet arabs meet religious fanatic audacity travel alongside egyptian mercenary arab bent destroy nascent jewish infancy eat sleep travel pick lice ordinary fella also meet notable include verminous ever present camera sage visit witness begin refugee crisis finally end way story personal courage cross enemy line repeatedly manage step ahead suspicious official easily american undercover evans", "genres": ["Travel Writing"], "summary": "This rare book by John Roy Carlson gives an unconventional and detailed account of the war for Israel's independence. Carlson daringly goes undercover on all sides, and therefore provides a unique and captivating account of events. \r\n\r\n\"I left my country quite as uninformed, I am afraid, as are most Americans with respect to other peoples and other shores. But everywhere I went I sought to touch reality—always honestly, and always at first hand. Everywhere I clung close to the smells, the flora and fauna of native existence. In that spirit I have written of the Arabs among whom I lived. I found much good and much evil—evil acquired through a feudal order that, in my opinion, remains the Arab’s greatest enemy and his greatest barrier to emergence from the dark ages. I am grateful for Arab hospitality and the kindness I was shown, but a reporter, like a physician, must not remain blind to the ills plaguing his subject.\"", "asin": "1406756628", "rank": "5575264", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51pgxnYeikL.jpg", "country": "Egypt", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}