{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 152, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "This narrative about a fictitious woman photographer, whose life spans most of the twentieth century, is well worth while, with its mixture of fact and fiction and its focus on a woman who does something which for many years was not considered a woman's proper work."}, {"review_sentiment": 5.0, "review_text": "Very beautifully written, captivating story and well worth reading."}, {"review_sentiment": 4.0, "review_text": "This is a so much better novel than its soppy title suggests. Very convincingly penned in the first person female, it’s the 'autobiography' of Amory Clay, a middle-class girl from south-east England who becomes a world-class photographer. She will become famous for her war pictures – post-D-Day France and Vietnam – but she often has to support herself with routine fashion shoots and wedding assignments. In her mind she will be famous for her lovers – not too many, but all of them memorable. The man she marries turns out to be, like her father, psychologically scarred by the horrors of war.War and peace and love: perennial themes to which William Boyd, as he has before, does eloquent justice. SWEET CARESS is illustrated throughout with photos by (and of) Amory, not many of them creatively outstanding but all extraordinarily relevant to the narrative. How did this happen? Were they ‘found’ (and presumably doctored) or are they brilliant concoctions? They make a valuable contribution to the book, although  the writing is what really holds the reader in place.Of one of her lovers Amory writes: ‘Even two minutes in his company provided some comment or observation that would make me laugh or make me violently disagree with him and so those two minutes of my day were well spent as a consequence.’ That level of perception about ‘Any Human Heart’ (one of his best titles) is what makes William Boyd, consistently, a joy to read. SWEET CARESS (I so dislike the title) is a richly observed story about a life richly lived.[Reviewer is the author of THE BEXHILL MISSILE CRISIS]"}, {"review_sentiment": 4.0, "review_text": "A touching and riveting story of the life of a photographer's journey that spans three major wars. There were compelling accounts of the different encounters she experienced throughout her life. It was intriguing following the subject-matter and development of Amory Clay's black and white photographs."}, {"review_sentiment": 5.0, "review_text": "Absolutely fabulous!"}, {"review_sentiment": 5.0, "review_text": "Love his story telling - so compelling. Could not put down."}, {"review_sentiment": 5.0, "review_text": "Love William Boyd’s talent to write engaging, perfectly-plotted novels, often spanning decades and getting all the details,  the atmosphere, colours and shapes of things, right. Here, he presents a pseudo-(auto-)biography of Amory Clay, an early female professional photographer (1908-77),  who worked in the UK, US, Germany, Mexico, liberated France & Germany and Vietnam. Throughout, she stays the inquisitive young daughter of a man damaged for life by WW I, wondering about what war and true love feels like.WB describes Amory’s early,  professional and love life chronologically along with flashbacks from ‘her’ 1977 diary. Was she as iconic as Martha Gellhorn, a real-life war correspondent, also born in 1908? Or as versatile and famous as Paul Theroux’s fictional Maude Coffin Pratt in his 1978 novel “Picture Palace”? The polite answer is ‘hardly’, because a number of key pictures she took were confiscated or destroyed along with her camera. Also, Amory is remorseful about some pictures she could and should have taken. The quality of many pictures reproduced in this novel is rather poor, their provenance unclear, perhaps selected from albums of snapshots bought at car-boot sales?William Boyd’s ability to write from a female perspective and thus colouring viewpoints on love and war, is astounding. He did so too in “Brazzaville Beach” and two novels I have not read yet. The amount of imagination and energy he invests in dressing up a complicated story and getting all the details right is awesome, comparable to colleagues such as Annie Proulx and Anne Tyler. Great psychological portrait of a lovely, decisive and headstrong woman."}, {"review_sentiment": 4.0, "review_text": "No thank you."}, {"review_sentiment": 5.0, "review_text": "A great read. Takes you on epic journey. A life well lived. Hard to believe made up. Great characters and story."}, {"review_sentiment": 2.0, "review_text": "William Boyd is a wonderful writer and I have enjoyed almost every book of his that I have read. There are exceptions - Ordinary Thunderstorms for example - but overwhelmingly he manages to deliver a beautifully observed novel with popular appeal.I've recently read Sweet Caress, which again is a beautifully written novel. Unfortunately the skill of the text is undermined by the clumsiness of the photographs used to illustrate it. As well as a reader I'm a collector of photographs so I studied the photographs with interest. If these are the best that Amora Clay can produce then she's a rank amateur. To suggest that her pic \"Confrontation\" would have won an award during the Vietnam war era is ludicrous. There were so many wonderful, confrontational photographs taken during the period that this effort would have been consigned to the bin, where it belongs. It has few redeeming features.The photographs in the novel are so obviously bad that it spoilt my enjoyment of the beautifully wrought text. I was left wondering whether the author was having a joke at my expense or whether he genuinely thought the photographs were good. Or whether he just didn't care. Whatever the explanation having included the pics in the novel they have to be taken into account in any review. Without the pics I'd give the book four stars. With the pics it rates two stars."}]}, "authors": ["William Boyd"], "isbn": "1408867982", "longitude": 2.3514992, "periods": null, "title": "Sweet Caress: The Many Lives of Amory Clay", "word_cloud": "narrative fictitious woman photographer life span twentieth century well worth mixture fact fiction focus woman something year consider woman proper work very beautifully write captivate story well read much better soppy title suggest very convincingly pen first person female girl become photographer become famous war picture often support routine fashion shoot wed assignment mind famous lover memorable man marry turn father psychologically scar horror peace perennial theme eloquent justice illustrate photo creatively outstanding extraordinarily relevant narrative happen find presumably doctor brilliant concoction make valuable contribution write really hold lover write even minute company provide comment observation laugh violently disagree minute day well spend level perception best title make consistently joy dislike title richly observe story life richly live touching riveting story life journey span major war compel account different encounter experience life intrigue follow development black white photograph absolutely fabulous story tell compelling put talent write engage novel often span decade get detail atmosphere color shape thing right here present biography early female professional photographer work liberate stay inquisitive young daughter man damage life wonder war true love feel describe early professional love life chronologically flashback diary iconic war correspondent also bear famous fictional polite answer hardly number key picture take confiscate destroy camera also remorseful picture take quality picture reproduce rather poor provenance unclear perhaps select album snapshot buy sale ability write female perspective thus color viewpoint war astound novel yet amount imagination energy invests dress complicate story get detail right awesome comparable colleague psychological portrait lovely decisive headstrong woman thank great epic journey life well live believe make character story wonderful writer enjoy almost exception ordinary example overwhelmingly manage beautifully observe popular recently beautifully write skill text undermined clumsiness photograph use illustrate well collector photograph study photograph interest best produce rank amateur pic war era ludicrous wonderful confrontational photograph take period effort bin belongs redeem photograph obviously bad spoil enjoyment beautifully work text leave wonder author joke expense genuinely think photograph good care explanation include pic take account review pic give star pic rate star", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Amory's first memory is of her father doing a handstand. She has memories of him returning on leave during the First World War. But his absences, both actual and emotional, are what she chiefly remembers. It is her photographer uncle Greville who supplies the emotional bond she needs, and, when he gives her a camera and some rudimentary lessons in photography, unleashes a passion that will irrevocably shape her future.\r\n\r\nA spell at boarding school ends abruptly and Amory begins an apprenticeship with Greville in London, living in his flat in Kensington, earning two pounds a week photographing socialites for fashionable magazines. But Amory is hungry for more and her search for life, love and artistic expression will take her to the demi monde of Berlin of the late 1920s, to New York of the 1930s, to the Blackshirt riots in London and to France in the Second World War where she becomes one of the first women war photographers. Her desire for experience will lead Amory to further wars, to lovers, husbands and children as she continues to pursue her dreams and battle her demons.\r\n\r\nIn this enthralling story of a life fully lived, William Boyd has created a sweeping panorama of some of the most defining moments of modern history, told through the camera lens of one unforgettable woman, Amory Clay. It is his greatest achievement to date.\r\n\r\n\"Clever and compelling . A thrilling piece of craft, a meditation on work and life and everything in between.\" The Guardian", "asin": "1408867982", "rank": "5668321", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51sO4K6CtmL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}