{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 45.5202471, "ratings": {"num_ratings": 342, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Amazing book, read it."}, {"review_sentiment": 5.0, "review_text": "a must read book classic."}, {"review_sentiment": 3.0, "review_text": "Interesting reading"}, {"review_sentiment": 4.0, "review_text": "I've )avoided(  Leguin for 40 years.  I was wrong. Thoughtful and open ended. Neat endings but open to interpretation. If  the Zen mode of story telling was not deliberate it's still effective. Not your usual change the past time travel epic."}, {"review_sentiment": 4.0, "review_text": "This was a fascinating read even though I’m pretty sure some of it went right over my head. For a short book, it certainly packs a punch and gets right into George’s head. His dreams have the power to change reality, which is why he so desperately wants to stop dreaming, but once Dr. Haber realizes what’s in front of him he takes advantage of the situation. He implants dream “suggestions”  into George’s mind but to George, everything is very literal so the end result is not always what the doctor had in mind.People die or cease to exist. They come back. Aliens can’t communicate. Then they can, but only after they become turtles. Check out that cover. Turtles!This is a crazy book but I could easily read it again because there’s so much I missed the first time around. The book club I belong to discussed it last week and it was a good discussion. Apparently, it was also made into a movie. Has anyone read the book or seen the movie?"}, {"review_sentiment": 5.0, "review_text": "I first encountered Ursula Le Guin as a teenager in her Earth Sea Trilogy, a wonderful tale of magic with deeper levels I totally missed in my initial reading. The Lathe of Heaven is for a more mature reader dealing with themes like responsibility, hubris, compassion and love. This is the second time I’ve read the novel and it won’t be the last.When the novel opens George Orr is an unassuming man with a problem. He’s convinced his dreams can change reality and he’s taking illegal drugs to keep him from hurting people while he sleeps. He’s put under the care of Dr. William Haber who’s skepticism quickly disappears as he begins to unethically abuse Orr’s gift through hypnotism and an experimental machine to remake the world into a better place where his own importance is recognized and the big problems—war, racism, overpopulation, etc.—don’t exist anymore. But Orr’s power works through the unconscious and Haber never quite gets the results he wants—not that he blames himself. Success is due to his genius, failure is the fault of the man he’s using his legal hold over to coerce into changing the world.Orr’s effort to get legal help introduces the third and most interesting character to the story. Heather LeLache is a lawyer who becomes interested in Orr’s case and actually sees the world rewritten while she observes his therapy. The shared experience brings Orr and LeLache closer but can their growing friendship—hidden from Haber—survive an ever-rewritten world.The ending of this novel is a painful one filled with growth and horror, but not without hope. This one will make your head spin."}, {"review_sentiment": 5.0, "review_text": "love this author"}, {"review_sentiment": 4.0, "review_text": "This was a great read and a new twist on science  fiction.  Got a little bit long about half way through  but well written."}, {"review_sentiment": 4.0, "review_text": "What a great premise! The prose is sound, even poetic. Ursula K. Le Guin brings in her knowledge of the Tao Te Ching as well. An interesting read."}, {"review_sentiment": 5.0, "review_text": "Imagine that your dreams had the ability to alter reality. To change not only the present, but also the past and (effectively) the future. And every time you dreamed, you might wake up to a new home, a different job, a changed city, and possibly erase the existence of people you'd known, including loved ones.Then imagine being so frightened by your ability that you start seeing a psychiatrist - and he, upon realizing your \"powers,\" uses you to manipulate the world to his liking.That premise didn't just draw me into Ursula K. Le Guin's THE LATHE OF HEAVEN. Instead, it reeled me in and let me dangle in the wonder, terror, and sheer inventiveness of the story. It did take some time to fall into LATHE's rhythm; there are a fair number of long paragraphs of scientific explanations and other details, both in the dialogue and in the narrative. But once I did, I was utterly absorbed in its shifting landscapes and histories, the hard-to-believe truths and cleverly disguised lies, and George's struggle to find a way to simply fall asleep knowing that he hadn't subconsciously tinkered with the world. And the more that his psychiatrist, Dr. Haber, toyed with George's abilities with every therapy session, the more difficult it became to put this book down.Admittedly LATHE is a bit dated now (it was first published in 1971, with the story set in 2002). But I found it easy enough to re-imagine George's futuristic Portland, Oregon with a 2017 basis. The themes, though, are the real blood and marrow of this book, because they're still relevant today. Humanity's self-destructive behavior, the delicate nature of the patient-doctor relationship, our dependence on medication, and the perils of power... And since it's a UKLG book, I knew I could count on the wisdom, wit, and lyricality that's always present in her writing. Have I said before that I love Ursula's prose? Because I do. And in THE LATHE OF HEAVEN, it gives the conflicts more weight, her insights more depth, and her small cast of characters more complexity.I think THE LEFT HAND OF DARKNESS has finally found competition for the title of My Favorite Science Fiction Book by UKLG."}]}, "authors": ["Ursula K. Le Guin"], "isbn": "1416556966", "longitude": -122.6741949, "periods": ["2000s"], "title": "The Lathe Of Heaven: A Novel", "word_cloud": "amaze interest reading avoid year wrong thoughtful open end ending open interpretation mode story tell deliberate still effective not usual change time travel epic fascinating even pretty sure go right head short certainly pack punch get right head dream power change reality desperately want dream realize front take advantage situation implant dream suggestion everything literal end result always doctor die cease exist come back communicate then turtle cover crazy easily much miss first time club belong discuss last week good discussion also make movie anyone see movie first encounter teenager wonderful tale deeper level totally miss initial read mature deal theme responsibility hubris compassion love second time open unassuming man problem convince dream change reality take illegal drug hurt people sleep put care skepticism quickly disappear begin unethically abuse gift hypnotism experimental machine remake world better place importance recognize big racism overpopulation exist anymore power work unconscious never quite get result blame due genius failure fault man use legal hold coerce change effort legal help introduces third interesting character story lawyer becomes interested case actually see world rewritten observe shared experience bring closer grow end painful fill growth horror hope make head spin love author great new twist science fiction little bit long half way well write great premise prose sound even poetic bring knowledge well interesting dream ability alter reality present also past effectively future time dream new home different job change city possibly erase existence people know include loved imagine frighten ability start see psychiatrist realize power us manipulate world premise draw instead reel dangle terror sheer inventiveness story time rhythm fair number long paragraph scientific explanation detail dialogue narrative utterly absorb shift landscape history truths cleverly disguise lie struggle way simply asleep know subconsciously tinker world psychiatrist toy ability therapy session difficult become bit date first publish story set find easy enough futuristic basis theme real blood marrow still relevant today behavior delicate nature relationship dependence medication peril power know wisdom wit typicality always present write have say love ursula prose give conflict weight insight depth small cast character think finally find competition title", "genres": ["Fiction & Literature", "Science Fiction"], "summary": "A classic science fiction novel by Ursula K. Le Guin, one of the greatest writers of the genre, set in a future world where one man’s dreams control the fate of humanity.\r\n\r\nIn a future world racked by violence and environmental catastrophes, George Orr wakes up one day to discover that his dreams have the ability to alter reality. He seeks help from Dr. William Haber, a psychiatrist who immediately grasps the power George wields. Soon George must preserve reality itself as Dr. Haber becomes adept at manipulating George’s dreams for his own purposes.\r\n\r\nThe Lathe of Heaven is an eerily prescient novel from award-winning author Ursula K. Le Guin that masterfully addresses the dangers of power and humanity’s self-destructiveness, questioning the nature of reality itself. It is a classic of the science fiction genre.", "asin": "1416556966", "rank": "31385", "city": "Portland", "image": "https://images-na.ssl-images-amazon.com/images/I/41EQ3LzZg-L.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}