{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 11, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "I've used this book in several courses of Race, Sport, & American Culture. A wonderful insider's view to one of the Nation's most storied Olympics."}, {"review_sentiment": 4.0, "review_text": "This book was recommended by a friend or I might have missed reading it.  It is a good read about the Mexico Olympics with a stunning disclosure about an atrocity committed by the Mexican government."}, {"review_sentiment": 4.0, "review_text": "1968 was arguably the most tumultuous year of our nation. All of our social changes and craziness played out on a world stage in Mexico City. Amazing physical feats were sometimes overshadowed by the personal and social struggles of those athletes. Perhaps it sparked the real rebirth of our modern Olympics.I love history when told through the vehicle of story: personal story. As a rather recent career changer late in my working career—as a teacher—I have found that these stories really touch my students who read the book, especially those who are turned off by history and care only about sports. They simply do not realize that sports are part of our history and reflect the times.I would highly recommend this book for young adults who would otherwise care only about sports to learn more about the world and their own history."}, {"review_sentiment": 4.0, "review_text": "The year 1968 has been rather thoroughly scrutinized by authors over the year. After a buildup throughout the Sixties, we entered 1968 as if we were entering some sort of funhouse, not knowing what would happen as we passed through and got to the exit.The tensions of the time were very apparent in sports, with the civil rights and women's movements gained velocity by the second, it seemed. Take a changing society, and mix it with an amateur athletic bureaucracy that didn't accept change easily, and you have the makings for fascinating confrontation.That was the case for the 1968, particularly when it came to the Summer Olympics in Mexico City. And that's the backdrop for Richard Hoffer's frequently fascinating book, \"Something in the Air.\"The American Olympic team goes under the microscope here, and Hoffer must have been filled with glee as he went through the cast of characters that converged south of border that fall. A book like this relies on the athletes and the stories, and Hoffer found a bunch of good ones.The author focuses on the United States track and field team. We had sprinters like Tommie Smith and John Carlos, forever remembered for their wordless protest about conditions back home while on the podium during the National Anthem at the medal ceremony. Gloved fists in the air and heads down, it became a remarkable moment almost instantly. The two sprinters had been involved in talk of a boycott of the Games beforehand; their attendance, performance and action proved much more effective as support for their cause. Smith and Carlos were great stories in their own right, overcoming much to rank as the world's best.The other stories on the track team are good too. Dick Fosbury invented a whole new way of jumping over a bar in the high jump. Jim Ryun ran the race of his life in the 1,500 meters, only to be remember for losing to Kip Keino. The women's track team, which basically consisted of the Tennesee State squad, cleaned up at the podium despite oldfashioned beliefs that women shouldn't run very far.The other sports come up as well, although they have a secondary role. The most interesting story there might belong to George Foreman, who first burst onto the national scene in Mexico City. Foreman became something of an establishment hero for waving an American flag after winning a gold medal. While most thought it was a counterpoint to the Smith/Carlos protest, Foreman says today that his action was his own protest toward prejudice against American boxers by Olympic judges. And I particularly liked the portions on the Harvard crew team, filled with bright, questioning intellects who were determined to have a good time along the way.Hoffer covers all of this with a sharp, intelligent eye. His observations on the times and on the Games are always on target; I particularly liked his description of the Olympics as something of a mortuary for old sports (equestrian events? Greco-Roman wrestling?).The book's only flaw is that there are a few small factual errors that pop up along the way. Some high jumpers become long jumpers and vice verse, and a few lessons about geography and distance conversion (centimeters to inches, for example) would have been useful.While those slip-ups prevented a five-star rating, this is the type of book that almost forces the reader to gulp down in big swallows. \"Something in the Air\" fills in the gaps of an already-fascinating event, and makes it more compelling in hindsight. That's about all you can ask from any book."}, {"review_sentiment": 4.0, "review_text": "A great book.  I lived through those times, and the book changed my attitudeabout the events.  At the time, I, like a lot of americans, thought the atheleteswere selfish, misdirected, and anti american.  Jim Ryan was always my hero,and he came through as a reasonable, thoughtful human being."}, {"review_sentiment": 4.0, "review_text": "My review was rejected and will not be published.My only response is the following.  If my submission is not satisfactory, or does not make the grade, PLEASE DISCONTINUE MAKING REQUESTS OF ME TO WRITE A REVIEW.  As you survey my purchases you can see that I have punched MANY books.  I have not read all of them.  If you want a more scholarly review ask"}, {"review_sentiment": 4.0, "review_text": "I had to read this book for an African American Diaspora Studies class, and this is a great read if you're like me and despise reading historical texts. The author presents the information in a way that captures your attention, raising awareness to the hypocrisy and contradicting nature of the 1968 Olympics. The author does a great job in explaining the story behind this historical event and there are moments that make you laugh. I would definitely recommend this book for anyone to read. The only negative is the amount of names the author talks about, but at the same time that's history for you."}, {"review_sentiment": 2.0, "review_text": "The Washington Post's review (above) gives a full overview of the tumultuous events and fascinating personalities described in \"Something In The Air\".  To Richard Hoffer's credit, he interviewed a great number of them and is able to provide readers with many interesting anecdotes. But... then one begins to encounter numerous factual errors (not to mention many typos and carelessly written sentences). The latter are merely annoying; the former, the factual errors, are startling coming from a long-time Sports Illustrated writer.  And they make one wonder if he was equally careless - and simply inaccurate - in recounting the recollections of those he interviewed.  Examples: He credits Ray Norton with a \"100 meter time of 9.3 seconds\".  Nope, 100 yards.  He says Jim Ryun was 5 meters behind Keino at the 800 mark in the 1,500 and says \"the race had gotten away from him.\"  Yes, it had - but because he was actually 18 meters back, according to Track and Field News's report on the race. Five meters would not have been a big gap, as a sportswriter surely should know.  He writes at length about Dick Fosbury's winning performance in the high jump and says that the first marathoner, Mamo Wolde, was just entering the stadium as Fosbury began his approach. His point: The appearance of the marathon winner usually got huge applause but did not in this case because of the crowd's focus on Fosbury. But Hoffer goes on to describe the reaction of Kenny Moore, the American who finished over 9 minutes behind Wolde. He says Moore was coming on the track when Fosbury jumped and reacted with delight to the crowd's cheering for Fosbury's leap.  So... Fosbury's run-up took over 9 minutes?  Concerning Fosbury's revolutionary flop style of jumping, Hoffer says: \"Neither his jump nor the straddle was inherently superior.\" Yet every single world class jumper for decades has used only the \"Flop\" as have virtually all jumpers at every level.  He has the high jump bar going up \"quarter inch by quarter inch\" which he says is \"actually 5 centimeters\".  But, as his own context on the same page shows, each 5 centimeter elevation was close to 2 inches.  In one sentence Hoffer has Lynn Davies winning gold in the broad jump in '64 and Ralph Boston winning silver - and Igor Ter Ovanesian beating Boston there by 4 centimeters. Where did Ter Ovanesian place? 1 1/2?  He mentions \"pole vaulter John Thomas\" - who was actually a great high jumper -and \"Bob Beamon the high jumper\" even though he later writes at length about Beamon's awesome long jumping.  He says \"Bob Beamon's father was in Sing Sing when he was conceived....\"  Well, not unless they had conjugal visits in those days, which I seriously doubt.  He locates San Jose as north of Sacramento.  He twice mentions the great '50s basketball player Paul Arizon - a career sportswriter who doesn't know how to spell the name of an all-time great: Arizin.  In describing the anchor leg of the 4x200 relay in swimming he says: \"So what was supposed to be a Spitz-Schollander duel....\" - which would have been quite a feat since they were both on the U.S. team.  These are some of those I caught.  How many did I miss?  Why didn't Hoffer, or someone at his publisher with a little knowledge of sports, proofread this book. And, as I said, was he as careless when he reported the recollections of Beamon, Carlos, et al?  I'm disappointed since I followed the events of that year closely.  I wrote a letter to Track and Field News early in the year sympathising with those considering a possible boycott. (It's available on-line, plus I still have the issue from '68 - not a prettied up memory.) I began this book with high expectations. Some were met but the inexcusable lack of fact-checking and proofreading made me doubt the over-all accuracy of Hoffer's reporting."}, {"review_sentiment": 4.0, "review_text": "I got interested in this book while reading an excerpt in a recent issue of Sports Illustrated.  I had extremely high hopes for this book, but was somewhat disappointed.  Being born in 1970, I obviously have no personal recollection of the 1968 Olympics, but long remembered hearing about Bob Beamon's historic long jump and Tommie Smith and John Carlos' defiance on the medal stand.  The opportunity to learn even more about the Mexico City against the backdrop of the turbulence and upheaval that was 1968 was irrestible.My main criticism of Hoffer's book is that it is quite uneven.  There are some strong parts, specifically the chapters about Fosbury, Smith and Carlos.  On the other hand, his coverage of Beamon and Foreman did not provide nearly the depth and dimension that I expected and was a letdown when compared to the previously mentioned athletes.  By far the most enlightening part of the book centered on Avery Brundage, an American who was head of the IOC.  Brundage tried to maintain iron-fisted control of the Games and keep absolute order in what was the first Olympics in a developing nation --- and before the vast commercialization that the Olympics have become today.Overall, Hoffer's book is a solid contribution, but has enough holes to only be 4 stars.  It is a quick read and contains enough back stories to be worth the time."}, {"review_sentiment": 4.0, "review_text": "Well lets start out by counting  how many political things were happenning that summer that had nothing to do with the actual sport of competing with other nations  best track and Olympic stars in various  sports such as boxing with a young George Foreman walking around with an American flag.Great human interest stories on the historic two weeks of competition and reviews of winners as well as the losers who trained their whole life for Olympic glory!Its a facinating read for the olympic fan as well as stories of hyuman sacifice and training. i know that i could not put the book down as a quick paced style of writing.Run for the gold and pick it up today."}]}, "authors": ["Richard Hoffer"], "isbn": "1416588949", "longitude": -99.1333416, "periods": ["1900s"], "title": "Something in the Air: American Passion and Defiance in the 1968 Mexico City Olympics", "word_cloud": "use several course wonderful insider view nation storied recommend friend miss read good stunning disclosure atrocity commit mexican government arguably tumultuous year nation social change craziness play world stage physical feat sometimes overshadow personal social struggle athletes perhaps sparked real rebirth modern love history tell vehicle story personal story rather recent career changer late working find story really touch student especially turn history care sport simply sport part history reflect highly young adult otherwise sport world history year rather thoroughly scrutinize author year buildup sixty enter enter sort fun house know pass get tension time apparent sport civil right woman movement gain velocity second seem change society amateur athletic bureaucracy change easily making fascinate case particularly come frequently fascinate team go microscope glee go cast character converge south border fall like relies athletes story find bunch good author focus track field team sprinter forever remember wordless protest condition back home podium medal ceremony fists air head become remarkable moment almost instantly sprinter involve talk boycott beforehand attendance performance action prove much effective support cause great story right overcome much rank world stories team good invent whole new way jump bar high jump run race life meter remember lose woman track team basically consist squad clean podium old fashioned belief woman sport come well secondary role interesting story first burst national scene become establishment hero wave flag win gold medal think counterpoint protest say today action protest prejudice boxer judge particularly like portion crew team fill bright question intellect determine good time cover sharp intelligent eye observation time always target particularly like description mortuary old sport equestrian event wrestle flaw small factual error pop along way high jumper become long jumper vice verse lesson geography distance conversion centimeter inch example rating type almost force gulp big swallow fill gap event make compel hindsight ask great live time change event time like lot american think atheleteswere selfish misdirect anti always hero come reasonable thoughtful human review reject response follow submission satisfactory make grade survey purchase see punch want scholarly review ask african class great despise read historical text author present information way capture attention raise awareness hypocrisy contradict nature author great job explain story historical event moment make laugh definitely anyone negative amount name author talk time history review give full overview tumultuous event fascinate personality describe credit interview great number able provide reader many interesting anecdote begin encounter numerous factual error mention many typos carelessly write sentence latter merely annoy former factual error startle come writer wonder equally careless simply inaccurate recount recollection interview credit meter time second yard say meter say race actually meter accord report race meter big gap sportswriter surely know write length win performance high jump say first marathoner enter stadium begin point appearance marathon winner usually get huge applause case crowd focus go describe reaction finish minute say come track jump react delight crowd cheer leap take minute concern revolutionary flop style jump say jump straddle inherently superior single world class jumper decade use virtually jumpers level high jump bar go quarter inch quarter inch say actually centimeter context page show centimeter elevation close inch sentence win gold broad jump win silver beat centimeter ovanesian place mention pole vaulter actually great high jumper high jumper even later write length awesome long jump say father sing conceive conjugal visit day seriously locate north twice mention great basketball player career sportswriter know spell name great describe anchor leg relay swimming say so supposed duel quite team catch many miss someone publisher little knowledge sport proofread say careless report recollection al disappoint follow event year closely write letter early year sympathize consider possible boycott available still prettied memory begin high expectation meet inexcusable lack proofread make doubt accuracy reporting get interested reading excerpt recent issue extremely high hope somewhat disappointed bear obviously personal recollection long remember hear historic long jump medal stand opportunity learn even backdrop turbulence upheaval main criticism quite uneven strong part specifically chapter hand coverage provide nearly depth dimension expect letdown compare previously mention athlete far enlighten part center head try control absolute order first develop nation vast commercialization become solid contribution enough hole star quick contain enough back story time let start count many political thing happen summer nothing actual sport compete nation best track star various sport box young walk human interest story historic week competition review winner well loser train whole life glory fascinate olympic fan well stories human sacrifice training know quick pace style gold pick today", "genres": ["History", "Sport"], "summary": "IN SOMETHING IN THE AIR, Richard Hoffer has written a gripping sports narrative that brilliantly tells the individual stories of the unforgettable athletes who gathered in Mexico City in 1968, a year of dramatic upheaval around the world.\r\nThose Olympics caught the revolutionary spirit of the times. In these pages, Hoffer captures the turbulence and offbeat heroism of that historic Olympiad, which was as rich in inspiring moments as it was drenched in political and racial tension. This was a year that saw the assassinations of Martin Luther King Jr. and Robert F. Kennedy; racial rioting in the nation's big cities; the upheaval at the Democratic National Convention in Chicago; growing revulsion toward the war in Vietnam; an inspiring bid for freedom in Czechoslovakia, which was crushed by Soviet tanks; and student demonstrations seemingly everywhere, including, fatefully, in Mexico City itself.\r\n\r\nRacial tensions were high on the U.S. Olympic team, where inflamed black athletes had to choose between demands for justice on one hand and loyalty to country on the other. No one had easy choices.\r\n\r\nAlthough the basketball star Lew Alcindor (later to become the great Kareem Abdul-Jabbar) decided not to participate, heavyweight boxer George Foreman not only competed and won a gold medal, but waved a miniature American flag at foreign judges. The sprinters Tommie Smith and John Carlos became as famous for their raised-fist gestures of protest as their speed on the track. No one was prepared for Bob Beamon's long jump, which broke the world record by a staggering twenty-two inches. And then there was Dick Fosbury, the goofball high jumper whose backward, upside-down approach to the bar (the \"Fosbury Flop\") baffled his coaches while breaking records. Though Fosbury was his own man, he was apolitical and easygoing. He didn't defy authority; he defied gravity.\r\n\r\nThese were a complicated Olympics -- no longer a reliably reassuring sporting event, a respite from world events. Not only was the 1968 Olympics a forum for youthful protest, it was a platform for the lingering racism that divided a nation. The generational contest that was working itself out in the culture back home was exploding in Mexico City. Everything was up for grabs. Professionalism was suddenly overtaking this last outpost of amateurism, the media was piggybacking a newly inflated spectacle, nations tussled as usual for international attention. And all the while, a bunch of kids were pitting their interests against the world's, weighing performance against politics, in one of the most exciting sporting events of the twentieth century.\r\n\r\nWitty, insightful, and filled with human drama, Something in the Air mixes Shakespearean complexity with Hollywood sentimentality, sociopolitical significance, and the exhilarating spectacle of youthful physical prowess. It is a powerful, unforgettable tale that will resonate with sports fans and readers of social history alike.", "asin": "1416588949", "rank": "2130732", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/51LOqcT0EdL.jpg", "country": "Mexico", "story_arc": ["Tragedy", "Things only get worse"]}