{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 79, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "An interesting look at the opportunities for unmarried women in Italy in the 17th century"}, {"review_sentiment": 5.0, "review_text": "The story was very interesting right from the beginning. I liked the fact that it was about current times and referred back to historical times. I was a bit disappointed at the historical story line at the end, but I guess it's loosely based on true events, so you really can't change that. I would recommend this book for people who enjoy stories about historical Italy."}, {"review_sentiment": 5.0, "review_text": "great novel full of detail"}, {"review_sentiment": 5.0, "review_text": "I enjoyed the book very much. Looking forward to reading more of Ms. Phillip's books."}, {"review_sentiment": 5.0, "review_text": "I loved the shifts from the past to the present Venice. The characters are vividly introduced and the plots are spellbinding. It's a hard book to put down once opened."}, {"review_sentiment": 4.0, "review_text": "Intriguing and yet also in parts too contrived."}, {"review_sentiment": 3.0, "review_text": "I think I would have liked this book more if it had remained in the 1600’s.  The characters were more interesting and the story itself seemed to flow much better than when the author switched to the present day.  Unfortunately on the whole this one didn’t quite pull it together."}, {"review_sentiment": 3.0, "review_text": "I'm not a huge fan of the novels that follow multiple threads, but this one was done fairly well.I found the political intrigue in Venice a bit hard to follow (especially for a \"summer read\"), and based on what other reviewers have said, I quit trying to follow every nuance and detail, and sort of just skimmed over those parts.I was more interested in the present time story of the chaperone/historian and her various challenges & relationships.The book did get off to a slow (and dull/uninspired) start, and I almost gave up, but I decided to give it just a bit more of a chance and I'm glad I changed my mind.  Somewhere about half way through (or was it 2/3 ?), not only did the pace pick up, but it seemed like the writing became more inspired, the characters became more interesting/dimensional  - and I started noticed touches of light humor here & there.  All this combined to make the latter half of the book a much better read, so I'm glad I stuck with it.I think the book still suffers a bit of an identity crisis - it's certainly not serious history, but rather, historical fiction-like.  It's got a little bit of romance, but it's definitely not in the romance category.  In the latter part of the book, it has moments where it resembles a good \"chick flick\" (that's the best way I have of describing that type of book), but then the moment passes.  Then there are scenes where it's starting to read like a \"DaVinci Code\" type novel, but then it changes again.  All of these a good directions to go - but perhaps the book suffers a bit from being just a little bit of everything without really doing any one thing extremely well.All in all, a good way to pass the time, but not one I'd go out of my way to recommend.  I am interested enough in the author to read her other book, to see what else she has to offer."}, {"review_sentiment": 5.0, "review_text": "This gets five stars because it is a mystery that flashes back to the past but set in the present. History professors dig into primary source archives to discover the truths about the past..  being a female I am always looking for female leading characters. This has it all."}, {"review_sentiment": 4.0, "review_text": "Although I found myself starting to drift away near the middle of the book, I did finish it. The characters do grow on you. Alessandra's story contrasted nicely with the modern day romances going on. This book is a light and frothy read with just enough seriousness to get involved in."}]}, "authors": ["Christi Phillips"], "isbn": "1416527389", "longitude": 12.3345898, "periods": ["1600s", "2000s", "Recent Releases"], "title": "The Rossetti Letter", "word_cloud": "interesting look opportunity unmarried woman century story interesting right beginning like fact current time refer back historical time bite disappointed historical story line end guess loosely base true event really people story historical great full detail enjoy much look forward read love shift past present character vividly introduce plot spellbind hard put intrigue yet also part contrive think remain character interest story seem flow much better author switch present day whole quite pull together huge fan novel follow multiple thread do fairly find political intrigue bit hard follow especially summer base reviewer say quit try follow nuance detail sort skim interested present time story various challenge get slow start almost give decide give bit chance glad change mind half way pace pick seem write become inspired character become start noticed touch light humor combined make latter half much better glad stick still suffers bite identity crisis certainly serious history rather historical get little bit romance definitely romance category latter part moment resemble good chick flick best way describe type moment pass then scenes start type change good direction go perhaps suffers bit little bit everything really thing extremely good way pas time go way recommend interested enough author see else offer get star mystery flash back past set present professor dig primary source archive discover truths female always look female lead character find start drift away middle finish character grow story contrast nicely modern day romance go light frothy enough seriousness get involve", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Book 1 of 2 in the Claire Donovan Series\r\n\r\nIn this captivating debut, Christi Phillips blends fact and fiction, suspense and sensuality into a vibrant, richly imagined novel in which a modern historian uncovers a courtesan's secret role in a shocking conspiracy of seventeenth-century Venice. \r\n\r\nClaire Donovan always dreamed of visiting Venice, though not as a chaperone for a surly teenager. But she can't pass up this chance to complete her Ph.D. thesis on Alessandra Rossetti, a mysterious courtesan who wrote a secret letter to the Venetian Council warning of a Spanish plot to overthrow the Venetian Republic in 1618. Claire views Alessandra as a heroine and harbors a secret hope that her findings will elevate Alessandra to a more prominent place in history. But an arrogant Cambridge professor is set to present a paper at a prestigious Venetian university denouncing Alessandra as a co-conspirator -- a move that could destroy Claire's paper and career. \r\n\r\nAs Claire races to locate the documents that will reveal the courtesan's true motives, Alessandra's story comes to life with all the sensuality, political treachery, and violence of seventeenth-century Venice. Claire also falls under the city's spell. She is courted by a handsome Italian, matches wits with her academic adversary, bonds with her troubled young charge, and, amid the boundless beauty of Venice, recaptures the joy of living every moment. . . \r\n\r\nLayering wit and warmth into her portraits of two very different yet equally dynamic heroines, Christi Phillips shifts effortlessly between past and present in a remarkable novel that is at once a love story, a mystery, and an intriguing historical drama. Filled with beautifully rendered details of one of the world's oldest and most magical cities, The Rossetti Letter marks Phillips's debut as a writer of extraordinary skill and grace.", "asin": "1416527389", "rank": "1200807", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51DQzLZscdL.jpg", "country": "Italy", "story_arc": ["Tragedy", "Things only get worse"]}