{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 55.7507178, "ratings": {"num_ratings": 295, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "This book lived up to it's reputation.  Well written and quite descriptive of how the \"justice\" of the communist party is administered."}, {"review_sentiment": 5.0, "review_text": "Do ends justify the means, or should the means be justified in and of of themselves?I think that is the most pertinent question this book should make us ponder. The life of the protagonist, who earlier believed the former, but realized over time the truth in the latter, is what this book presents.Of course, I have heard some people say that Animal Farm is a book about pigs on a farm; and likewise the point of this book too will be missed, if you don't have some background of the Stalinist takeover of Russia."}, {"review_sentiment": 4.0, "review_text": "Great Kafkaesque novel."}, {"review_sentiment": 4.0, "review_text": "Fantastic.  I had never heard of it before reading Fahrenheit 451.  This was the inspiration for that book.  A very unique perspective on post revolution USSR."}, {"review_sentiment": 5.0, "review_text": "The debates between Rubashov and Ivanov are the most interesting part of the story. We also see how there is no room for humanity - only cold logic."}, {"review_sentiment": 5.0, "review_text": "I highly recommend this book to anyone that has the slight inclination towards communism."}, {"review_sentiment": 5.0, "review_text": "I really enjoyed the book. It's a pretty quick read, but has great depth. The story revolves around the fate of an original member of the revolution who is no longer revolutionary enough."}, {"review_sentiment": 5.0, "review_text": "Good copy of a great book."}, {"review_sentiment": 2.0, "review_text": "Pretty drab.  Could not get through it."}, {"review_sentiment": 3.0, "review_text": "Yes, this is one of the Modern Library 100 Best.  That may be justified but its history as a screed against totalitarian Russia in the 1940s or by the fact that it gives the reader a pseudo Russian novel in a mere 290 pages.  We certainly need to be reminded of the evils of totalitarians, but lots of options exist.  As a novel about the darkness of Russia, Darkenss is more of a cartoon version.  If you want to experience a Russian novel, read (or listen to) Dostoyevsky (e.g., Crime & Punishment, The Idiot), Tolstoy (e.g., Anna Karenina, War & Peace).  I read Darkness a month ago and have forgotten any emotion it evoked.  I read Anna 42 years ago and it is still with me.  If you want to rage against Soviet totalitarianism, read The Gulag by Solzhenitsyn.  Bonus - if you slag all teh way through all three volumes of the Gulag, you may be the only person who ever did."}]}, "authors": ["Arthur Koestler"], "isbn": "1416540261", "longitude": 37.6176606, "periods": ["1900s"], "title": "Darkness at Noon", "word_cloud": "live reputation write quite descriptive justice communist party administer end mean mean justified think pertinent question make life protagonist earlier believe former realize time truth latter course hear people say animal pig farm likewise point miss takeover fantastic never hear read inspiration unique perspective post revolution debate interesting part story also see room humanity cold logic highly recommend anyone slight inclination towards communism really enjoy pretty quick great depth story revolve fate original member revolution longer revolutionary enough good copy great drab history screed totalitarian fact give pseudo mere page certainly need remind evil totalitarian lot option exist cartoon version want experience listen month ago forgotten emotion evoke year ago still want rage soviet totalitarianism slag the way volume person ever", "genres": ["Fiction & Literature", "WWII"], "summary": "Originally published in 1941, Arthur Koestler's modern masterpiece, Darkness At Noon, is a powerful and haunting portrait of a Communist revolutionary caught in the vicious fray of the Moscow show trials of the late 1930s.\r\n\r\nDuring Stalin's purges, Nicholas Rubashov, an aging revolutionary, is imprisoned and psychologically tortured by the party he has devoted his life to. Under mounting pressure to confess to crimes he did not commit, Rubashov relives a career that embodies the ironies and betrayals of a revolutionary dictatorship that believes it is an instrument of liberation.\r\n\r\nA seminal work of twentieth-century literature, Darkness At Noon is a penetrating exploration of the moral danger inherent in a system that is willing to enforce its beliefs by any means necessary.", "asin": "1416540261", "rank": "31048", "city": "Moscow", "image": "https://images-na.ssl-images-amazon.com/images/I/51S2QRqPqqL.jpg", "country": "Russia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}