{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 40.4862174, "ratings": {"num_ratings": 332, "rating": 4.2, "reviews": [{"review_sentiment": 3.0, "review_text": "I liked the tv show better even though it has become \"the same old,same old\"."}, {"review_sentiment": 5.0, "review_text": "All of her books are fantastic. I can't get enough of them!"}, {"review_sentiment": 5.0, "review_text": "Great book."}, {"review_sentiment": 4.0, "review_text": "What the author does with this series:  Kathy Reichs started off slow but gets better and better. This is part of the series called the <i>Tempe Brenner – Forensic Anthropologist</i>.  This paragraph applies to all books in this series.  Tempe is a anthropologist who works for medical examiners in Montreal, Quebec and Charlotte North CarolineEven though the books are often very detailed in both location and the examination of the remains, the story often moves faster than you expect.Do you need to read this series in order:  YES or you miss out on too much of the back stories.Triggers: This is a book about medical examiners at its core, so lots of references to dead bodies, some are described in strong detail (in a forensic way).Our anthropologist ends up in some life threatening situations and on a couple of occasions in the series, animals are killed, sometimes gratuitously.  Relatives of Tempe often in up wounded as the bad persons try to get to her through her family.The skeleton is that of a young girl, no more than fourteen years old - and forensic anthropologist Dr Temperance Brennan is struggling to keep her emotions in check. Coroner Yves Bradette is being evasive, insisting the bones are ancient and of no interest. But it doesn't quite add up, and a frustrated Tempe is convinced that Bradette is hiding something. It's not Tempe's case; she's overwhelmed with more urgent work in the lab. But the nagging in her subconscious won't let up. A memory triggered, deep in her hindbrain - the disappearance of a childhood friend; no warning, no explanation. Working on instinct, Tempe takes matters into her own hands. But she couldn't have predicted where this case would lead, or the horrors it would eventually uncover. Can Tempe maintain a professional distance as the past catches up with her in this, her most deeply personal case yet?"}, {"review_sentiment": 4.0, "review_text": "The Temperance Brennan books by Kathy Reichs - which led to the series Bones - are a great mix of real science, fun fiction, characters you like (and a few you don't) and looks at two geographical regions. I'm buying them all for kindle as I can so I can reread the series, as I find them all enjoyable and worth an occasional reread. Some of my favorites!"}, {"review_sentiment": 4.0, "review_text": "Like all of Kathy Reichs Brennen books"}, {"review_sentiment": 4.0, "review_text": "The plot as really interesting and the characters well used! Kind of happy that Tempe and Ryan get back together by the end! Thanks to the author for sharing her talent!"}, {"review_sentiment": 5.0, "review_text": "Kathy Reich does have a formula, but each book has a theme and the reader learns a lot."}, {"review_sentiment": 3.0, "review_text": "love tv show better"}, {"review_sentiment": 3.0, "review_text": "So at the beginning n a bit dry"}]}, "authors": ["Kathy Reichs"], "isbn": "1416525653", "longitude": -74.4518173, "periods": ["2000s", "Recent Releases"], "title": "Bones to Ashes", "word_cloud": "like tv show better even become old old fantastic enough great author series start slow get better better part series call paragraph apply series anthropologist work medical examiner often detail location examination remain story often move faster need series order miss much back medical examiner core lot reference dead body describe strong detail forensic way anthropologist end life threaten situation couple occasion series animal kill sometimes gratuitously relatives often wound bad person try skeleton young girl fourteen year old forensic anthropologist struggle keep emotion check yves evasive insisting ancient interest quite add frustrated convince hide something case overwhelm urgent work lab nag subconscious memory trigger deep hind brain disappearance childhood friend warn explanation work instinct take matter hand case horror eventually maintain professional distance catch deeply personal case yet lead series great mix real science fun fiction character look geographical region buy kindle reread series find enjoyable worth occasional reread favorite plot really interesting character well use happy back together end author share talent formula theme learn lot tv show better so begin n bit dry", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "The gripping Temperance Brennan novel from world-class forensic anthropologist Kathy Reichs, the international no. 1 bestselling crime thriller writer and the inspiration behind the hit TV series Bones.\r\n\r\nDr Temperance Brennan takes on a case that uncovers horrors she could never have predicted.\r\n\r\nIt is the skeleton of a young girl, no more than fourteen years old - and forensic anthropologist Tempe Brennan is struggling to control her emotions.\r\n\r\nThe coroner is being evasive, insisting the bones are ancient and of no interest. But this doesn't feel right, and Tempe is convinced that someone is hiding something.\r\n\r\nWorking on instinct, Tempe takes matters into her own hands. But her work uncovers horrors she could never have predicted, as what started in the lab quickly becomes her most harrowing, and personal, case yet.", "asin": "1416525653", "rank": "208107", "city": "New Brunswick", "image": "https://images-na.ssl-images-amazon.com/images/I/5138%2BCUb8OL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}