{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 2441, "rating": 4.6, "reviews": [{"review_sentiment": 4.0, "review_text": "Easy read with enough mystery and twists to not be entirely predictable, yet has a comforting familiarity. Well developed characters and moves easily between time periods."}, {"review_sentiment": 5.0, "review_text": "Very good"}, {"review_sentiment": 5.0, "review_text": "such a great book so many twists and connections between the characters in the book. this is a book I could read a second time and pick up on some new details. a great book club book!!"}, {"review_sentiment": 5.0, "review_text": "Whoa! I am once again completely blown away by the incredible gift Kate Morton has for storytelling! She creates interesting characters and takes her readers on an emotional journey through the tragedies and joys of their lives. I don't have words to describe how deeply she portrays the true nature of her characters, good and bad. And how grateful I am that she doesn't leave loose ends in her stories.I read this book through in 2 days between interruptions. I read a lot - usually 2 or 3 books a week. I'm particular about what I read and don't waste time reading junk, but rarely give 5-star ratings except for the most exceptional books. This was one of those, as was her book, \"The Distant Hours\" that I read last week. I've just finished all of her books and can't wait til she puts out the next one!"}, {"review_sentiment": 5.0, "review_text": "I am so sad to see this book come to an end. Kate Morton has such a beautiful talent for combining wonderfully exciting stories, full of endearing and complex characters along with some of the most exquisite writing I’ve ever read. This was my third novel I’ve read by her and most definitely my favorite. Now my problem is to decide which one of her books to read next!"}, {"review_sentiment": 5.0, "review_text": "Excellent read! I love Kate Morton!! Her books are among the best. You won’t be disappointed!"}, {"review_sentiment": 5.0, "review_text": "This book held my attention from start to finish.  I found myself crying at the end from  too many emotions  to count.  I thoroughly it and will recommend it to others.  This author is superb at grabbing the readers attention and emotions."}, {"review_sentiment": 5.0, "review_text": "I loved it because it was rich in detail and spinning an intriguing in depth story of deception,  romance, and never ending love. Well wrtten."}, {"review_sentiment": 2.0, "review_text": "Too long, too many characters, too many time periods. Each new chapter I had to stop and think, OK, this is such-and-such character, her family members are so-and-so... Oh, and I guessed the ending before the book was half over."}, {"review_sentiment": 4.0, "review_text": "Well written.  Great for bookclub discussion.  Highly recommended."}]}, "authors": ["Kate Morton"], "isbn": "1416550550", "longitude": -0.12574, "periods": ["1900s", "Recent Releases"], "title": "The Forgotten Garden", "word_cloud": "enough mystery twist entirely predictable yet comfort familiarity develop character move easily time period very good great many twist connection character time pick new detail great club completely blow away incredible gift storytelling create interesting character take reader emotional journey tragedy joy live word describe deeply portrays true nature character good bad grateful leave loose end day interruption lot usually week particular waste time read junk rarely give rating exceptional last week finish til put next sad see come end beautiful talent combine wonderfully excite story full endear complex character exquisite writing ever third definitely favorite now problem next excellent love best disappoint hold attention start finish find cry end many emotion count thoroughly recommend others author superb grab reader attention emotion love rich detail spin intriguing depth story deception romance never end love well long many character many time period new chapter stop think ok character family member guess end half well write book club discussion recommend", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "From the internationally bestselling author of The House at Riverton, an unforgettable new novel that transports the reader from the back alleys of poverty of pre-World War I London to the shores of colonial Australia where so many made a fresh start, and back to the windswept coast of Cornwall, England, past and present\r\n\r\nA tiny girl is abandoned on a ship headed for Australia in 1913. She arrives completely alone with nothing but a small suitcase containing a few clothes and a single book -- a beautiful volume of fairy tales. She is taken in by the dockmaster and his wife and raised as their own. On her twenty-first birthday they tell her the truth, and with her sense of self shattered and with very little to go on, \"Nell\" sets out on a journey to England to try to trace her story, to find her real identity. Her quest leads her to Blackhurst Manor on the Cornish coast and the secrets of the doomed Mountrachet family. But it is not until her granddaughter, Cassandra, takes up the search after Nell's death that all the pieces of the puzzle are assembled. At Cliff Cottage, on the grounds of Blackhurst Manor, Cassandra discovers the forgotten garden of the book's title and is able to unlock the secrets of the beautiful book of fairy tales.\r\n\r\nThis is a novel of outer and inner journeys and an homage to the power of storytelling. The Forgotten Garden is filled with unforgettable characters who weave their way through its spellbinding plot to astounding effect.\r\n\r\nMorton's novels are #1 bestsellers in England and Australia and are published in more than twenty languages. Her first novel, The House at Riverton, was a New York Times bestseller.", "asin": "1416550550", "rank": "16872", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51pV4lY0MtL.jpg", "country": "England", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}