{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 213, "rating": 3.5, "reviews": [{"review_sentiment": 1.0, "review_text": "This book needs some editing to make it less wordy and more to the point. You easily get lost among all details."}, {"review_sentiment": 4.0, "review_text": "Excellent reading!"}, {"review_sentiment": 5.0, "review_text": "This novel, set amidst the lives of American fruit and mining company executives and their families living in a (not-so-protective) bubble in Cuba during the Batista years, really draws in the reader.  You want to know what happens next to these people as the Castro revolution grows in scope and intensity, even though you know how the story has to end.Kushner's writing is quite good, and one of her literary devices is to tell the story at different times from different characters' perspectives, including those of the teenagers living in the American colony. One weak spot in the novel is a romance between a Havana showgirl and a French mercenary, and her tying them both to the American expatriates seems a bit forced. But that's only a small blemish in a fascinating novel."}, {"review_sentiment": 5.0, "review_text": "Very interesting view of the families during the change over in Cuba."}, {"review_sentiment": 3.0, "review_text": "Michael Corleone: The soldiers are payed to fight, the rebels aren’t.Hyman Roth: What does that tell you?Michael Corleone: They can win.-Godfather Part IIMy knowledge of the communist revolution in Cuba was limited to my favorite movie until I read Rachel Kushner's Telex from Cuba.  Spoiler alert: The rebels win again and an evacuation ensues.Kushner has mastered her craft, painting a fine textured portrait of 1950’s Cuba that guides you along as if hosted by a local.  Themes of class, pretense, colonialism, identity, race, and status smartly layer the many sub-plots featuring American expat families, their children and servants, and an underworld of cabaret dancers, prostitutes, the mysterious Frenchman La Mazière, Prio, Batista and the rebels who want to replace them including Castro himself.  It’s high praise to Kushner to say I feel as though I’ve been to Cuba now.The scope of the narrative can be a bit overwhelming, especially when picking up the book after a multi-day pause — but strangely, the book’s weakness lies in its simplicity. The imperial, corporate American adults are invariably corrupt and weak, while the indigenous (or Jamaican or Haitian in this case) servants and cane-cutters are earnest and good. To her credit Kushner does not portray the rebels romantically, having ex pat, come rebel, Del Stites vividly describe the bulldozing of bodies into mass graves at the outset of his glorious revolution that would impoverish the island for two generations. The novel also struggles in its arc and pacing- after a galloping cane fire sets the story in motion, the plot meanders for many chapters before finding it’s stride again in the rise of the rebels in the hillsKushner’s strength, like most good novel writers is in the exploration of her characters’ psyches,  deconstructing and unmasking the weakness and insecurity behind pretense, the mix of comedy and tragedy in their struggles - including Rachel K’s herself.  In short, Kushner delivers a vivid portrayal of Cuba, and an intimate exploration of her characters’ lives, but in the end this is a bit of a colonial sleeper."}, {"review_sentiment": 4.0, "review_text": "Delicious portrait of expat life prior to revelution. Realistic in its portrail as well as its philosophical offering on the sometimes shallowness of idealism. I was sad when the book was over as I missed the emesment in the lives of the characters! A strongly recommended read."}, {"review_sentiment": 3.0, "review_text": "What a very odd book.  The \"point of view\" shifts from one character to another at every new chapter.  An American man who was born in Cuba narrates several chapters in the first person; the inner thoughts of the other main characters are described in the third person.  Some of these characters include a young girl; one of the American wives; an exotic nightclub dancer/call girl; and a French gunrunner.  There are a few loose ends left unresolved.  For example, something seems to be wrong with Mrs. Mackey mentally, but at the end she seems totally normal; and, what happened to Mr. Carrington after he returned home with a migraine, saw his wife looking out the window, then disappeared?Descriptions of the way of life of the American \"colony\" (sugar cane plantation and nickel mine) are good.  The racism and strict social stratification within the American colony is clear.  Famous persons such as Fidel Castro and Ernest Hemingway make cameo appearances.  Not a whole lot of \"action\" happens.  I can't comment on the accuracy of the historical events, which I am not familiar with, but the depiction of pre-Castro Cuba is very vivid.I've told many people that Fidel Castro appeared on the Ed Sullivan Show (on TV) in 1959 and have not been believed, so I googled it.  Right after Castro's revolution ousted the Batista regime, Ed Sullivan had the opportunity to go to Havana and interview Fidel in January 1959.  He televised six minutes of the interview on his TV show; I saw it.  You can find it on the Internet.  Everyone thought Fidel was the best thing to happen to Cuba-- until he declared himself to be a communist.  End of honeymoon!"}, {"review_sentiment": 2.0, "review_text": "Did not care for any of the characters and hard to follow with regard to characters. Boring!"}, {"review_sentiment": 2.0, "review_text": "Interesting story but somewhat disjointed."}, {"review_sentiment": 3.0, "review_text": "Liked the historical context but found the fictionalization dragged out more than necessary. The beginning got off to quick start that was also fun."}]}, "authors": ["Rachel Kushner"], "isbn": "1416561048", "longitude": -82.3658671, "periods": ["1900s", "Recent Releases"], "title": "Telex from Cuba: A Novel", "word_cloud": "need edit le wordy point easily lose detail excellent reading set midst live american fruit mining company executive family live bubble year really draw want know happen next people revolution grow scope intensity even know story write quite good literary device tell story different time different character perspective include teenager live american colony weak spot romance showgirl mercenary tie american expatriate seem bit forced small blemish fascinating very interesting view family change soldier pay fight rebel tell communist revolution limit favorite movie rebel win evacuation master craft paint fine textured portrait guide along hosted local class pretense colonialism identity race status smartly layer many featuring american expat family child servant underworld cabaret dancer prostitute mysterious rebel want include high praise say feel scope narrative bit overwhelming especially pick pause strangely weakness lie imperial corporate american adult invariably corrupt weak indigenous case servant earnest good credit portray rebel romantically ex pat come rebel vividly describe bulldoze body mass graf outset glorious revolution island generation also struggle gallop cane fire set story motion plot meander many chapter find stride rise rebel hillskushner strength good writer exploration character psyche deconstruct unmasking weakness insecurity pretense mix comedy tragedy struggle include short delivers vivid portrayal intimate exploration character live end bit colonial sleeper portrait expat life prior revelation portrait well philosophical offering sometimes shallowness idealism sad miss enmeshment live character strongly recommend odd point view shift character new chapter american man bear narrate several chapter first person inner thought main character describe third person character include young girl american wive exotic nightclub girl french gunrunner loose end leave unresolved example something seem wrong mentally end seem totally normal happen return home migraine saw wife look window disappear way life american colony sugar cane plantation nickel mine good racism strict social stratification american colony clear person make cameo appearance not whole lot action happen accuracy historical event familiar depiction tell many people appear believe google right revolution oust regime opportunity go interview televise minute interview tv show saw find think best thing declare communist honeymoon care character hard follow regard character bore interest story somewhat disjoint like historical context find fictionalization drag necessary beginning get quick start also fun", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "From the National Book Award Finalist and New York Times bestselling author of The Flamethrowers, an astonishingly wise, ambitious, and riveting novel set in the American community in Cuba during the years leading up to Castro's revolution—a place that was a paradise for a time and for a few. The first novel to tell the story of the Americans who were driven out in 1958, this is a masterful debut with a unique and necessary lens into US-Cuba relations.\r\n\r\nYoung Everly Lederer and K.C. Stites come of age in Oriente Province, where the Americans tend their own fiefdom—three hundred thousand acres of United Fruit Company sugarcane that surround their gated enclave. If the rural tropics are a child's dreamworld, Everly and K.C. nevertheless have keen eyes for the indulgences and betrayals of the grown-ups around them—the mordant drinking and illicit loves, the race hierarchies and violence.\r\n\r\nIn Havana, a thousand kilometers and a world away from the American colony, a cabaret dancer meets a French agitator named Christian de La Mazière, whose seductive demeanor can't mask his shameful past. Together they become enmeshed in the brewing political underground. When Fidel and Raúl Castro lead a revolt from the mountains above the cane plantation, torching the sugar and kidnapping a boat full of \"yanqui\" revelers, K.C. and Everly begin to discover the brutality that keeps the colony humming. Though their parents remain blissfully untouched by the forces of history, the children hear the whispers of what is to come.\r\n\r\nKushner's first novel is a tour de force, haunting and compelling, with the urgency of a telex from a forgotten time and place.", "asin": "1416561048", "rank": "151126", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/51ZRidfS9GL.jpg", "country": "Cuba", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}