{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 210, "rating": 4.3, "reviews": [{"review_sentiment": 3.0, "review_text": "Bo boAdd ghrr Hahn Rahul cdfg yjgdfu tugboat jjbf ihgfd yoghurt jpg jgfrn Jan van cdfhBough lkjft kijhf cdghkk meh"}, {"review_sentiment": 4.0, "review_text": "This is a new series, and I have already downloaded the sequel book for my next read.  I series about the Texas Rangers can go for a long time, with many characters moving in and out of the stories from book to book.  I doubt that the Rangers would be happy with their deputy cavorting with a victim of the killer, and wouldn't let her/him be involved in ahy investigations.  Still, the match up of these two makes for good storytelling, and the promise of more of them in the future,"}, {"review_sentiment": 4.0, "review_text": "Good read.  Fast...keeps your attention"}, {"review_sentiment": 4.0, "review_text": "I thought it was a little weird at times. I would like to read more of these books and would recommend this book to others"}, {"review_sentiment": 4.0, "review_text": "Very good read. Plenty of intrigue in this murder mystery."}, {"review_sentiment": 5.0, "review_text": "Loved this book.  The author is great so much so that I ordered the next two books in her series."}, {"review_sentiment": 5.0, "review_text": "Excellent writing!  All her books have been so damn wonderful !  Plenty of suspense, keeps you on the edge of your seat. Murder is usually a surprise, I get a lucky guess at the murder sometimes. Truely good stories!"}, {"review_sentiment": 5.0, "review_text": "Excellent murder and suspense mystery. Keeps you on your toes. If you love Allison Brennan, James Patterson or John Sanford you will love this book. My first of her books and will definitely buy more from her!"}, {"review_sentiment": 5.0, "review_text": "love it"}, {"review_sentiment": 3.0, "review_text": "I don't know if it was just me but could not get into the book.  But after about 30 pages or so it became an intreging read. I didn't  want to put the book down.  Any one who wants a good mystery will enjoy this book."}]}, "authors": ["Mary Burton"], "isbn": "1420125052", "longitude": -97.7436995, "periods": ["2000s", "Recent Releases"], "title": "The Seventh Victim", "word_cloud": "board ghrr cdfg yjgdfu tugboat jjbf ihgfd yogurt jog jgfrn van cdfhbough lkjft kith cdghkk meh new series already download sequel next series go long time many character move story doubt deputy cavort killer involved hay investigation still match make good storytelling promise future good keep attention think little weird time others very good intrigue murder mystery love author great much order next series excellent write damn wonderful suspense keep edge seat usually surprise get lucky guess murder sometimes truly good story excellent murder suspense mystery toe love first definitely buy love know page become intreging want put want good mystery enjoy", "genres": ["Fiction & Literature", "Mystery & Suspense", "Romance"], "summary": "Book 1/3 in Texas Rangers \r\n\r\nIt's been seven years since the Seattle Strangler terrorized the city. His victims were all young, pretty, their lifeless bodies found wrapped in a home-sewn white dress. But there was one who miraculously escaped death, just before the Strangler disappeared. . \r\n\r\nLara Church has only hazy memories of her long-ago attack. What she does have is a home in Austin, a job, and a chance at a normal life at last. Then Texas Ranger James Beck arrives on her doorstep with shattering news: The Strangler is back. And this time, he's in Austin. . .\r\n\r\nHe's always craved her, even as he killed the others. For so long he's been waiting to unleash the beast within. And this time, he'll prove he holds her life in his hands--right before he ends it forever. . .\r\n", "asin": "1420125052", "rank": "905444", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/514BnRb%2BhdL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}