{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 20, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Like Metro itself, this book is awe inspiring in its scope and remarkable in its detail. The thesis is maintained throughout. The maps are excellent for those, like myself, without a firm grasp of the region's geography. The chapters are clear and focused. It took me a year of bus rides to work though the book, and found myself swept along. I have to admit to being surprised (though not incredulous as the explanation is as clear as any book I have encountered) several times. It was an excellent page-turner throughout... the freeways planed to devour communities, the bridge, the political intransigence, the buses, the plans, and the people. I was lucky enough to fly across the country to visit the District as a kid. The museums and monuments blended in my young imagine with Metro itself as a vision of America set in stone (since I didn't know it was concrete). What I did not know then is that this interaction of Americans in the commons was created as carefully, and painfully, as any monument. Although written before the Tysons Corner extension on the Silver Line, the book contrasts the development of Tysons Corner with Rosslyn-Ballston expertly."}, {"review_sentiment": 5.0, "review_text": "To a third generation Washingtonian, this book got everything right and in a most readable way.Local and national, history at its best. A book about building a subway usually would not be considered a page turner. This one briskly moves along, better than Metro in its current state of disrepair. The author really gets the zeitgeist of each decade, especially the 1950s and early 60s. As a journalist who started his career at the old Evening Star, it is dismaying to read how the Star and Post both enthusiastically lined up behind plans, which fortunately did not come to fruition, to turn this city into a mass of concrete and highways."}, {"review_sentiment": 5.0, "review_text": "Fantastic blend of historical evidence and first hand testimony. Great read"}, {"review_sentiment": 5.0, "review_text": "I am an engineer currently working for WMATA.  This book does a great job explaining the roles of the various agencies involved in the planning of metro and the formation of WMATA.  It properly puts into perspective how difficult a political problem it was to plan and construct the system in the face of highway proposals, protests from other agencies and locals, and the inherent problem within tri-jurisdictional control.If you live in DC and are genuinely interested in public transit, read this."}, {"review_sentiment": 5.0, "review_text": "This book is incredibly well researched and thought out. Its thesis is proved not by beating you over the head but by the historical record. Moreover, it's quite a page turner. My only quibble would be the organization in the middle; in my opinion it tended to bounce between chronological and topical. That is a small price to pay for this great read. I recommend this book."}, {"review_sentiment": 5.0, "review_text": "This is a college professor's history of the construction of the DC Metro system, so it might have been stuffy.Instead, it is very readable, and many aspects of how the Nation changed culturally show up in the book.  It covers the design of the system, and the construction challenges, but perhaps more interestingly it covers the cultural and political history of putting the system in place...something I doubt could be initiated today.  The place of people of color, people with disabilities, people from economically disadvantaged areas, and women each figure prominently in the story, as does the continuing battle between the road and mass transit for government funding and rights-of-way."}, {"review_sentiment": 5.0, "review_text": "This book should be mandatory reading for all the engineering studies. The detail of the politics, the players and the schedule to implement a mega project."}, {"review_sentiment": 4.0, "review_text": "During the earliest stages of building this line, I actually lived in the Suburban Virginia area, and while very interested in the construction, I saw very little, except test borings on Wisconsin avenue, as I had to work.  Now, having read this book, I know mkuch more about the process, and in 1977 we actually rode on the downtown portion. As expected, there were many, many roadblocks to construction, thrown up by local politicos, just plain mean spirited people who had the power to do so. This book provides an interesting overview of the behind the scenes action in trying to build a subway system, only to be constantly delayed, and to see costs skyrocket as the years went by.Recommended reading for those who not only are interested in the actual construction, but also those who want to know more about the dysfunction that often attends the hyper-political atmosphere of nearly anything done in Washington, DC"}, {"review_sentiment": 4.0, "review_text": "As a DC Metro resident, I enjoyed reading how the Metro became what it is today.  Interesting to see how the city developed around the different stations."}, {"review_sentiment": 4.0, "review_text": "This is not an easy read by any means. It is a slog but not so much because it's not interesting but more because the author goes into great detail to tell the complete story as to how one of the best commuter rail systems in the U.S. came about. (Don't just take my word for it. Out of 35 cities polled, DC ranked #7 by tourists and #8 by residents in Public Transportation and Pedestrian Friendliness in the 2012 America's Favorite Cities survey done by Travel And Leisure magazine.) What is even more amazing is how this got done decades ago in a time when public transit really was not on the agenda of most cities let alone a modern subway system.It's worth your time just give yourself a lot of it to weave your way through. Anyone who is fascinated by city planning and the push-me/pull-me of special interest groups, government red tape, business interests and the visionaries who pull it all together, well, your jaw will drop at how things eventually get done.To be honest, if you find some chapters not up your alley you can skip to ones that are. Personally, I was more into learning about the actual stations and the riders more than anything. I did find the chapter on the plans (which started in 1955!) very enlightening especially when you see the failures of other major U.S. cities to come to grips with transit and opt for freeways. It's ultimately a hopeful book because if D.C. can do it, certainly other cities can. A must-read really for all urban planners...and politicians as well."}]}, "authors": ["Zachary M. Schrag"], "isbn": "1421415771", "longitude": -77.0366456, "periods": ["1900s"], "title": "The Great Society Subway: A History of the Washington Metro (Creating the North American Landscape)", "word_cloud": "awe inspire scope remarkable detail thesis maintain map excellent firm grasp region geography chapter clear focus take year bus rid work though find admit surprised incredulous explanation clear encounter several time excellent freeway plan devour community bridge political intransigence bus plan people lucky enough fly country visit kid museum monument blend young imagine vision set stone know concrete know interaction common create carefully painfully monument write extension contrast development expertly generation get everything right readable national best building subway usually consider turner briskly move along better current state disrepair author really get zeitgeist decade especially early journalist start career old dismay enthusiastically line plan fortunately come fruition turn city mass concrete highway fantastic blend historical evidence first hand testimony engineer currently work job explain role various agency involve plan formation properly put perspective difficult political problem plan construct system face highway proposal protest agency local inherent problem live genuinely interested public transit incredibly well research think thesis prove beating head historical record moreover quite page turner quibble organization opinion tend bounce chronological topical small price pay recommend college professor construction system many aspect change culturally cover design system construction challenge perhaps interestingly cover cultural political put system place something doubt today place people color people disability people economically disadvantage area woman figure prominently story continue battle road mass transit government funding mandatory reading engineering study detail politics player schedule implement mega project earliest stage build line actually live area interested construction saw little test boring avenue work now know much process actually ride downtown portion expect many many roadblock construction thrown local politico plain mean spirited people power provide interesting overview scene action try subway system constantly delay see cost skyrocket year go read interested actual construction also want know dysfunction often attend atmosphere nearly anything do resident enjoy read become today see city develop different station easy mean slog much interesting author go detail tell complete story best commuter rail system come word city poll rank tourist resident public survey do magazine even amaze get do decade time public transit really agenda city let alone modern subway worth time give lot weave way fascinate city planning special interest group government red tape business interest visionary pull together well jaw drop thing eventually honest find chapter alley skip one personally learn actual station rider anything find chapter plan start enlighten especially failure major city come grip transit opt freeway ultimately hopeful certainly city really urban planner politician well", "genres": ["History", "Urbanism"], "summary": "Drivers in the nation's capital face a host of hazards: high-speed traffic circles, presidential motorcades, jaywalking tourists, and bewildering signs that send unsuspecting motorists from the Lincoln Memorial into suburban Virginia in less than two minutes. And parking? Don't bet on it unless you're in the fast lane of the Capital Beltway during rush hour.\r\n\r\nLittle wonder, then, that so many residents and visitors rely on the Washington Metro, the 106-mile rapid transit system that serves the District of Columbia and its inner suburbs. In the first comprehensive history of the Metro, Zachary M. Schrag tells the story of the Great Society Subway from its earliest rumblings to the present day, from Arlington to College Park, Eisenhower to Marion Barry.\r\n\r\nUnlike the pre–World War II rail systems of New York, Chicago, and Philadelphia, the Metro was built at a time when most American families already owned cars, and when most American cities had dedicated themselves to freeways, not subways. Why did the nation's capital take a different path? What were the consequences of that decision?\r\n\r\nUsing extensive archival research as well as oral history, Schrag argues that the Metro can be understood only in the political context from which it was born: the Great Society liberalism of the Kennedy, Johnson, and Nixon administrations. The Metro emerged from a period when Americans believed in public investments suited to the grandeur and dignity of the world's richest nation. The Metro was built not merely to move commuters, but in the words of Lyndon Johnson, to create \"a place where the city of man serves not only the needs of the body and the demands of commerce but the desire for beauty and the hunger for community.\"\r\n\r\nSchrag scrutinizes the project from its earliest days, including general planning, routes, station architecture, funding decisions, land-use impacts, and the behavior of Metro riders. The story of the Great Society Subway sheds light on the development of metropolitan Washington, postwar urban policy, and the promises and limits of rail transit in American cities.", "asin": "1421415771", "rank": "326158", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/511234EUl7L.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}