{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 51, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book about Cuba before Castro and what things were like. It was a super quick read in one day"}, {"review_sentiment": 5.0, "review_text": "Fabulous look at Havana before the revolution with great photos and easy to read info.  Photos from 2007 of many of the buildings show their slow deterioration under Castro but still wonderful architecture. Highly recommend"}, {"review_sentiment": 5.0, "review_text": "A must have for anyone intersted in Cuban history of the 20th Centruy. It is filled with great photos, postcards and clippings as well as informative articles on various aspects of Cuban life in Havana."}, {"review_sentiment": 5.0, "review_text": "Bought as a gift and it looked like a good read when I (peeked) before giving it."}, {"review_sentiment": 5.0, "review_text": "Great look into the past"}, {"review_sentiment": 5.0, "review_text": "Great book......."}, {"review_sentiment": 4.0, "review_text": "Good read and superb photos."}, {"review_sentiment": 5.0, "review_text": "Fascinating look at pre-revolutionary Havana. Very attractive and interesting book, love the photos and graphics. A lost world of sex, glamour, cocktails, fabulous shows, great cars and partying. Makes me wish I could have been a young man in Cuba pre-1959! I would have been there as much as I could."}, {"review_sentiment": 5.0, "review_text": "An interesting \"before you go\" book!!  Adds many layers of interest to the Havana experience."}, {"review_sentiment": 5.0, "review_text": "excellen book"}]}, "authors": ["Peter Moruzzi"], "isbn": "1423603672", "longitude": -82.3658671, "periods": ["1900s", "Recent Releases"], "title": "Havana Before Castro: When Cuba Was a Tropical Playground", "word_cloud": "thing super quick day fabulous look revolution great photo easy info many building show slow deterioration still wonderful architecture recommend anyone interested history fill great photo postcard clipping well informative article various aspect life gift look good peek give look past great good superb photo fascinate look attractive interesting love photo graphics lost world sex glamour cocktails fabulous show great car party wish young man much interesting go many layer interest experience excellent", "genres": ["History", "Politics"], "summary": "Through vintage and contemporary photographs, brochures, postcards, and artifacts evocative of time and place, Havana Before Castro tells the story of the city that was the most popular exotic destination for Americans during the forty years between World War I and Castro's revolution. \r\n\r\nSee how Havana evolved from America's Prohibition haven and rich man's playground to a heady blend of glittering nightclubs, outrageous cabarets, all-night bars, and backstreet brothels. \r\n\r\nVisit Havana's seamy Shanghai Theatre as well as its glamorous Tropicana, Montmartre, and Sans Souci nightclubs. \r\nLinger at La Floridita -- the cradle of the daiquiri cocktail (one of Hemingway's favorite watering holes) -- rub elbows with Frank Sinatra at Sloppy Joe's Bar, and learn why Cuban cigars remain the world's most highly prized. \r\n\r\nFollow the parade of corrupt presidents who, along with American mobsters such a Meyer Lansky, welcomed the mass tourism that led to Havana becoming a tropical Vegas swirling in a haze of rum and cigars, backed by a conga beat.", "asin": "1423603672", "rank": "272990", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/51RaWNZJSOL.jpg", "country": "Cuba", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}