{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 16, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Informative, well written, entertaining and important. Hope she updates it with any changes and developments since it was first published."}, {"review_sentiment": 3.0, "review_text": "Insightful, interesting, foreboding . Lots of repetition but author gets point across about how easily we could lose the balance of diversity in Galapagos."}, {"review_sentiment": 5.0, "review_text": "After visiting the Galapagos I wanted more information about the politics of conservation of this world treasure."}, {"review_sentiment": 4.0, "review_text": "I read this on the way and during a trip in the Galapagos. I liked the \"immersed journalism\" writing style which was captivating. The book provided me with a good view of the complex situation at the Galapagos both from a natural history as well as socio-economic perspective.On the negative side, I felt some repeatitions. It felt as though each chapter was written without regard to the fact that people/facts were already mentioned previously."}, {"review_sentiment": 5.0, "review_text": "This book helped me understand the politics of the Galapagos and all the competing influences on the status of the islands. It goes way beyond the normal tourist information and made our 3 week trip to the islands much more of a cultural experience."}, {"review_sentiment": 5.0, "review_text": "Such a marvelous book looking at geopolitical, social, economic and environmental factors influencing the present and future of these islands. I learned so much and would strongly recommend this book to others, particularly if you are planning to visit."}, {"review_sentiment": 5.0, "review_text": "This book looks at The Galapagos from modern day scientific studies and socio-political struggles of the people who live there today. Very interesting, informative and real.I highly recommend this read if you want to go beyond Darwin."}, {"review_sentiment": 4.0, "review_text": "Very interesting and helpful book about the Islands for our recent visit. Informative in a way a pure history is not."}, {"review_sentiment": 5.0, "review_text": "I actually read this as a \"textbook\" for a class before travelling to the Galapagos.  The \"sciency\" information is presented in a very understandable and colloquial way so it is still fun to read.  The author writes in first person often and that always makes books more fun. Once we got to the Galapagos, I was really reminded of things from the book that were interesting.  Although we didn't make it to the Charles Darwin Research Station, I did get to see lots of feral cats and many other introduced species."}, {"review_sentiment": 5.0, "review_text": "This book was in great condition. After reading the first page I was very intrigued. I am excited to read this book next semester."}]}, "authors": ["Carol Ann Bassett"], "isbn": "1426204027", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Galapagos at the Crossroads: Pirates, Biologists, Tourists, and Creationists Battle for Darwin's Cradle of Evolution", "word_cloud": "well write entertain important update change development first publish insightful interest forebode repetition author get point easily balance diversity visit want information politics conservation world treasure way trip like immersed journalism write style captivate provided good view complex situation natural history well negative side felt repetition felt chapter write regard fact already mention previously help politics compete influence status islands go way normal tourist information make week trip island much cultural experience such marvelous look geopolitical social economic environmental factor influence present future island learn much strongly others particularly plan visit look modern day scientific study struggle people live today interesting informative highly recommend want very interesting helpful recent visit way pure history actually textbook class traveling science information present understandable colloquial way still fun author write first person often always make fun get really remind thing interest make get see lot feral cat many introduce specie great condition read first page intrigue excite next semester", "genres": ["Travel Writing", "Science & Nature"], "summary": "As eloquent as it is alarming, Carol Ann Bassett’s portrait of today’s Galápagos depicts a deadly collision of economics, politics, and the environment that may destroy one of the world’s last Edens. \r\n\r\nFor millions, the Galápagos Islands represent nature at its most unspoiled, an inviolate place famed for its rare flora and fauna. But soon today’s 30,000 human residents could surpass 50,000. Add invasive species, floods of tourists, and unresolved conflicts between Ecuadorian laws and local concerns, and it’s easy to see why the Galápagos were recently added to UNESCO’s World Heritage in Danger list. \r\n\r\nEach chapter in this provocative, perceptive book focuses on a specific person or group with a stake in the Galápagos’ natural resources—from tour companies whose activities are often illegal and not always green, to creationist guides who lead tours with no mention of evolution, from fishermen up in arms over lobster quotas, to modern-day pirates who poach endangered marine species. \r\n\r\nBassett presents a perspective as readable as it is sensible. Told with wit, passion, and grace, the Galápagos story serves as a miniature model of Earth itself, a perfect example of how an environment can be destroyed-- and what is being done to preserve these islands before it's too late.", "asin": "1426204027", "rank": "1148721", "city": "Galápagos Islands", "image": "https://images-na.ssl-images-amazon.com/images/I/51VF2PdrejL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}