{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 4.5980772, "ratings": {"num_ratings": 44, "rating": 3.9, "reviews": [{"review_sentiment": 1.0, "review_text": "I am a native Spanish speaker. This translation is almost non legible. At the beginning I thought maybe it was a case of \"old spanish\" being translated into modern English. So I asked another person with excellent knowledge of both languages. Same opinion. Very poor translation."}, {"review_sentiment": 1.0, "review_text": "This book is translated from spanish to english very poorly. I would recommend reading in spanish. Don't bother with this book!"}, {"review_sentiment": 5.0, "review_text": "Good narration, very descriptive. ItIt makes you go to el Valle Del Cauca and enjoy there mountaiaIt is a great novel"}, {"review_sentiment": 1.0, "review_text": "DO NOT BUY the print-on-demand (fact undisclosed) book whose cover has a drawing of a young women's face with three white flowers in her hair. This book looks like it has been automatically translated - word for word from the Spanish, many phrases and paragraphs just do not make any sense in English. See additional comment below regarding fraudulent aspect: it is NOT the advertised 1890 translation of Rollo Ogden, easily checked against a genuine edition. Amazon should NOT sell such fraudulent books. I have asked for (and received) a refund."}, {"review_sentiment": 1.0, "review_text": "Do not buy this book. I do not understand why it has so many high ratings. My husband bought this book to share this gem of Columbian literature with me because I do not speak Spanish fluently. The minute we picked the book up and started reading it, it was obvious that it was a direct and literal translation from Spanish. Many sentences do not make any sense in English. We went to the Translators Note at the beginning of the book for some clarification only to find that he is listed as Senior C.M. Silva LLD. I'm not sure if they meant Señor or C.M. Silva, Sr. That basically sums up the challenges with this English translation. Also, curiously, the last page says that it was printed in San Bernardino, CA, the day it was ordered. In addition to these faults, there are also many erroneous punctuation marks. Do not buy this book."}, {"review_sentiment": 5.0, "review_text": "The same, good book conditions , very little words . Difficult to read at my age."}, {"review_sentiment": 5.0, "review_text": "Great book . Romantic innocent love story"}, {"review_sentiment": 5.0, "review_text": "What a love story. I couldn't put the book down."}, {"review_sentiment": 5.0, "review_text": "Great - I know this because I read it before, but I am still waiting for my book to arrive."}, {"review_sentiment": 5.0, "review_text": "Excellent condition"}]}, "authors": ["Jorge Isaacs"], "isbn": "1434486141", "longitude": -74.0761028, "periods": ["1800s"], "title": "Maria", "word_cloud": "native spanish speaker translation almost non legible begin think maybe case old spanish translate modern ask person excellent knowledge language opinion poor translation translated spanish english poorly read spanish bother good narration descriptive make go e enjoy great fact undisclosed cover draw young woman face white flower hair look automatically translate word word many phrase paragraph make sense additional comment regard fraudulent aspect advertise translation easily check genuine edition fraudulent ask receive refund understand many high rating husband buy share gem columbia literature speak spanish fluently minute pick start read obvious direct literal translation sentence make sense go begin clarification find listed sure meant basically sum challenge translation also curiously last page say print day order addition fault also many erroneous punctuation mark do good condition little word age romantic innocent love story love story know still wait arrive excellent condition", "genres": ["Fiction & Literature"], "summary": "\"Maria\" is the only novel by Jorge Isaacs Ferrer, who was a Colombian writer, politician, and soldier. This novel became one of the most notable works of the Romantic movement in Spanish literature.\r\n\r\nWritten by Colombian writer Jorge Isaacs in 1867, the novel takes place in the hacienda \"El Paraiso\" located in the municipality of El Cerrito in the Valle del Cauca, in which Isaacs really lived. ", "asin": "1434486141", "rank": "1673733", "city": "Bogota", "image": "https://images-na.ssl-images-amazon.com/images/I/31YRG9WUJlL.jpg", "country": "Colombia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}