{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 56, "rating": 3.8, "reviews": [{"review_sentiment": 1.0, "review_text": "I did not like the book.Too much bad language.Can't imagine being  around someone so self absorbed.I guess it was well written, if that was the whole idea."}, {"review_sentiment": 5.0, "review_text": "This book had so many LOL moments that I would recommend it to anyone needing a laugh.  It had fun characters and amusing awkward moments."}, {"review_sentiment": 1.0, "review_text": "Got really tired of the long week of shennanigans with the fancy ex friends. Sarah is usually better than this."}, {"review_sentiment": 4.0, "review_text": "HOW PERFECT IS THAT is a witty, almost chick-lit, engaging read. As an event coordinator myself, I was able to connect in that aspect with Blythe. Full of unique characters, their personalities and traits so real you feel for them, Bird had outdone herself with this one. The book remained strong through-out; a testimony to Sarah's writing. This is the first work I have read of Sarah Bird's, but definitely will be looking for more of her work. A real page-turner!"}, {"review_sentiment": 4.0, "review_text": "came on time and in the manner described. Really enjoy S Bird's books, enjoyed this one.  Awaiting more of her books."}, {"review_sentiment": 4.0, "review_text": "Very entertaining!  The main character was hard to like at first, but she grew on me!  I'm a Texas Ex and long time Austin resident; it's fun to read about locations I'm familiar with."}, {"review_sentiment": 4.0, "review_text": "This was a hilarious read!  Not joke-funny, but witty, cant help yourself from literally laughing out loud no matter where you are at. Find the part where an Asian school mate from a few years past talks to Blythe (main character).  The conversation written in full Asain-like accent and Blythe is trying to figure out what she is saying.  Favorite couple of sentences of the book by far!This is NOT my type of book/genre/topic at all. I stumbled across it at the library and (hate to say this) but the cover drew me in! Something about it kept me flipping page after page.  It was realistic and the main character is so outrageous and...witty!  SO glad I did stray away from my normal style book.Also would make a great vacation read that is zippy, quick, and unexpected.  Definitely worth buying!Just starting on a few other books by same author....hope she keeps this style of lightheartedness up! Need something like this right now!"}, {"review_sentiment": 5.0, "review_text": "Since I am a resident of a suburb of Austin, I definitely could relate to all the author wrote about and described. The characters were vivid and the humor was enjoyable!"}, {"review_sentiment": 3.0, "review_text": "I recently read Sarah Bird's The Gap Year, and liked it a lot, so decided to try another one of her books. However, this one was more comedic than The Gap Year, and it just didn't click for me. I felt the characters were more one-dimensional, each designed to play a part in a morality tale, rather than feeling true to life. The lead character Blythe Young is former 'trailer trash' (character's words, not mine) who has worked her way up to the heights of 'Old Austin' society through marriage and a catering business. However, she's now divorced, and because of a series of deceptions she tried to pull off, shunned by her high society friends. She ends up bunking with her old college friend Millie, who is now a spiritual counselor of sorts. Over time, Blythe is forced to own up to her deceptions and make good, and she (and her society friends) come to realize the folly of their ways and develop more meaningful lives. I like that premise, but unfortunately, the sitcommish set of events that leads up to their transformation is just too wacky and out there for me, and I didn't develop enough of a relationship with the characters (including Blythe) to appreciate their transformation. So while I appreciate the overall spiritual message and did enjoy some of the comedy, overall this was just so-so for me. Based on The Gap Year though, I will give a couple more of Sarah Bird's books a try."}, {"review_sentiment": 3.0, "review_text": "Blythe Young is in trouble. Her rich husband is gone, along with all the trappings that came along with being an Austin socialite. Her business is bust. She owes the IRS big time. She has defaulted on her student loans. Drugs are her only solace. Nowhere to run to, baby.But, then again, Blythe does have somewhere to run to. Her old friend, Millie. And Millie doesn't let her down.If you've never read a Bird, you must do it. Now. If you're not an Austinite, or at least a Texan, be prepared to enter a unique subculture. It's funny, but very, very dark. Go for it. Especially if it's summer."}]}, "authors": ["Sarah Bird"], "isbn": "143912308X", "longitude": -97.7436995, "periods": ["2000s", "Recent Releases"], "title": "How Perfect Is That", "word_cloud": "like much bad imagine someone self guess well write whole idea many moment anyone need fun character amuse awkward moment really tire long week shenanigan fancy friend usually better witty almost engaging event coordinator able connect aspect unique character personalities trait real feel outdone remain strong testimony write first work definitely look work real come time manner describe enjoy awaiting very entertain main character hard first grow long time resident fun location familiar hilarious not witty cant help literally laugh loud matter part school mate year past talk main character conversation write full accent try figure say couple sentence far type stumble library hate say cover draw something kept flipping page page realistic main character outrageous witty glad stray away normal style great vacation zippy quick unexpected worth buying start author keep style lightheartedness something right resident suburb definitely author write describe character vivid humor enjoyable recently sarah like lot decide try however comedic click felt character design play part morality tale rather feel true life lead character former trash character word mine work way height society marriage catering business however divorce series deception try pull shun high society friend end bunk old college friend spiritual counselor sort time force deception make good society friend come folly way develop meaningful life like premise unfortunately sitcommish set event lead transformation wacky develop enough relationship character include appreciate transformation appreciate overall spiritual message enjoy comedy overall base give couple try trouble rich husband go along trapping come along socialite business bust owe big time default student loan solace somewhere run old friend let never now least prepared enter unique subculture funny dark summer", "genres": ["Fiction & Literature", "Humour", "Women's Fiction"], "summary": "Sarah Bird takes on Austin high society in this critically acclaimed, hilarious comedy of manners in which a newly divorced heroine eventually comes to realize what matters most in life.\r\n\r\nIn social satirist Sarah Bird’s seventh novel, Blythe Young is happily immersed in Austin society after she marries Trey Biggs–Dix, naively signing a strict prenuptial agreement insisted upon by her mother-in-law. But when that same mother-in-law lands a better catch for her son ten years later, Blythe, now thirty-three and childless, is unceremoniously dumped. Penniless, desperate, but determined, Blythe finds herself taking refuge at Seneca House, the housing co-op where she lived a decade ago in college. There she encounters her old college roommate, the sweet Millie Ott, one of the many friends Blythe shucked off during a frenzy of social climbing.\r\n\r\nBefore long, Blythe comes face to face with her past sins and dubious moral choices, and under the unlikely tutelage of Millie, the eternal optimist, Blythe is finally able to discover the path to real happiness. Combining the wicked humor of David Sedaris with the hip, trendy style of Lauren Weisberger, this fast-paced, and sharply observed tale is a comic triumph of a novel.", "asin": "143912308X", "rank": "1652818", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/51ZDR0hjfgL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}