{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 451, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Great story. Better than a movie. Hard to put down."}, {"review_sentiment": 1.0, "review_text": "I am disappointed"}, {"review_sentiment": 1.0, "review_text": "Make no mistake, this book is boring garbage written by one of the most overrated authors around.So many 5-star reviews, just goes to show how easily impressed so many people can be.Read the 1-star reviews instead, the ones from critical people.  They all say the same thing, the devastating drawbacks to this book and this twisted author.  Namely, the book is mostly boring, inane dialog between people who are saying a bunch of shallow things that don't matter.  They could be saying something entirely different, doesn't make a bit of difference.  It's all useless, pointless babble, drivel, designed to fill pages.And Kanon's writing style is incredibly pompous and smug.  He has no use for standard sentence structure, instead he thinks he's so awesome with his cute little style.  He tries to be \"hip\" and \"cool\" by using clipped, incomplete sentences of maybe just 3 or 4 words, sentences that ignore all the rules of grammar in the English language.  It is highly irritating, distracting, and unforgivably STUPID.Add to this NO character development, you couldn't care less about anybody in this book.  And very little narrative or plot development to boot.  Another John LeCarre, my a***!"}, {"review_sentiment": 5.0, "review_text": "Great story. I was sad to finish the book."}, {"review_sentiment": 3.0, "review_text": "Along the lines of Winds of War, in my opinion. It has enough drama along with the period-piece history to keep one reading."}, {"review_sentiment": 1.0, "review_text": "I'm struggling my way through this book. It is so heavy on dialogue. Half the time you don't know who's talking to whom."}, {"review_sentiment": 5.0, "review_text": "Good read."}, {"review_sentiment": 3.0, "review_text": "I like spy novels that are set in the backwaters of World War II and this one takes place in Istanbul, to which now-under-employed spies gravitate to await a new, pot-war world qnd their possible  role in it.  As American expat Leon Bauer becomes involved in an operation, he finds life becomes increasingly dangerous.  The plot is very involved and one must pay attention to Kanon's somewhat understated style, but in the end, you will conclude that it was a good novel with a satisfactory outcome.  An important element of the story is the smuggling of Jewish refugees into Palestine from Romania.  And, of course, the author gives splendid descriptions of life in fascinating Istanbul at the war's ending."}, {"review_sentiment": 5.0, "review_text": "Loved this novel. Having visited Istanbul for a wedding a few years ago, I was drawn in by the author's detailed description of life there over a half century ago as the backdrop for writing worthy Lecarré at his best."}, {"review_sentiment": 4.0, "review_text": "Kanon’s well written, intriguing, post WW II mystery centers on Leon Bauer, a low level spy who works undercover in Istanbul.  As American espionage in Turkey winds down, and spies are relocated, the embassy orders Leon on one last routine assignment.  The assignment, an abhorrent task for Leon, creates conflict and causes him to re-think his values and his assignment."}]}, "authors": ["Joseph Kanon"], "isbn": "1439156433", "longitude": 28.9651646, "periods": ["1900s"], "title": "Istanbul Passage: A Novel", "word_cloud": "story movie put disappoint mistake boring garbage write overrated author many review go show easily impress many people review instead one critical people say thing devastate drawback twist author namely mostly bore inane dialog people say bunch shallow thing matter say something entirely different make bit difference useless pointless babble drivel design fill write style incredibly pompous smug standard sentence structure instead think awesome cute little style try hip cool use clip incomplete sentence maybe word sentence ignore rule grammar english language highly irritate distract unforgivably character development le anybody little narrative plot development boot story sad finish line opinion enough drama history reading struggle way heavy dialogue time talk good like spy novel set backwater take place spy gravitate await new world end possible role american expat become involved operation find life become increasingly dangerous plot involve attention somewhat understate style end conclude good satisfactory important element story smuggle jewish refugee course author give splendid description life fascinate war end love visit wed year ago draw author detail description life half century backdrop write worthy best well write intrigue post mystery center low level spy work undercover american espionage wind spy relocate embassy order last routine assignment assignment abhorrent task create conflict cause value assignment", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "In the bestselling tradition of espionage novels by John LeCarre and Alan Furst, Istanbul Passage brilliantly illustrates why Edgar Award–winning author Joseph Kanon has been hailed as \"the heir apparent to Graham Greene\" (The Boston Globe).\r\n\r\nIstanbul survived the Second World War as a magnet for refugees and spies. Even expatriate American Leon Bauer was drawn into this shadow world, doing undercover odd jobs in support of the Allied war effort. Now as the espionage community begins to pack up and an apprehensive city prepares for the grim realities of postwar life, Leon is given one last routine assignment. But when the job goes fatally wrong—an exchange of gunfire, a body left in the street, and a potential war criminal on his hands—Leon is trapped in a tangle of shifting loyalties and moral uncertainty.\r\n\r\nPlayed out against the bazaars and mosques and faded mansions of this knowing, ancient Ottoman city, Istanbul Passage is the unforgettable story of a man swept up in the dawn of the Cold War, of an unexpected love affair, and of a city as deceptive as the calm surface waters of the Bosphorus that divides it.", "asin": "1439156433", "rank": "372293", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51-HeSJH4ZL.jpg", "country": "Turkey", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}