{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 25.7742658, "ratings": {"num_ratings": 86, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "I loved Carlos Eire's first memoir, \"Waiting for Snow in Havana\". His memory of his childhood and Cuba's transformation into a communist state was astnoishing considering how young he was.This follow-up, which picks up immediately after the first book leaves off, is very different. His memory is still powerful, but his fondness for his homeland and sweet memories of his family are replaced by his struggles to adapt to American life, being bounced from home to home, his strained family relationships, and how he \"dies\" over and over, reinventing himself with each new place.Also, while \"Waiting\" is fairly linear, this book goes back and forth alot. There is still a chronological narrative, but he also goes to different points in time. I think some of these scenes could be saved for a potential third memoir.In general, the mood of \"Learning\" is much darker. But in this time of questioning what to do with the immigration policies in America, particularly with DACA, having the perspective of the struggles of an immigrant child is particularly important."}, {"review_sentiment": 5.0, "review_text": "Poignant story brilliantly recalled by a sensitive and Spirit-filled man whom I would love to know!"}, {"review_sentiment": 4.0, "review_text": "This book touched my heart.  I left Cuba and came to the US at age twelve. Although I came with my parents, sister and nephew, I can identify with the struggles, pain and injustices Carlos and his brother went through not to mention the rest of the Cuban kids who were sent to US alone through the Peter Pan Project. Many of these kids never saw their parents again. I highly recommend this book for ages fourteen and up. Lights Out: A Cuban Memoir of Betrayal and Survival"}, {"review_sentiment": 5.0, "review_text": "Well written.  A lot to learn about the Cuban experience."}, {"review_sentiment": 5.0, "review_text": "Mr. Eire makes reading his story so compelling and unique all the while mentioning not an uncommon experiences of many immigrants.His keen observations and biting sarcasm mixed in with a hefty dose of religious humor makes him a compelling author."}, {"review_sentiment": 4.0, "review_text": "Great read!"}, {"review_sentiment": 5.0, "review_text": "Eire continues his saga from landing on U.S. shore. How he and his brother survived the callousness of Castro's government in letting children out of Cuba without parents is a miracle in itself. The miracle continues here with the sad, hard saga of Eire growing up here in poverty and very little love. Astonishing that he is now a professor at Yale. Eire's hatred of the Communist Revolution in Cuba is well placed."}, {"review_sentiment": 5.0, "review_text": "A great sequel to Waiting for Snow in Havana.  It is the life of a Cuban refugee in exile.  There was so much that was similar to my experience in this country forty, fifty years ago.  It is a must read for this new generation of Cuban Americans."}, {"review_sentiment": 5.0, "review_text": "A perfect book to read as cuba is so much in the news lately.  Yes, I would recommend this book."}, {"review_sentiment": 5.0, "review_text": "I wanted to read a follow-on to his \"Waiting for Snow in Havana\" and this book was great.  I like his writing style and was happy with the result.  I'd still like to know more about his life post-Learning...."}]}, "authors": ["Carlos Eire"], "isbn": "1439181918", "longitude": -80.1936589, "periods": ["2000s", "Recent Releases"], "title": "Learning to Die in Miami: Confessions of a Refugee Boy", "word_cloud": "love first memoir wait memory childhood transformation communist state astonish consider young pick immediately first leave different memory still powerful fondness homeland sweet memory family replace struggle adapt american life bounce home home strain family relationship die reinvent new wait fairly linear go back forth a lot still chronological narrative also go different point time think scene potential third general mood much darker time question immigration policy particularly perspective struggle immigrant child particularly important story brilliantly recall sensitive man touched heart leave come age twelve come parent sister nephew identify struggle pain injustice brother go mention rest kid send alone kid never saw parent highly recommend age fourteen well write lot learn experience make read story compel unique mention uncommon experience many keen observation bite sarcasm mixed hefty dose religious humor make compel author great eire continue saga land shore brother survive callousness government let child parent miracle miracle continue sad hard saga grow poverty little love professor hatred well place great sequel wait life exile much similar experience country forty fifty year new generation perfect cuba much news lately want wait great like write style happy result still know life", "genres": ["Memoir"], "summary": "In his 2003 National Book Award–winning memoir Waiting for Snow in Havana, Carlos Eire narrated his coming of age in Cuba just before and during the Castro revolution. That book literally ends in midair as eleven-year-old Carlos and his older brother leave Havana on an airplane—along with thousands of other children—to begin their new life in Miami in 1962. It would be years before he would see his mother again. He would never again see his beloved father.\r\n\r\nLearning to Die in Miami opens as the plane lands and Carlos faces, with trepidation and excitement, his new life. He quickly realizes that in order for his new American self to emerge, his Cuban self must \"die.\" And so, with great enterprise and purpose, he begins his journey.\r\n\r\nWe follow Carlos as he adjusts to life in his new home. Faced with learning English, attending American schools, and an uncertain future, young Carlos confronts the age-old immigrant’s plight: being surrounded by American bounty, but not able to partake right away. The abundance America has to offer excites him and, regardless of how grim his living situation becomes, he eagerly forges ahead with his own personal assimilation program, shedding the vestiges of his old life almost immediately, even changing his name to Charles. Cuba becomes a remote and vague idea in the back of his mind, something he used to know well, but now it \"had ceased to be part of the world.\"\r\n\r\nBut as Carlos comes to grips with his strange surroundings, he must also struggle with everyday issues of growing up. His constant movement between foster homes and the eventual realization that his parents are far away in Cuba bring on an acute awareness that his life has irrevocably changed. Flashing back and forth between past and future, we watch as Carlos balances the divide between his past and present homes and finds his way in this strange new world, one that seems to hold the exhilarating promise of infinite possibilities and one that he will eventually claim as his own.\r\n\r\nAn exorcism and an ode, Learning to Die in Miami is a celebration of renewal—of those times when we’re certain we have died and then are somehow, miraculously, reborn.\r\n\r\n“Eire is a tremendously likable narrator, honest about the limitations of memory, always wearing his heart on his sleeve.…those who remember the exuberant kid from Waiting for Snow in Havana…will be moved by the man he becomes.” The New York Times Book Review", "asin": "1439181918", "rank": "591689", "city": "Miami", "image": "https://images-na.ssl-images-amazon.com/images/I/51iTP-HgK%2BL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}