{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": -4.3217055, "ratings": {"num_ratings": 5, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Paul Pickering is the natural successor to Graham Greene, his novels contain all the elements we would expect; a morally wavering central character out of his depth and often bewildered by events unfolding around him, exotic and dangerous post-colonial locations, cultural clashes, a beautiful and mysterious love interest, assorted villains, hints of dark secrets and heavy political overtones and religious undertones.Featuring classical pianist Stanley (‘Smiles’) Miles-Harcourt, en route to play a Peace and Reconciliation Concert in a war-ravaged 1990s Congo and a reunion with his former schoolteacher and mentor, Lyman Andrew, The Leopard’s Wife has all of these essentials and does not disappoint. As events unfold we journey deep in to the African jungle and a world beyond time, with only Smiles’ diary, and the tantalizing back-story of events at an English public school, to give the reader a hint of what may lie ahead."}, {"review_sentiment": 2.0, "review_text": "While reading this book, I checked the book jacket several times to see if there was any reference to the author's expertise about the Congo: how well did he research and from what sources? Had he lived there? Were his descriptions and explanations trustworthy or just part of a story? Nada. Once I was into it, I slogged on like Smiles through the jungle, hoping there was some redeeming elevating message at the end that would make it all worth it, the way I would persevere through an exceptionally messy diaper change knowing that once I was finished I could wash and I would have a clean happy baby to boot.It didn't happen for me.  I think I read what was supposed to be some point to the story, but it couldn't overcome the rest of the book.  Part of what made me mistrust him was the over-the-top story of the horrors of an English boarding school. Two stars for a suspenseful novel, but read this only if you want to also read well crafted-descriptions of the erections, sodomy rape, and other horrific abuse.Referencing the diaper change, I put this where I put the other \"yukky stuff\"."}, {"review_sentiment": 5.0, "review_text": "Wow. Just wow! I can't think of a better word to describe The Leopard's Wife. I loved it! There were some very powerful themes in here and I feel like I might have to re-read it again to grasp a better understanding of them. The plot was suspenseful and surprising at times; it was unpredictable in a good way. Also the writing itself was just awesome it was like I was actually in the Congo with Smiles and the crew. The characters in my opinion were well fleshed out which was a great asset to the story. After all nobody likes one dimensional characters. War is a major reoccurring theme in this book but the funny thing is that I didn't find this book to be overly political. I would definitely recommend this book. If you're like me you will walk away from it pondering the facts of life."}, {"review_sentiment": 4.0, "review_text": "Every now and again, a great read comes into my hands, and this book is one of them.  It's all about Stanley Miles-Harcourt (known as Smiles), a famous concert pianist who arrives in the Congo to play a concert for Peace and Reconciliation.  Everything goes awry and he ends up having to travel hundreds of miles up the Congo River with the baby grand Zimmermann piano, in a dubiously safe boat, through and sometimes across , impenetrable jungle, to where the concert is to be broadcast in a seemingly random effort to help end the violent tribal wars.  The story is set in the late 1990s when war was tearing the country apart, tribes against tribes, resulting in violent deaths, rape, and torture.  Alongside the background of the Congo, its uncertainty, violence, breath-taking beauty and sometime `noble savages', we start to learn (through his diary entries) of Smiles' own uncertain, sometimes violent background at his public school in England.  There is an underlying mystery that carries the reader as though on his/her own river journey, wondering what we will find at the end.  Will the piano and pianist ever get to their destination?  And why is Smiles is so keen to reconcile with his old school master and mentor, Lyman Andrew, who is supposed to be part of the Peace and Reconciliation concert?  The answers are found in the diary entries, tantalizingly exposing us to the darker side of English public school life.The writer, Paul Pickering, has drawn this clashing contrast of cultural and racial differences, which is essence of this book.  Bringing the two together, is the \"Leopard's wife\", beautiful, clever, dangerous Lola, married to a Congolese military leader, the terrible Xavier, in love with his rebel brother, and now in love with Smiles and all that he represents to her.Incongruous at times, amusing, but deeply penetrating, the book explores the frailty and strength of humankind, driven by desire, rage, arrogance, and the will to survive.Well recommended."}, {"review_sentiment": 5.0, "review_text": "Highly recommend this book as not only is it a good story but also gives you a brilliant insight into the Congo and allows you to move beyond your preconceptions gathered from the international medias negative press of the country."}]}, "authors": ["Paul Pickering"], "isbn": "1439168547", "longitude": 15.3125974, "periods": ["2000s", "Recent Releases"], "title": "The Leopard's Wife: A Novel", "word_cloud": "natural successor novel contain element morally waver central character depth often bewilder event unfold around exotic dangerous location cultural clash beautiful mysterious love interest assort villain hint dark secret heavy political overtone religious classical pianist route play reunion former schoolteacher mentor essential disappoint event unfold journey deep jungle world time diary tantalize event english public school give hint ahead read check jacket several time see reference author expertise well research source have live description explanation trustworthy part story slog jungle hop redeem elevate message end worth way exceptionally messy diaper change know finish happy baby happen think suppose point story rest part make mistrust story horror board school star suspenseful want also well erection sodomy rape horrific change put put stuff wow better word describe love powerful theme feel better understand plot suspenseful surprising time unpredictable good way also write actually crew character opinion well fleshed great asset story nobody like dimensional character major reoccurring theme funny thing find overly political definitely like walk away ponder fact life great come hand know famous concert pianist arrive play concert go awry end travel hundred mile baby grand piano dubiously safe boat sometimes impenetrable jungle concert broadcast seemingly random effort help violent tribal war story set late war tear country apart tribes tribe result violent death rape torture background uncertainty violence beauty sometime savage start learn diary entry uncertain sometimes violent public school underlie mystery carry river journey wonder find end piano pianist ever destination reconcile old school master mentor suppose part concert answer find diary entry tantalizingly expose darker side public school writer drawn clash contrast cultural racial difference essence bring together wife beautiful clever dangerous marry congolese military leader terrible love rebel brother love represent time amuse deeply penetrate explores frailty strength humankind driven desire rage arrogance recommend recommend good story also give brilliant insight allow preconception gather international medias negative press country", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Now in paperback from London Times columnist Paul Pickering—the breathtaking story of a young pianist who travels through the Congo to meet a former mentor with whom he shares a dark past, falling in love with a Congolese army officer’s wife along the way.\r\n\r\n• A renowned writer: A seasoned journalist and novelist, Paul Pickering has traversed the globe for his stories. For The Leopard’s Wife, he undertook an expedition down the Congo River, from Kisangani to Kinshasa, to craft a novel brimming with authenticity of a majestically beautiful country torn apart by civil war.\r\n\r\n• A captivating story of love and war: The Democratic Republic of Congo has been embroiled in a civil war since 1998, during which more than 5 million people have been killed. The Leopard’s Wife provides a searing look at both the atrocities committed, particularly against women, and the resiliency of its people to soldier on in the face of constant uncertainty. It is a beguiling story of greed, power, and ever-changing alliances, of the consequences of misplaced idealism and betrayal, and of the lengths people will go to for love.\r\n\r\n“An unusual book. Blackly humorous, it is a character study as well as an espionage novel. Highly literate, brooding and sad, The Blue Gate of Babylon is much more than a spy story. It is superior literature.” The New York Times ", "asin": "1439168547", "rank": "6293576", "city": "Kinshasa", "image": "https://images-na.ssl-images-amazon.com/images/I/51pRad4ol%2BL.jpg", "country": "DR Congo", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}