{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 331, "rating": 3.7, "reviews": [{"review_sentiment": 3.0, "review_text": "I'm a fan of Martin Cruz Smith. However, this novel did not live up to his past works."}, {"review_sentiment": 4.0, "review_text": "Once again MC Smith transports the reader to the period of the novel, so you feel like you are witnessing the end of WWII in Italy, with the fascinating, ever-changing interplay between the German occupiers, fading Fascists, vengeful Partisans, and the invading Americans."}, {"review_sentiment": 4.0, "review_text": "I liked the main character, a fisherman, because he was not impressed with himself. He was drawn into situations beyond his control and did the simple right thing."}, {"review_sentiment": 2.0, "review_text": "Lovers of Venice’s captivating atmosphere, architecture and culture will be disappointed. The book misses the opportunity to capitalize on that appeal, which should have been a better background to the story. The tongue in cheeck humor, which irritatingly ran throughout didn’t work either, making it not one thing nor the other. The least satisfying of Martin Cruz Smith’s books and a struggle to maintain enough interest to finish."}, {"review_sentiment": 5.0, "review_text": "Great read!"}, {"review_sentiment": 3.0, "review_text": "An overabundance of WWII stories covers the shelves, still many novels pass muster and entertain the reader.  The Girl from Venice twists the story of a Jewish girl adrift in Italy during the last days of WWII.  While fishing, Cenzo discovers Giulia.  Cenzo must now hide Giulia and find someone to take her to safety as the Germans are herding Jews and killing them.  Martin Cruz Smith captures the beauty of the sea, the fish, and the art of fishing in this story of love.  Many authors concentrate on the hardships of the war and the terrible events that happen, but Smith glides over all the tragedies.  Of course, the jealousy among brothers permeates the story, but in the end, Cenzo follows his heart and conscience."}, {"review_sentiment": 2.0, "review_text": "I've read Gorky Park and Polar Star and this pales in many ways.  If I had read this first I probably would not have read more by this author."}, {"review_sentiment": 5.0, "review_text": "am a long time  Martin Cruz Smith fan and liked the book"}, {"review_sentiment": 5.0, "review_text": "Great read!"}, {"review_sentiment": 1.0, "review_text": "Not interesting or well written"}]}, "authors": ["Martin Cruz Smith"], "isbn": "1439140235", "longitude": 12.3345898, "periods": ["1900s", "Recent Releases"], "title": "The Girl from Venice", "word_cloud": "fan however live past work once transport period feel witness end fascinate interplay german occupier fade fascist vengeful invading like main character fisherman impress draw situation control simple right thing lover captivate atmosphere architecture culture disappoint miss opportunity capitalize appeal better background story tongue chick humor irritatingly run work either make thing least satisfying struggle maintain enough interest finish great overabundance stories cover shelf still many novel pass muster entertain twist story jewish adrift last day fish discovers someone safety herd kill capture beauty sea fish art fish story love many author concentrate hardship war terrible event glide tragedy course jealousy brother permeates story end follow heart conscience pal many way first probably long time fan like great not interest well write", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "WWII"], "summary": "The stunning new novel from the author of the international bestseller Gorky Park: a World War II love story set against the romance and danger of occupied Venice.\r\n\r\nCenzo is a world-weary fisherman, determined to sit out the rest of the war. He’s happy to stay out of the way of the SS, quietly going about his business of fishing in the lagoons of northern Italy. Then one night, instead of pulling in his usual haul, Cenzo fishes a young woman out of the canal. Giulia is an Italian Jew who has managed to escape capture and is determined to find her family. This meeting results in them both taking an entirely unexpected journey, and Cenzo suddenly finds himself thrown headlong into the world of international wartime politics, where everyone has their own agenda and nowhere is safe…\r\n\r\n'Brilliant…enough enigmas within enigmas within enigmas to reel the mind'. The New Yorker", "asin": "1439140235", "rank": "75283", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51QLAKMiOqL.jpg", "country": "Italy", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}