{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 28, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Australia fires the imagination, and, no wonder--the whole damn place is alive, with a huge serpent underground, and fish who lead the fishermen to magical places in the sea.  White people are just a passing nuisance in the first novel written by an Aboriginal woman.  We call it 'nature' because we lack the pan-theistic worldview of a people who listen and believe what goes on around them.  They aren't spiritual saints, either.  Two families have been feuding for 400 years, and it ain't over yet."}, {"review_sentiment": 4.0, "review_text": "It's a dark story. If you like odd ball stories that are well written and come from a completely different place, this is a good read. Needs a bit of concentration. Great insights into this way of life."}, {"review_sentiment": 4.0, "review_text": "This book used beautiful language to describe views and create the scene. The divide between mining conglomerates and the indigenous population was  outlined, I feel I could see Desperance, and the authors knowledge and awe of the spiritual ancestry shone through."}, {"review_sentiment": 4.0, "review_text": "I liked this book. The first 100 pages had me spell-bound, with the language of the Gulf Country, the colours and the spirits of that shining place. As time went on, however, the book lost me a little, but never completely. I think this is a book that needs to be read more than once, to really appreciate the depth and beauty of the writing."}, {"review_sentiment": 5.0, "review_text": "Well written, this tome might be difficult to get into. However, once you get caught up in it, you will realize just how unique this is.It is the age old battle of a struggle for land. The setting is Australia. Competing groups want the same area.  Industrialized folks vs. longtime native peoples.  Who will win out?This is a surprisingly good sleeper of a novel. Recommended-Read it."}, {"review_sentiment": 3.0, "review_text": "I had to start this novel 3 times before I could finally get into it, but when I finally did, I enjoyed it.  The story is not particularly original, but it is nicely written.  THe main narrative concerns an aboriginal family, and the mysticism woven throughout the story adds a lot of interest, although I think that it was so foreign to me that it was hard to get through at first.  Hype on the novel had me quite excited for it, but ultimately it fell somewhat flat of the \"literary sensation\" tag that has been applied to it.  This will be enjoyable for folks who have patience with an involved story line and are interested in the mystical aspects of the aboriginal culture.  I would suggest \"The Gone-Away World\" by Nick Harkaway as an alternative with first rate writing and a highly original storyline that doesn't get as bogged down in the middle."}, {"review_sentiment": 5.0, "review_text": "I got this book because I wanted to understand why I couldn't talk to my Australian housemate.  Probably Australians would never agree with me, but I think at this point the average Sydneysider is more like native Australians than she is like British or Americans, especially the younger ones of both.  I think it's become a more deeply and durably exotic country than any of them know themselves.  Wright might grudgingly agree with me a tiny little bit, I don't know.  Look what she writes about the immigrant townspeople (paraphrased a bit):  You got to believe what was true in the homes of  Desperanians. A folk tale of ancient times elsewhere  was stored in treasure chests in the minds of these  people. A sea people such as themselves, come from  so far away to be lost, would forever have all seas  in their sights. That was their story.The book didn't help the way I thought it might because there are almost no conversations with two people in them.  There are people talking to themselves out loud, or wandering around thinking about things, and then there are massive theatrical mob scenes in towns and bars and camps with people throwing things or combing the area with torches or gawking at a disaster.  There are also mob scenes where people are not in the same room but are sheltered inside their humpys or houses connected by their similar thoughts, so of course these people are not actually talking at all, since they are relatively far away from each other, though i mean...not that far, like, a few feet, not like between Australia and America far...but, although not a conversation it's written in the book as if it were one through being mediated by the cultural framework of the town's streets or the beach or the camp or the Amazon comments forum.In spite of not helping it made me feel a lot better because her characters are oddly open and gracious toward past conversations in their memory: even though when they were actually talking it would seem to a third listener like they were getting nowhere, yelling past each other, or just, um...saying something like, trying to look for spots or flares on the sun which is impossible because it's too bright, well, it's not true.  In the end everyone does speak and hear each other.  And it does not matter if they repeat themselves during the conversations or not because everything echos, for years.  In _Carpentaria_ no single substory, even in the sense that a conversation is a substory....it never happens in less than five years ever, and often takes much longer.The story itself is beyond unbearable but the way it's told is brilliant enough to soothe some of the regret.  definitely srsbzns."}, {"review_sentiment": 4.0, "review_text": "Several reviewers have commented that this is a difficult book to read.  I will agree with that.  It is not the type of book that most readers can read while other things are going on around them.  Like all really great works of literature, it requires the readers' utmost attention.  The catch is that once the reader really focuses on the text, the payback is immense.Carpentaria is a fascinating work that combines elements of magical realism and Australian history to tell a fantastic and riveting tale (or tales) of the Aboriginal people.  At times beautifully surreal and at other times painfully realistic, this book is populated with amazing and truly fantastic characters and situations that the author uses to highlight injustice.  The language is equally impressive.  Like the story, it moves seamlessly between the majestic and the everyday, leaving the reader in no doubt that the author has carefully selected every word in this carefully-written novel.  I suggest this book for fans of exceptional writing.  Give yourself time to read this book as it deserves to be read and you will really enjoy it."}, {"review_sentiment": 5.0, "review_text": "A fantastic look at Australian native narrative mixed with modern day culture confusion.This is a difficult read for someone not accustomed to Aborigine spirituality, the colonization of Australia and nature metaphor.I would recommend brushing up on Australian history before reading, it will transform an otherwise confusing and stressful read into a thoughtful and provocative narrative with great character."}, {"review_sentiment": 3.0, "review_text": "I have been trying to read Carpentaria for the last few months. When I began reading the book, I was fascinated by Normal Phantom and angel Day. I wanted to know more about the people of Desperance. But, I am finding the book tedious to read. I read a chapter and put it down and pick up something else to read.  Then I have to reread part of what I read to help me remember the story.  I plan to try and finish the book, but it may take me the rest of the year.P.S.  The book won!  I have tried and tried and I can not get into this book...So what good is a book the rader can not get into?  There is a story to tell here but the struggle is not worth finding out.  I have read WAR AND PEACE faster and it is easier to start than this"}]}, "authors": ["Alexis Wright"], "isbn": "1439157847", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Carpentaria: A Novel", "word_cloud": "fire imagination wonder whole damn place alive huge serpent fish lead fisherman magical place sea people pass nuisance first write woman call lack worldview people listen believe go spiritual saint family feud year ai yet dark story odd ball story well write come completely different place good bit concentration insight way life use beautiful language describe view create divide mining conglomerate indigenous population outline feel author knowledge awe spiritual ancestry shone like first page language color spirit shin place time go however lose little never completely think need really appreciate depth beauty write well write tome difficult however caught unique age old battle struggle land set compete group want area folk longtime native people win surprisingly good sleeper start time finally finally enjoy story particularly original nicely write main narrative concern aboriginal family mysticism weave story add lot interest think foreign hard get first quite excite ultimately fell somewhat flat literary sensation tag apply enjoyable folk patience involved story line interested mystical aspect aboriginal culture alternative first rate write highly original story line get bogged middle get want understand australian housemate never think point average native british especially younger one think deeply durably exotic country know grudgingly tiny little bit know write immigrant townspeople paraphrase bit get believe true home desperanians folk tale ancient time elsewhere stored treasure chests mind people sea people come far away lose forever sight help way think almost people people talk loud wander think thing massive theatrical mob scene town bar camp people throw thing comb area torch gawk disaster also mob scene people room shelter hump house connect similar thought course people actually talk relatively far away mean far foot far conversation write mediated cultural framework town street beach camp comment help make feel lot better character oddly open gracious past conversation memory even actually talk third listener get nowhere yell um say something try spot flare sun impossible bright well true end everyone speak hear matter repeat conversation everything year single sub story even sense conversation sub story never happen le year ever often take much story unbearable way tell brilliant enough soothe regret definitely srsbzns several reviewer comment difficult agree type reader thing go really great work literature require reader utmost attention catch really focus text payback fascinate work combine element magical realism australian history tell fantastic rivet tale tale aboriginal people time beautifully surreal time painfully realistic populate amazing truly fantastic character situation author us highlight injustice language equally impressive story move seamlessly majestic everyday leave doubt author carefully select word suggest fan exceptional write give time deserves really fantastic look australian native narrative mixed modern day culture difficult someone accustom spirituality colonization nature brush australian history read transform otherwise confuse stressful thoughtful provocative narrative great character try last month begin read fascinate want know people find tedious chapter put pick something else then reread part help story plan finish try try get so good darer story tell struggle find faster easier start", "genres": ["Fiction & Literature"], "summary": "IN the sparsely populated northern Queensland town of Desperance, battle lines have been drawn in the disputes among the powerful Phantom family of the Westend Pricklebush, Joseph Midnight’s renegade Eastend mob, and the white officials of neighboring towns. Trapped between politics and principle, past and present, the indigenous tribes fight to protect their natural resources, sacred sites, and, above all, their people. \r\n\r\nSteeped in myth and magical realism, Wright’s hypnotic storytelling exposes the heartbreaking realities of Aboriginal life. Carpentaria teems with extraordinary, larger-than-life characters who transcend their circumstances and challenge assumptions about the downtrodden \"other.\" The novel \"bursts with life\" (Daily Telegraph) as Alexis Wright re-creates the land and its people with mysticism, stark reality, and pointed imagination.", "asin": "1439157847", "rank": "1002291", "city": "Carpentaria", "image": "https://images-na.ssl-images-amazon.com/images/I/31TO0ZI4xtL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}