{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 872, "rating": 4.1, "reviews": [{"review_sentiment": 3.0, "review_text": "This was the final part of a trilogy that included the Paris Wife and Behaving Badly (not the exact title) that all dealt with the time Hemingway spent in Paris.  The first two were entertaining reads, but this one was tough. Maybe because I already knew the history? Not sure....."}, {"review_sentiment": 3.0, "review_text": "This book was for book club.  I'm looking forward to hear what the other members felt.The best part was when Hemingway was with F Scott"}, {"review_sentiment": 5.0, "review_text": "everything went good"}, {"review_sentiment": 4.0, "review_text": "A lesser work in my opinion."}, {"review_sentiment": 5.0, "review_text": "You wouldn’t think that a mere “restored edition” of one of the most popular books ever published, Ernest Hemingway’s Paris memoir, “A Moveable Feast,” would provide any news or insights.After all, Hemingway’s carcass has been picked over by at least 49,000 biographies since his death in 1961, 48, 999 of which I have read.And I initially dismissed this “restored edition” when I read the self- indulgent nepotism, in the form of unnecessary introductions, by his son Patrick Hemingway and his grandson Sean Hemingway.Boy was I wrong!What Papa’s bloodlines have uncovered from the Hemingway archives at Harvard is that the popular first edition was heavily edited (and censored) by Hemingway’s fourth and final wife, Mary.In particular, Mary made sure that the never completed introduction, which confirms that the entire memoir is essentially a love letter to his first wife Hadley, ever saw the light of day. This is contained in the ending section entitled “fragments,” Hemingway’s various drafts for an introduction.Here are some of the sentences that Mary Hemingway did not want to see published:“I have left out much and changed and eliminated and I hope Hadley understands. She is the heroine and the only person who had a life that turned out well and as it should except certain of the rich.” “She deserves everything good in life including accurate reporting.”“There is never any end to Paris but maybe this will give you some true part of the people and places and the country when Hadley and I believed that we were invulnerable and that was the end of the first part of Paris.”It is in the “Pilot and the Rich” chapter near the book’s end, that Hemingway admits he fell for the wealthy charms of his second wife Pauline, ruining the innocence of his true love for Hadley. While the Great Depression prices of the 1920s, when the dollar had enormous value against the weak French Franc, made it possible for Hemingway and Hadley and their son Bumby to survive and even live part of the year in Swiss hotels, Pauline’s wealth allowed him the financial security to write fiction full-time, a situation he had not enjoyed with Hadley, when he had to make frequent trips away from her to cover post World War I diplomatic conferences as a journalist, because they needed the money. When I began reading Hemingway in the 1970s he was being dismissed as a male chauvinist whose female characters were inhumanly shallow and whose real talent was as a pretentious food critic, so replete were his novels filled with descriptions of good food and fine wine.Yet by the 1980s I was reading Simone de Beauvoir, the greatest feminist of them all, a writer who not only admired Hemingway but did so to a degree that she modeled her own literary style after his. Female readers today, the beneficiary of an unintended feminist revival, single-handedly achieved by the boorish degrading of women by Donald Trump, can now reevaluate “A Moveable Feast” through the prism of time.The prism of time reveals a Hemingway in these pages apologizing for his own, at times, overbearing, boorish, selfish behavior, and makes clear he understood that Hadley had sacrificed her own career as a pianist to his as a writer. In this startling admission of his desertion of Hadley, he writes, “He had the irreplaceable early training of a bastard and a latent and long denied love of money.”Hemingway portrays the rich Pauline as a stalker of talent, not uncommon in the arts world. He’s not accusing her of being a “traditional home wrecker,” but rather a rich woman buying the innocent happiness of the naïve, the naïve being he and Hadley.“When you have two people who love each other, are happy and gay and really good work is being done by one or both of them, people are drawn to them as surely as migrating birds at night to a powerful beacon.” Of course, this is more than a comment on the rich buying what they want. It is a universal observation that the unhappy will destroy the happiness of others, or try to acquire it, in a kind of corporate takeover, as it were.In one of the most remorseful confessions in world literature, Hemingway owns up to his abandonment of Hadley, his one true love:“When the husband is a writer and doing difficult work on a book so that he is occupied much of the time and is not a good companion or partner to his wife for a big part of the day, the arrangement has advantages until you know how it works out. The husband has two attractive girls around when he has finished work. One is new and strange and if he has bad luck he gets to love them both. Then the one who is relentless wins.“The wife does not know about it and trusts the husband. The new one says you cannot really love her if you love your wife too. She does not say that at the start. That comes later when the murder’s done.”You might say that Hemingway got what he deserved for leaving Hadley for the new and exciting and variety and wealth of Pauline, and many have. And you and they may be right.Yet to call leaving your first wife for your second wife “murder” is a metaphor that shows a level of contrition that is extraordinary and brutally honest to a degree that few men could own up to. And demonstrates the extreme sensitivity that made Hemingway, good and bad, what he was as a writer and man.These updates and observations about the “restored” “A Moveable Feast” do not, of course, explain the unique charm of the stories and why you may have read the original edition and now will read this one.Despite grumblings over the years of how rude certain Parisians or Parisian waiters may have been, I have NEVER, EVER, heard anybody say Paris is not a beautiful, haunting, inviting city.That is the advantage Hemingway works from in his delightful descriptions of the city which is the core of this classic book. You, the reader, may now begin:“Then there was the bad weather. It would come in one day when the fall was over. You would have to shut the windows in the night against the rain and the cold wind would strip the leaves from the trees in the Place Contrescarpe.”[Hansen Alexander’s new work of creative nonfiction is HOW THE LIONS ATE TIM TEBOW.]"}, {"review_sentiment": 4.0, "review_text": "This memoir of Hemingway’s time in Paris in the early 1920s contains observations on writing and writers, comments on members of the “lost generation,” snippets of life in Paris, and reflections on the impact these years in Paris had on Hemingway’s later life.  This is the “restored edition,” which includes additional material not in the original edition edited by Hemingway’s fourth (and final) wife Mary.  Editor and Hemingway grandson Seán Hemingway provides a nice introduction describing the differences between this edition and the original one, and the reasons for his editorial decisions.  He also captures nicely what writing is all about when he notes Hemingway’s “ability to discern the gold from the dross and turn his observations into prose,” an ability which Hemingway first developed during the time remembered in this book.Ernest and his wife Hadley were poor, but Hemingway mentions more than once how happy they were.  He also notes how being hungry “sharpens all of your perceptions,” so that even paintings are viewed differently.  Apparently there is nothing quite like going to a museum on an empty stomach, though Hemingway also emphasizes the importance of finding routes through the city that do not take one past restaurants or bakeries that would simply intensify the hunger pangs.Of course, many of Hemingway’s friends and associates (and rivals) in Paris were other writers, artists, or people associated with writing (like Sylvia Beach, who ran the famous Shakespeare and Company bookstore in Paris but was so much more than a bookshop owner).  His observations on these writers are scattered throughout the book and regularly ground the narrative in the expatriate literary life of Paris during the interwar years.  The poet Ezra Pound is described in completely positive term: generous, loyal, a good friend.  Hemingway’s contempt for Ford Madox Ford, on the other hand, is undisguised, though consciously and admittedly so.  Though Gertrude Stein comes across as pompous, Hemingway’s view of her is generally positive early on, somewhat less so later.  His portrait of F. Scott Fitzgerald and his wife Zelda is fascinating and more extensive than any others.  Hemingway and Fitzgerald were friends, but while Hemingway clearly admires his best writing, he also thinks he could have done much more.  He is distressed about his friend’s heavy drinking, and is not favorably disposed toward Zelda, whom he describes as envious of Scott’s writing.As one might expect, there are numerous observations about writing, including perhaps most famously Hemingway’s description of the reminder he would deliver to himself when he got stuck in his writing: “’Do not worry.  You have always written before and you will write now.  All you have to do is write one true sentence.  Write the truest sentence you know.’  So finally I would write one true sentence and then go on from there.”  But this is not primarily a book about writing, and many of Hemingway’s other observations are small gems.  About Ezra Pound he notes that “he liked the works of his friends, which is beautiful as loyalty but can be disastrous as judgment.”  And there is this brief portrait of the Paris years, which contains volumes in a few words: “But Paris was a very old city and we were young and nothing was simple there, not even poverty, nor sudden money, nor the moonlight, nor right and wrong nor the breathing of someone who lay in the moonlight beside you.”There’s a poignancy to some of the writing, with hints of the heartbreak and betrayal that were also part of the Paris years.  Hemingway has the perspective of decades as he writes, but with this hindsight comes a degree of cynicism about younger days and their innocence.  This emerges most noticeably as he casts backward glances (made most obvious in one of the sketches added to this edition) at a simpler time before his first marriage ended as a result of his romance with Pauline, who became his second wife (and was the grandmother of Séan, editor of this volume).  The final paragraph in the chapter titled “Winters in Schruns” is a remarkable description.  It starts: “The last year in the mountains new people came deep into our lives and nothing was ever the same again.  The winter of the avalanches was like a happy and innocent winter in childhood compared to that winter and the murderous summer that was to follow.  Hadley and I had become too confident in each other and careless in our confidence and pride.”  Though Hemingway offers no details on “the bulldozing of three people’s hearts to destroy one happiness and build another,” details are not needed.  The episode is more powerfully described as an almost entirely interior event.I have read only a couple of Hemingway’s novels, but the same straight-ahead writing style that characterized them is found in this memoir.  It serves the purpose well, offering a largely unadorned portrait of a time and a place that were formative for the craft and the sensibilities of the man who, in 1954, became one of the handful of Americans to receive the Nobel Prize in Literature."}, {"review_sentiment": 5.0, "review_text": "As described.  Quick shipper."}, {"review_sentiment": 5.0, "review_text": "A Movable Feast is a timeless classic. Ernest Hemingway  writes about his time in Paris."}, {"review_sentiment": 5.0, "review_text": "Fun read. Especially when he's traveling with F. Scott Fitzgerald."}, {"review_sentiment": 5.0, "review_text": "my favorite book by EH"}]}, "authors": ["Ernest Hemingway"], "isbn": "143918271X", "longitude": 2.3514992, "periods": ["1900s"], "title": "A Moveable Feast", "word_cloud": "final part trilogy include exact title dealt time spend first entertain read tough maybe already know history not sure club look forward hear member best part everything go good lesser work opinion think mere restore edition popular ever publish memoir news carcass pick least biography death initially dismiss restored edition indulgent nepotism form unnecessary introduction son grandson wrong bloodline uncover archive popular first edition heavily edit censor fourth final wife particular make sure never complete introduction confirms entire memoir essentially letter first wife ever saw light day contain end section entitle fragment various draft sentence want see publish leave much change eliminate hope understand person life turn well certain deserve everything good life include accurate never end maybe give true part people place country believe invulnerable end first part chapter end admit fell wealthy charm second wife ruin innocence true love price dollar enormous value weak french make possible son survive even live part year swiss hotel wealth allow financial security write fiction situation enjoy frequent trip away cover post diplomatic conference journalist need money begin read dismiss male chauvinist female character inhumanly shallow real talent pretentious food critic replete novel fill description good food fine read greatest feminist writer admire degree model literary style reader today beneficiary unintended feminist revival achieve boorish degrade woman prism prism time reveal page apologize time overbear boorish selfish behavior make clear understood sacrifice career pianist writer startle admission desertion write irreplaceable early training bastard latent long deny portrays rich stalker talent uncommon art world accuse traditional home wrecker rather rich woman buy innocent happiness nave nave people love happy gay really good work do people draw surely migrate bird night powerful course comment rich buying want universal observation unhappy destroy happiness others try kind corporate takeover remorseful confession world literature own abandonment true love husband writer difficult work occupy much time good companion partner wife big part day arrangement advantage know work husband attractive girl finish work new strange bad luck get then relentless wife know trust husband new say really love wife say start come later murder get deserve leave new excite variety wealth many leave first wife second wife murder metaphor show level contrition extraordinary brutally honest degree men demonstrate extreme sensitivity make good bad writer update observation restore course explain unique charm story edition grumbling year rude certain parisian waiter hear anybody say beautiful haunt inviting advantage work delightful description city core classic then bad weather day fall window night rain cold wind leaf tree new work creative nonfiction memoir time early contain observation write writer comment member lose generation snippet life reflection impact year later life restored edition include additional material original edition edit fourth final wife grandson provide nice introduction describe difference edition original reason editorial decision also capture nicely write note ability discern gold dross turn observation prose ability first develop time remember wife poor mention happy also note hungry sharpens perception even painting view differently apparently nothing quite go museum empty stomach also emphasize importance find route city take past restaurant bakery simply hunger course many friend associate rival writer artists people associated write run famous bookstore much bookshop owner observation writer scatter regularly ground narrative expatriate literary life interwar year poet describe completely positive term generous loyal good friend contempt hand undisguised consciously admittedly come pompous view generally positive early somewhat le later portrait wife fascinate extensive others friends clearly admire best writing also think do much distress friend heavy drinking favorably dispose describe envious one numerous observation write include perhaps famously description reminder get stuck writing always write write write true sentence truest sentence finally true sentence go primarily write many observation small gem note like work friend beautiful loyalty disastrous brief portrait year contain volume word old city young nothing simple even poverty sudden money moonlight right wrong breathe someone lay moonlight poignancy write hint heartbreak betrayal also part year perspective decade write hindsight come degree cynicism younger day innocence emerge noticeably cast backward glance make obvious sketch add edition simpler time first marriage end result romance become second wife grandmother editor volume final paragraph chapter title remarkable description start last year mountains new people come deep life nothing ever winter avalanche happy innocent winter childhood compare winter murderous summer become confident careless confidence offer detail bulldoze people hearts happiness detail need episode powerfully describe almost entirely interior couple novel write style characterize found serve purpose well offer largely unadorned portrait time place formative craft sensibility man become handful receive describe shipper movable timeless classic write time travel favorite eh", "genres": ["Memoir"], "summary": "Ernest Hemingway’s classic memoir of Paris in the 1920s, now available in a restored edition, includes the original manuscript along with insightful recollections and unfinished sketches.\r\n\r\nPublished posthumously in 1964, A Moveable Feast remains one of Ernest Hemingway’s most enduring works. Since Hemingway’s personal papers were released in 1979, scholars have examined the changes made to the text before publication. Now, this special restored edition presents the original manuscript as the author prepared it to be published.\r\n\r\nFeaturing a personal Foreword by Patrick Hemingway, Ernest’s sole surviving son, and an Introduction by grandson of the author, Seán Hemingway, editor of this edition, the book also includes a number of unfinished, never-before-published Paris sketches revealing experiences that Hemingway had with his son, Jack, and his first wife Hadley. Also included are irreverent portraits of literary luminaries, such as F. Scott Fitzgerald and Ford Maddox Ford, and insightful recollections of Hemingway’s own early experiments with his craft.\r\n\r\nWidely celebrated and debated by critics and readers everywhere, the restored edition of A Moveable Feast brilliantly evokes the exuberant mood of Paris after World War I and the unbridled creativity and unquenchable enthusiasm that Hemingway himself epitomized.", "asin": "143918271X", "rank": "10353", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51lVoALt-2L.jpg", "country": "France", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}