{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 762, "rating": 3.1, "reviews": [{"review_sentiment": 3.0, "review_text": "I bought this book because I was very impressed with her novel \"The Time Travelers Wife\" but was disappointed with this read. Very unusual book."}, {"review_sentiment": 4.0, "review_text": "Julia and Valentina are identical twins. They are the daughters of Edie, who was the twin sister of Elspeth, who has just died and left J & V her flat in London, along with a great deal of money. The catch is, they must spend a year living in the flat, and their parents must not be allowed into the flat. This sounds all right to J & V, who although technically adults, show no signs of maturity. They have dropped out of three colleges and do nothing more than exist. Actually, that’s not quite true; Valentina is interested in fashion design and enjoys sewing and upcycling used clothing. Julia, the bolder of the two, has no interest in anything, and as she’s the dominant one, nothing is largely what they do.The building they come to live in has other tenants; on the top floor lives Martin, a victim of severe OCD and agoraphobia, whose wife has just left him, unable to deal with his rituals and towers of trash any longer. On the ground floor lives Robert, who was Elspeth’s lover. The building backs up to Highgate Cemetery, with the graves of many famous people as well as the crypt that contains Elspeth herself, and her family. This will be important later. The flat is also inhabited by Elspeth’s ghost- something she makes known after a while.This is one creepy book- and some of the creepiness isn’t supernatural. The way Julia dominates Valentina, the reason for the rift between Edie and Elspeth, the relationship between Valentina and Robert and between Valentina and Elspeth- there is wrongness everywhere. And that created a problem for me: I couldn’t manage to really like any of the characters. Even ones who I felt sorry for at first turned out monstrous. As another reviewer said, Martin is the most human and likable person in the book- and his relationship with Julia is actually a good one.It wasn’t hard to figure out what would happen after a certain point, but reading how it played out was still a creep fest. The author’s prose is lovely; even when I was disgusted with the people, the writing beckoned me on. Because of my dislike for the characters I can’t give it five stars, but it’s a very strong four, because very little horror really gives me the shivers."}, {"review_sentiment": 3.0, "review_text": "None of the grace and magic of her other work.  Characters are beautifully developed but unfortunately no one is likable."}, {"review_sentiment": 3.0, "review_text": "I've had this book on my bookshelf since 2010, and I finally read it. As expected, Niffenegger's writing is confident and rewarding, emotional and logical. I loved the premise and the setting--but the ending very nearly ruined the entire book for me. The characters end up making some of the most selfish decisions I've ever read, and not in the way that is fun to read. It felt almost like a betrayal to characters I'd spent 300 pages getting to know very well. It made my stomach hurt."}, {"review_sentiment": 3.0, "review_text": "I read it . I liked it somewhat"}, {"review_sentiment": 5.0, "review_text": "Loved the book.  Didn't end as I expected.  Left me hanging.  Not sure I liked the ending."}, {"review_sentiment": 1.0, "review_text": "Absolute nonsense. I barely had the will to finish it. The premise was ridiculous and the twins were so poorly written I couldn't bring myself to care about their possible death."}, {"review_sentiment": 5.0, "review_text": "With Her Fearful Symmetry, Audrey Niffenegger creates two worlds on the edge of each other, influencing the characters who inhabit each (or, in some cases, both.). Cemeteries like Highgate were more like parks in the 19th Century.  Victorians and Edwardians had a much more initmate relationship with death and the dead, and setting the house so central to the plot at the edge of Highgate, indeed, giving it a private entrance that allows the home's inhabitants to move between and through the cemetery grounds and the world outside its walls at will, serves to break down the barrier between those worlds and between reality.  In this book, the dead are both free to move between dimensions and constrained by geography and their past lives, fears, wants and needs.  Similarly, the still-living inhabitants of the house next to the cemetery are, likewise, psychically and physically bound.The title of the novel gives us a clue about the two sets of twins central to the story.  The symmetry extends into physical bodies and their emotional selves - one set of the twins' bodies even mirror each other internally, while their emotional lives are also simultaneously refective and opposing.As the story deepens and progresses, the feelings of an oppressive closing in and a simultaneous expansion that defies physical dimension begin to weave together and fight against each other just as the main characters do the same to a dangerous, disturbing degree.  By the end of the book, the reader realizes how dangerous and disturbing her fearful symmetry really is.  This is not an easy read, nor a comfortable one.  It is, however, a glorious one."}, {"review_sentiment": 3.0, "review_text": "I really wanted to love this book. I've been meaning to read it for years, but it is one of those odd books that keeps being overshadowed by another. So I finally decided to pick it up.At first, I was in love. Once again, Niffenegger's prose captured me and crafted a perfect tone of love, darkness, and loss. The characters are interesting and well-designed, and I loved the various forms of \"leaving\" and dealing with that loss that the book played with.But as it progressed, I felt as if the pieces were both falling into place and apart all at once. The characters I once enjoyed started to empty--or feel like horrible individuals. Not that I mind not liking characters, but it can seem as if you're betrayed by them. (And perhaps that's the point of the story, as it is a recurring theme as well. But it was too much for me and took away the enjoyability.)By the end, I was ready for the end. I still loved many of the characters, but others had done a 180 in my eyes, and I was ready to be rid of them.Niffenegger is definitely a talented author, and I enjoy her balance of realism and fantastical elements, but this one didn't quite work for me as TIME TRAVELER'S WIFE did."}, {"review_sentiment": 4.0, "review_text": "Well written, but creepy ending."}]}, "authors": ["Audrey Niffenegger"], "isbn": "1439169012", "longitude": -0.12574, "periods": ["2000s", "Recent Releases"], "title": "Her Fearful Symmetry", "word_cloud": "buy impress disappoint very unusual identical twin daughters twin sister die leave flat along great deal money catch year living flat parent flat sound right technically adult show sign maturity drop college nothing exist quite true interested fashion design enjoy sew up cycling use clothing bolder interest anything dominant nothing largely build come live tenant top floor live victim severe agoraphobia wife leave unable deal ritual tower trash longer ground floor live lover building back grave many famous people well crypt contains family important later flat also inhabit something make know creepy creepiness supernatural way dominate reason rift relationship wrongness everywhere create problem manage really character even one felt sorry first turn monstrous reviewer say human likable person relationship actually good hard figure certain point reading play still creep fest author prose lovely even disgust people write beckon dislike character give star strong little horror really give shiver none grace magic work beautifully develop unfortunately likable bookshelf finally expect write confident reward emotional logical love premise set end nearly ruin entire character end make selfish decision ever way fun felt almost betrayal character spend page get know well make stomach hurt like somewhat love expect leave hang not sure like end nonsense barely finish premise ridiculous twin poorly write care possible death create world edge influence character inhabit case cemetery park much intimate relationship death dead setting house central plot edge indeed give private entrance allow home inhabitant move cemetery ground world wall serf break barrier world reality dead free move dimension constrain geography past live fear want need similarly inhabitant house next cemetery likewise psychically physically title give clue set twin central story extend physical body emotional self set twin body even mirror internally emotional life also simultaneously reflective story deepens progress feeling close simultaneous expansion defies physical dimension begin weave together fight main character dangerous disturb degree end realize dangerous disturb really easy comfortable however glorious really want love mean year odd keep overshadow so finally decide pick first love once capture crafted perfect tone love darkness loss character interest love various form leave dealing loss play progress felt piece fall place apart character enjoy start empty feel horrible individual not mind like character seem betray perhaps story recur theme well much take away enjoy ability end ready end still love many character others do eye ready rid definitely talented author enjoy balance realism fantastical element quite work well write creepy end", "genres": ["Fiction & Literature", "Mystery & Suspense", "Romance"], "summary": "From the author of the #1 bestselling The Time Traveler's Wife, a spectacularly compelling novel—set in and near Highgate Cemetery in London, about the love between twins, men and women, ghosts and the living.\r\n\r\nJulia and Valentina Poole are twenty-year-old sisters with an intense attachment to each other. One morning the mailman delivers a thick envelope to their house in the suburbs of Chicago. Their English aunt Elspeth Noblin has died of cancer and left them her London apartment. There are two conditions for this inheritance: that they live in the flat for a year before they sell it and that their parents not enter it. Julia and Valentina are twins. So were the girls’ aunt Elspeth and their mother, Edie.\r\n\r\nThe girls move to Elspeth’s flat, which borders the vast Highgate Cemetery, where Christina Rossetti, George Eliot, Stella Gibbons, and other luminaries are buried. Julia and Valentina become involved with their living neighbors: Martin, a composer of crossword puzzles who suffers from crippling OCD, and Robert, Elspeth’s elusive lover, a scholar of the cemetery. They also discover that much is still alive in Highgate, including—perhaps—their aunt.\r\n\r\n\"Entertaining... The reader is pleasantly carried along by the author's ability to create credible characters and her instinctive narrative gifts.\" The New York Times\r\n", "asin": "1439169012", "rank": "243762", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41shL26sKdL.jpg", "country": "England", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}