{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 92, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "Chuck Klosterman is a great writer, I always seem to enjoy his work. This is an interesting story that I'm surprised hasn't been picked up for a movie yet. I'm not sure if that's a good or bad thing, but I feel it would make a good transition to the screen.It's been awhile since I read it, so there are things I am forgetting, but I feel the only reason I give it 4 rather than 5 stars is that although I really enjoyed it, I don't feel like it was something so great and so memorable that it would stay with me forever. With that said, I still highly recommend it."}, {"review_sentiment": 3.0, "review_text": "The book is well written, but id only read it once, the concept is only kind of interesting."}, {"review_sentiment": 5.0, "review_text": "Good book. Good author. If you're looking for your next book then here you are."}, {"review_sentiment": 3.0, "review_text": "I may find it more enjoyable to think about the issues this book presents than in the act of reading it. It felt like a mess, and I felt the author's voice in all the motivations, dialogue and scenarios posted--and yes, these are character pieces, but all the characters at least act in the same tone of speaking. I would give it a two and a half stars just because I see a solid short story in here, and some of the images it presents are compelling."}, {"review_sentiment": 5.0, "review_text": "I enjoyed this book. I had a hard time putting it down, because I wanted to see what would happen next."}, {"review_sentiment": 4.0, "review_text": "Interesting plot. The book is a good read, I found myself glued for much of the narrative. My only gripe: it seemed (again, seemed) like the Y character was really an outlet for the author to speak freely on his opinions of society and other matters. I almost pictured Klosterman as the protagonist of the book and sometimes it seemed like a long soliloquy you would hear at a bar after 10-12 beers."}, {"review_sentiment": 4.0, "review_text": "This indeed was my first read from Klosterman and I got the idea to read it from the listing given in the back of the Entertainment magazine. I have picked up Downtown Owl which is also by him but have not yet read it. I have to say this book was a great read for me, especially the part where he is describing his observation with the girl who runs a lot and his perspective on her was interesting even after what he did to her. There were a few interesting details about the book that it had me thinking just what I would do with the ability to observe people under the radar but scary close to them at the same time!"}, {"review_sentiment": 4.0, "review_text": "Read this book for our book club.  It kept me intrigued until the end.  I was a little disappointed in the ending, quite weak, and predictable."}, {"review_sentiment": 4.0, "review_text": "If you're already a fan of Chuck's work, then you should own/read this one too. It's really as simple as that.Definitely a fictional departure for him, at least compared to Downtown Owl, in my opinion. Great read nonetheless."}, {"review_sentiment": 5.0, "review_text": "Great, quick read."}]}, "authors": ["Chuck Klosterman"], "isbn": "143918447X", "longitude": -97.7436995, "periods": ["2000s", "Recent Releases"], "title": "The Visible Man: A Novel", "word_cloud": "great writer always seem enjoy work interesting story surprise picked movie yet sure good bad thing feel good transition thing forget feel reason give rather star really enjoy feel something great memorable forever say still highly well write id concept kind interesting good author look next enjoyable think issue present read felt mess felt author voice motivation dialogue scenario post yes character piece character least act speaking half star see solid short story image present compel enjoy hard time put want see next interest plot good find glued much narrative gripe seem seem character really outlet author speak freely opinion society matter almost picture protagonist sometimes seem long soliloquy bar beer indeed first get idea listing give magazine pick also yet say great especially part describe observation girl run lot perspective interest even interest detail think ability people radar scary close time read club keep intrigued end little disappointed end quite weak predictable already fan work really simple fictional departure least compare opinion nonetheless quick", "genres": ["Fiction & Literature"], "summary": "New York Times bestselling author of Sex, Drugs, and Cocoa Puffs and Downtown Owl, “the Ethicist” of the New York Times Magazine, Chuck Klosterman returns to fiction with his second novel—an imaginative page-turner about a therapist and her unusual patient, a man who can render himself invisible.\r\n\r\nTherapist Victoria Vick is contacted by a cryptic, unlikable man who insists his situation is unique and unfathomable. As he slowly reveals himself, Vick becomes convinced that he suffers from a complex set of delusions: Y__, as she refers to him, claims to be a scientist who has stolen cloaking technology from an aborted government project in order to render himself nearly invisible. He says he uses this ability to observe random individuals within their daily lives, usually when they are alone and vulnerable. Unsure of his motives or honesty, Vick becomes obsessed with her patient and the disclosure of his increasingly bizarre and disturbing tales. Over time, it threatens her career, her marriage, and her own identity. \r\n\r\nInterspersed with notes, correspondence, and transcriptions that catalog a relationship based on curiosity and fear, The Visible Man touches on all of Chuck Klosterman’s favorite themes—the consequence of culture, the influence of media, the complexity of voyeurism, and the existential contradiction of normalcy. Is this comedy, criticism, or horror? Not even Y__ seems to know for sure.", "asin": "143918447X", "rank": "149474", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/51MegtQmkTL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}