{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 315, "rating": 4.1, "reviews": [{"review_sentiment": 3.0, "review_text": "Not great."}, {"review_sentiment": 5.0, "review_text": "As always she does not disappoint"}, {"review_sentiment": 5.0, "review_text": "Love all Reichs books."}, {"review_sentiment": 5.0, "review_text": "I have enjoyed the TV show Bones, so reading this was great...."}, {"review_sentiment": 5.0, "review_text": "Kathy Reichs is the real deal!! Totally enjoy the combination of story and science!!"}, {"review_sentiment": 2.0, "review_text": "Kathy Reich's books are long, but this one is too long and has too many many subplots.  It is overly complicated as well. I'm not sure I understood the resolution of the identification of the body at the end. I doubt that I'll read another book by this author."}, {"review_sentiment": 4.0, "review_text": "I really enjoyed this book it took me wanting to keep turning pages and trying to follow the clues and figure it out. In this one Jason Lowery has been declared dead since 1968 so when a body shows up and the fingerprints come back how can they be Jason's. There are all kinds of twist and turns in this book. Kept me glued to the pages."}, {"review_sentiment": 5.0, "review_text": "Great series.Kathy Reichs is very good!"}, {"review_sentiment": 4.0, "review_text": "I always enjoy these books, and wanted to collect them all on kindle"}, {"review_sentiment": 5.0, "review_text": "new twists, new stories, new excitement"}]}, "authors": ["Kathy Reichs"], "isbn": "1439102406", "longitude": -157.8556764, "periods": ["2000s", "Recent Releases"], "title": "Spider Bones (Tempe Brennan)", "word_cloud": "not great always disappoint enjoy tv show reading great real deal combination story science long long many many subplots overly complicate well sure understood resolution identification body end doubt author really enjoy take want turn page try follow clue figure declare dead body show fingerprint back kinds twist turn glue page good always enjoy wanted collect kindle new twist new story new excitement", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Kathy Reichs—#1 New York Times bestselling author and producer of the FOX television hit Bones—returns with the thirteenth riveting novel featuring forensic anthropologist Dr. Temperance Brennan. \r\n\r\nJohn Lowery was declared dead in 1968—the victim of a Huey crash in Vietnam, his body buried long ago in North Carolina. Four decades later, Temperance Brennan is called to the scene of a drowning in Hemmingford, Quebec. The victim appears to have died while in the midst of a bizarre sexual practice. The corpse is later identified as John Lowery. But how could Lowery have died twice, and how did an American soldier end up in Canada? \r\n\r\nTempe sets off for the answer, exhuming Lowery’s grave in North Carolina and taking the remains to Hawaii for reanalysis—to the headquarters of JPAC, the U.S. military’s Joint POW/ MIA Accounting Command, which strives to recover Americans who have died in past conflicts. In Hawaii, Tempe is joined by her colleague and ex-lover Detective Andrew Ryan (how “ex” is he?) and by her daughter, who is recovering from her own tragic loss. Soon another set of remains is located, with Lowery’s dog tags tangled among them. Three bodies—all identified as Lowery. \r\n\r\nAnd then Tempe is contacted by Hadley Perry, Honolulu’s flamboyant medical examiner, who needs help identifying the remains of an adolescent boy found offshore. Was he the victim of a shark attack? Or something much more sinister? \r\n\r\nA complex and riveting tale of deceit and murder unfolds in this, the thirteenth thrilling novel in Reichs’s “cleverly plotted and expertly maintained series” (The New York Times Book Review). With the smash hit Bones now in its fifth season and in full syndication—and her most recent novel, 206 Bones, an instant New York Times bestseller—Kathy Reichs is at the top of her game. \r\n", "asin": "1439102406", "rank": "148200", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/51sazqw2mSL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}