{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 58, "rating": 3.9, "reviews": [{"review_sentiment": 1.0, "review_text": "didn't finish....should have been called chocorange after his addiction to this silly candy that the author was obsessed with...boring."}, {"review_sentiment": 5.0, "review_text": "Love the book."}, {"review_sentiment": 5.0, "review_text": "Well written"}, {"review_sentiment": 4.0, "review_text": "I've been a huge fan of Rendell since discovering her work not too long ago. This one was consistently out at the library and I finally got to read it. I have to say it wasn't my favorite of her books, though it is still quite good. Similar premise of several interwoven narratives of morally and otherwise challenged characters in London tangentially connected by crimes. There is a quality to Rendell's characters, they tend to be wretched, in fact I think of them as rendellian wretcheds, there is just a way she wrote about psychology of things that oppress a person be it poverty, lack of drive or obsessions. In this case it is primarily the latter. The main character becomes spectacularly obsessed with a specific kind of sweets and nearly allows it to screw up his life. In fact it is this character that I had a problem with the most. He's well to do, has a comfortable life, intelligent and yet makes really bizarre choices. I'm not just talking about his obsession. The behavior I'm referring to is his strange careless for personal safety. Inviting random strangers in on chance the money he found belongs to them, leaving his house burglar ready. Rendell does a terrific job of describing the psychology of obsession and in all fairness she never did care all that much for likability of her characters, but this time the ratio was dramatically off for me and not enough occurred otherwise to offset it. Still absolutely worth a read, such strong writing, the Portobello area described so vividly, it becomes a character itself, the one constant player, despite the changes, observing patiently the clumsy humanity scurrying past it, scheming and plotting and trying to get by. Well observed. Well written. Recommended."}, {"review_sentiment": 1.0, "review_text": "Firstly, did Ruth Rendell actually write this?  I kept reading, expecting something to happen, but it never did.  The text was extremely repetitive."}, {"review_sentiment": 1.0, "review_text": "Stephen King is quoted that Rendell creates stories of \"obsession, instability, and malignant coincidence.\"  To that I would add psychological creepiness and downright weirdness.  I found the book distasteful, from the three unemployed, on-the-dole losers to the gallery owner's unrelenting addiction.  Almost every page had a description of his desire for Chocorange.  Also annoying was the doctor who by almost any standard overstepped her objective role to \"friend\" the schizophrenic.  Arson, burglary, murder, family ostracism - the book has it all.There was not one character to relate to and the vaunted description of Portobello was as junky as its nearby characters' lives."}, {"review_sentiment": 5.0, "review_text": "One of her best!"}, {"review_sentiment": 5.0, "review_text": "Another mixture of Ruth's dysfunctional people.  Great read."}, {"review_sentiment": 5.0, "review_text": "Great"}, {"review_sentiment": 4.0, "review_text": "This is lighter than many of Ruth Rendell's books, lighter and at times, funnier.  I loved the ending.I cared about the characters and wanted them to win."}]}, "authors": ["Ruth Rendell"], "isbn": "1439150400", "longitude": -0.12574, "periods": ["2000s", "Recent Releases"], "title": "Portobello: A Novel", "word_cloud": "finish call choc orange addiction silly candy author obsess boring well write huge fan discover work long ago consistently library finally get say favorite still quite good premise several interwoven narrative morally otherwise challenged character tangentially connect crime quality character tend wretched fact think mendelian wretched way write psychology thing person poverty lack drive obsession case primarily latter main character become spectacularly obsess specific kind sweet nearly allow screw life fact character problem well comfortable life intelligent yet make really bizarre choice talk behavior refer strange careless personal safety random stranger chance money find leave house burglar ready terrific job describe psychology obsession fairness never much likability character time ratio dramatically enough occur otherwise offset still absolutely worth strong write area describe vividly become character constant player change observe patiently clumsy humanity scurry scheme plot try get observed well write recommend firstly actually write keep read expect something never text extremely repetitive quote create story obsession instability malignant coincidence psychological creepiness downright weirdness find distasteful unemployed loser gallery owner unrelenting addiction page description desire also annoy doctor almost standard overstep objective role friend schizophrenic burglary murder family ostracism character relate vaunt description hunky nearby character life best mixture dysfunctional people great great lighter many lighter time funnier love cared character want win", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Ruth Rendell is widely considered to be crime fiction’s reigning queen, with a remarkable career spanning more than forty years. Now, in Portobello, she delivers a captivating and intricate tale that weaves together the troubled lives of several people in the gentrified neighborhood of London’s Notting Hill.\r\n\r\nWalking to the shops one day, fifty-year-old Eugene Wren discovers an envelope on the street bulging with cash. A man plagued by a shameful addiction—and his own good intentions—Wren hatches a plan to find the money’s rightful owner. Instead of going to the police, or taking the cash for himself, he prints a notice and posts it around Portobello Road. This ill-conceived act creates a chain of events that links Wren to other Londoners—people afflicted with their own obsessions and despairs. As these volatile characters come into Wren’s life—and the life of his trusting fiancée—the consequences will change them all.\r\n\r\nPortobello is a wonderfully complex tour de force featuring a dazzling depiction of one of London’s most intriguing neighborhoods—and the dangers beneath its newly posh veneer.", "asin": "1439150400", "rank": "1413028", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41egXiXv5AL.jpg", "country": "England", "story_arc": ["Tragedy", "Things only get worse"]}