{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 27, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Cory meets Adrian one fateful evening while at the police station because her car was stolen. Little does she know that this is only the beginning of a whirlwind romance with the attractive soldier."}, {"review_sentiment": 5.0, "review_text": "I really like the pace of this story and the way their love story developed. Cory and Adrian were beautifully put together. I actually got ready eyes near the end, really a very good romance novel."}, {"review_sentiment": 2.0, "review_text": "Simply written. No great storyline. Dialogue poor, but gave two stars for island and Maris gras description. I liked the visual."}, {"review_sentiment": 5.0, "review_text": "Cory's car is stolen and no one at the police station seems to care until her ranting and raving catches the attention of 2nd Lieutenant Adrian Mendez. Cory is suddenly speechless (something she isn't often), but then she realizes this gorgeous man is a soldier and cops and soldiers are at the top of her 'don't go there' list. So why does her body not cooperate? These two are quickly drawn together and the heat is off the charts. Unfortunately, a past they unknowingly share may very well destroy any chance of a future for them."}, {"review_sentiment": 5.0, "review_text": "Neither one of them was ready for love. But somehow they found it. I guess Collin has a lot to do with it. Or at least that is what her grams thinks."}, {"review_sentiment": 4.0, "review_text": "This book really brings out an element of true love, love with no limits and the true feeling behind true forgiveness."}, {"review_sentiment": 5.0, "review_text": "This book was AWESOME!!! Having born and lived all my life in this very same country and being able to relate to the background setting of the story was wonderful. She did a really good job in painting a clear picture of the scenery, history and the military men and their statuses. While I read this book, some parts of it I found myself smiling and nodding my head saying, \"this is so true.\" I hope to read more awesome/island stories from this author. Five stars!!!"}, {"review_sentiment": 3.0, "review_text": "Heather Rodney-Diaz has stormed the literary world with her debut Island Pursuits, which is set in Trinidad and Tobago. The Caribbean essence was captured when the author incorporated native lingo such as \"yuh cannot walk in here and do as yuh please\".Who doesn't love a man in uniform? Adrian Mendez (Afro-Latino) is a 32 year old ex-Marine now soldier who has no qualms of identifying himself as \"African-American-Hispanic-Trinidadian\". After an emotional breakup Mendez decided moving to the island would soothe his broken heart.Cory Phillips (black and Indian) is an educated, feisty, dramatic heroine who doesn't think twice about putting on a show to get her point across. Her characteristics are quickly displayed when her car is stolen from the parking lot where she was enjoying a New Year's celebration. Detesting anyone in uniform Phillip doesn't anticipate much help from the police department.No one would have ever thought Cory would have fallen for someone in uniform due to an unspoken situation. Her emotions are in disarray when it's clear that her relationship with Adrian has caused her to lose a best friend and much more. When she discovers Adrian withheld a dreadful secret, she's immediately taken back to a point in her life she wished never existed. Although Adrian omitted the truth, I applauded his efforts as he mended each obstacle for inner peace.It took a few chapters for me to really get into the story line but overall Island Pursuits turned out to be a nice read. There are several grammatical errors but nothing that hindered me from finishing the novel. The drama between Cory and her friend Kerry was never expanded on which was disappointing. Hopefully the author will enlighten us about the situation in her next release.-Reviewed by LaMona"}, {"review_sentiment": 4.0, "review_text": "I really liked the island references in this story - Queens Park Savannah, Carnival, soca and a whole lotta love made this story hold my interest. The substory that gave this story tension gave it a twist that for me, made it more interesting than your average romance. Good job Heather Rodney-Diaz!"}, {"review_sentiment": 5.0, "review_text": "This was my First book by Heather Rodney Diaz .. Also her Debut Novel. I have to say I really enjoy reading the book..Island pursuit  is the perfect title for the book. Miss Rodney -Diaz gave a great description Of Trinidad and Tobago,Felt like i was their again.The characters was hilarious to say the less both of them are head strong which I loved. about the book because sometimes other book the male character can over power the Woman.. with this book they both took the lead and back off when the other needed to do take control...Nothing more sexier than Military man and Mr Adrian Mendez sure is and all Alpha Mal along with it, When he first sees Cory all thoughts of anything or anyone else is gone including his job love lust at first sight.Cory is one tough smart woman , but all hells breaks loss when her car was stolen the way she went about it was unconventional to say the lease but she got results.. some of super funny..who knew getting your car stolen would be so sexy, funny and adventurous cant forget finding love in the process in the beautiful Island setting , super sexy , great chemistry between the characters complex at times but that made i more interesting.. was not dull moment in the book..so many great elements  that will keep you up reading...sex,  drama, and it was a lot of drama for you. seduction intrigue,and cant forget the  passion  I was hooked from the first page to the last I hope there will be more stories for this author, great job on your debut novel great read found a new fan in me..A"}]}, "authors": ["Heather Rodney-Diaz"], "isbn": "1440550662", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Island Pursuits", "word_cloud": "meet adrian fateful even police station car steal know begin whirlwind romance attractive soldier really pace story way story develop beautifully put together actually get ready eye end really good romance write great story line poor give star gar description like visual cory car steal police station seem care rant rave catch attention suddenly speechless something often realize gorgeous man soldier cop soldier top go list body quickly draw together heat chart unfortunately unknowingly share well chance future ready love somehow find guess lot least gram think really bring element true love love limit true feel true forgiveness bear live life country able relate set story wonderful really good job paint clear picture scenery history military men status part find smile nod head say true hope story author star storm literary world debut set essence capture author incorporate native lingo uh walk uh please man uniform adrian year old soldier qualm identify emotional breakup decide move broken black educate feisty dramatic heroine think twice put show point characteristic quickly display car steal parking lot enjoy celebration anyone uniform anticipate much ever think someone uniform due unspoken situation emotion disarray clear relationship cause lose best friend much discovers adrian withhold dreadful secret immediately take point life wish never exist omit truth applaud effort mend obstacle inner take chapter really story line overall turn nice several grammatical error nothing hinder finish drama friend never expand disappointing author enlighten situation really like reference story soc whole lotto love make story hold interest sub story give story tension give twist make interesting average romance good job also say really read pursuit perfect title give great description character hilarious say le head strong love sometimes male character power take lead back needed take control sexier man sure first see thought anything anyone else go include job lust first tough smart woman jells break loss car steal way go unconventional say lease get super get car steal funny adventurous cant forget find love process beautiful set super sexy great chemistry character complex time make dull moment many great element read sex drama lot drama seduction intrigue cant forget passion hook first page last hope story author great job debut great find new fan", "genres": ["Fiction & Literature", "Romance", "Erotica"], "summary": "When former U.S. Marine Adrian Mendez decided to return to his beautiful twin-island homeland of Trinidad and Tobago in the southern Caribbean, he didn’t expect to find the woman of his dreams. But one chance encounter with the captivating Cory Phillips was all it took. Adrian quickly realizes once just isn’t enough with this beautiful but feisty island goddess.\r\n\r\nHeadstrong and set in her ways, Cory struggles tremendously with the military stereotypes of the island. But when this gorgeous, sensual—and deadly—soldier offers her his help, how could she resist him? After many sultry and pleasure-filled steamy Caribbean nights with Adrian, Cory finds herself going against everything she once believed in.\r\n\r\nTheir lustful island pursuits lead to a sizzling romance in paradise—but what they both discover about the past threatens to destroy any chance of a happily ever after. Can their love survive this tropical turbulence even as danger and deception lurks? \r\n\r\nSensuality Level: Hot\r\n\r\nHeather Rodney-Diaz lives on the twin islands of Trinidad and Tobago in the southern Caribbean, indeed her motivation for writing spicy and super-sexy multicultural romantic island escapes. Here, on these fascinating islands of sun, sand, and sea, there's no better place for dreaming up scorching hot heroes or falling in love. Island Pursuits is her debut novel.", "asin": "1440550662", "rank": "6396635", "city": "Trinidad and Tobago", "image": "https://images-na.ssl-images-amazon.com/images/I/517XNKM8c5L.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}