{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 2, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "Rocco Perri was born in southern Italy in 1887 and moved to Canada as a young man.  He eventually settled in Hamilton, ON, and became one of the most prominent mob bosses in Canadian history.  He made his fortune in bootlegging, drugs, prostitution and more and was usually able to stay one step ahead of the law.  His common law wife was Bessie Starkman and she murdered in 1930 as they were arriving home one night ... her murder was never solved.Frank Zaneth was from northern Italy and also arrived in Canada as a young man.  He headed out west and tried homesteading with his then wife in the prairies.  This turned out to be not what he had bargained for so he sold his land and became a Mountie.  Over the years, he spent most of his time undercover and eventually investigating Perri became one of his cases.Perri went for a walk in April 1944 and was never seen again.  There are theories that he is encased in cement at the bottom of Hamilton Harbour or that he took off to Mexico and lived out his days in hiding.I hadn't heard of Perri or Zaneth or their stories.  I came across this book and it sounded interesting and it was.  It's obvious the author did a great amount of research as it is quite detailed.  I knew there was bootlegging going on during the Prohibition area and this book definitely gives you a feel of what it was like at that time living outside the law.  Plus I didn't realize Canada had such a big mob presence."}, {"review_sentiment": 5.0, "review_text": "Interesting, as I live nearby where it all took place.  G"}]}, "authors": ["Trevor Cole"], "isbn": "1443442232", "longitude": -79.387207, "periods": ["1900s", "Recent Releases"], "title": "The Whisky King", "word_cloud": "bear southern move young man eventually settle become prominent mob boss canadian history make fortune bootleg drug prostitution usually able step ahead law common law wife murder arrive home night murder never northern also arrive young man head west tried homestead wife prairie turn bargain sold land become year spend time undercover eventually investigate become go walk never see theory encase cement bottom take live day hear story come sound interesting obvious author great amount research quite detail know bootleg go area definitely give time live outside law realize big mob presence interest live nearby take place", "genres": ["Biography", "History", "True Crime"], "summary": "The remarkable true story of Canada's most infamous bootlegger and the undercover Mountie on his trail\r\n\r\nA rich and fascinating history of Canada’s first celebrity mobster, Rocco Perri - King of the Bootleggers - and the man who pursued him, “Operative No. 1,” Canada’s first undercover Mountie.\r\n\r\nAt the cusp of the twentieth century, two Italian men, among many others, arrived in Canada during waves of immigration. One, Rocco Perri, from southern Italy, rose from the life of a petty criminal on the streets of Toronto to run the most prominent bootlegging operation of the Prohibition Era in central Canada, taking over Hamilton and leading one of the region’s most influential crime families. \r\n\r\nPerri was feared by his enemies and loved by the press, who featured him regularly in splashy front-page headlines in the Toronto Star. So great was his celebrity, following the murder of his first wife and business partner, Bessie Starkman, a crowd of 30,000 thronged in the streets of Hamilton to watch her funeral.\r\n\r\nPerri’s businesses—which included alcohol, drugs, gambling and prostitution—kept him under constant police surveillance. He caught the interest of one man in particular, the other arrival from Italy, Frank Zaneth. Zaneth, from the Italian north, joined the RCMP and became its first undercover operative. His work took him across the country, but he was dogged in his pursuit of Rocco Perri and worked for his arrest until the day Perri was last seen, in 1944, when he disappeared without a trace.\r\n\r\nThe Whisky King is the story of the fascinating rise to power of a notorious 1920s Canadian crime figure twinned with the life of the man who pursued him.\r\n\r\n“A superb book of historical non-fiction. . .by a writer at the top of his game.” The Globe and Mail\r\n", "asin": "1443442232", "rank": "713797", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51wcYSpvGQL.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}