{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": -33.928992, "ratings": {"num_ratings": 224, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Deon Meyer at his best!"}, {"review_sentiment": 5.0, "review_text": "Excellent!"}, {"review_sentiment": 3.0, "review_text": "A lot of same same and Benny no longer as interesting a character. Still good read"}, {"review_sentiment": 5.0, "review_text": "I have several of Deon Meyer's books. This one is one of the best. Great author."}, {"review_sentiment": 5.0, "review_text": "This book is brilliant!  I absolutely enjoy Deon Meyer's style of writing which is filled with suspense and simultaneously entertaining.  I subsequently purchased four more books. He is now my no. 1 preferred author. A must read. Deon Meyer please continue to write! This book was first published in 2013. A few minor reviews said the story is far fetched ... my message is please read the news in 2017 !!!"}, {"review_sentiment": 4.0, "review_text": "Fast moving and full of suspense. You live the drama and problems the characters undergo.  New twists makes it a good page turner. Drama, suspense intrigue, love hate and more are all part of this the third in a series of Benny Griesel."}, {"review_sentiment": 5.0, "review_text": "Absolutely captivating and completely unpredictable, Deon Meyer grips you from the beginning to the end of yet another must read."}, {"review_sentiment": 4.0, "review_text": "Deon Meyer writes well about policing in S. Africa. You get insights into politics,policing, and some aspects of the current cultural inter- play in the country. Highly readable on many levels and a good story as well. Well worth reading."}, {"review_sentiment": 4.0, "review_text": "Found the end a bit of an anti-climax but al in all, really enjoyed the story.  Can relate to a lot of the story as an ex-Capetonian."}, {"review_sentiment": 5.0, "review_text": "Deon Meyer just gets better and better. Bernie Griessel is a complex and interesting character as well as all those around him. And the plot is superb"}]}, "authors": ["Deon Meyer"], "isbn": "1444723766", "longitude": 18.417396, "periods": ["2000s"], "title": "Cobra", "word_cloud": "best excellent lot longer interesting character still good several best great author brilliant absolutely enjoy style write fill suspense simultaneously entertain subsequently purchase prefer please first publish minor review say story far fetched message please news fast move full suspense live problem character undergo twist make good page turner suspense intrigue love hate part third series absolutely captivate completely unpredictable grip begin yet write well police get insight politics police aspect current cultural play country readable many level good story well read end bit al really enjoyed story relate lot story get better better complex interesting character well around plot superb", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 4/5 in Benny Griessel \r\n\r\nWhy would a mathematics professor from Cambridge University, renting a holiday home outside Cape Town, require a false identity and three bodyguards? And where is he, now that they are dead? The only clue to the bodyguards' murder is the snake engraved on the shell casings of the bullets that killed them.\r\n\r\nInvestigating the massacre, Benny Griessel and his team find themselves being drawn into an international conspiracy with shocking implications. It seems it is not just the terrorists and criminals of Britain and South Africa who may fear the Professor's work, but the politicians too.\r\n\r\nAs the body count begins to spiral viciously, Benny must put his new-found love life aside and focus on finding the one person who could give him a break in the case: a teenage pickpocket on the run in the city. But Benny is not the only person hunting for Tyrone Kleinbooi . . .\r\n\r\nShortlisted for the CWA International Dagger, COBRA is a relentlessly suspenseful, topical and richly rewarding novel from an author who is acclaimed around the world as a brilliant voice in crime fiction.", "asin": "1444723766", "rank": "13623782", "city": "Cape Town", "image": "https://images-na.ssl-images-amazon.com/images/I/51fapo0BVwL.jpg", "country": "RSA", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}