{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 48.2083537, "ratings": {"num_ratings": 42, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "It is great but tough sledding for a non-intellectual like me."}, {"review_sentiment": 1.0, "review_text": "This translation is execrably poor, with so many words just missing from sentences that it is almost impossible to read."}, {"review_sentiment": 5.0, "review_text": "You need this book!"}, {"review_sentiment": 5.0, "review_text": "Musil identifies essentialism with a society suffocating within its past regime. The characters are diverse bringing a dichotomy based opinion. Musil gives depth and attention to detail that allows the reader to read then evaluate."}, {"review_sentiment": 1.0, "review_text": "Beware of the kindle edition! It does not contain the poshumous papers included in the print editions. This is, mind you, about 30% of the whole work.The novel (?)  itself  is incredible, but it requires genuine dedication."}, {"review_sentiment": 5.0, "review_text": "Newspapers and covert activities are themes of The Like of How It Now Happens. Diotima is attempting to steer society, but she reproaches her husband when he is agitated with never having loved her, but only flinging him on her like a wild beast. That might be in Volume 2 on page 34 or 78. One of them mentions the sort of bookish cleverness one should not laugh at. Tuzzi is stuck for an answer to demands of the kind that he should think more of the deep ocean of inner beauty instead of concentrating on her body. The sexuality that is being sorted out here applies to drafting Elvis Presley so he would be treated like everybody the piffle people like.On page 48, General Stumm's happiness jingled in his head like spurs. Policy is tilting into a mixed bag. An African prince has influence on the secretary who sends out invitations so reminders of the army experiences invite so much inner surprise. I was a student at the University of Michigan when a high school print shop was printing tickets for football games. People who bought tickets from high school students on the day of the game were expecting to sit on the 50 yard line, but other people had tickets that looked exactly the same. An investigation revealed that some tickets had been part of the usual administrative routine and the high school had a discipline problem to inflict upon printing. Books can be smarter than any university student who did not skip high school."}, {"review_sentiment": 4.0, "review_text": "Though widely regarded by literary critics as one of the giants of twentieth century literature, the Austrian writer Robert Musil remains relatively little known in this country. The two lengthy volumes of “The Man Without Qualities”, his magnum opus, appeared in German in the early 1930’s but were not published in English until 1953. He was at work on a third volume when he died in Switzerland in 1942 at the age of 61.Set in culturally teeming pre-World War I Vienna, surrounded by an ancient but troubled and restless empire, the novel revolves around the life and thoughts of one Ulrich, a sarcastic observer of the decadent aristocratic set within which he moves. This is essentially a novel of ideas, and as such is far from an easy work to read. The limitless cultural and philosophical reflection is held together by only a thin and rambling narrative. But aphorisms abound the pondering and contemplation are often provocative and occasionally brilliant. Sample: “If [someone] is told that something is the way it is, then he thinks: Well it could probably just as easily be some other way. So the sense of possibility …[is]….to attach no more importance to what is than to what is not.”I remained enthralled despite the philosophical headwinds and continued through most of Volume One. Given sufficient energy, I intend to return to it and Volume Two after a period of rest.Footnote: It has been said that a translation, like a mistress, can be faithful, or beautiful, but not both. The prose in this translation is often awkward and lumpy. I assume, therefore that it is faithful."}, {"review_sentiment": 5.0, "review_text": "Big ideas, boldly and beautifully written."}, {"review_sentiment": 3.0, "review_text": "I suspect that I'll be attacked for this review but nonetheless: Musil is a great writer but the narratorial voice is incessantly negative, bitter, and arrogant and it's hard to spend the time it requires to read more than 1500 pages with something/someone so relentlessly negative, bitter, and arrogant. I don't mind such unpleasantness but I like it mixed with charm occasionally or something at least that more reflects the variety of life. I find that the quality of his prose cannot entirely overcome the narratorial voice. Regardless of the ideas and themes the novel explores -- which the other reviewers eloquently and intelligently discuss -- MWQ is a work of fiction and not philosophy, so how it reads is important.I seem to be very much in the minority in not finding the book thoroughly enjoyable, although I suspect there's been some self-censorship by people not wanting to leave a bad review because MWQ is such a canonical work of Modernism. Perhaps I should give it another read.I think any reader of MWQ would benefit from reading Joseph Roth, especially The Radetzky March, immediately before or after Musil.Lastly, if you haven't read the book and you're wondering about the title, the \"without qualities\" doesn't mean he has no redeeming factors or talents, it means he has no \"personality characteristics\". I don't know why we in the English speaking world persist with the misleading translation."}, {"review_sentiment": 5.0, "review_text": "Amazing novel."}]}, "authors": ["Robert Musil"], "isbn": "1447289439", "longitude": 16.3725042, "periods": ["1900s"], "title": "The Man Without Qualities", "word_cloud": "great tough sledding translation execrably poor many word miss sentence almost impossible need identifies essential ism society suffocating past regime character diverse bring dichotomy base opinion give depth attention detail allow kindle edition contain posthumous paper include print edition mind whole incredible require genuine dedication newspaper covert activity theme now happen attempt steer society reproach husband agitate never love fling wild beast volume mention sort bookish cleverness laugh stick answer demand kind think deep ocean inner beauty instead concentrate body sexuality sort applies draft everybody piffle people page general happiness jingle head spur tilt mixed bag african prince influence secretary sends invitation reminder army experience invite much inner surprise student high school print shop print ticket football game buy ticket high school student day game expect sit yard line people ticket look exactly investigation reveal ticket part usual administrative routine high school discipline problem inflict print smarter university student skip high school widely regard literary critic giant twentieth century literature austrian writer remain relatively little known country lengthy volume magnum opus appear german early publish work third volume die age culturally teem surround ancient troubled restless empire revolve life thought sarcastic observer decadent aristocratic set move essentially ideas far easy work limitless cultural philosophical reflection hold together thin ramble narrative aphorism ponder contemplation often provocative occasionally brilliant someone tell something way think probably easily way sense possibility attach importance remain enthralled philosophical headwind continue volume sufficient energy intend return volume period say translation mistress faithful prose translation often awkward lumpy assume therefore faithful big idea boldly beautifully write suspect attack review nonetheless great writer narratorial voice incessantly negative bitter arrogant hard spend time require page relentlessly negative bitter arrogant mind unpleasantness like mixed charm occasionally something least reflect variety life find quality prose entirely overcome narratorial voice idea theme explore reviewer eloquently intelligently discus work fiction philosophy read seem much minority find thoroughly enjoyable suspect people want leave bad review canonical work perhaps give think read especially immediately wonder title mean redeem factor talent mean personality characteristic know english speaking world persist mislead translation amaze", "genres": ["Fiction & Literature", "Historical Fiction", "Satire"], "summary": "It is 1913, and Viennese high society is determined to find an appropriate way of celebrating the seventieth jubilee of the accession of Emperor Franz Josef. But as the aristocracy tries to salvage something illustrious out of the collapse of the Austro-Hungarian Empire, the ordinary Viennese world is beginning to show signs of more serious rebellion. Caught in the middle of this social labyrinth is Ulrich: youngish, rich, an ex-soldier, seducer and scientist.\r\n\r\nUnable to deceive himself that the jumble of attributes and values that his world has bestowed on him amounts to anything so innate as a 'character', he is effectively a man 'without qualities', a brilliant, detached observer of the spinning, racing society around him. \r\n\r\nPart satire, part visionary epic, part intellectual tour de force, The Man Without Qualities by Robert Musil is a work of immeasurable importance.", "asin": "1447289439", "rank": "209414", "city": "Vienna", "image": "https://images-na.ssl-images-amazon.com/images/I/51ogPj%2Bz-bL.jpg", "country": "Austria", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}