{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 55.6867243, "ratings": {"num_ratings": 54, "rating": 4.4, "reviews": [{"review_sentiment": 2.0, "review_text": "This book was recommended by a traveling companion.  Did not really know what to expect.  The book is so big and fat it is hard to hold and actually enjoy reading.  I gave up and donated."}, {"review_sentiment": 5.0, "review_text": "I couldn't put it down!  So many twists and turns!!!"}, {"review_sentiment": 4.0, "review_text": "I listened to this on audible. It was great. Fast paced and kept me guessing. Well worth a listen/read"}, {"review_sentiment": 3.0, "review_text": "It's over at last. The never ending story. Would I read another of the author's books? I doubt it unless I learn Danish. Is Denmark and Copenhagen really like this? In any event I will give it  a miss."}, {"review_sentiment": 4.0, "review_text": "This story tells the story of a young girl's murder in the context of a political election.  The writing also conveys a lot about the society in which it took place.  So it is a period piece told in recent times."}, {"review_sentiment": 4.0, "review_text": "Really enjoyed it.  Easy to read and kept my attention."}, {"review_sentiment": 5.0, "review_text": "Spine tingling."}, {"review_sentiment": 4.0, "review_text": "At first it seemed like a series copy cat, but as the story progressed I realized there were many difference that held my attention til the end. Good story. Well written."}, {"review_sentiment": 5.0, "review_text": "If you enjoyed the American version of this series, watch the Danish one. Yes, it's Region 2 but for $33 you can get a player. I purchased the Samsung DVD-E360K Region Free DVD Player with USB and Karaoke. This is THE best series I've ever watched. Sophie Grabol is marvelous. After viewing it, I realized how watered-down the American take off is."}, {"review_sentiment": 5.0, "review_text": "Once again David Hewson does not disappoint.  Great book that you cannot lay down.  You think you have the \"bad guy\" figured out and  you are wrong every turn of the plot.  If you like murder mysteries and the great writing of this super author, buy the book!"}]}, "authors": ["David Hewson"], "isbn": "1447208412", "longitude": 12.5700724, "periods": ["2000s", "Recent Releases"], "title": "The Killing", "word_cloud": "recommend travel companion really expect big fat hard hold actually enjoy read give donate so many twist turn listen audible great pace keep guess worth last never end story author doubt learn danish really event give miss story tell story young girl murder context political election writing also convey lot society take place period piece tell recent time really enjoy keep attention spine tingling first seem series copy cat story progress realize many difference hold attention til end story write enjoy version series watch player purchase best series ever watch marvelous view realized american take once disappoint lay think bad guy figure wrong turn plot like murder mystery great write super author buy", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "A page-turning adaptation of the first season of the original Danish television series The Killing, from the author of the Detective Nic Costa series.\r\n\r\nThrough the dark wood where the dead trees give no shelter Nanna Birk Larsen runs . . . There is a bright monocular eye that follows, like a hunter after a wounded deer. It moves in a slow approaching zigzag, marching through the Pineseskoven wasteland, through the Pentecost Forest. The chill water, the fear, his presence not so far away . . . There is one torchlight on her now, the single blazing eye. And it is here.\r\n\r\nSarah Lund is looking forward to her last day as a detective with the Copenhagen Police department before moving to Sweden. But everything changes when 19-year-old student Nanna Birk Larsen is found raped and brutally murdered in the woods outside the city. Lund's plans to relocate are put on hold as she leads the investigation along with fellow detective Jan Meyer. While Nanna's family struggles to cope with their loss, local politician Troels Hartmann is in the middle of an election campaign to become the new mayor of Copenhagen. When links between City Hall and the murder suddenly come to light, the case takes an entirely different turn. Over the course of 20 days, suspect upon suspect emerges as violence and political intrigue cast their shadows over the hunt for the killer.", "asin": "1447208412", "rank": "672250", "city": "Copenhagen", "image": "https://images-na.ssl-images-amazon.com/images/I/511FcjVEphL.jpg", "country": "Denmark", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}