{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 819, "rating": 4.3, "reviews": [{"review_sentiment": 1.0, "review_text": "not my type of read"}, {"review_sentiment": 5.0, "review_text": "Vintage Burke. What's not to love?"}, {"review_sentiment": 5.0, "review_text": "Great story"}, {"review_sentiment": 5.0, "review_text": "If you haven't read any of these you are missing some great books.  I have now read the complete series and wishing there were more."}, {"review_sentiment": 5.0, "review_text": "I've read one other book by James Lee Burke and I enjoyed both very much. It's more than a crime novel, it's a history lesson combined with truths of life he has learned and shares with intense compassion with his readers. I'm sure I will read and enjoy every book written."}, {"review_sentiment": 5.0, "review_text": "Simply fantastic.  Burke never disappoints in Robicheaux series."}, {"review_sentiment": 5.0, "review_text": "Great book and writer"}, {"review_sentiment": 4.0, "review_text": "It's James Lee Burke.  Moving and atmospheric as usual."}, {"review_sentiment": 2.0, "review_text": "James Lee Burke is a favorite author of mine. Loved much of his work, but this one is  a mess. If you like endless  maudlin worrying about mortality and endless liberal griping and an endless series of disconnected scenes then this book is for you. But remember, others have said, and I agree, it has a very thin and very unbelievable  plot. To me the conclusions (there were mind-numbing botches)  left me scratching my head. Halfway through I wondered where and how the myriad characters were going and how this jumble  was going to come together. . We have a delusional Dave Robicheaux pondering and fearing death--not just once or twice. Throughout we get his lengthy  introspective on meeting his mother and father on a old time river boat. Vietnam death memories come to play.  In the end Clete joins in Dave's  fears.  Perhaps it's because the writer is approaching his eighth decade (born 1936) as he admits in the book. Alafair has grown up and once again makes friends with unsavory people, including murderers. Except for one scene, Alafair is tiresome. Molly is disgusted with Dave's illusions. Clete going over the top with violence.  As a cop, Dave  lets an admitted murderer slide. There is the old  Nazi war criminal with his own agenda who  wants to kill  Dave, and  oil men who put hits on not only Dave, but Alafair and Molly--which was known to them but they seem to shrug it off. . The oil men are there because of the gulf oil blowout.  The usual creeps like child abusers, women femme fatales,  Mafia figures portrayed as dum-dums, crooked, rapist cops, down-and-out blacks, teen savants, drinkers, rotten corporations that are ruining the wetlands,  helpful hookers, and jolly drug dealers show up. The over-the-top scenes  could not support all these characters resulting in an unsatisfactory story. ."}, {"review_sentiment": 4.0, "review_text": "Long book, rather lame subject matter but the writing is terrific. Glad i finished it."}]}, "authors": ["James Lee Burke"], "isbn": "1451648146", "longitude": -90.0701156, "periods": ["2000s", "Recent Releases"], "title": "Creole Belle: A Dave Robicheaux Novel", "word_cloud": "type vintage love story miss great complete series wishing enjoy much crime history lesson combine truth life learn share intense compassion reader sure enjoy write fantastic never disappoint series writer atmospheric usual favorite author mine much work mess endless maudlin worry mortality endless liberal grip endless series disconnect scene remember others say agree thin unbelievable plot conclusion botch leave scratch head wonder myriad character go jumble go come together delusional ponder fear death twice lengthy introspective meeting mother father old time river boat death memory come play end join fear perhaps writer approach eighth decade bear admit grown make friend unsavory people include murderer scene tiresome molly disgust illusion go top violence cop let admit murderer slide old war criminal agenda want oil men put hit know seem oil men oil usual creep child abuser woman lemme fa tales figure portray crooked rapist cop black teen savant drinker rotten corporation ruin wetland helpful hooker jolly drug dealer show scene character result unsatisfactory story long rather lame subject matter write terrific finish", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 19/20 in the Robicheaux Series\r\n\r\n“America’s best novelist” James Lee Burke returns with another New York Times bestselling entry in the Dave Robicheaux thriller series (The Denver Post).\r\n\r\nSet against the events of the Gulf Coast oil spill, rife with “the menaces of greed and violence and man-made horror” (The Christian Science Monitor), Creole Belle finds Dave Robicheaux languishing in a New Orleans recovery unit since surviving a bayou shoot-out. \r\n\r\nThe detective’s body is healing; it’s his morphine-addled mind that conjures spectral visions of Tee Jolie Melton, a young woman who in reality has gone missing. An iPod with an old blues song left by his bedside turns Robicheaux into a man obsessed…And as oil companies assign blame after an epic disaster threatens the Gulf’s very existence, Robicheaux unearths connections between tragedies both global and personal—and faces down forces that can corrupt and destroy the best of men.\r\n\r\n\"All the characters . . . are superbly drawn, and the plot is heart-pounding . . . sure to be embraced by author James Lee Burke's fans.\" The Washington Post\"\r\n", "asin": "1451648146", "rank": "230281", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/5136%2BbICcZL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}