{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 423, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "If you like stories about hustler, pimps and hoe's you will enjoy this book some of the slang we still use now today enjoy."}, {"review_sentiment": 5.0, "review_text": "Amazing roller coaster life story of a legendary street star.  Def a page turner .  I now call my $ my scratch"}, {"review_sentiment": 5.0, "review_text": "A serious serious book!!!"}, {"review_sentiment": 5.0, "review_text": "I can't put it down. Classic"}, {"review_sentiment": 5.0, "review_text": "Great read"}, {"review_sentiment": 4.0, "review_text": "The realist book I ever read. The master of the game and the hustle. What a true genius. Game changer !"}, {"review_sentiment": 2.0, "review_text": "This is something my husband ordered. I can't rate this book. But I hoped he enjoyed it."}, {"review_sentiment": 5.0, "review_text": "This is a very quick read. Iceberg Slim is a good writer and really get's you immersed. This is alternately described as fiction and non-fiction. After reading it, I can see why. I'm sure it is the author's real story of his life, and a view into his world. On the other hand, as a pimp, he has a pension for exaggeration. In some passages, you start to question if what he's saying is really possible. I think that's the reason the book contains the little disclaimer about it being a work of fiction. Nonetheless, it is a fascinating glimpse into the psychology of pimps and prostitutes and surprisingly informative. The slang is from the 20's and 30's and kind of hard to understand sometimes, but the book includes a handy glossary. Pimp is both a page turner, and a significant work. I'd highly recommend it."}, {"review_sentiment": 5.0, "review_text": "I liked this book because the story actually pulls you in. It's like I was watching one of those weekly series like The Have And Have Nots or Power, only better because I don't have to wait until next week or next season."}, {"review_sentiment": 5.0, "review_text": "Interesting read so far! A real page turner!"}]}, "authors": ["Iceberg Slim"], "isbn": "1451617135", "longitude": -87.6244212, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Pimp: The Story of My Life", "word_cloud": "like story hustler pimp enjoy slang still use today enjoy amaze roller coaster legendary street star page turner call scratch serious serious great realist ever master game true genius changer something husband order rate hop quick good writer really immerse alternately describe fiction read see sure author real view world hand pimp pension exaggeration passage start question say really possible think reason contains little disclaimer work fiction fascinate glimpse psychology pimp prostitute surprisingly informative slang kind hard understand sometimes include handy glossary page turner significant work highly recommend like actually pull watch weekly series better wait next week season interest far real page turner", "genres": ["Biography"], "summary": "Before Hip Hop, there was the pimp. The book that brought black literature to the streets is back to show the Hip Hop generation what it’s all about, where they came from. By telling the story of one man’s struggles and triumphs in an underground world, this book shows the game doesn’t change - it just has a different swagger. Iceberg Slim's story is now depicted in a major motion picture distributed worldwide. Iceberg Slim: Portrait of a Pimp shows Slim's transformation from pimp to the author of 7 classic books.\r\n\r\nAs real as you can get without jumping in, this is the story of Slim’s life as he saw, felt, tasted, and smelled it. Only he could tell this story and make the reader feel it. If you thought Hustle & Flow was the true pimp story, this book is where it all began. This is the heyday of the pimp, the hard-won pride and glory, small though it may be; the beginnings of pimp before it was dragged in front of the camera, before pimp juice and pimp style. A trip through hell by one man who lived to tell the tale. The dangers of jail, addiction and death that are still all too familiar for today’s black community. \r\n\r\nThough it is a tale of his times, it will remain current and true for as long as there is a race bias, as long as there is a street life, as long as there is exploitation.\r\n\r\n''Pimp is an eye-boggling netherworld documentary, a (--) tale of ferocious emotion, expressed through action.'' Q ", "asin": "1451617135", "rank": "27129", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/410GcKdg32L.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}