{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 72, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Book 1 in this series was nice..have already started book 2. Only downside: this is Canadian content by a Canadian author, yet it's written in US English...a totally improper variation on real English."}, {"review_sentiment": 4.0, "review_text": "Good read."}, {"review_sentiment": 4.0, "review_text": "Great story!"}, {"review_sentiment": 5.0, "review_text": "Really enjoyed this mystery. The suspense held for me  and was resolved plausibly, As a former Toronto resident, I really enjoyed the local and regional references.  Looking forward to reading those other books in this series"}, {"review_sentiment": 4.0, "review_text": "A very enjoyable read. Not a thriller as others have noted, but with rich, well developed characters so that you care what happens to them even when nothing much is happening to them. One word of caution however, this is a nostalgic view of Toronto, probably in the early 1990s. People still remember WWII as adult memories and the Internet and cell phones do not appear. I enjoyed it."}, {"review_sentiment": 5.0, "review_text": "Excellent !"}, {"review_sentiment": 5.0, "review_text": "I read a lot of legal thrillers, and this book is definitely in my top ten.  Rotenberg is an amazing writer.  The book is a real nail biter, too, with lots of clues as to the perpetrator given throughout.  The characters are well written and interesting. I learned a lot about the British legal system used in Canada, because of Rotenberg's legal background.  I highly recommend this book to anyone who is a fan of John Grisham, Scott Turow, etc. You're in for a treat!"}, {"review_sentiment": 4.0, "review_text": "I enjoy books that make you stop and think about the situation at hand.  From the first couple of pages, my mind was already starting to figure out \"what is wrong with this picture.\""}, {"review_sentiment": 5.0, "review_text": "Great characters and an excellent murder mystery with many twists and turns.I will look for more from this author."}, {"review_sentiment": 5.0, "review_text": "One of the better mysteries I have read recently.  I liked the descriptions of Toronto and especially like the character descriptions.  This was my first time reading a book in this series, and I wish that the Kindle edition had been x-ray enabled as I had trouble keeping the multitude of characters straight in my mind.I would rank this a little below my favorite Canadian mystery series by Louise Penny."}]}, "authors": ["Robert Rotenberg"], "isbn": "1451673493", "longitude": -79.387207, "periods": ["2000s", "Recent Releases"], "title": "Old City Hall", "word_cloud": "series already start only downside canadian content author yet write totally improper variation real english good story really enjoy mystery suspense hold resolve plausibly former resident really enjoy local regional reference look forward read series enjoyable not thriller others note rich well developed character care happen even nothing much happen word caution however nostalgic view probably early still adult memory cell phone appear enjoy excellent lot legal thriller definitely top ten amazing writer real nail biter lot clue perpetrator give character well write interest learn lot legal system use legal background highly recommend anyone fan treat enjoy make stop think situation hand first couple page mind already start figure wrong picture great character excellent murder mystery many twist look author better mystery recently like description especially character description first time read series wish edition enable trouble keep multitude character straight little favorite canadian mystery series", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Kevin Brace, Canada’s most famous radio personality, stands in the door of his luxury condominium, hands covered in blood, and announces to his newspaper delivery man: “I killed her.” His wife lies dead in the bathtub, fatally stabbed.  \r\n\r\nIt would appear to be an open-and-shut case. \r\n\r\nThe trouble is, Brace refuses to talk to anyone – including his own lawyer – after muttering those incriminating words. With the discovery that the victim was actually a self-destructive alcoholic, the appearance of strange fingerprints at the crime scene, and a revealing courtroom cross-examination, the seemingly simple case takes on all the complexities of a hotly contested murder trial. Meantime, much to everyone’s surprise, the Leafs are making in unlikely run for the Stanley cup. \r\n\r\n“…the atmospherics, and especially Rotenberg’s affection for the city of Toronto and the involutions of the law, make this a fast-paced, appealing addition to the genre.” Kirkus Review", "asin": "1451673493", "rank": "853099", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51P6GCvlH0L.jpg", "country": "Canada", "story_arc": ["Tragedy", "Things only get worse"]}