{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 2450, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Great."}, {"review_sentiment": 5.0, "review_text": "very good"}, {"review_sentiment": 5.0, "review_text": "my favorite book"}, {"review_sentiment": 3.0, "review_text": "I love the movie Gone With The Wind but the book is another story. I haven't even finished the book because of the long backstories surrounding other characters. It kind of slows me down reading because the only character I'm interested in is Scarlet while it's nice to have some backstory of other characters it seems dragged out to make the story longer."}, {"review_sentiment": 5.0, "review_text": "Unbeatable. Her attitudes are what they are. Criticize her views toward slavery and the South (and she offers a thinly-veiled criticism of it). You may not agree with her attitudes, but historically, it is written with convincing sincerity and explains much of what we are seeing now in support of Donald Trump. The South has been misled before."}, {"review_sentiment": 4.0, "review_text": "I am one of those people that only knew GWTW because of the movie. I was told it was based off the book but I didn't think much of it until I started college and saw that there was a second book that was a sequel to this book. I should have really read this one before it because there were so many differences between the movie and the book, including characters that were never in the movie! Only reason I knocked 1 star is because of that difference; I just can't let it go. Nonetheless, it was a very great read. While different, I really loved how the story was told and it really drew me in. I know the book has its enemies but I see nothing wrong with it, and while not accurate, does explain a part of history. I bought the hard cover which is very nice and printed on thick paper. I'm happy I bought it to with my growing collection of Gone With the Wind."}, {"review_sentiment": 5.0, "review_text": "The world I knew with ALL people respected!"}, {"review_sentiment": 5.0, "review_text": "Are you kidding?!?!  GWTW is a classic and worth 25 stars.  I haven't read it on the kindle yet, just bought it to have it since I don't like reading small print books anymore."}, {"review_sentiment": 5.0, "review_text": "The best movie,  the best book!!!!"}, {"review_sentiment": 5.0, "review_text": "Can't believe I didn't read it years ago. There are so many layers to this great read; history, personal and social ethics, wealth and hardship. I highly recommend this book."}]}, "authors": ["Margaret Mitchell"], "isbn": "1451635621", "longitude": -90.0701156, "periods": ["1800s"], "title": "Gone with the Wind", "word_cloud": "great good favorite love movie story even finish long backstories surround character kind slow read character interested nice backstory character seem dragged story longer unbeatable attitude view slavery offer criticism attitude historically write convincing sincerity explain much see support mislead people know movie tell base think much start college saw second sequel really many difference movie include character never movie only reason knock star difference great different really love story tell really drew know enemy see nothing wrong accurate explain part history buy hard cover nice print thick paper happy buy grow collection world know people respect kid classic worth star kindle yet buy like read small print anymore best movie best believe year ago many layer great history personal social ethic wealth hardship highly recommend", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Since its original publication in 1936, Gone With the Wind—winner of the Pulitzer Prize and one of the bestselling novels of all time—has been heralded by readers everywhere as The Great American Novel.\r\n\r\nWidely considered The Great American Novel, and often remembered for its epic film version, Gone With the Wind explores the depth of human passions with an intensity as bold as its setting in the red hills of Georgia. A superb piece of storytelling, it vividly depicts the drama of the Civil War and Reconstruction.\r\n\r\nThis is the tale of Scarlett O’Hara, the spoiled, manipulative daughter of a wealthy plantation owner, who arrives at young womanhood just in time to see the Civil War forever change her way of life. A sweeping story of tangled passion and courage, in the pages of Gone With the Wind, Margaret Mitchell brings to life the unforgettable characters that have captured readers for over seventy years.", "asin": "1451635621", "rank": "4869", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51vXH2JGV8L.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}