{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 25.2683521, "ratings": {"num_ratings": 422, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "A wonderfully written book!  Ian Fleming would have loved Deaver's treatment of his famous character!"}, {"review_sentiment": 4.0, "review_text": "I've read just about all the James Bond novels - Flemming and post Flemming. They're great, easy reads. However, many of them have parts that make you wince with embarrassment - the objectifying of women, the sweeping generalization of countrymen, the chain smoking, heavy drinking etc... And from books written in the middle of the 20th century it was OK.The problem was keeping that character in the 21st century. What Jeffery Deaver did with the character is probably the real accomplishment of this book. Bond's real problems in this story are red tape, incompetent competing co-workers and budget constraints. He doesn't smoke and sometimes decides to restrain from himself. In some ways this is more like \"Son of Bond\" and it works well.So, why not 5 stars? I didn't like the pop culture references - they felt a little forced. Plus, some of the action scenes could have been a little more descriptive.I did like the parent back story (is that now cannon?). It's a pity there wasn't any more in this timeline."}, {"review_sentiment": 5.0, "review_text": "Well done! Ian Fleming would be pleased!"}, {"review_sentiment": 4.0, "review_text": "Slow start, but once it picked up - I really liked it. Kept me guessing until the end. Good job!"}, {"review_sentiment": 1.0, "review_text": "Does the job fine.  Prompt delivery and super service.  I am very pleased and would definitely recommend them.  The only brand to buy  Works like crazy  Product is as advertised works well"}, {"review_sentiment": 1.0, "review_text": "This clearly appeals to long-time 007 fans but as a stand-alone piece it couldn't be anymore unengaging. Constantly the author is trying to sneak in some attempted wits, pop culture references and other mumbo jumbo which doesn't stick because its delivered in a forced manner. The storyline becomes instantly forgettable due to never finding its voice let alone having too many villains to even find time to breathe and let all the details sink in."}, {"review_sentiment": 4.0, "review_text": "OK James Bond book but not as good as Fleming."}, {"review_sentiment": 5.0, "review_text": "In spite of mixed reviews, I enjoyed Deaver's approach to Bond in a more modern setting.  He delivers us a villain who is memorable (maybe for extreme reasons).  I recommend the book for anyone who enjoys Bond and wouldn't mind seeing him in action in a slightly new context."}, {"review_sentiment": 4.0, "review_text": "This is by far the best of the post Fleming James Bond books that I have read. All the qualities that Fleming have him shined here. But please Mr Deaver, a Rolex? New age Bond's prefer an Omega Seamaster!😏"}, {"review_sentiment": 5.0, "review_text": "This book reads like the modern Bind movies.  I just miss the original timeline .  However, to keep Bond fresh, it is necessary to alter his history some."}]}, "authors": ["Jeffery Deaver"], "isbn": "1451629354", "longitude": 55.2961962, "periods": ["2000s", "Recent Releases"], "title": "Carte Blanche: The New James Bond Novel (007 James Bond)", "word_cloud": "wonderfully write treatment famous character novel fleming post fleming great easy read however many part make wince embarrassment objectify woman sweep generalization countryman chain smoking heavy drinking etc write middle century problem keep character century character probably real accomplishment real problem story red tape incompetent compete budget constraint smoke sometimes decides restrain way work star pop culture reference felt little forced action scene parent back story cannon pity timeline well do slow start pick really like guess end good job job delivery super service please definitely brand crazy advertise work well clearly appeal fan piece engage author try sneak attempt wit pop culture reference mambo jumbo stick deliver forced manner story line become instantly forgettable due never find voice let alone many villain even find time breathe let detail ok good fleming spite mixed review enjoy approach modern setting deliver villain memorable maybe extreme reason recommend anyone enjoy see action slightly context far best post quality shin please age prefer read modern movie miss original timeline however fresh necessary alter history", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "The face of war is changing. The other side doesn't play by the rules much any more. There's thinking, in some circles, that we need to play by a different set of rules too . . .'\r\n\r\nFresh from Afghanistan, James Bond has been recruited to a new agency. Conceived in the post-9/11 world, it operates independent of Five, Six and the MoD, its very existence deniable. Its aim: to protect the Realm, by any means necessary.\r\n\r\nThe Night Action alert calls Bond from dinner with a beautiful woman. GCHQ has decrypted an electronic whisper about an attack scheduled for later in the week: casualties estimated in the thousands, British interests adversely affected.\r\n\r\nAnd 007 has been given carte blanche to do whatever it takes to fulfil his mission.\r\n\r\n\"Among the high-end marques of crime, Deaver ranks in the Bentley Continental class: a sleek, fast and supremely well-engineered suspense machine . . . Deaver has stylishly fulfilled his brief.\" The Independent", "asin": "1451629354", "rank": "805189", "city": "Dubai", "image": "https://images-na.ssl-images-amazon.com/images/I/51jw9K-fY8L.jpg", "country": "United Arab Emirates", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}