{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 1, "rating": 3.0, "reviews": [{"review_sentiment": 3.0, "review_text": "I read this book immediately after finishing the memoir, \"The Poet's Wife\", by Mandy Sayer.  This memoir I really was impressed with and found the author honest, eloquent, and totally charming.  Unfortunately, \"Love in the Years of Lunacy\" was not nearly so impressive, and in fact, I found it rather immature."}]}, "authors": ["Mandy Sayer"], "isbn": "1451678460", "longitude": 151.2164539, "periods": ["1900s", "Recent Releases"], "title": "Love in the Years of Lunacy: A Novel", "word_cloud": "immediately finish memoir really impress find author honest eloquent totally charm unfortunately nearly impressive fact find rather immature", "genres": ["Fiction & Literature", "Historical Fiction", "WWII", "Women's Fiction"], "summary": "From an award-winning Australian novelist comes a wonderfully inspiring story about the ill-fated love affair between a white female jazz saxophonist and a black American GI, set against the backdrop of 1940s Sydney.\r\n\r\nSydney, 1942. Pearl is eighteen, beautiful, and impetuous. She plays saxophone in an all-girl jazz band at the Trocadero and occasionally sits in on underground gigs with her twin brother, Martin, who also plays the sax. One evening, black GI and jazz legend James Washington blows into her life, and love begins to unfold against the blacked-out nights and rumor-filled days of a city in the grip of war. \r\n\r\nWhen James is shipped out to fight in New Guinea, Pearl hatches a breathtaking plan to reunite with him. And then all hell breaks loose. Internationally acclaimed author Mandy Sayer writes with astonishing insight and tenderness in this audaciously original novel—a romance with a haunting jazz soundtrack and a war story like no other.\r\n\r\n“I remember this time from my childhood, the concentration of fear and erotic hopes, and Mandy Sayer is brilliant as usual in both celebrating that time and transcending it in this remarkable love story for all desperate times and places.” Thomas Keneally", "asin": "1451678460", "rank": "4807470", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51TcfU0j6CL.jpg", "country": "Australia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}