{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 88, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Just love it so much!!! Hardest part was to finish this book and turn the last page and I knew I was over! Didn't want to let it go..."}, {"review_sentiment": 5.0, "review_text": "this is one of the best books i have ever read.it is authentic and real. it is about being young and what it is like to grow up.none of nunn's other books comes close to this, but then this is one of the top ten books of the century. the writing is true and of outstanding quality.you really should read this. it will not change your life but it will enrich it. this is the art of fiction at its best."}, {"review_sentiment": 4.0, "review_text": "Absolutly loved this book, very interesting ending."}, {"review_sentiment": 1.0, "review_text": "Bad news."}, {"review_sentiment": 5.0, "review_text": "ok"}, {"review_sentiment": 1.0, "review_text": "Dark and pointless story ..  depressing"}, {"review_sentiment": 5.0, "review_text": "I enjoyed this book.  I thought it moved along at a pretty good pace.  I'm from Orange County, so it was interesting to hear about some familiar locations.  The end was a little bit of a let down, definitely an ending conceived in the 80's.  Still though it was an entertaining book.  One thing is clear, the more that things change, the more Huntington Beach stays the same.  If you enjoy this kind of action, mystery book, you'll enjoy this novel.  For the price it was hard to be disappointed."}, {"review_sentiment": 5.0, "review_text": "The only reason I read this book is because of an old Jane's Addiction video called Soul Kiss where the bass player is sitting on the toilet and says he's reading \"Tapping The Source\" so I thought - hell why not. It is such a good book. Great story about a normal California kid, low self esteem, deciding to change up his life and move away from his home inland. He makes his way by bus to Huntington Beach and meets the craziest people - some good, some bad. And on top of a great story there's an awesome description of what it's like to surf. From just starting out, getting bashed by the locals to becoming a local and surfing near the pier at night. His adventures are a blast to follow and this book is good from start to finish! Yeah I usually judge a book by it's cover, but I'm glad I didn't with this one. The cover is a horrible design, but the book is worth every second. Read it!"}, {"review_sentiment": 5.0, "review_text": "When I heard it was the inspiration for the movie \"Point Break\" I was worried it would be all too familiar based on having seen that movie.  But I was pleased to discover an entirely different and much darker plotline, and I read this book in 2 sittings.  A great read!"}, {"review_sentiment": 2.0, "review_text": "If you desire predictability in a novel, this one is for you. If you like colorless language and a protagonist who is reactive rather than active, by all means check this work out. It is beyond me that this novel was a National Book Award finalist, finding me questioning what happened to that most renowned prize."}]}, "authors": ["Kem Nunn"], "isbn": "1451645546", "longitude": -118.244476, "periods": ["2000s", "Recent Releases"], "title": "Tapping the Source: A Novel", "word_cloud": "just much part finish turn last page know let best ever authentic real young grow nun come close top ten century write true outstanding really change life enrich art fiction best absolutely love interesting end news ok pointless story depress enjoy think move pretty good pace orange interest hear familiar location end little bit let definitely end conceive still entertain thing clear thing change stay enjoy kind action mystery enjoy price hard disappoint reason old video call bass player sit toilet say read think hell good story normal kid low self esteem decide change life away home inland make way bus meet craziest people good bad top great story awesome description surf start get bash local become local surf pier night adventure blast follow good start usually judge cover glad cover horrible design worth second hear inspiration movie worry familiar base see movie please discover entirely different much darker plot line sittings great desire predictability colorless language protagonist reactive rather active mean check work finalist find question happen renowned prize", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Kem Nunn’s “surf noir” classic is a thrilling plunge into the seedy underbelly of a Southern California beach town—the inspiration for the film Point Break.\r\n\r\nPeople go to Huntington Beach in search of the endless parties, the ultimate highs, and the perfect waves. Ike Tucker has come to look for his missing sister and for the three men who may have murdered her. In that place of gilded surfers and sun-bleached blonds, Ike’s search takes him on a journey through a twisted world of crazed Vietnam vets, sadistic surfers, drug dealers, and mysterious seducers. He looks into the shadows and finds parties that drift toward pointless violence, joyless vacations, and highs you may never come down from...and a sea of old hatreds and dreams gone bad. And if he’s not careful, his is a journey from which he will never return.", "asin": "1451645546", "rank": "307515", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/51ZW4cy2OHL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}