{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 69, "rating": 3.6, "reviews": [{"review_sentiment": 3.0, "review_text": "This is an OK book on he Spanish Civil War. While the author mentions that there are better books to be read (Paul Preston, Anthony Beevor, Hugh Thomas), I still thought that this would be an annotated version and how the Spanish Civil War shaped the world. The book did this, but in a very clunky and boring way. There were some spots of greatness, but most of the book seemed like a medical history than a overall history. If you are a fan of Mr. Rhodes, then buy the book, otherwise buy an actual history on the Spanish Civil War."}, {"review_sentiment": 1.0, "review_text": "Having read \"The Making of the Atomic Bomb\" a few years ago, I was expecting another masterpiece.  I would stil heartily recommend that bok to anyone.This, on the other hand, fails innmany ways.  It begins as a kind of history of medical treatment advances first used in the war in Spain.  This is not what it was billed as.  Eventually, it loses even that focus, and meanders dusjointedly through a few familiar anecdotes.  I should have put it down after reading half of it, but my desire for completion forced me to waste more time I will never get back.  I don't know what the author wanted to accomplish here.  Perhaps he had a contract to deliver a book and threw together some research notes to turn in to a hapless editor."}, {"review_sentiment": 5.0, "review_text": "Gave to a friend as a gift - not sure yet if he liked it because he never mentioned if he opened it to read it."}, {"review_sentiment": 3.0, "review_text": "I found this book hard going at first, as I expected a brief traditional history of the Spanish Civil War, and found the narrative somewhat difficult to follow without any organizing discussion of battles and strategy. The book is episodic — here is the story of a Canadian doctor working on blood transfusions, here is the story of Ernest Hemingway, here is the story of Pablo Picasso. The figures from the different sections of the book never meet each other. We see parts of the war (1937 in particular) from numerous perspectives typically away from the front line, but this should be viewed as only a supplement to a more traditional history of the war."}, {"review_sentiment": 3.0, "review_text": "Rhodes writes an easy read, semi-informative book about the Spanish Civil War (1936 to 1939) that pitted the Fascists forces of General Francisco Franco against Spain’s “Republican” government. The Spanish government was far from a democracy—it was a pseudo-communist government that was suffused with Comintern agents of the Soviet Union. In May 1937, Spanish Communists took over the government.Fighting with Franco were German and Italian air, artillery, and ground forces. Supporting the government were the military forces of the Union of Socialist Soviet Republic. About two-million soldiers were involved in the war—200,000 killed and many thousands more wounded and missing. Unfortunately, this book has no central theme—it has minimal coherence. Occasionally, Rhodes offers a snippet of the war about and who is doing what to whom, but mostly he focuses his narrative on the volunteer British medical personnel tending to wounded Republican soldiers: their heroism, dedication, and professionalism. Mostly, I reckon he discusses the Western expatriates that pontificated about the horrors of the war and the awful Fascists. Actually, this book is not about the Civil War in Spain, it’s about the expatriates in Spain during the Civil War. Here are a few of these people:• Ernest Hemingway. An American novelist. Whilst drinking, womanizing, and sending dispatches to the North American Alliance, he worked with Joris Ivens (Dutch artist and Communist) producing the agitprop film titled, The Spanish Earth.• Martha Gellhorn, Hemingway’s wife. American novelist, poet, political activist, and war correspondent. Worked trying to get Basque children evacuated to safety.• George Orwell, British leftist, novelist, and journalist. Volunteered to fight with the people’s militias “The Workers’ Party of Marxist Unification.” Wounded in the throat, he was medically discharged and returned to England. In the following years he wrote the satirical novels Animal Farm and 1984.• Muriel Rukeyser, American poet, war correspondent for the Daily Worker, and other far-left publications.• J.B.S. Haldane, British scientist and war correspondent.• Norman Bethune, thoracic surgeon and firebrand Communist, performed hundreds of operations, some in dire conditions. He was nonchalant about danger and would work in the front lines.• Man Ray, American Dada and surrealist artist, photographer, and filmmaker, documented the War.• Patience Darton, British nurse with keen initiative, gritty survival, and mental fortitude in tending to the wounded. Fell in love with an ardent Communist soldier—killed in action.• The International Brigades composed of Western volunteers.Rhodes dedicates many pages to Pablo Picasso and his painting “Guernica.” Picasso was horrified by the German Condor Legion’s bombing and utter destruction of this Basque city on 26 April 1937. The commanding officer of the Condor Legion, Lieutenant Colonel Wolfram von Richthofen, said, “Guernica must be destroyed if we are to strike a blow against the enemy personnel and material.” Joan Mirό, the Catalan surrealist, painted a large mural titled “Catalan Peasant in Revolt.”Rhodes does not include pictures of these art works, and his only overall map of Spain is inadequate. Nonetheless, Hell and Good Company would have an appeal for the literati."}, {"review_sentiment": 2.0, "review_text": "This was a disappointing read. The book felt like a strange jumble of topics organized in a disjointed manner. The author spends relatively little time on the war itself, more on the experiences of a random assortment of Anglophones. It felt like the subjects were given an outsized place in the war because the author was limited tk English language journals and sources, regardless of whether the subjects he goes on to include had a significant part in the war or not. It was not clear where the book was going but all too obvious that the author was very interested in the mistresses of well known artists and authors.Some interesting vignettes, but overall an unorganized and confusing read."}, {"review_sentiment": 3.0, "review_text": "In the Preface to Hell and Good Company: The Spanish Civil War and the World It Made, Richard Rhodes writes “This book only incidentally concerns Spanish politics. . . I was drawn, rather, to the human stories that had not yet been told or had been told only incompletely. I was drawn as well to the technical developments of the war.” The book’s subtitle pledges to paint a picture of “the World It Made” as well.  Unfortunately, the pages that follow do not deliver on any of these promises.What was the Spanish Civil War really like?Instead of looking at the war through the eyes of its principals — the soldiers who fought on both sides — Rhodes devotes the lion’s share of his attention to the outsiders who, in the main, figured on the periphery of the conflict: writers Ernest Hemingway, Andre Malraux, John Dos Passos, Muriel Rukeyser, and George Orwell; journalists Herbert Matthews and Martha Gellhorn; English scientist J. B. S. Haldane; physicians Norman Bethune, Edward Barsky, and Duran Jorda; nurse Patience Darton; and, naturally, Pablo Picasso. Rhodes is particularly enamored of Picasso, occupying page after tedious page with detailed descriptions of the many drafts on paper and canvas that preceded the artist’s seminal work, Guernica. Even Benito Mussolini and Adolf Hitler receive more attention in the book than any but a tiny handful of Spaniards. Some of this is interesting for the light it casts on the lives and careers of these prominent individuals. The same can’t be said about the lived reality of the half-million people, mostly Spaniards, who died in what has been widely described as the precursor to World War II.Rhodes’ pledge to explore “the technical developments of the war” falls flat, too. He catalogs the types of aircraft sent to Spain by Germany, Italy, and Russia, and refers to their relative capabilities, but there is little new information about “developments” worthy of the name. He devotes more attention to advances in battlefield medicine: the work of Dr. Bethune and his Catalan counterpart, Dr. Duran Jorda, in introducing and refining a new approach to blood transfusions, which led to “the world’s first battlefield shipment of preserved blood,” and improvements in triage to focus surgeons on those who could benefit the most from their work.Rhodes gives short shrift to an account of the fighting. Nearly all his attention is focused on the siege and defense of Madrid and on the horrific bombing campaign that leveled Guernica, with an abbreviated account of the Abraham Lincoln Battalion’s participation in the Battle of Jarama.Is all this a case of dishonest packaging — an inappropriate title and a misleading preface? Perhaps. But no matter how you cut it, Hell and Good Company was a decidedly unbalanced account of the Spanish Civil War.I expected more from Richard Rhodes.About the authorRichard Rhodes deservedly won the Pulitzer Prize in 1988 for The Making of the Atomic Bomb. An historian and journalist, he has written dozens of other nonfiction books as well as four novels."}, {"review_sentiment": 4.0, "review_text": "The title is a perfect summary of this well written accounting of SpaNish civil war - the good, the bad and the indifferent."}, {"review_sentiment": 3.0, "review_text": "The problem with buying books on the internet is that one cannot sample them.  This book is NOT a history of the Spanish Civil War per se, despite the subtitle.  In fact, the author announces that fact early on, saying that there is already plenty of other literature pertaining to the military, social and political aspects of the war.  Rather, this is a history (of sorts) of the EFFECTS of the war on developments in technology, art, etc.  It is too long for the slim message it carries; the substance of what it has to say would have made an adequate article for the New Yorker or Harper's.  Frankly, this book is just not very interesting.  I am ashamed to admit that after reading two chapters I found myself skimming the pages and finally gave up the effort of reading at Chapter 4."}, {"review_sentiment": 3.0, "review_text": "The book presumes the reader's general knowledge about the Spanish Civil War.  As the author says in so many words in his introduction, the book is not a comprehensive history of the war but instead comprises accounts by several participants in the conflict and arranges them chronologically.  The accounts are disjointed and range from blood collection and transfusion to the creation of Picasso's Guernica.  The book might appeal to readers already knowledgeable about the war, interested in battlefield medicine, or interested in literary figures of the time, such as Hemingway, Spender, and Orwell.  But it is unclear who the intended audience is."}]}, "authors": ["Richard Rhodes"], "isbn": "1451696221", "longitude": 2.1774322, "periods": ["1900s", "Recent Releases"], "title": "Hell and Good Company: The Spanish Civil War and the World it Made", "word_cloud": "ok author mention better still think annotate version shape clunky boring way spot greatness seem like medical history overall history fan buy otherwise buy actual history have year ago expect masterpiece heartily bk hand fail inn many way begin kind history medical treatment advance first use bill lose even focus meander disjointedly familiar anecdote put read half desire completion force waste time never get back know author wanted accomplish perhaps contract deliver throw together research note turn hapless editor friend gift sure yet like never mention open find hard go first expect brief traditional history find narrative somewhat difficult follow organize discussion battle strategy episodic story doctor work blood transfusion story story figure different section never meet see part particular numerous perspective typically away front line view supplement traditional history write easy pit fascist force republican government government far government suffuse agent communist take franco german italian air artillery ground force support government military force soldier involve kill many thousand wound miss unfortunately central minimal coherence offer snippet mostly focus narrative volunteer medical personnel tend wounded soldier heroism dedication professionalism reckon discus western expatriate pontificate horror awful fascist actually expatriate here people american novelist drinking womanize send dispatch north american work artist produce agitprop film title wife american novelist poet political activist correspondent work try get child evacuate leftist novelist journalist fight people militias wound throat medically discharge return follow year write satirical novel correspondent scientist thoracic surgeon firebrand perform hundred operation dire condition nonchalant danger front surrealist artist photographer filmmaker document initiative gritty survival mental fortitude tend wound ardent compose dedicates many page paint horrified bomb utter destruction city commanding officer say strike blow enemy personnel surrealist paint large mural title include picture art work overall map inadequate literati disappoint felt strange jumble topic organize disjointed manner author spend relatively little time experience random assortment anglophones felt like subject give outsize place author limit kt english language journal source regardless subject go include significant part clear go obvious author interested mistress well know artist interest vignette overall unorganized confusing write incidentally concern politics draw rather human story yet tell tell incompletely draw well technical development subtitle pledge paint picture well unfortunately page follow deliver really instead look eye principal soldier fight side devote lion share attention outsider main figure periphery conflict writer journalists scientist physicians nurse naturally particularly enamor occupy page tedious page detail description many draft paper canvas precede artist seminal work even receive attention tiny handful interesting light cast live career prominent individual say lived reality people mostly die widely describe precursor pledge explore technical development fall flat catalog type aircraft send refers relative capability little new information development worthy name devote attention advance battlefield medicine work counterpart introduce refine new approach blood transfusion lead first battlefield shipment preserve blood improvement triage focus surgeon give short shrift account fight attention focus siege defense horrific bomb campaign level abbreviate account participation case dishonest packaging inappropriate title mislead preface perhaps matter cut decidedly unbalance account expect author richard deservedly historian journalist write dozens nonfiction well novel title perfect summary well write account bad indifferent problem buying internet sample history subtitle fact author announces fact early say already plenty literature pertain military social political aspect history sort development technology art etc long slim message carry substance say adequate article interest ashamed admit read chapter find skim page finally give effort reading chapter presumes general knowledge author say many word introduction comprehensive history instead comprise account several participant conflict arranges chronologically account disjoint range blood collection transfusion creation reader already knowledgeable interested battlefield medicine interested literary figure time unclear intend audience", "genres": ["History", "Spanish Civil War"], "summary": "From the Pulitzer Prize–winning and bestselling author of The Making of the Atomic Bomb, “The most extraordinary book about the Spanish Civil War ever encountered” (The Washington Post).\r\n\r\nThe Spanish Civil War (1936–1939) inspired and haunted an extraordinary number of exceptional artists and writers, including Pablo Picasso, Joan Miró, Martha Gellhorn, Ernest Hemingway, George Orwell, and John Dos Passos. The idealism of the cause—defending democracy from fascism at a time when Europe was darkening toward another world war—and the brutality of the conflict inspired some of their best work: Guernica, For Whom the Bell Tolls, Homage to Catalonia, The Spanish Earth.\r\n\r\nThe war spurred breakthroughs in military and medical technology as well. New aircraft, new weapons, new tactics and strategy all emerged during this time. Progress arose from the horror: the doctors and nurses who volunteered to serve with the Spanish defenders devised major advances in battlefield surgery and frontline blood transfusion. In those ways, and in many others, the Spanish Civil War served as a test bed for World War II, and for the entire twentieth century.\r\n\r\nFrom the life of John James Audubon to the invention of the atomic bomb, readers have long relied on Richard Rhodes to explain, distill, and dramatize crucial moments in history. Now, he takes us into battlefields and bomb shelters, into the studios of artists, into the crowded wards of war hospitals, and into the hearts and minds of a rich cast of characters to show how the ideological, aesthetic, and technological developments that emerged in Spain and changed the world forever. “Hell and Good Company is vivid and emotive…thrilling reading” (The Wall Street Journal).", "asin": "1451696221", "rank": "996728", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/51%2B996Aq6iL.jpg", "country": "Spain", "story_arc": ["Tragedy", "Things only get worse"]}