{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 59, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "As an old \"Haiti hand\" I have read no other book that better explains the magic of this beguiling country and its beautiful people. It is a must read for anyone who has been seduced by the magic of Haiti and wants to attempt to understand that which is not fully understandable. Ms. Wilentz has done a masterful job."}, {"review_sentiment": 4.0, "review_text": "Wilentz's analysis of what has gone wrong (and quite often right) in Haiti relief efforts reminds me of the evolution of Oxfam. Oxfam started after World War II with the simple goal of providing money to recovering European communities. Then it made a major leap to working together with local communities to determine their own needs and how to satisfy them. In its most recent change, another major evolution (as I understand it), Oxfam recognizes that poor and marginalized communities cannot improve themselves without rectifying the power imbalance in the world. I think Wilentz is asking for just such an evolution among people who care about Haiti. But many of the stories in the book reinforce common impressions about Haiti (and perhaps Wilentz herself can be credited with launching such conversations). I also found the book a bit repetitious and indulging a bit too often into self-reflection, although Wilentz, as a masterful writer, used those traits to build her arguments. We are left with the urge to find out what Haitians want and to ask whether we can productively ask for anything different."}, {"review_sentiment": 5.0, "review_text": "Like most of the Western World there is a mentality of ‘out of sight out of mind.’ Wilentz makes Haiti very much insight, in mind. It shares the personal accounts of Haitian culture, missionary workers, Doctors without Boarders, and the reporter who brings it all to us. It made Haiti hit home by pulling on the heartstrings of the innocent Haitian children victims to their surroundings. It merged the gap with the fables we tell kids to teach them a lesson and keep them safe; only instead of Snow White they had werewolves and voodoo. It made me respect those that give their life for a cause with solutions so far out of reach—yet they jump in. Great read with a blend of culture and humanity."}, {"review_sentiment": 3.0, "review_text": "Haiti is the poorest country in the western hemisphere and will continue to be so forever.  It combines the deepest ignorance and the deepest corruption of any country outside Africa.  This does not mean that well meaning white people should not try to help.  But be prepared to accomplish nothing and to be criticized by people like Amy Wilentz.  Haitians are no more capable of self-rule than a cat is capable of flying an airplane."}, {"review_sentiment": 5.0, "review_text": "Very well written, based on personal experience, knowledgeable author. This book contrasts with her prior one which was much more optimistic. One of the necessary reads to begin to understand Haiti."}, {"review_sentiment": 5.0, "review_text": "Should be required reading to get a better understanding of what it means to be Haitian in Haiti and  that interconnectedness with the outside world."}, {"review_sentiment": 5.0, "review_text": "Absolutely fascinating account of humanitarian aid woven into the history of Haiti."}, {"review_sentiment": 5.0, "review_text": "This book starts in a helicopter flight over a huge fortress that propelled Haiti out of a slave colony.  I learned about Haiti's history along with the somewhat unhealthy relationships between the Haitians and the post earthquake aid organizations.  Amy Wilentz gives the reader a fascinating look at our neighbor to the South."}, {"review_sentiment": 5.0, "review_text": "This was recommended by a friend who has just published her first book.  She said this book is one of her favorites and she displayed it when shewas at a local book store.  The author spent a lot of time in Haiti and the book reflects both her connection with the people she has met in Haiti and her concern for them."}, {"review_sentiment": 4.0, "review_text": "Amy writes with passion,clarity, and a wealth of knowledge.  I enjoyed and benefited reading Farewell, Fred Voodoo.  I recommend it for others who are trying to learn about, or deal with, the complexity of Haiti."}]}, "authors": ["Amy Wilentz"], "isbn": "1451644078", "longitude": 0.0, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Farewell, Fred Voodoo: A Letter from Haiti", "word_cloud": "old hand better explains magic beguile country beautiful people anyone seduce magic want attempt understand fully understandable do masterful job analysis go wrong quite often right relief effort remind evolution start simple goal provide money recover european community then make major leap work together local community determine need satisfy recent change major evolution understand recognize poor marginalized community improve rectify power imbalance world think ask evolution people care many story reinforce common impression perhaps credit launch conversation also find bit repetitious indulge bit often masterful writer use trait build argument leave urge find want productively ask anything different western mentality sight make much insight share personal account haitian culture missionary worker doctor boarder reporter bring make hit home pulling heartstrings innocent haitian child victim surroundings merge gap fable tell kid teach lesson safe instead werewolves voodoo make respect give life cause solution far jump blend culture humanity poorest country western continue combine deepest ignorance deepest corruption country mean well mean white people try help prepared accomplish nothing criticize people capable cat capable fly airplane very well write base personal experience knowledgeable author contrast prior much optimistic necessary read begin reading better understanding mean haitian interconnectedness world absolutely fascinate account humanitarian aid woven history start helicopter flight huge fortress propel slave colony learn history somewhat unhealthy relationship post earthquake aid organization give fascinate neighbor recommend friend publish first say favorites display shews local store author spend lot time reflect connection people meet concern write passion clarity wealth knowledge enjoy benefit read recommend others try learn deal complexity", "genres": ["History", "Travel Writing", "Politics"], "summary": "Winner of the National Book Critics Circle Award for Autobiography, this is a brilliant writer’s account of a long, painful, ecstatic—and unreciprocated—affair with a country that has long fascinated the world.\r\n\r\nA foreign correspondent on a simple story becomes, over time and in the pages of this book, a lover of Haiti, pursuing the heart of this beautiful and confounding land into its darkest corners and brightest clearings. Farewell, Fred Voodoo is a journey into the depths of the human soul as well as a vivid portrayal of the nation’s extraordinary people and their uncanny resilience. Haiti has found in Amy Wilentz an author of astonishing wit, sympathy, and eloquence.\r\n\r\n“Farewell, Fred Voodoo showcases all [Wilentz’s] formidable gifts as a reporter: her love of, and intimate familiarity with, Haiti; her sense of historical perspective; and her eye for the revealing detail. Like Joan Didion and V. S. Naipaul, she has an ability not only to provide a visceral, physical feel for a place, but also to communicate an existential sense of what it’s like to be there as a journalist with a very specific and sometimes highly subjective relationship with her subject.” Michiko Kakutani, The New York Times\r\n", "asin": "1451644078", "rank": "675906", "city": "Haiti", "image": "https://images-na.ssl-images-amazon.com/images/I/51lLS4hrxKL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}