{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 4, "rating": 4.7, "reviews": [{"review_sentiment": 4.0, "review_text": "This was a sentimental and nostalgic read and discussion for our SF-based book club.  It received an average grade of just a B, in a range of B- to B+, but several of us noted that we liked it as a book club pick more than necessarily reading it (\"enjoyed each story, but nothing compelling to keep reading to the next story\").  Its selection was partly for some local history and some literary history.  It was reasonably satisfying for both.  Most striking was Jack's call to report on the 1906 earthquake and fire -- which was read by some of us during the Sonoma fires.  We liked that other stories took us farther afield around the Bay Area, including the upper Delta.Much of the discussion was around where Jack London fits as a writer.  He was financially very successful and continues to be well known, but his work is not literary or innovative in the way of, say, Hemingway.  The nostalgia related to his memorable works that we read in middle school, but the connection was \"like the Hardy Boys.\"  Interesting that the Millennials in the group had read less or none of London's work, and that the short story To Build a Fire seems to have outlasted White Fang and Call of the Wild in middle school academics.This book suffers from being \"more a composite, without a flow\" than an intentional book of short stories.  Still we were glad we read it and enjoyed the discussion (the local venue certainly may have helped!)."}, {"review_sentiment": 5.0, "review_text": "Fine"}, {"review_sentiment": 5.0, "review_text": "Stories by the inimitable Jack London, set in the era of the late American frontier, that express his familiar themes of toughness, humor, and survival."}, {"review_sentiment": 5.0, "review_text": "Jack London could write. I love these stories because they are set in the San Francisco Bay Area which I know well, and I enjoy the descriptions of places I  know well."}]}, "authors": ["Jack London"], "isbn": "1453840508", "longitude": -122.4192363, "periods": ["1900s"], "title": "Jack London: San Francisco Stories", "word_cloud": "sentimental nostalgic discussion club receive average grade range several note liked club pick necessarily read enjoy story nothing compel read next story selection partly local history literary history reasonably satisfy most striking call report earthquake fire fire like take farther afield include upper discussion fit writer financially successful continue well know work literary innovative way say nostalgia relate memorable work middle school connection group le none work short story seem outlast middle school suffers composite flow intentional short still glad enjoy discussion local venue certainly fine inimitable set era late american frontier express familiar theme toughness humor survival love set know well enjoy description place know well", "genres": ["Fiction & Literature"], "summary": "From one of America's great writers, this delightful collection - the first of its kind - contains twenty-three adventurous tales set in the San Francisco Bay Area. \r\n\r\nIf San Francisco has captured the world's imagination through the hardboiled stories of Dashiell Hammett, the prose and poetry of Jack Kerouac and his fellow Beats, through Orson Welles' Lady From Shanghai and Alfred Hitchcock's Vertigo, it is as a romantic city of vast suspension bridges and foggy back alleys, not as the wild west of Jack London's day. \r\n\r\nPre-quake San Francisco was a tough town, and Jack London - hobo, sailor, oyster pirate, hard drinker - was pretty tough, too. Although famous for his stories of the Klondike and the Pacific, London wrote extensively about his home base. \r\n\r\nThis collection contains such classic stories as 'The Apostate' and 'South of the Slot' as well as extracts from John Barleycorn and The Sea-Wolf. The overlooked 1905 story cycle Tales of the Fish Patrol is included in its entirety. London's vivid eyewitness report of the Great 1906 Earthquake and Fire - which destroyed forever the old city - stands as a fitting epilogue. \r\n\r\nDiscover a vanished San Francisco in these wonderful stories of Jack London. ", "asin": "1453840508", "rank": "547410", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51X6KZoMXhL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}