{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 587, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "I definitely love the personalities of Amelia as well as Emerson! I really enjoyed the plot and the fact that the writer does not bore you with an exaggeration of details. It was funny, sarcastic and entertaining!! Definitely recommend this book! Now on to the second book!"}, {"review_sentiment": 4.0, "review_text": "This is a charming series which I have loved for many years. All the characters are gripping and the Egyptology is spot on. However Elizabeth Peters didn't check up on the laws of the British hereditary peerage and entailment of estates. Lucas was the son of the Earl of Ellsmere's daughter and would not have been in line to inherit the title or the entailed property. This could only be inherited down the male line. So if Lord Ellesmere had a son and a daughter only his son's son could inherit. Failing this the title would go to the earl's brother or in the event of his death the brother's son. I am not certain but I think in the event of no male heirs of direct decent being found the peerage became extinct and entailed property reverted to the crown. This archaic system has only been corrected this century and inheritain"}, {"review_sentiment": 5.0, "review_text": "I just finished this book and I loved it.  I was anxious to buy the others in the series until I got to Amazon and found they are all $9.99.  I am so disappointed that this kind of fantastic author writes books that the general public are likely not going to buy especially with over 20 in the series.  This price is more than most brick & Mortar paper backs.  So beware if you love to read historical novels set in Egypt, like I do, you will need to be prepared to break the bank to buy them.  Where is Kindle Unlimited when I need it??  Worth the read even if you don't buy the rest."}, {"review_sentiment": 5.0, "review_text": "What an engaging author!  Her depictions of the characters are spot on.  At times, writers can only sympathetically portray characters of their own sex.  Not so with Elizabeth Peters, she is gifted in the art of exposing her characters personalities so well, that I feel as if I have personally become acquainted with them.  I am amused at reading negative comments about some of the content not being politically correct. How sad to demean a heartfelt innocent book with pontifical bias  I hope we are all adults and can handle these affronts to some people's perceived sensitivities.  To me, the story line was incidental to my enjoyment of the skillful writing..I felt like I was watching a good old B&W; 1940s movie.  I will intersperse my reading of action, pot boiler, SF, horror, and literature (not so much) books with this author's work.  I think she had fun writing it; I know I enjoyed reading it.."}, {"review_sentiment": 4.0, "review_text": "It was so much fun reading this book on my vacation, thoroughly enjoyed it. Going on to next book of Amelia Peabody."}, {"review_sentiment": 5.0, "review_text": "A very well written book. I find that her description of the Middle East is very accurate. She also makes you feel as if you were right there with her. Very outstanding."}, {"review_sentiment": 3.0, "review_text": "Amelia Peabody, an independent woman in her thirties, loves Egyptian culture. She hires a new assistant who has some problems of their own.  They  meet the Emerson brothers who are busy uncovering treasures in tombs. Amelia and her friend get more involved when the older Emerson needs medical help. Then a mummy appears at night. Can they solve the mystery and not get killed?Okay writing. Amelia is an interesting woman."}, {"review_sentiment": 5.0, "review_text": "This is a thoroughly engaging book which includes many landmarks of Egypt as well as a historical account of the ancient and current storyline tome. Very we'll done with intrigue along the way. Definitely a woman,s romantic novel as we'll."}, {"review_sentiment": 5.0, "review_text": "First in a series of very well written books!"}, {"review_sentiment": 5.0, "review_text": "Elizabeth Peters creation Amelia Peabody us a delight, a bit of historical reference to set the scene then off on a rollicking ride through 1890's Egypt, shuddering less at ambulatory mummys than at the destruction visited to the area before sensible archeology was employed to save the ancient treasures of the world.  Just enough history and archeology to paint the scene appropriately, then a good story with an excellent cast of characters that you cannot wait to hear from again.  Be forewarned Dear Reader that the 21 book series was published not quite in chronological order, to ward off confusion or frustration, go to Wikipedia and find the chronological order to read the stories in, I found that much more satisfying."}]}, "authors": ["Elizabeth Peters"], "isbn": "1455572357", "longitude": 31.243666, "periods": ["1800s", "Recent Releases"], "title": "Crocodile on the Sandbank", "word_cloud": "definitely love personality well really enjoy plot fact writer exaggeration detail funny sarcastic entertain definitely now second charming series love many year character grip spot however law british hereditary peerage entailment estates son daughter line title entailed property male line son daughter son son title earl brother event death brother son certain think event male heir direct decent find peerage become extinct entailed property revert crown archaic system corrected century inheritain finish love anxious buy others series get find disappoint kind fantastic author write general public likely go especially series price brick paper back beware historical novel set need prepared break bank need worth even buy rest engage author depiction character spot time writer sympathetically portray character sex not gift expose character personality well feel personally become acquainted amuse read negative comment content politically correct sad demean heartfelt innocent pontifical bias hope adult handle affront people perceive sensitivity story line incidental enjoyment skillful felt watch good old movie intersperse read action pot boiler horror literature much author work think fun write know enjoy read much fun read vacation thoroughly enjoy go next well write find description accurate also make feel right outstanding independent woman thirties love egyptian culture hire new assistant problem meet brother busy uncover treasure tomb friend get involve older need medical help then appear night mystery get kill write interest woman thoroughly engage include many landmark well historical account ancient current story line tome do intrigue way woman romantic series well write creation delight bit historical reference set scene rollick ride shudder le ambulatory mummy destruction visit area sensible archaeology employ save ancient treasure world just enough history archaeology paint scene appropriately good story excellent cast character wait hear forewarn series publish quite chronological order ward confusion frustration go find chronological order story find much satisfy", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "Women's Fiction"], "summary": "Book 1/20 in Amelia Peabody\r\n\r\nAmelia Peabody is Elizabeth Peters' most brilliant and best-loved creation, a thoroughly Victorian feminist who takes the stuffy world of archaeology by storm with her shocking men's pants and no-nonsense attitude!\r\n\r\nIn this first adventure, our headstrong heroine decides to use her substantial inheritance to see the world. On her travels, she rescues a gentlewoman in distress - Evelyn Barton-Forbes - and the two become friends. The two companions continue to Egypt where they face mysteries, mummies and the redoubtable Radcliffe Emerson, an outspoken archaeologist, who doesn't need women to help him solve mysteries -- at least that's what he thinks!\r\n\r\n\"Think Miss Marple with early feminist gloss crossed with Indiana Jones... Dastardly deeds, whirlwind romances, curious mummies and all the fun and intrigue of Egyptian excavations, with a heroine who wields a sturdy parasol rather than a magnum. Accomplished entertainment.\" The Guardian", "asin": "1455572357", "rank": "45232", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/5180sUOPy3L.jpg", "country": "Egypt", "story_arc": ["Tragedy", "Things only get worse"]}