{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 30, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Great read."}, {"review_sentiment": 4.0, "review_text": "Difficult to keep the characters straight. Lots of double-crossing; hard to figure out who the good guys are."}, {"review_sentiment": 5.0, "review_text": "Several of the talking books I've bought 2nd hand at Amazon 'skip tracts' at random, VERY FRUSTRATING!"}, {"review_sentiment": 2.0, "review_text": "Didn't realize it was only four chapters and not that great to begin with"}, {"review_sentiment": 5.0, "review_text": "Lots of plot twists and characters. I couldn't put the book down and kept reading all night. Another great story from Jeff Abbott."}, {"review_sentiment": 4.0, "review_text": "I love Jeff Abbot's writing. Collision was definitely an excellent thriller with lots of intertwined plots going on at the same time. My only problem not giving this book 5 stars was that there were way too many characters involved in all the various plots at the same time. For me that was a little distracting. I have enjoyed all the books I've read by Mr. Abbott immensely."}, {"review_sentiment": 3.0, "review_text": "I enjoyed the book even if I found it far fetched. It may be more real than I think  though with all the contractors the CIA and NSA utilize today. I will read another Abbott book now to see if it is different."}, {"review_sentiment": 4.0, "review_text": "It scares the bejusus out of me to think that probably some of this is just what goes on in countries.  It opens my mine up to things that have happened and the reality of it all.  I now of read 6 of his books and all of them are very intense.  I will read more."}, {"review_sentiment": 3.0, "review_text": "Plot while good was a little predictable and long but overall another great novel by Abbott, recommended for Abbott fans."}, {"review_sentiment": 3.0, "review_text": "A good story  but I did not appreciate the language in some of it. Some of the story was not very plausible."}]}, "authors": ["Jeff Abbott"], "isbn": "145554616X", "longitude": -97.7436995, "periods": ["2000s", "Recent Releases"], "title": "Collision", "word_cloud": "great keep character straight hard figure good guy several talk buy hand tracts random frustrating chapter great begin plot twist character read night great story love write definitely excellent thriller lot intertwine plot go time problem give star way many character involve various plot time little distract enjoy immensely enjoy even find far fetch real think contractor today see different scar think probably go country open mine thing happen reality intense good little predictable long overall great recommend fan good story appreciate language story plausible", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "From New York Times bestselling author Jeff Abbott...\r\n\r\nBen Forsberg is a successful corporate consultant who is mourning the murder of his new bride. \"Pilgrim\" is a former CIA agent who is weary from the long years of living in the shadows.\r\n\r\nWhen Ben's business card turns up in the pocket of a dead hit man, Ben and Pilgrim, two complete strangers, realize that they've been framed in an elaborate setup. Unsure who to trust--and pursued by a brutal and vengeful killer--the unlikely partners have no choice but to work together to discover who's targeted them for elimination--and why. But with everything at stake, Ben has no idea that Pilgrim is harboring some shocking secrets of his own--secrets that will soon force Ben to confront the blurred line between best friends and bitter enemies.", "asin": "145554616X", "rank": "652260", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/51jt3LGbZEL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}