{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 1783, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "A+A+A+"}, {"review_sentiment": 5.0, "review_text": "Baldacci’s formula never gets old. There are enough twists and turns to keep every book exciting and page-turning. More please!"}, {"review_sentiment": 4.0, "review_text": "Couldn't put it down for that amount of time, hope the hour game proves to be the same. Good high paced story, kept me chasing the secrets!  Somewhat over the top but that is the escape we read for and don't we want to be or know these people."}, {"review_sentiment": 3.0, "review_text": "This reads like Baldacci is in a bit of a rut."}, {"review_sentiment": 5.0, "review_text": "excellent  !!!!!!  Twists & turns that keep you wondering and reading ."}, {"review_sentiment": 4.0, "review_text": "It was a good read.  It made me want to continue the series."}, {"review_sentiment": 3.0, "review_text": "Baldacci always good"}, {"review_sentiment": 3.0, "review_text": "Fun read."}, {"review_sentiment": 5.0, "review_text": "Excellent read!!!"}, {"review_sentiment": 5.0, "review_text": "David Baldacci is one of the best mystery writers."}]}, "authors": ["David Baldacci"], "isbn": "1455576387", "longitude": -77.0366456, "periods": ["2000s", "Recent Releases"], "title": "Split Second", "word_cloud": "formula never get old enough twist turn excite more please put time hour game prove good high pace story keep chase secret top escape want know people read bit rut excellent twist turn wonder read good make want continue series always good fun excellent best mystery writer", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 1/6 in the King and Maxwell Series\r\n\r\nThe world can change forever in a single...SPLIT SECOND\r\n\r\nMichelle Maxwell has just wrecked her promising career at the Secret Service. Against her instincts, she let a presidential candidate out of her sight for the briefest moment, and the man whose safety was her responsibility vanished into thin air. Sean King knows how the younger agent feels. Eight years earlier, the hard-charging Secret Service agent allowed his attention to be diverted for a split second. And the candidate he was protecting was gunned down before his eyes. Now Michelle and Sean are about to see their destinies converge.\r\n\r\nDrawn into a maze of lies, secrets, and deadly coincidences, the two discredited agents uncover a shocking truth: that the separate acts of violence that shattered their lives were really a long time in the making-and are a long way from over...", "asin": "1455576387", "rank": "35589", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/41VRHnsMsHL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}