{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 24.5895489, "ratings": {"num_ratings": 869, "rating": 4.6, "reviews": [{"review_sentiment": 1.0, "review_text": "No idea what I expected but this is just not well done in my opinion.  I've read many expat books and this just does not meet my expectations."}, {"review_sentiment": 3.0, "review_text": "Easy read whcih can be fun but I got really bored.  The descriptions weren’t vivid enough.  The writing was just too basic for me."}, {"review_sentiment": 5.0, "review_text": "Stumbled across this book and LOVED it!  We are thinking of relocating to Costa Rica or Panama and I can relate to so many thing this couple went through.  Great reading -could not put it down. Thanks for sharing and hope to visit the Happier House someday.  On to Book 2!!"}, {"review_sentiment": 4.0, "review_text": "Funny story..fast paced. Makes me want to move to CR."}, {"review_sentiment": 5.0, "review_text": "More.....More.......More!!"}, {"review_sentiment": 5.0, "review_text": "Great read- Pisani is hilarious!  I literally laughed out loud many times throughout the book, and that rarely happens."}, {"review_sentiment": 5.0, "review_text": "I'm thinking of living part time in Costa Rica so bought this book. The author is amusing and she gives the straight story: The good, the bad and the beautiful. I'm going to look for more books by Nadine Hays Pasina. I want to know if they got their house built and how their life progressed after their first year in Costa Rica."}, {"review_sentiment": 5.0, "review_text": "Better than I thought it would be.  Really, really funny."}, {"review_sentiment": 5.0, "review_text": "Have read all the author's books and loved them all; funny, insightful, and honest!"}, {"review_sentiment": 5.0, "review_text": "I laughed throughout the entire book. I didn't want it to end. I hope to meet Nadine and Rob someday."}]}, "authors": ["Nadine Hays Pisani"], "isbn": "1463536100", "longitude": -107.3920441, "periods": ["2000s", "Recent Releases"], "title": "Happier Than a Billionaire: Quitting My Job, Moving to Costa Rica, and Living the Zero Hour Work Week", "word_cloud": "idea expect well do opinion many expat meet expectation fun get really bore description vivid writing basic stumble think relocate relate many thing couple go reading put share hope visit someday pace want move more hilarious literally laugh loud many time rarely happen think part time buy author amuse give straight story good bad beautiful go look want know got house build life progress first year better think really really funny author love funny insightful honest laugh entire want end hope meet someday", "genres": ["Memoir", "Travel Writing"], "summary": "TWO PLANE TICKETS, NO PLAN, ONE DREAM \r\n\r\nA celebration of one couple's decision to risk it all and live in one of the happiest places on earth. \r\n\r\nIn this humorous and witty account, Nadine Pisani shares what it is like to follow her dream of quitting her job and starting a new life under the sunny skies of Costa Rica. Along the way, she finds reliable utilities are not that reliable, quirky neighbors are unavoidable, and tackling red tape takes the strength of a linebacker. But with all its challenges, you'll learn why Costa Rica is ranked as one of the happiest places on earth--and you too may want to taste the Pura Vida lifestyle.", "asin": "1463536100", "rank": "62885", "city": "Costa Rica", "image": "https://images-na.ssl-images-amazon.com/images/I/51sgLAYZMhL.jpg", "country": "Mexico", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}