{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 52, "rating": 3.9, "reviews": [{"review_sentiment": 2.0, "review_text": "Still trying to plow through this. I don't care for her writing style."}, {"review_sentiment": 5.0, "review_text": "Jane Addams is the best of the best American heroes. Her writing sparkles with wit, kindness, and the sobriety of lived experience. If you think of Jane Addams as a Christian do-gooder from the dark ages before the Great Society think again. She was a flesh-and-blood freethinker and truth-teller for the ages who walked her talk with rare courage and humor. Read this book if you want to see how much like 2017 the first decades of the 20th century were. There's nothing old-fashioned in her thinking--20 Years at Hull House is one of those back-to-the-future stories that should be required reading before you cast a vote."}, {"review_sentiment": 3.0, "review_text": "good"}, {"review_sentiment": 4.0, "review_text": "This is a landmark book on American social problems and the best way to address them. It is also one of the most thoughtful memoirs I've ever read. Jane Addams' observations of life in an immigrant neighborhood in turn of the century Chicago are keenly penetrating. She really knows the life she describes, because she lived among these immigrants, befriending them, involving herself in their personal difficulties, learning their aspirations, and helping them to further their education and boost their access to what America could offer them. Addams also differs from almost every other social activist I know in her willingness--almost a compulsion--to rethink her positions once being confronted with evidence that she has misunderstood the reality around her. This is a woman who never stopped thinking and growing, and who was constantly building and improving the settlement house she founded. Moreover, she always always gave credit to those who joined her in the work, originating projects she would not have thought of on her on and carrying through work she could not do alone.I give the book less than five stars only because the edition does not do full justice to the book. There is no introduction to the text, and nothing to provide biographical background on the extraordinary woman who wrote it, Jane Addams. Happily, the typeface is readable, and the illustrations, reprinted from the original edition, are large enough to add value to the book. But a great text like this one, written in a late Victorian style, and containing allusions to events of its day that are no longer familiar to readers, could use a few footnotes. However, there are biographies of Addams and online websites that can supply this need. One should not fear to read the book--there's plenty here to think about and learn from, even if some of the facts remain a little unclear."}, {"review_sentiment": 4.0, "review_text": "Content is A-And I personally was not a fan of her verbosely eloquent writing style, though I definitely think it is highly effitive in recounting the history of hull-house from a first person point of view."}, {"review_sentiment": 5.0, "review_text": "If you are interested in the life of Jane Addams, Sociology, or in turn-of-the-century Christian Humanism, then this is a good book to read. The book has the pre-WWI optimism still found in the Social Gospel movement, but clearly written by an anti-evangelical author. Great insights into not just the work that was done at Hull House, but also a lens into all of humanity's collecive reponse to marginalized populations."}, {"review_sentiment": 4.0, "review_text": "I expected this to be very dated, and in many ways it was.  However, I was frequently struck with the impression that some things have changed very little. Only the names have been changed: we still vilify and fear that which is different."}, {"review_sentiment": 5.0, "review_text": "Great book. Jane Adams is an inspiration to so many in Social Work. The add on I was offered to purchase for audio is terrible. It takes away the meaning and feeling of Ms. Adams thought and expression. The audio voice is very robotic."}, {"review_sentiment": 5.0, "review_text": "Very good book I had to read for school."}, {"review_sentiment": 4.0, "review_text": "A classic social work text."}]}, "authors": ["Jane Addams"], "isbn": "1463682476", "longitude": -87.6244212, "periods": ["1900s"], "title": "Twenty Years At Hull House", "word_cloud": "still try plow care write style best best american hero writing sparkle wit kindness sobriety live experience think dark age freethinker age walk talk rare courage humor want much first decade century nothing thinking story require reading cast vote good landmark american social problem best way address also thoughtful memoir ever observation life immigrant neighborhood turn century keenly penetrate really know life describes live immigrant befriend involve personal difficulty learn aspiration help education boost access also differ almost social activist know willingness almost compulsion rethink position confront evidence misunderstood reality woman never stop think grow constantly build improve settlement found moreover always always give credit join work originate project carry work le star edition full justice introduction text nothing provide biographical background extraordinary woman write typeface readable illustration reprint original edition large enough value great text write late victorian style contain allusion event day longer familiar reader footnote however biography online website supply need fear plenty think even fact remain little unclear content personally fan verbosely eloquent write style definitely think highly effective recount history first person point view interested life good optimism still find movement clearly write author insight work do also lens humanity collective repose marginalize population expect date many way however frequently strike impression thing change little only name change still vilify fear different inspiration many add offer purchase audio terrible take away mean feel think expression audio voice robotic very good school classic social work text", "genres": ["Memoir", "History", "Social & Cultural Studies"], "summary": "Twenty Years at Hull House, by the acclaimed memoir of social reformer Jane Addams, is presented here complete with all sixty-three of the original illustrations and the biographical notes. \r\n\r\nA landmark autobiography in terms of opening the eyes of Americans to the plight of the industrial revolution, Twenty Years at Hull House has been applauded for its unflinching descriptions of the poverty and degradation of the era. Jane Addams also details the grave ill-health she suffered during and after her childhood, giving the reader insight into the adversity which she would re-purpose into a drive to alleviate the suffering of others. \r\n\r\nThe process by which Addams founded Hull House in Chicago is detailed; the sheer scale and severity of the poverty in the city she and others witnessed, the search for the perfect location, and the numerous difficulties she and her fellow activists encountered while establishing and maintaining the house are detailed. \r\n\r\nEventually, after years of work, Hull House became a shining example of how intervention in the poorest slums could have remarkable results for the families concerned. Children who regularly attended Hull House enjoyed education and opportunities for creativity. Many went on to experience a prosperous adulthood thanks to the skills and tutoring they gained at the house. \r\n\r\nToday, Jane Addams is held as a great example of a pioneering spirit, whose social work and social assistance were greatly inspiring to the reforming administration of Franklin D. Roosevelt. The model Addams established with Hull House was imitated widely; by 1922, over five-hundred settlement houses had been founded across the United States.", "asin": "1463682476", "rank": "1060371", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/41DCqHU-tDL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}