{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 32, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "I was put onto this book by a friend. I don't generally go in for things like this but I was a great book full of heart tugging stories. They may not be well suited for children, but they are great for adults."}, {"review_sentiment": 2.0, "review_text": "The best part of this book is missing! Seton's illustrations are half the charm of the original volume, and this OCR-scannedversion is completely without them. So disappointing!"}, {"review_sentiment": 5.0, "review_text": "These stories are supper fun to read, but sad, because most of the time it tells about when the animals die, but it is one of my favorite books, and you can learn a lot from it. Some animals can be far more interesting than you would think. This book was so good, I could hardly stop reading it, and I definitely think everyone should have a chance to read this book also."}, {"review_sentiment": 3.0, "review_text": "I read it and it almost made me cry.😢It gets you excited on what the animals are doing, and you start to like the animal, then you feel like your there right next to the animal....and thwn the anlimal dies.😮☹🙁😢😭😭😭"}, {"review_sentiment": 5.0, "review_text": "Classic!"}, {"review_sentiment": 4.0, "review_text": "Favorite when I was a kid.  Giving it to 3 grandkids."}, {"review_sentiment": 5.0, "review_text": "A very powerful message lies within this book.  Our family has passed this book down for generations."}, {"review_sentiment": 5.0, "review_text": "Anyone should read it. So if you missed it in middle school, read it now! Highly recommended for ages from 10 to 110."}, {"review_sentiment": 5.0, "review_text": "We used this book as part of our School curriculum. My children absolutely loved it."}, {"review_sentiment": 5.0, "review_text": "My grandfather has an original copy of the book with the pen sketched pictures and all the wildlife doodles on the edges of the pages.  The kindle version misses all that which is part of the charm of the book ~ but the stories are still great.  Real tear jerkers. But as Mr. Seton reminds us, The life ending of every wild animal is always tragic.  *sniff, sniff*  One learns a lot about wild life behavior through this reading as well...."}]}, "authors": ["Ernest Thompson Seton"], "isbn": "1466233249", "longitude": -79.387207, "periods": ["1800s"], "title": "Wild Animals I Have Known", "word_cloud": "put friend generally go thing great full heart tug story well child great adult best part miss illustration half charm original volume completely so disappointing story supper fun sad time tell die favorite learn lot far interest good hardly reading definitely think everyone chance also almost make get excited start animal feel right next animal then animal classic kid give grand kids powerful message lie family pass generation miss middle school recommend age use part curriculum child absolutely love grandfather original copy sketch picture wildlife doodle edge page kindle version miss part charm story still great real tear jerk remind life end animal always tragic learn lot life behavior reading well", "genres": ["Fiction & Literature"], "summary": "Wild animals I have known (1898) by Ernest Thompson Seton, illustrated with 200 drawings. \r\n\r\nTHESE STORIES are true. The animals in this book were all real characters. They lived the lives depicted here, and showed the stamp of heroism and personality more strongly by far than it has been in the power of my pen to tell. Natural history has lost much by the vague general treatment that is so common. What satisfaction would be derived from a ten-page sketch of the habits and customs of Man? How much more profitable it would be to devote that space to the life of some one great man. This is the principle I have endeavored to apply to my animals. \r\n\r\nThe real personality of the individual, and his view of life are my theme, rather than the ways of the race in general, as viewed by a casual and hostile human eye.", "asin": "1466233249", "rank": "582268", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51B7Qe-QOeL.jpg", "country": "Canada", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}