{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 48, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "This was a beautiful book, a story of an elderly Grandmother and her very young Granddaughter.  Both a bit wary of each other at the beginning but as time went on they each taught each other something and despite the age gap  the bond between them grows.  It is set in India and I found it hard to put down, read and enjoy."}, {"review_sentiment": 5.0, "review_text": "Great story and characters !"}, {"review_sentiment": 4.0, "review_text": "Interesting and easy read."}, {"review_sentiment": 3.0, "review_text": "I read the book but was not happy about the language.  I will not read this author again."}, {"review_sentiment": 5.0, "review_text": "The book goes back and forth between the present and her memories of the war, so I can't say there isn't some violence depicted, but this is not a violent story."}, {"review_sentiment": 5.0, "review_text": "I loved this, great characters, great story (although I wish I understood the war better). I wish they hadn't bounced between the stories as much but that's ok.  Great book"}, {"review_sentiment": 4.0, "review_text": "Nothing in particular."}, {"review_sentiment": 3.0, "review_text": "I found this read very slow with uninteresting characters, not well developed.  Sorry."}, {"review_sentiment": 5.0, "review_text": "I truly enjoyed this book. I love books that make me reach for my IPad and Google Images of what the character is describing. I find myself learning about a culture and that is such a gift! I do not believe that I will get to visit Cairo but I have a relative who did but has since passed on and it makes me feel closer to him. It is a wonderful story and I recommend it."}, {"review_sentiment": 4.0, "review_text": "\"I remember.And even as I say the words aloud in the silent room and hear the whisper dying away in the shadows of the house, I realize that it's not true.Because I don't, I can't remember.I am old, and I am beginning to forget things.\"Iris and Ruby is a novel about memories - both creating them and recalling them. Iris is an 82 year old doctor living in Cairo with two aged servants, in poor health and realizing that she is losing important memories of her younger years. She is estranged from her daughter who lives in England with her family and has few friends. Then Ruby, her 19 year old grand-daughter shows up at her door to escape her family. Ruby is adrift in her life, unsure of which direction to go and decided that maybe she would find answers in Cairo. Ruby quickly understands that her grandmother is trying to recall her past memories and decides to help her by listening to stories from her past.The novel moves seamlessly between present day Cairo and the Cairo of WWII when Iris first arrived. The author's descriptions of the city are fantastic - you can almost see the glittering parties and party dresses of the 40s along with the present day market place teaming with people and items for sale. Through Iris's stories of her past, it becomes apparent what formed her into the person she is in the present. There are romances - both in the 40s with Iris and in the present day with Ruby. There is a lot of family drama between mother and daughter - Iris with her daughter Lesley and Ruby with her mother. Through it all, Iris and Ruby create a bond that transcends time.This is a fantastic multi-generational novel and it takes place in an exciting part of the world. I loved this book and will remember these two characters long after the last page.(The novel was given to me by the author for a fair and honest review)"}]}, "authors": ["Rosie Thomas"], "isbn": "1468314963", "longitude": 31.243666, "periods": ["1900s", "Recent Releases"], "title": "Iris and Ruby", "word_cloud": "beautiful story elderly young bite wary beginning time go taught something age gap bond grow set find hard put enjoy story character interest easy happy language author go back forth present memory war violence depict violent story love great character great story wish understood war better wish bounce story much nothing particular find slow uninteresting character well develop truly enjoyed love reach character describe find learning culture gift believe get visit relative pass make feel closer wonderful story recommend even say word aloud silent room hear die away shadow house realize old begin forget thing memory create recall year old doctor live age servant poor health realize lose important memory younger year estrange daughter life family friend then year old show door escape family adrift life unsure direction decided maybe answer quickly understand grandmother try recall memory decides help listen story move seamlessly present day first arrive author description city fantastic almost see glitter party party dress present day market place team people item sale story becomes apparent form person present romance present day lot family drama mother daughter daughter mother bond transcends fantastic take place excite part world love character long last page give author fair honest review", "genres": ["Fiction & Literature", "Romance", "Historical Fiction", "WWII", "Women's Fiction"], "summary": "A gripping, exotic and epic tale for fans of Dinah Jeffries and Victoria Hislop\r\n\r\nThe unexpected arrival of her willful teenage granddaughter, Ruby, brings life and disorder to 82-year-old Iris Black’s old house in Cairo. Ruby, driven away from England by her fraught relationship with her own mother, is seeking refuge with the grandmother she hasn’t seen for years.\r\n\r\nAn unlikely bond develops as Ruby helps Iris document her fading memories of the glittering, cosmopolitan Cairo of World War Two, and of her one true love – the enigmatic Captain Xan Molyneux – whom she lost to the ravages of war.\r\n\r\nThis lost love shaped Iris’s past – and will affect Ruby’s future in ways they could not have imagined…", "asin": "1468314963", "rank": "1402185", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51ytJ7WPaGL.jpg", "country": "Egypt", "story_arc": ["Tragedy", "Things only get worse"]}