{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 3, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Charlotte Salomon, a victim of the Holocaust, is the subject of this French novel translated into English. David Foenkinos has written a poetic description of Charlotte's life in novel form. Charlotte lived in Germany and France until her death at age 27. Foenkinos uses his years of research to tell Charlotte's story with detailed descriptions of each place she lived and of all the people in her life.Foenkinos offers the reader an intimate glimpse into the life of this gifted girl who was considered, at an early age, to be an artistic genius. Charlotte died too young, she had so much to live for and so much work she could have given the world. David Foenkinos honors her with this novel. This translation will be a unique addition to the literary world of English language readers."}, {"review_sentiment": 5.0, "review_text": "Beautiful writing about a beautiful person!"}, {"review_sentiment": 5.0, "review_text": "Book arrived quick and in good condition. This book was a great read about the life of Charlotte Solomon told by David Foenkinos who does a great job repainting Charlottes short lived life. Charlottes family tragedy, social injustice, and matters of the heart are brought to light in a very interesting format. This book has led me on to Charlottes original piece, Life? Or theater? I would recommend his book! Great read, great buy."}]}, "authors": ["David Foenkinos"], "isbn": "1468312766", "longitude": 13.3888599, "periods": ["1900s", "Recent Releases"], "title": "Charlotte", "word_cloud": "victim subject translate write poetic description life form live death age use year research tell story detailed description place lived people offer intimate glimpse life gift girl consider early age artistic genius die young much live much work give world honor translation unique addition literary world language reader beautiful write beautiful person arrive quick good condition great life tell great job repaint short live life family tragedy social injustice matter heart bring light interest format lead original piece theater great buy", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "Internationally literary phenomenon, multiple award-winner, and massive bestseller with over 500,000 copies in print in France and rights sold in 20 countries, Charlotte tells the story of artist Charlotte Salomon—born in pre-World War II Berlin to a Jewish family traumatized by suicide.\r\n\r\nObsessed with art, and with living, Charlotte attended school in Germany until it was too dangerous to remain, fled to France, and was interned in a bleak work camp from which she narrowly escaped. Newly free, she spent two years in almost total solitude, creating a series of autobiographical art—images, words, even musical scores—that together tell her life story. A pregnant Charlotte was killed in Auschwitz at the age of 26, but not before she entrusted her life's work to a friend, who kept it safe until peacetime. The result, an extraordinary novel avant la lettre, was eventually published as Life? or Theatre? (and now reissued by Overlook), a unique, relentlessly complete artistic expression.\r\n\r\nIn Charlotte, David Foenkinos—with passion, life, humor, and intelligent observation—has written his own utterly original tribute to Charlotte Salomon's tragic life and transcendent art. His gorgeous, haunting, and ultimately redemptive novel is the result of a long-cherished desire to honor this young artist. Infused with the emotion of a writer who connects deeply with his subject, and masterfully and sensitively translated by Sam Taylor, Charlotte is a triumph of creative expression, a monument to genius stilled too soon, and an ode to the will to survive.\r\n\r\n\"Astounding . . . Foenkinos makes us a part of this hopefully growing community: that of the admirers of a young artist named Charlotte Salomon, assassinated when she was 26 years old.\" L'Express", "asin": "1468312766", "rank": "453625", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51msDkx3RsL.jpg", "country": "Germany", "story_arc": ["Tragedy", "Things only get worse"]}