{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 13, "rating": 4.5, "reviews": [{"review_sentiment": 4.0, "review_text": "Set during Hitler’s rise to power in 1930’s Germany, a small group of German Jews determine, to thwart and stop the Nazi machine.  Isaac Zarco, a descendent of Berekiah Zarco, who resided in Portugal during the Lisbon Massacre in 1500, wrote prophetic memoirs, which warned the Jews to leave Europe before a catastrophe would claim them.Sophia, a bright and lonely, German Aryan teenager, fond of her Jewish neighbor, and who believes the Nazi policies repugnant, joins Isaac Zarco’s band of rebels.Zimler adds the intrigue of a murder mystery and a tender love story to the historical novel, which brims with symbolism and Kabbalistic mysticism.  Zarco’s intimate circle of friends, former circus performers, dubbed, “The Ring”, a group of people with physical abnormalities, become targets of Hitler’s racial purity laws.  Sophia tends to her autistic brother whom she adores and is unable to convince her parents or her boyfriend of the evils and dangers in the Nazi regime.As the dimensions and realities of the Third Reich expand in Germany and into other countries, and as Sophia’s fascination with Zarco grows, Zarco becomes ever more obsessed to comprehend and translate his ancestor’s coded memoir."}, {"review_sentiment": 3.0, "review_text": "I love how Richard Zimler has devoted himself to a compelling historical narrative through the family Zarco, but I didn't feel this book matched his others. I could not really get into it."}, {"review_sentiment": 5.0, "review_text": "I so enjoyed this book and wished that the story would not end. As I read Zimler's characters came to life and their own stories captured my attention.  I am fascinated with 20th century history of Europe and Zimler offered an unique angle on the terrible time of Hitler. Highly recommended."}, {"review_sentiment": 5.0, "review_text": "A good  perspective of Germany beginning in 1934 as told by a young, non- jewish girl who has very close Jewish friends and ultimately becomes Jewish."}, {"review_sentiment": 5.0, "review_text": "I  thoroughly enjoyed this book,"}, {"review_sentiment": 5.0, "review_text": "Amazing book that kept me in its thrall even as I was going about other tasks of living. The intersperse of spiritual and \"reality\" during the events allows interpretation and experience on many levels.  HIghly recommend."}, {"review_sentiment": 5.0, "review_text": "The Seventh Gate begins in contemporary America. Our infirmed and elderly protagonist, Sophie, is in a hospital. She appears not far from death. Her devoted nephew visits regularly and takes care of all of her needs. He is deeply interested in her past, especially what happened to her as a child and teenager in Germany. After a halting start, the author carries us back in time to her adolescent years, in 1932 Berlin.Young Sophie is a bright, inquisitive, artistic and sexually articulate fourteen-year-old, living in Berlin with her detached mother, ambivalent father and autistic young bother.  She dreams of becoming an actress, cares deeply for her non-verbal and anxiety-prone brother, sexually desires her teenaged boyfriend and fights with her distant parents regularly. Her family is Christian, but not very devout.Sophie soon finds herself attracted to her enigmatic elderly Jewish neighbor, Isaac Zarco. Isaac is a kind, gentle, mysterious man, consumed with comprehending the Kabbalistic memoirs of his ancestor from Portugal. Isaac believes that the secrets of life, God and the hereafter are hidden within the cryptic writing of his ancestor’s ancient document.Sophie is also captivated with Zarco’s erudite collection of amazing Jewish friends, most of whom plot against Nazis in a secret group called “The Ring.” The members include a charismatic troupe of former circus performers, including fascinating dwarfs and a tall, shadowy, deformed woman, named Vera.  The members of The Ring are intriguing, delightful and amazing characters.  When a young group member who has been a close friend to Sophie is sent to Dachau, she realizes that there must be a Nazi traitor in the group. But who?The remainder of this exciting novel follows Sophie through the war years as she falls deeply in love with Isaac, becomes a full-fledged member of The Ring and conducts a desperate race against time to save her brother and discover the traitor.Laden within this plot are several juicy sub-plots, including Sophie’s anxious relationship with her cold mother and a love-hate relationship with her father who turned almost instantly from ardent Communist to full-fledged Nazi. Zimler carefully explores Sophie’s loving relationship with her young autistic brother, Hansi.  In every way, Sophie is a more devoted and empathetic parent to Hansi than her own parents have been. They are deeply embarrassed by Hansi’s autism. But Sophie’s protective love never falters. Despite his inscrutable silence, Sophie understands Hansi completely.As time passes, Sophie begins to realize the terrible danger posed by the Nazi-controlled German government, She fears losing her best friend, Rinsi, a Jew, as well as Isaac and the members of the Ring. Sophie’s sexual relationship with a teenaged friend turns sour because of his ardent Nazi views. As time passes, Sophie is drawn farther away from her parents-turned Nazis and much closer to her Jewish friends, who are risking their lives to help Jews flee the Gestapo and concentration camps.As the years pass, Sophie falls more profoundly in love with Isaac, who is old enough to be her father, much less a Jew – constituting an illegal, if not also immoral relationship. Zimmler plays this liaison marvelously. The burgeoning love between them is a powerful force, played out against a world turned upside down by the Nazi genocide against Jews and the disabled. As the Gestapo closes in on our protagonists, Hansi is removed from home, to be sterilized because of his autism.  Just as the Nazi State desires Jews dead, it follows that the disabled must go as well, in order for society to be more properly racially pure and Aryan.Zimler established himself as a successful murder mystery author during the Holocaust in The Warsaw Anagrams, in which a mysterious murder plot is gradually exposed within the infamous Warsaw Ghetto. Here he describes the fabric of life in Berlin exquisitely, as Nazis push down upon Jews until almost none remain. Zimler creates a murder mystery worthy of the great artisans of that genre. In The Seventh Gate, he ardently describes the traps of injustice upon Germany’s Jewish and disabled citizens. Although one could argue that the Holocaust offers no easier disparity between good and evil, Zimler’s character development is electrifying and his plot rolls along ever faster into the depths of fear. Zimler wraps all of this within the cryptic veil of Jewish mysticism.As he pours through his ancestor’s Kabbalistic documents, Isaac begins to comprehend the route that humans take on their journey throughout life and beyond, the details of which go far beyond normal Jewish learning. These secrets are made available to him only through years of extensive study of Kabbalah. We learn that humans must pass through numerous “gates” if they are to gain entrance into heaven. Yet only the most learned and humane of us can pass. Zimler’s use of Jewish mysticism within a murder mystery, within the dreadful steady Nazi drive into genocide, adds profound layers of thrilling detail to the novel.The Seventh Gate builds frustration and anxiety into a devastating and haunting conclusion. This is a shocking, evocative and thrilling novel, fueled by outstanding character development and a plausible murder mystery. Zimler creates heroic protagonists who struggle constantly against overwhelming odds. The elements of fear and death surround and invade each valiant character, made all the more lovable by their individual disabilities and charm. The Seventh Gate is gripping, consuming and shocking. Most importantly, as we contemplate the horrors inflicted upon innocent people by Nazi Germany, it remains all the more plausible. Through charming, brave and bright Sophie, Zimler helps us comprehend what it felt like to be a German with a good soul, within the writhing dark cloud of Nazism and its culture of intolerance and murder.Zimmler pushes several boundaries in The Seventh Gate. Sophie, a Christian teenager in Nazi Germany, falls in love with and has sexual relations with an elderly Jewish man. She breaks several laws and perhaps the hearts of some readers by loving and living with this endearing elderly Jew. She also explores sexuality at a time and age when it was considered to be inappropriate.Missing in this exemplary piece of evocative and haunting fiction is an epilogue. Why create a prologue if there is to be no epilog? We are left to wonder what life lessons the elderly Sophie could have given us at the conclusion, had the book returned us to the present-day.The Seventh Gate is thrilling, shocking, inspiring and unforgettable. Within it, author Zimler delivers taboo sexuality, prejudice, a deeply entrenched murder mystery, Judaism and the Kabbalah, World War II and the Holocaust - all wrapped within the veneer of Nazi Germany’s terrifying shadow of hatred and bigotry. The reader will be haunted by these brave characters and the stirring murder mystery long after the book has been completed.Reviewer Charles S. Weinblatt is a retired university administrator and the author of published fiction and non-fiction, including the popular Holocaust novel, Jacob’s Courage."}, {"review_sentiment": 5.0, "review_text": "Richard Zimler's \"The Seventh Gate\" is a gripping, sad novel about a family in 1930's Berlin dealing with the rise of Nazism throughout Germany.  Depressingly, most of the family members deal with this development by rolling over and ingratiating themselves with the Nazis.  The exception is the young, pretty Sophie, who refuses to distance herself from her Jewish friends and other \"undesirables\" in her circle.  A major point of the novel, in fact, is to remind readers that it was not only the Jews who were victimized and murdered by the Nazis, but all kinds of non-Jews, too.  I wished that the book's prologue, featuring an old Sophie in a nursing home as she starts to look back, was balanced by an epilogue showing the old Sophie again, perhaps giving us some final observations on those terrible early years of her life.  But the absense of such an epilogue is a quibble.I actually listened to the audiobook version of \"The Seventh Gate\", which was beautifully read by Gabrielle de Cuir. The book's prologue and some brief sections throughout the novel were also capably read by Stefan Rudnicki.  If you can weather all the tragedy, sadness, and death, which becomes near relentless as the book progresses, \"The Seventh Gate\" is an engrossing, enlightening historical novel with much to offer."}, {"review_sentiment": 5.0, "review_text": "This is a story about WWII and the circumstances about \"odd circus people\" who are friends and the things that happen in their lives just before the Jews of Europe are rounded up.  Very suspenseful and much of history is outlined in this book for those who aren't familiar with the details.  For the others that do know the details, much can be learned.  Lots of lessons in this book."}, {"review_sentiment": 5.0, "review_text": "Richard Zimler has just gone to the top of my list of favorite writers!  For me, The Seventh Gate was a nonstop page-turner that powerfully integrated mystery, romance, suspense, intrigue, love, death, and God......all within the dark context of Hitler's Nazi Germany.  By the time I completed this 446-page novel, I felt that I had sojourned through several decades in another place and time. Indeed, Zimler's prose and writing style has tapped the eloquence of Thomas Wolfe.  READER ALERT: As this is a nearly impossible book to put down, you may be slightly sleep-deprived before reaching the final page."}]}, "authors": ["Richard Zimler"], "isbn": "1468308238", "longitude": 13.3888599, "periods": ["1900s", "Recent Releases"], "title": "The Seventh Gate", "word_cloud": "rise power small group german determine thwart machine descendant reside write prophetic memoir warn leave catastrophe bright lonely german teenager fond jewish neighbor believe policy repugnant join band add intrigue murder mystery tender love story historical brim symbolism mysticism intimate circle friends former circus performer dub group people physical abnormality become target racial purity law tend autistic brother adores unable convince parent boyfriend evils danger nazi dimension reality expand country fascination grow become ever obsess comprehend translate ancestor cod memoir love devote compelling historical narrative family feel matched others really enjoy wished story himmler character come life story capture attention fascinated century history offer unique angle terrible time recommend good perspective begin tell young jewish girl close jewish friend ultimately become jewish thoroughly enjoy amaze keep thrall even go task live intersperse spiritual reality event allow interpretation experience many level recommend begin contemporary inform elderly protagonist hospital appear far death devote nephew visit regularly take care need deeply interested past especially happen child teenager halt start author carry time adolescent year bright inquisitive artistic sexually articulate live detach mother ambivalent father autistic young bother dream become actress care deeply brother sexually desire teenage boyfriend fight distant parent regularly family soon find attracted enigmatic elderly jewish neighbor kind gentle mysterious man consume comprehend memoir ancestor believe secret life hereafter hidden cryptic write ancestor ancient also captivate erudite collection amaze jewish friend plot secret group call member include charismatic troupe former circus performer include fascinate dwarf tall shadowy deform woman name member intriguing delightful amaze character young group member close friend send realizes traitor group remainder excite follow war year fall deeply love become member conduct desperate race time brother discover plot several juicy include anxious relationship cold mother relationship father turn almost instantly ardent carefully explore love relationship young autistic brother way devote empathetic parent parent deeply embarrassed autism protective love never falter inscrutable silence understand time pass begin terrible danger posed german government fear lose best friend well member ring sexual relationship teenage friend turn sour ardent view time pass drawn farther away much closer jewish friend risk life help flee concentration year pass fall profoundly love old enough father much le constitute illegal also immoral relationship play liaison marvelously burgeon love powerful force play world turn upside genocide disable close protagonist remove home sterilize autism desire dead follow disabled well order society properly racially pure establish successful murder mystery author mysterious murder plot gradually expose infamous here describe fabric life exquisitely push upon almost none remain create murder mystery worthy great artisan genre ardently describe trap injustice disable citizen offer easier disparity good evil character development electrify plot roll ever faster depth fear wrap cryptic veil jewish pours ancestor kabbalistic document begin route human take journey life detail go far normal jewish learn secret make available year extensive study learn human numerous gate gain entrance heaven yet learn humane pass use jewish mysticism murder mystery dreadful steady drive genocide add profound layer thrill detail build frustration anxiety devastate haunt conclusion shock evocative thrilling fuel outstanding character development plausible murder mystery create heroic protagonist struggle constantly overwhelm element fear death surround invade valiant character make lovable individual disability charm grip consume shock most importantly contemplate horror inflict innocent people remain plausible charm brave bright help comprehend felt german good soul writhe dark cloud culture intolerance push several boundary teenager fall love sexual relation elderly jewish man break several law perhaps hearts reader love live endear elderly also explore sexuality time age consider exemplary piece evocative haunting fiction epilogue create prologue epilogue leave life lesson elderly give conclusion return thrill shock inspire unforgettable author deliver taboo sexuality prejudice deeply entrenched murder mystery wrap veneer terrify shadow hatred haunt brave character stir murder mystery long retire university administrator author publish fiction include popular grip sad family deal rise nazism family member deal development roll ingratiate exception young pretty refuse distance jewish friend undesirable circle major point fact reader victimize murder kind wish prologue feature old nursing home start back balanced epilogue show old perhaps give final observation terrible early year life absence epilogue actually listen audio book version beautifully prologue brief section also capably tragedy sadness death becomes relentless progress engross enlighten historical much offer story circumstance odd circus people friends thing happen live round very suspenseful much history outline familiar detail others know detail much learn lesson go top list favorite writer powerfully integrated mystery romance suspense intrigue death dark context time complete felt sojourn several decade place time indeed prose write style tap eloquence nearly impossible put slightly reach final page", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "WWII"], "summary": "By the author of the critically acclaimed international hits \"The Last Kabbalist of Lisbon\" and \"The Warsaw Anagrams,\" this novel proves Richard Zimler's mastery of the \"riveting literary murder mystery\" (\"Independent on Sunday\"). \r\n\r\nIt's Berlin, 1932. Sophie is a smart and sexually precocious fourteen-year-old coming of age during Hitler's rise to power. Forced to lead a double life when her father and boyfriend become Nazi collaborators, she reserves her dreams of becoming an actress for her beloved elderly neighbor, Isaac Zarco, and his friends, most of whom are Jews working against the government in a secret group called the Ring. When a member is sent to Dachau, she realizes there must be a Nazi traitor in the group. But who? \r\n\r\nThrough successive mysteries, reversals, and surprises --and a race against time --The Seventh Gate builds to a shattering end. In its chilling but sensuous evocation of the time and place, Richard Zimler's novel is a love story and a tale of ferocious heroism \r\n\r\n\"A moody, tightly constructed historical thriller that is both entertaining and instructive.\" The New York Times", "asin": "1468308238", "rank": "2719380", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51-rDG3YggL.jpg", "country": "Germany", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}