{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 61, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "If you are interested in renaissance Florence, this is required reading"}, {"review_sentiment": 5.0, "review_text": "Go buy a Cellini Watch.  Go buy the book, and then you will appreciate your watch.Deal with confidence with this seller.  Dr. George M. Whitehead"}, {"review_sentiment": 3.0, "review_text": "was written  Buy New  $94.44 but this not a new"}, {"review_sentiment": 5.0, "review_text": "read it for yourself. it is a must."}, {"review_sentiment": 5.0, "review_text": "Sculptor and goldsmith to Popes, Cardinals and Kings, Cellini pulls no punches in describing the villainous treachery and petty ways ofthe holier-than-thou crowd.  Popes come off as easily influenced tyrants and Cardinals fare no better-just a bunch of schemingsocial climbers.  No saint himself, Cellini goes to great pains in detailing the many travails he was put through by envious, jealous,less talented individuals in positions of power.  A true Alpha Male before anyone thought of the term, Cellini is a lusty, robust rascalwho suffers no slights or intimidations; of which there are a never ending litany to keep him busy defending his honor.  Murderousfights are not uncommon throughout the book and the action keeps the reader involved.  Cellini knew Michelangelo and Vasari amongmany other of Italy's incredible wealth of talent and he has opinions and descriptions of all he came in contact with.  This book is a mustfor any art lover or history buff."}, {"review_sentiment": 5.0, "review_text": "Compulsive self indulgence"}, {"review_sentiment": 5.0, "review_text": "An intriguing look into an artist's life in Renaissance Italy.  Benvenuto one of the artistic masters of the Renaissance era .  he will tell you all about his successes and failures .  His patrons are sometimes unreliable and he feels under appreciated.  His rivals are envious,  jealous and almost always insulting. He is often diven to extreme measures to defend his reputation and honor. It is a facinating story of the life of a facinating man."}, {"review_sentiment": 5.0, "review_text": "Arrived on time, just as described."}, {"review_sentiment": 5.0, "review_text": "all ok"}, {"review_sentiment": 2.0, "review_text": "Another braggart and narcissist, even though he was recognized as one of the best.  I found it tiresome."}]}, "authors": ["Benvenuto Cellini"], "isbn": "1470067064", "longitude": 2.3514992, "periods": ["1500s"], "title": "The Autobiography of Benvenuto Cellini", "word_cloud": "interested renaissance require reading appreciate confidence seller write new sculptor goldsmith pull punch describe villainous treachery petty way of the crowd come easily influence tyrant cardinal fare bunch scheming social climber saint go great pain detail many travail put envious jealous le talented individual position power true anyone think term lusty robust rascal who suffer slight intimidation never end litany busy defend honor uncommon action keep involve know among many incredible wealth talent opinion description come contact must for art lover history buff compulsive self indulgence intriguing look artist life artistic master era tell successes failures patron sometimes unreliable feel appreciate rival envious jealous almost always insult often dive extreme measure defend reputation honor fascinate story life fascinate man arrived time describe ok braggart narcissist even recognize best find tiresome", "genres": ["Biography", "Art & Architecture", "History", "Renaissance"], "summary": "Benvenuto Cellini was a celebrated Renaissance sculptor and goldsmith - a passionate craftsman who was admired and resented by the most powerful political and artistic personalities in sixteenth-century Florence, Rome and Paris. \r\n\r\nHe was also a murderer and a braggart, a shameless adventurer who at different times experienced both papal persecution and imprisonment, and the adulation of the royal court. \r\n\r\nInn-keepers and prostitutes, kings and cardinals, artists and soldiers rub shoulders in the pages of his notorious autobiography: a vivid portrait of the manners and morals of both the rulers of the day and of their subjects. \r\n\r\nWritten with supreme powers of invective and an irrepressible sense of humour, this is an unrivalled glimpse into the palaces and prisons of the Italy of Michelangelo and the Medici.", "asin": "1470067064", "rank": "1274494", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51vLvI873qL.jpg", "country": "France", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}