{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 3, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Loosely based on the attempted coup d’état in Trinidad in 1990, the action in this fast moving story takes place on a fictitious island in the Caribbean. However, as the author says, the action has much in common with attempted coups in other parts of the world, and (in my opinion) gives an insight into much of the unrest that is taking place all over the world today.The story starts as seen through the eyes of Ashes, a quiet studious family man. Ashes thinks that his religious “Leader” has many of the answers that he is seeking in life, so says “yes” when asked to participate in the coup, not quite understanding what he is agreeing to, but following his charismatic leader. Then one afternoon Ashes turns up to prayers, and by the time he leaves his life has changed for ever.As events unfold, not quite as the revolutionaries imagine, the action shifts to the House of Power – and the narrative moves between Ashes and Mrs Garland, Minister for the Environment, one of the hostages.The fears, emotions and doubts experienced by hostages and captors are portrayed expressively, and the action rises and falls according to what is going on inside the House, and what can be observed of the outside through the windows – at one stage Kate Adie is seen, so you know things are bad!At the end of the book the story is rounded off well.I found this a fascinating and gripping book. The perspective of Mrs Garland (hostage) was very thought provoking, and some of the conversations she has with the revolutionaries made me compare these fictional events to current world affairs. Her discussions about the realities of government, compared to the version fed to the young gunmen, and her thoughts as to what the future of these young impressionable men should be once the current events have run their course, are very thought provoking.Some of the characters appeared so seldom in the book, that I needed, on a few occasions, to flick back to check who they were, but that may say more about my memory for names than anything else! The author uses words peculiar to Trinidad in her writing, and it is a pity that these are not translated at the back of the book. However a quick internet search brings up definitions.For me this is a book that I will be thinking about for some time to come, and has certainly given me a new perspective on world events."}, {"review_sentiment": 3.0, "review_text": "If you’ve ever listened to the Shooting the Poo podcast or spoken to my mate Dave, you’ll know that I have a thing about Hollywood films based on true events.  No matter how well acted or directed the movie, I always experience a crushing sense of betrayal when I discover that the majority of the film, including a number of the pivotal scenes, were completely made-up.  You’d think I’d get over it and yet I keep asking myself the same question – why don’t these movies just tell the truth?*The same question accompanied me as I read Monique Roffey’s Costa Book Award nominated novel, House of Ashes.  In this case, though, it’s not the lack of truth that’s the issue, if anything it’s Roffey’s fidelity to history that weighs the book down.In the Author’s Note she tells us that her story, about a coup d’état on the fictional Caribbean Island of Sans Amen, may “bear some relation to an attempted coup which took place in Trinidad and Tobago in 1990.”  This is an understatement.  While the place names might have changed, and while characters like Ashes and Breeze and Aspasia Garland never existed, the historical beats – the year of the coup (1990), the takeover of the Government house and the island’s one television station, the number of militants that were involved (114), the length of the coup (6 days), the looting that happened in Port-au-Prince during the crisis and the beating and shooting of the Prime Minister for ordering the army to attack with full force – are all accurately portrayed in the novel.This then raises the obvious question – why bother with an invented Caribbean island, why not just provide a historical, but fictional, account of the 1990 coup?Danuta Kean provides the answer in her July 2014 interview with Monique Roffey for The Independent.  She observes that,\"[Roffey’s] nerves are not those of a media newbie. Instead they reflect a writer playing with fire… She glances around as if we are being watched. I look around too. Nervousness is infectious. Her paranoia is reasonable. The religious group behind the 1990 uprising remains active. She has no desire to be a female Salman Rushdie.\"Roffey then explains what prompted her to write the novel:\"“I thought I was crazy to even contemplate writing about it,” she admits. A year was spent talking it over with her psychoanalyst. What pushed the idea off the couch and on to the page was a Commission of Inquiry held in 2011. Its report was delivered in March 2012 and after that the words flew out of her. “Writing wasn’t the hard part,” she says.\"Faced with the conflicting need to bring attention to the 1990 coup, while also protecting herself and her family, I can understand why Roffey made the artistic decision to set her story in Sans Amen. It’s easy to argue that art should transcend issues of life and death.  History is littered with creative-types who’ve endangered their lives for their work.  But when faced with potential death threats, I can absolutely appreciate why common sense might prevail.In anycase I doubt Roffey believes that she’s comprised her work by changing place names and inventing characters.  The focus of House of Ashes is the message rather than the historical truth.  As she states in her Author’s Note, “the events [detailed in the novel] may have much in common with coups d’état in other parts of the world, for example Latin America, Europe or Africa.  While on the decline, the coup remains a common form of power change in the world.”  And in line with that sentiment, the novel provides an interesting post-colonial critique, exploring the bad habits left over by colonial powers and the abuse of innocence, especially young, uneducated men living in poverty and looking for meaning and sense in their lives.Beyond the themes of the novel, the narrative is tense, gripping and confronting.  Roffey does an excellent job in detailing the adrenalin charged horror of the first moments of the coup and the mix of boredom, fear and loss of dignity that settles in once the food runs out and a corner of the room becomes a latrine.Throughout it all, though, the ghost of the 1990 coup lingers.  While it’s clear that the militants overthrowing the Robinson Government are religious, Roffey never uses the words Islam or Muslim to describe their faith.  The fact that Roffey mutes this element means that there’s this gaping hole in the novel that’s never adequately explored.  It’s sad because I would have loved to have seen Roffey apply her keen insight on the faith that motivated the militants.Unlike a Hollywood film, Roffey wants to give us a true accounting of what happened in Trinidad and Tobago in 1990 and why.  However, genuine fear of reprisal means that what could have been a powerful and relevant novel never fully comes together.  It’s not an entirely hollow reading experience, but I do wish I lived in a time where art wasn’t sometimes required to distance itself from the truth.* Yes, I know reality and history are messy and don’t lend themselves to the neat narrative beats of a movie.  But that’s what documentaries are for."}, {"review_sentiment": 3.0, "review_text": "Oskar Pinkus is a Polish Jew who lived in Losice, located 85 miles east of Warsaw and 10 miles from the Bug River. In 1939-1940, after the German-Soviet conquest of Poland, Losice's Jews didn't believe in Hitler's threats (pp. 50-51). This further shows that the widespread Jewish-Communist collaboration of 1939 couldn't have been driven by fears of Nazi extermination.The Polish Blue Police (Policja Granatowa) was kept in the dark until the last moment before the August 1942 roundup of Losice's Jews (p. 106). The Germans also forced the local farmers to come with their carts (p. 106). (This corrects the misuse of a painting shown in the movie SHTETL, through which the viewer is misled into believing that the local farmers collaborated willingly in the roundup and transport of Bransk's Jews).  At Siedlce, 20 miles from Losice, the Ukrainian police took over (pp. 109-110), and both the Blue Police and Polish farmers were sent home. The Ukrainians and Germans loaded the Jews onto trains for their 60-mile trip to their deaths at Treblinka. At Siedlce, it was the Germans, not Poles, who were jeering the Jews: \"As the Jews passed, the Poles fell silent watching the procession of doomed men and women. The German soldiers who stood on the sidewalks commanded in sneering voices...: (pp. 109-110).Just before the roundup, Pinkus fled Losice. Throughout his treks, he was helped by Poles in numerous, successive occasions (p. 88, 90, 91,128, 129, 137, 212), including once by a Polish Blue Policeman (p. 87). This further proves that many Polish benefactors were necessary for the saving of even one Jew. Pinkus also mentions Poles who refused to help owing to the German-imposed death penalty for such acts (p. 89, 93, 133) and, unlike Jan Tomasz Gross, recognizes the legitimacy of this motive for Polish inaction (p. 119). However, Pinkus criticized overseas Jews for their lack of assistance (p. 119).Pinkus eventually found \"permanent\" lodging in a shelter underneath farmer Karbicki's barn. At first, Karbicki helped only because Pinkus paid him but, in time, became more altruistic (p. 199; \"But I can't keep you for nothing\", p. 220). The reader may exonerate Karbicki after considering his extreme poverty, which included tattered clothes and hole-ridden boots (p. 128; p. 153). (It is unfair that Poles who were paid to help Jews are deemed ineligible for the Yad Vashem medal, whereas Danes, who were incomparably better well-off under German occupation and yet took hefty fees for shipping Jews to Sweden, are eligible).At first, Pinkus praised the AK and commended it for assassinating Germans, spies, collaborators, and informers (pp. 195, 204), and for making the Germans fearful of entering the woods. As a result of all this, in 1943 the hidden Jews felt safer than ever (p. 196).In time, Pinkus left his shelter at Karbicki's farm and encountered other Jews in hiding in the forest or nearby farms. They assembled into a band that built an independent shelter within the forest, and that stole feedstuffs and livestock from Polish farmers (pp. 204-206). One may understand why Poles sometimes killed fugitive Jews.Pinkus then writes: \"Shymeluk had gone to Wolki for food one night and did not return. At first the farmers denied that he had even been in the village but eventually we learned that he had been killed by...the AK, the Polish underground. Shymeluk was in a farmer's house when the AK arrived. They took him with them, and although there was no direct proof that they killed him, it remained a fact that Shymeluk never returned from that trip.\" (p. 213). Obviously, Pinkus didn't see any of this, but was relying on someone else's statements (in other words, hearsay). Besides, could \"going for food\" include stealing? Finally, in any event, how could Pinkus know that Shymeluk's presumed death didn't occur sometime AFTER the latter's presumed contact with the AK?Interestingly, Pinkus' only clearly eyewitness experience with the AK was a positive one. The AK visited the area, forced all the Jews out of hiding, and, not only didn't harm them, but encouraged them (pp. 215-218).But later that night, the AK allegedly returned and \"without even looking\" threw grenades into the forest shelter in which the Jews had until recently been hiding (p. 218). Considering the darkness of the forest, and unless Pinkus was very close to the shelter (which he doesn't indicate), how could he possibly know such details? Besides, if the AK was out to kill Jews, why didn't it do so earlier that day, in broad daylight, when it had all the Jews gathered together?Skepticism is justified. The informed reader may recount Polish Jew Jerzy Kosinski's tall tales about Polish atrocities against Jews, exposed as such by independent investigation, or Yaffa Eliach's contradictory, fantastic account of her 7 year-old self counting the number of bullets fired by an AK soldier into her baby brother. (Who counts shots, and what AK soldier would waste multiple scarce bullets on an infant?)Pinkus even makes a Yaffa Eliach-like accusation of the AK having an order to kill all remaining Polish Jews. He admits the nonexistence of written evidence of it, yet says: \"But better evidence lies in their record of persistent and widespread murder...In 1945 alone, 352 Jews were murdered by the AK...\" (p. 226). What a non sequitur! A few hundred Jews killed, even if all correctly blamed on the AK, is hardly proof of an AK \"mini-Wannsee\" (Eliach's term). And 352 killed out of over 250,000 remaining Polish Jews would only mean that the AK did an atrociously poor job of it.Pinkus claims that, in March 1945, the AK killed 3 of the 20 surviving Jews of Losice (p. 226). This is a flat lie. The AK no longer existed then! It had already been disbanded by Leopold Okulicki, its final commander, in January 1945."}]}, "authors": ["Monique Roffey"], "isbn": "1471126668", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "House of Ashes", "word_cloud": "loosely base attempt coup action fast move story take place fictitious island however author say action much common attempt coup part world opinion give insight much take place world story start see eye quiet studious family man think religious many answer seek life say yes ask coup quite understanding agree follow charismatic leader then afternoon turn prayer time leave life change event unfold quite revolutionary imagine action shift narrative move fear emotion doubt experience hostage captor portray expressively action rise fall accord go inside observe outside windows stage see know thing bad end story round find fascinate grip perspective hostage think provoke conversation revolutionary make compare fictional event current world affair discussion reality government compare version feed young gunman thought future young impressionable men current event run course thought character appear seldom need occasion flick back check memory name anything else author use word peculiar write pity translate back however quick internet search bring think time come certainly give new perspective world event ever listen podcast spoken mate know thing film base true event matter well acted directed movie always experience crush sense betrayal discover majority film include number pivotal scene completely think get yet keep ask question movie tell truth question accompany nominate case lack truth issue anything fidelity history weigh tell story coup fictional relation attempt coup take place understatement place name character never exist historical beat year coup takeover island television station number militant involve length coup day loot happen crisis beat shoot order army attack full force accurately portray raise obvious question bother invented island provide historical fictional account coup provide answer interview observe nerve medium newbie instead reflect writer play glance watch look infectious paranoia reasonable religious group uprising remains active desire female explain prompt write think crazy even contemplate write admits year spend talk psychoanalyst push idea couch page hold report deliver word fly write hard part say conflict need bring attention coup also protect family understand make artistic decision set story amen easy argue art transcend issue life death litter endanger life work face potential death threat absolutely appreciate common sense doubt believe comprised work change place name invent character focus message rather historical truth state event detail much common coup tat part world example decline coup remain common form power change line sentiment provide interesting critique explore bad habit leave colonial power abuse innocence especially young uneducated men live poverty look mean sense theme narrative tense grip confront excellent job detail adrenalin charge horror first moment coup mix boredom fear loss dignity settle food run corner room become ghost coup lingers clear militant overthrow religious never use word describe faith fact mute element mean gap hole never adequately explore sad love see apply insight faith motivate film want true accounting happen however genuine fear reprisal mean powerful relevant never fully come together entirely hollow reading experience wish live time art sometimes required distance truth know reality history messy lend neat narrative beat movie documentary live locate mile east mile conquest believe threat pp show widespread collaboration fear keep dark last moment roundup also force local farmer come cart corrects misuse paint show movie viewer mislead believe local farmer collaborate willingly roundup transport mile police take pp polish farmer send home load train trip death jeer pass fell silent watch procession doom men woman german soldier stand sidewalk command sneer voice pp roundup flee trek help numerous successive occasion include polish prove many polish benefactor necessary save even also mention refuse help owe death penalty act recognize legitimacy motive polish inaction however criticize overseas lack assistance eventually find permanent lodging shelter farmer barn first help pay time become altruistic nothing consider extreme poverty include tattered clothes boot unfair pay help deem ineligible medal whereas incomparably better german occupation yet take hefty fee ship eligible first praise commend assassinate spy collaborator informer pp make fearful enter wood result hidden felt ever time leave shelter farm encounter hide forest nearby farm assemble band build independent shelter forest stole feed stuffs livestock polish farmer pp sometimes kill fugitive writes go food night return first farmer deny even village eventually learn kill farmer arrive take direct proof kill remain fact never return trip obviously see rely someone else statement word hearsay go food include steal event presumed death occur sometime latter presume contact clearly eyewitness experience positive visit area force hide harm encourage pp later night allegedly return even look throw grenade forest shelter recently hide darkness forest close shelter indicate possibly detail earlier day broad daylight gather together justify informed polish tall tale polish atrocity expose independent investigation contradictory fantastic account self count number bullet fire soldier baby brother count shot soldier multiple scarce bullet infant even make accusation order kill remain polish admit nonexistence write evidence yet say better evidence lie record persistent widespread murder alone murder non hundred kill even correctly blame hardly proof term kill remain polish atrociously poor job claim kill survive flat lie longer exist already disband final commander", "genres": ["Fiction & Literature", "Historical Fiction", "Politics"], "summary": "The City of Silk is seething. The corrupt government has been ruling over the people too long and the city is becoming restless. Then one hot evening The Leader, a head of a group of rebels, gathers his followers and tells them: 'Today, we will be making history. For ourselves, and our fellow countrymen of Sans Amen.'\r\n\r\nAnd so a ragtag collection of men and boys take up arms and storm two of the most important buildings in the city: the house of power and the television studios. Together they will take back what is rightfully theirs.\r\n\r\nCaught up in the madness is Ashes. A bookish, learned man, he has been swept up by The Leader's powerful rhetoric. But now that words have turned to action he is not so sure anymore. And trapped inside the government building with the rebels is Aspasia. A proud woman, a mother of boys, she sees much of her sons in these boys with guns in their hands and power in their eyes.\r\n\r\nA powerful, evocative and important novel from the author of The White Woman on the Green Bicycle.", "asin": "1471126668", "rank": "4194158", "city": "Trinidad and Tobago", "image": "https://images-na.ssl-images-amazon.com/images/I/51grO8%2BiWWL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}