{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 27607, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Some writers tell compelling stories.  Some write beautifully.  This writer does both.  The characters are interesting; the imagery is vivid; the language is fresh.  The story moves forward at a nice pace, and the theme is poignant, forever relevant in a world that seems less averse to war than it should.I was immediately struck by the poetry: powerful, vivid, yet simple and clean.  The images were clear and precise, giving the reader a strong feeling of place and mood, without drowning us in adjectives.The characters were compelling.  I cared so much about this blind girl, how she would navigate through a world that had suddenly become so treacherous, and this brilliant and betrodden young man whose destiny was thrusting him toward the darkness when his soul was made for light.It's not often I come across a novel that I enjoy as much as I enjoyed this.  It was a pleasure to read it."}, {"review_sentiment": 5.0, "review_text": "A must-read."}, {"review_sentiment": 1.0, "review_text": "I could easily be accused of writing a review without reading the book, and that is true.  I didn't get past page 16.  The bottom line is the writing is absolutely juvenile.  If you are OK with reading incomplete sentences as well as those awkwardly worded, this could be a book for you.  Could easily be written by a 12 year old.  The fact that this book received a Pulitzer Prize is simply more evidence that where goes art, goes civilization.  And Western Civilization has jettisoned good standards and reason.  Sad."}, {"review_sentiment": 4.0, "review_text": "I had purchased this book a couple years ago after hearing a friend rave about it. I love historical fiction, particularly books that take place during WWII, and this sounded like an excellent choice. I've been a bit busy raising my twins so I didn't read it right away but decided recently to read it since I was in the mood for a long novel!All The Light We Cannot See by Anthony Doerr is a fiction novel about a young French girl named Marie-Laure and a teenage German boy named Werner whose lives become intertwined during the war. Marie-Laure experienced disintegrating blindness when she was six years old and now has to learn to navigate the war-ridden world using a wooden model of their neighborhood that her father builds. Werner is incredibly intelligent and can dismantle receivers and put them back together again. He knows how things work and can solve complicated mathematical equations. His abilities catch the attention of the German soldiers who have him enlist so he can fight against the resistance. Their stories come together to create a beautiful tale.It took me about two weeks to read this book and I really enjoyed it! It's intelligently-written and one you will want to ponder when you set it down. Many of the chapters are only a couple pages long and each chapter switches points-of-view. It's fairly easy to follow even though the narrators change so frequently. There are also several sections of the book, separated by dates, months, or years.The reason I gave this novel four stars is because, even though it's incredibly well-written, there are some parts that drag. Don't get me wrong, this book is very detailed and I love the classical works of fiction that Marie-Laure reads and the ways those books tie into the rest of the novel. There were just some parts that I found to be slow-moving so I didn't get to read that much that day but other days, I tore through it so that definitely made up for those other days!Overall, I liked this novel and definitely feel it's worth it to read it, especially if you enjoy historical fiction novels set during WWII. It's intelligently-written so you will want to be ready to do some thinking while reading this book. Parts of it dragged for me but it was mostly a quick read. I'm glad I finally read it and recommend it if you are looking for a thick novel to dive into!"}, {"review_sentiment": 5.0, "review_text": "This story is written so well that it pulls you in and you’ll feel “surrounded” by Doerr’s rich narrative. It’s so good that you’ll put the book down just to prolong the experience."}, {"review_sentiment": 2.0, "review_text": "In spite of its stellar reviews, I found this book painfully predictable. Has a character appeared who elicits your sympathy? Know that they will soon suffer a terrible fate. Little girl innocently playing? Turn a few pages and she'll be dead. Sensitive intellectual? Of course, he'll be bullied and suffer. Cruelty, inhumanity, it all falls into the slots of expected stereotypes. I'll spare you spoilers.Yet after all that, I have no doubt that I could do no better, so I take my hat off to the author and bow in respect."}, {"review_sentiment": 5.0, "review_text": "Excellent story telling.  I love the WW2 setting told from a little different perspective."}, {"review_sentiment": 5.0, "review_text": "Loved this book and could not put it down.  Get your tissues out!"}, {"review_sentiment": 5.0, "review_text": "Great book!"}, {"review_sentiment": 5.0, "review_text": "Beyond anything I've read in the last decades. Subtle and vital as the air we breathe. Coursing with understated power and the deepest reflection"}]}, "authors": ["Anthony Doerr"], "isbn": "1476746583", "longitude": 2.3514992, "periods": ["1900s", "Recent Releases"], "title": "All the Light We Cannot See", "word_cloud": "writer tell compel story write beautifully writer character interesting imagery vivid language fresh story move forward nice pace theme poignant forever relevant world seem le averse war immediately strike poetry powerful vivid yet simple clean image clear precise give strong feeling place mood drown character compel care much girl world suddenly become treacherous brilliant retrodden young man destiny thrust darkness soul make often come enjoy much enjoy pleasure easily accuse write review read true get past page bottom line write absolutely juvenile ok read incomplete sentence well awkwardly word easily write year old fact receive simply evidence go art go civilization western jettison good standard reason purchase couple year ago hear friend rave love historical fiction particularly take place sound excellent choice bite busy raise twin right away decide recently mood long fiction young french girl name teenage german boy name live become intertwined war experience disintegrate blindness year old learn navigate world use wooden model neighborhood father build incredibly intelligent dismantle receiver put together know thing work solve complicate mathematical equation ability catch attention german soldier enlist fight resistance story come together create beautiful take week really enjoy want ponder set many chapter couple page long chapter switch fairly easy even narrator change frequently also several section separate date month reason give star even incredibly part drag wrong detailed love classical work fiction read way tie rest part find get much day day tear definitely make day like definitely feel worth especially enjoy historical fiction novel set want ready think reading part drag mostly quick glad finally recommend look thick dive story write well pull feel surround rich narrative good put prolong experience spite stellar review find painfully predictable character appear elicits sympathy soon suffer terrible fate girl innocently play page dead sensitive intellectual course bully suffer inhumanity fall slot expect stereotype spare doubt take author bow respect excellent story tell love set tell little different perspective love tissue great anything last decade vital air understated power deepest reflection", "genres": ["Fiction & Literature", "WWII"], "summary": "WINNER OF THE PULITZER PRIZE\r\n\r\nFrom the highly acclaimed, multiple award-winning Anthony Doerr, the beautiful, stunningly ambitious instant New York Times bestseller about a blind French girl and a German boy whose paths collide in occupied France as both try to survive the devastation of World War II.\r\n\r\nMarie-Laure lives with her father in Paris near the Museum of Natural History, where he works as the master of its thousands of locks. When she is six, Marie-Laure goes blind and her father builds a perfect miniature of their neighborhood so she can memorize it by touch and navigate her way home. When she is twelve, the Nazis occupy Paris and father and daughter flee to the walled citadel of Saint-Malo, where Marie-Laure’s reclusive great-uncle lives in a tall house by the sea. With them they carry what might be the museum’s most valuable and dangerous jewel.\r\n\r\nIn a mining town in Germany, the orphan Werner grows up with his younger sister, enchanted by a crude radio they find. Werner becomes an expert at building and fixing these crucial new instruments, a talent that wins him a place at a brutal academy for Hitler Youth, then a special assignment to track the resistance. More and more aware of the human cost of his intelligence, Werner travels through the heart of the war and, finally, into Saint-Malo, where his story and Marie-Laure’s converge.\r\n\r\nDoerr’s “stunning sense of physical detail and gorgeous metaphors” (San Francisco Chronicle) are dazzling. Deftly interweaving the lives of Marie-Laure and Werner, he illuminates the ways, against all odds, people try to be good to one another. Ten years in the writing, a National Book Award finalist, All the Light We Cannot See is a magnificent, deeply moving novel from a writer “whose sentences never fail to thrill” (Los Angeles Times).", "asin": "1476746583", "rank": "2137", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51wG7x-S%2B0L.jpg", "country": "France", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}