{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 119, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "I'm a fan of both Thomas and Isaacson so I went into this wish really high expectations and this detailed book didn't disappoint. If you've read any of Evan Thomas' books such as \"The Very Best Men: The Daring Early Years of the CIA\" or \"Sea of Thunder: Four Commanders and the Last Great Naval Campaign 1941-1945\" then you will be familiar with his style of tracing the lives of several characters in one book. I have always enjoyed his style of biography that shifts from character to character in different chapters. Great read."}, {"review_sentiment": 5.0, "review_text": "I've just begun reading the book which appears to be well written with vivid historical context.  I give the seller five stars for the quality of the product and by virtue of the fact they even provided a personal letter.  That to me speaks volumes to the caliber of individual and a trait less common with many companies today.Semper Fidelis"}, {"review_sentiment": 5.0, "review_text": "A wonderfully researched joint biography of six men whose intelligence, decency and outlook greatly influenced American foreign policy in the eventful period of the Second World War and early stages of the Cold War.  A joy to read - with insightful and often humorous anecdotes about their lives, a perfect blend of exposition about the decisions they faced and their personal lives.  The authors believe - with much basis - that the results of their decisions were on the whole, quite favorable to their country and the world.The choice of these six is a good one - the authors don't strain to create connections where they are slight - e.g., Kennan and McCloy don't seem to interact much - but it is true that the degree to which their backgrounds do intersect is remarkable.  A subplot is \"American establishment\" and the extent of its existence.  A shallow reader might conclude - partly because the connections are drawn so vividly - that this was a closed elite. But this was untrue. - and the authors do not try to paint it so.  McCloy's background was quite modest - Kennan was from Wisconsin, Acheson from a well-established but almost rural family in New Hampshire.  Although Acheson, Harriman, Lovett and Bohlen were finely educated at prep schools, it's also true that during the period of their youths, the two or three dozen most heralded prep schools graduated many many thousands of students - most of whom obviously did not become high officials in government.The authors rightly admire (with the exception of the internment of Japanese civilians) the policies of the United States government during the 1940s and early 1950s -- a period in which the Democratic Party dominated the federal government - despite the \"Mr. Win the War\" hat donned by FDR when war came - and his opening the top levels of government to more conservative Republican men.  The authors' admiration of their subjects does induce a certain share in their irritation at criticism - particularly from the right.It would be interesting to see another pair of authors create a similar book about those who took high places in the Eisenhower administration - some of whom - Forrestal, Dillon, the Dulles brothers and Nitze come to mind - had a similar background to these men.  I suspect if such a book shared the outlook of its subjects, and the time period of their period in power, the book might be darker - the U.S. rather powerless to prevent the deaths of approximately 30 million in the Great Leap Forward, the deep Soviet oppression over half of Europe, an escalating nuclear arms race.In a sense, this is the equally true dark side of what the world looked like AFTER the Wise men were in power - in 1939, there had been NO Communist China at all, the Soviet Union had NOT extended its grip over a hundred million Europeans. One should not overestimate what good these wise men were able to do.It's really a fine book - hugely informative, the writing a pleasure to read - you'll quite enjoy it."}, {"review_sentiment": 4.0, "review_text": "More 20thcentury history here than any accumulation of readings from other texts.  A must read for concerned citizens"}, {"review_sentiment": 5.0, "review_text": "informative readable book about an important time in US history. parallels to today's headlines.difference is there was wisdom by the participants in those days. from the truman to johnsonadministrations. are there any wise men today?"}, {"review_sentiment": 4.0, "review_text": "As happens frequently in biographies, the authors fell in love with their subjects; praise for the 6 main members of the Cold War \"Establishment\" far outweighs criticism.  Averell Harriman and Dean Acheson get the most thorough attention among the 6 subjects, and rightfully so.I took away one star because the authors largely see the foreign policies of Republican presidents Ike, Nixon and Reagan through the eyes of the Wise Men, instead of objectively.  Only when Nixon \"comes to his senses\" and asks Acheson and Harriman for advice does he receive some praise.  Ike's foreign policy era is portrayed as one to be endured until the Wise Men are allowed back in the inner circle under JFK. Their total disdain for Reagan is clear; no mention of the reasons for end of the Cold War and Reagan's active part in it.However, the 5-star section of the book is clearly the LBJ-Vietnam era.  Wow, they really can't stand LBJ as a human being and politician, but his (and the Wise Men's) agony over the Vietnam war is written about almost lyrically.  The authors convey the complicated global factors of the war in an admirable, even-handed, almost sympathetic way."}, {"review_sentiment": 5.0, "review_text": "Well-written and very interesting book about creation of a new era of the US and World.Also quite extensive in picturing main characters with their strenghts and weaknesses."}, {"review_sentiment": 5.0, "review_text": "This is so well written on a topic I have read many books about I might even read Issacson's Steve Jobs book which I am not much interested in.This follows 6 men- two foreign service intellectuals/diplomats,two lawyers,and two bankers (though these hast seemed in this age to be quite mutable and interchangeable) who served as ambassadors,diplomats,councilors book takes the view of Barbara Tuchman who said that to understand a society (in her case medieval history in \"Distant Mirror\" that you don't get \"the real dope\" by looking at the peasant or the king but to the middle level,to the prince to see what goes on.And though one might read David McCullough's excellent Truman biography to  ones about Ike of the excellent reporting or David Hablberstam's \"The Best and The Brightest\" these were the prices who were six of the most important architects of the cold war policy and containment which shaped the Wests foreign policy through the 20th century.One of the most enjoyable and best telling of this history"}, {"review_sentiment": 5.0, "review_text": "Excellent writing. Thought-provoking."}, {"review_sentiment": 5.0, "review_text": "A fascinating history of how six good friends changed the course of US history -- both in and out of the government.  The book actually showed how the \"revolving door\" actually was a benefit rather than a detriment to good governance.  Impressive men made impressive contributions to our country."}]}, "authors": ["Walter Isaacson", "Evan Thomas"], "isbn": "1476728828", "longitude": -77.0366456, "periods": ["1900s"], "title": "The Wise Men: Six Friends and the World They Made", "word_cloud": "fan go wish really high expectation detail disappoint last familiar style trace life several character always enjoy style biography shift character character different chapter great begin read appear well write vivid historical context give seller star quality product virtue fact even provide personal letter speak volume caliber individual trait le common many company fidel's wonderfully research joint biography men intelligence decency outlook greatly influenced american foreign policy eventful period early stage joy insightful often humorous anecdote life perfect blend exposition decision face personal live author believe much basis result decision whole quite favorable country choice good author strain create connection slight seem interact much true degree background intersect subplot american establishment extent existence shallow partly connection draw vividly close elite untrue author try paint background quite modest almost rural family finely educate prep school also true period youth dozen herald prep school graduate many many thousand student obviously become high official author rightly admire exception internment japanese civilian policy government early period dominate federal government don war come open top level government conservative men author admiration subject induce certain share irritation criticism particularly pair author create similar take high place administration brother come mind similar men suspect share outlook subject time period period power rather powerless prevent death approximately deep soviet oppression half escalate nuclear arm sense equally true dark side look men power extend grip overestimate good men able really fine hugely informative write pleasure quite more history accumulation reading texts concern citizen informative readable important time history parallel today wisdom participant day truman johnsonadministrations men today happens frequently biographies author fell love subject praise main member far outweigh criticism thorough attention subject rightfully take star author largely see foreign policy republican president eye instead objectively only come sens ask advice receive praise foreign policy era portray endured allow inner circle total disdain clear mention reason end active part section clearly era really human politician agony war write almost lyrically author convey complicate global factor war admirable almost sympathetic way interest creation new era quite extensive picturing main character strength weakness well write topic many even much interested follow foreign service lawyer banker hast seem age quite mutable interchangeable serve ambassador diplomat councilors take view say understand society case medieval history real dope look peasant king middle level prince see go excellent biography one excellent report price important architect cold war policy containment shape foreign policy enjoyable best telling history excellent writing fascinating history good change course history government actually show revolving door actually rather detriment good governance men impressive contribution country", "genres": ["Biography", "History", "WWII", "Politics"], "summary": "With a new introduction by the authors, this is the classic account of the American statesmen who rebuilt the world after the catastrophe of World War II.\r\n\r\nA captivating blend of personal biography and public drama, The Wise Men introduces six close friends who shaped the role their country would play in the dangerous years following World War II. They were the original best and brightest, whose towering intellects, outsize personalities, and dramatic actions would bring order to the postwar chaos and leave a legacy that dominates American policy to this day: Averell Harriman, the freewheeling diplomat and Roosevelt’s special envoy to Churchill and Stalin; Dean Acheson, the secretary of state who was more responsible for the Truman Doctrine than Truman and for the Marshall Plan than General Marshall; George Kennan, self-cast outsider and intellectual darling of the Washington elite; Robert Lovett, assistant secretary of war, undersecretary of state, and secretary of defense throughout the formative years of the Cold War; John McCloy, one of the nation’s most influential private citizens; and Charles Bohlen, adroit diplomat and ambassador to the Soviet Union.", "asin": "1476728828", "rank": "21577", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/511K8I5hc2L.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}