{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 16, "rating": 3.6, "reviews": [{"review_sentiment": 2.0, "review_text": "I read this book because I was headed to Barcelona and wanted to read a book set in Spain and saw this was an established author.  Overall I found the characters frustrating.  I am an extremely A type person.  I have read plenty of books with characters who are opposite, different, diverse from me, but this was apparently too much for my taste.  I really can't think of a single redeeming characteristic of the main character. The other characters also failed to make me feel anything for them.  So little drive, so pitiful, and so incredibly selfish.  If I am going to read a book about characters like that I would at least like it to be fun, this was just depressing. Also, a little more homework would have gone a long way as the majority of this novel was not set in Barcelona.  That's, of course, my fault.  The one redeeming part was the bits of history.  If you like a wet blanket book, here yah go."}, {"review_sentiment": 3.0, "review_text": "Read Brooklyn first, did not enjoy as much."}, {"review_sentiment": 4.0, "review_text": "Interesting characters. Good writing."}, {"review_sentiment": 5.0, "review_text": "I love all of Colm Toibin's books, he is an amazing writer. I have almost all of his books."}, {"review_sentiment": 2.0, "review_text": "I was so disappointed with this book because I loved \"Brooklyn\".  When the story went backto Ireland, it was good..  The characters were not interesting."}, {"review_sentiment": 5.0, "review_text": "The South is author Colm Toibin’s first novel, and it was an auspicious arrival in 1990.  Brooding and anxious, his protagonist Katherine Proctor seeks a new future even at the cost of abandoning her husband and child in Ireland. She is motivated to get far away, to remove herself from small town values, from the deeply ingrained “troubles” in Ireland, and the low expectations for success that prevail like the cold, heavy mists over the sea and fields. She appears in Barcelona and wanders uncertain and listless in a city and country every bit as haunted by its fractious past as Ireland. How she struggles forward and seeks resolution through painting pulls readers into her predicaments to the end.Interiority defines this story as Toibin explores the internal musing, questioning, fantasizing, and circular thinking of his primary character. At times the story feels claustrophobic, other times it induces a kind of dream state like being lost in the mountain fog above Barcelona. A predominant theme here is abandonment, and Toibin presents it from the perspective of those leaving and those left behind. It tears at the soul and leaves yearning and questioning. A mother abandons her daughter who later leaves behind her son. There’s never a full resolution but sometimes an earnest attempt to understand and bridge the rifts of the past.Toibin is one of our greatest English-writing authors, and it’s a pleasure to explore his early writing with this novel of The South.\\Michael Helquist, MARIE EQUI: Radical Politics and Outlaw Passions"}, {"review_sentiment": 5.0, "review_text": "A magnificent account of a woman painter who leaves Ireland, which is haunted by the troubles and by the IRA for Spain which is haunted by the Spanish Civil war and by Franco's repressive regime."}, {"review_sentiment": 5.0, "review_text": "A brilliant story about a woman, told wonderfully by a man.  If you appreciate great writing, enjoy..."}, {"review_sentiment": 4.0, "review_text": "\"The South\" is my first sampling of Colm Toibin and I really enjoyed his treatment of identity and loss in the life of a single character.  The sense of quiet desperation that led to Katherine abandoning hearth and home in Ireland for the alienation of early Franco Spain is tangible, and although she remains a rather remote figure in her struggles to belong, one does feel so for her loss.  Betrayal, innocence, revenge and forgiveness run through the narrative, colliding and eliding in alarming and thought provoking ways.  I will be looking out for more of his work."}, {"review_sentiment": 4.0, "review_text": "A very direct storytelling, dramatic yet calmly told. No moralism. I read it after visiting Barcelona and Ireland which may have enhanced my reading, but I found in it a strong, sometimes seemingly cold yet also passionate female character, who doesn't justify any of her behavior. The  flashbacks that reveal her history are transitioned easily in and out of her story.Not all my questions about the character are answered yet I was still satisfied.Having read this first novel by Colm Toibim  I'm drawn to read more of his  work"}]}, "authors": ["Colm Toibin"], "isbn": "1476704481", "longitude": 2.1774322, "periods": ["1900s"], "title": "The South: A Novel", "word_cloud": "head want set saw establish find character frustrate extremely type person plenty character opposite different diverse apparently much taste really single redeem characteristic main character character also fail feel anything so little drive pitiful incredibly selfish go character fun depress also little homework go long way majority set course fault redeem part bit history wet blanket hay go first enjoy much interest character good writing love amazing writer almost disappoint love story go back to character interest author first auspicious arrival anxious protagonist seek new future even cost abandoning husband child motivate get far away small town value deeply ingrained trouble low expectation success prevail cold heavy mist sea field appear wanders uncertain listless city country bit haunt fractious past struggle forward seek resolution paint pull reader predicament defines story explore internal muse question fantasize circular think primary character time story feel claustrophobic time induces kind dream state lose mountain fog predominant theme abandonment present perspective leave leave tear soul leaf yearn question mother abandon daughter later leave son never full resolution sometimes earnest attempt understand bridge rifts greatest author pleasure explore early write passion magnificent account woman painter leave haunt trouble haunt spanish war repressive regime brilliant story woman tell wonderfully man appreciate great writing enjoy first sample really enjoy treatment identity loss life single character sense quiet desperation lead abandon hearth home alienation early tangible remain rather remote figure struggle belong feel loss innocence revenge forgiveness narrative collide elide alarm think provoke way look work direct storytelling dramatic yet calmly tell moralist visit reading find strong sometimes seemingly cold yet also passionate female character justify flashback reveal history transition easily question character answer yet still first draw work", "genres": ["Fiction & Literature"], "summary": "The first highly acclaimed novel from an “immensely gifted and accomplished writer” (The Washington Post), about an Irishwoman who creates a new life in post-war Spain.\r\n\r\nIn 1950, Katherine Proctor leaves Ireland for Barcelona, determined to escape her family and become a painter. There she meets Miguel, an anarchist veteran of the Spanish Civil War, and begins to build a life with him. But Katherine cannot escape her past, as Michael Graves, a fellow Irish émigré in Spain, forces her to reexamine all her relationships: to her lover, her art, and the homeland she only thought she knew. \r\n\r\nThe South is a novel of classic themes—of art and exile, and of the seemingly irreconcilable yearnings for love and freedom—to which Colm Tóibín brings a new, passionate sensitivity.", "asin": "1476704481", "rank": "323855", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/51T-4D9te1L.jpg", "country": "Spain", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}