{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 45.4667971, "ratings": {"num_ratings": 1012, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "I enjoyed this book, but not quite enough to rate it higher.It is, first, well-written and easy to read, with a simple, concise narrative that is conducive to the story and its narrator. Likewise, the text does not come off as dated, such that it can be readily comprehended by the modern reader. There are some good, poignant descriptions here and there, and several examples of the striking eloquence that defines quality literature; 'Farewell' reads every bit like a classic, I thought. I can't say I found the writing to be especially moving; but no complaints, either.As for content, I found the book to be substantial, but only just so. The story is solid, if a bit formulaic and predictable (for someone reading it nearly a century after publication, anyhow). The characters are well-drawn and believable. The same can be said of the plot twists and the ending: sound and functional and satisfying, though unexceptional by 2017's timeworn standards. Really, my feelings about the book in total follow this same theme: I can think of nothing I particularly liked about it, nor did I have any specific dislikes. I read it, I got a thing or two from it, and then moved on to the next book.Were 'Farewell' to be published today, by a no-name author, I'm not sure that it would receive the same acclaim that it has amassed over the decades. Though, I would still consider it a worthwhile read, all the same.I'm grateful for, and have benefited from, this book and the work that went into it.* * *Some notable quotes from 'A Farewell to Arms':\"I knew I did not love Catherine Barkley nor had any idea of loving her. This was a game, like bridge, in which you said things instead of playing cards.\" -- p.30\"I knew that I was hit and leaned over and put my hand on my knee. My knee wasn't there.\" -- p.55\"We were all cooked. The thing was not to recognize it. The last country to realize they were cooked would win the war.\" -- p.134\"'Then you think [the war] will go on and on? Nothing will ever happen?' 'I don't know. I only think the Austrians will not stop when they have won a victory. It is in defeat that we become Christian.'\" -- p.178\"The world breaks every one and afterward many are strong at the broken places. But those that will not break it kills. It kills the very good and the very gentle and the very brave impartially. If you are none of these you can be sure it will kill you too but there will be no special hurry.\" -- p.249\"'Now, that is the great fallacy; the wisdom of old men. They do not grow wise. They grow careful.'\" -- p.261\"They questioned us but they were polite because we had passports and money. I do not think they believed a word of the story and I thought it was silly but it was like a law-court. You did not want something reasonable, you wanted something technical and then stuck to it without explanation.\" -- p.281"}, {"review_sentiment": 2.0, "review_text": "Historian Charles Whiting once remarked that Ernest Hemingway's novel \"Across the River and Into the Trees\" was \"bitter, irrational, and cynical.\" This view was in keeping with its critical reception upon its release in 1950, which was overwhelmingly negative -- the first Hemingway novel ever to take a critical drubbing. And in truth it is not a very good novel, though like nearly everything Hemingway wrote, it contained more-than-occasional flashes of profundity and what might be called observational genius. But it seems to me that calling a Hemingway piece \"bitter, irrational and cynical\" is like calling a bomb heavy, noisy and destructive. It's an accurate description, but not an intelligent one. Nearly everything Hemingway ever wrote was bitter and cynical, and his characters seldom if ever acted in a rational manner: that was part, if not nearly all, of his literary signature. The flaws that cripple \"Across the River\" are not bitterness, cynicism or irrationality, but aimlessness and repetition.The story is extremely simple. In the immediate aftermath of WW2, an aging professional soldier in the U.S. Army named Richard Cantwell (who is referred to simply as \"The Colonel\") travels to Venice to meet with old friends and his young paramour, the 18 year-old Countess Renata. Cantwell is dying of heart disease and believes his demise is imminent, so he wishes to spend his last day hunting, dining and romancing young Renata, who is as infatuated with him as he is with her. The book details Cantwell's final day, but much of the story revolves around a stream-of-consciousness inner monologue the Colonel is having about his own past -- his service in Italy during WW1, his failed marriage, and the terrible experiences he had as a regimental and assistant divisional commander during the European campaign during WW2.As a novelist, Hemingway was always very strong coming out of the gate but -- I'm sorry to say this -- not worth much coming down the stretch. A superb short-story writer, the rigidity of his style, which was based around brevity, simplicity and implication (rather than description), did not work anywhere near as well for full-length books. \"Across the River\" suffers acutely from this weakness; though shorter than many of his other works it \"reads heavy\" in second and third acts, and is full of the infuriating shallowness and ugliness that makes it so damned difficult to care about his characters. (It would be interesting to count the number of times the characters exchange sappy, sophomoric \"I love yous\" or how many times Renata asks her bitter old beau to be \"kind.\") As always, we get long passages about Hemingway's obsession, the city of Paris, and as always, there is a great deal of talk about food and drink and a lot of facetious and somewhat sophomoric banter, which is amusing in small doses but almost intolerable in the long run. I'm not exaggerating when I say the exchanges between Cantwell and Renata are almost unreadable after awhile. Doubtless this is the way Hemingway spoke to his lovers -- his biographer and friend Ed Hotchner made that clear in his book, PAPA -- but it isn't the way anyone else on the planet spoke to theirs, and it comes off as self-indulgent, creepy and boring.The book is at its strongest when Cantwell recalls the two wars in which he has served. Hemingway served in Italy during the '14 - '18 war and as always, whenever he touches upon that time of his life his prose comes alive in a way it seldom does at any other time. I was greatly amused -- and many must have been outraged at the time -- at the \"bitterness and cynicism\" Cantwell displays about WW2 and the top Allied brass, especially Eisenhower, Montgomery, Leclerc, Patton, and Bedel \"Beetle\" Smith. After the war the deification of the top Allied leaders was in full swing and it must have come as a great shock to the readership to learn that many combat soldiers despised and even hated the public's top military idols for their venality, egotism and, yes, incompetence. Hemingway has performed a service by scraping away some of that whitewash here, and I wish he had reined in his pathological tendency to ramble and blather and written more clearly and fully on a subject he was in quite a good position to talk about. Overall I can't really say I'd recommend this novel to anyone except Hemingway fans -- those who have no experience with his work would best start somewhere else (with his short-stories, perhaps) and work their way toward this exercise in \"bitterness, cynicism and irrationality.\" They may find it more palatable once they are warmed up to his style than they would going in cold.In closing, I'd like to say that Hemingway's greatest strength was his ability to crush huge, profound life-truths and life-lessons into single sentences of roughly poetic simplicity, and \"River\" has a number of these, but not quite enough to salvage it. It's a promising book in many ways -- all of Hemingways' books contain some level of genius -- but even at its modest length it feels too long, talks too much and says too little. By this point in his career Hemingway was almost a god to many in the public, and perhaps had grown too lazy or self-satisfied for his own good. It is therefore comforting to know that despite this stumble, some of his greatest works still lay ahead of him."}, {"review_sentiment": 5.0, "review_text": "Excellent!"}, {"review_sentiment": 5.0, "review_text": "I bought both this book together with \"All Quiet on the Western Front\" because I wanted to read the two most well-known books about WWI written by those who served in it. Both are unique in their own way. All Quiet is a haunting portrayal of actual battlefield conditions, a book that takes you into the trenches to see warfare through the eyes of the soldiers who fought in it. Hemingway's novel is more of a romance/love story set in the context of WWI. As such, it is not as vivid in describing the war itself the way All Quiet is, but it tells us more about characters and people during the war.A unique feature about this particular version of the book is that it has appendices showing Hemingway's drafts and rewrites of the story. I did not read those sections, but they are there for the interest of literary scholars."}, {"review_sentiment": 5.0, "review_text": "I love the book and very fast shipping And exactly what my son needed for school !!"}, {"review_sentiment": 5.0, "review_text": "A master piece. Great read."}, {"review_sentiment": 5.0, "review_text": "I totally enjoyed reading this Hemingway Library edition of  A Farewell to Arms. I loved all the extras included that contributed  to understanding the background of the story. As a result of reading this edition, I have ordered another Library edition."}, {"review_sentiment": 5.0, "review_text": "great product"}, {"review_sentiment": 5.0, "review_text": "Great edition!"}, {"review_sentiment": 4.0, "review_text": "There are those who glorify war and Ernest Hemingway has often been accused of this. A Farewell to Arms seems to ride both sides of this fence. It is a very well written account of a soldier and a nurse having an awkward relationship. In this book, Hemingway takes his time and the result is a slow read.  However, it is a great book that has a lot under the surface. Often, Hemingway does not come right out and tell you the story. You have to read in between the lines to truly appropriate what is going on. This is a fascinating work and I really enjoyed reading it."}]}, "authors": ["Ernest Hemingway"], "isbn": "1476764522", "longitude": 9.1904984, "periods": ["1900s"], "title": "A Farewell to Arms: The Hemingway Library Edition", "word_cloud": "enjoy quite enough rate first easy simple concise narrative conducive story narrator text come date readily comprehend modern good poignant description several example strike eloquence defines quality literature read bit classic think find write especially move complaint content find substantial story solid bit formulaic predictable someone read nearly century publication character believable say plot twist end sound functional satisfying unexceptional timeworn standard feeling total follow theme think nothing particularly like specific dislike get thing move next publish today author sure acclaim amass decade still worthwhile grateful benefit work go notable quote arm know love idea love game bridge say thing instead play card know hit leaned put hand knee knee cook thing last country realize cook war think war go ever know think stop victory defeat become world break afterward many strong broken place break kill kill good gentle brave impartially none sure special hurry great fallacy wisdom old men grow grow careful question passport money think believe word story think silly want something reasonable want something technical stuck explanation historian remark bitter irrational cynical view keep critical reception release overwhelmingly negative first ever take critical drubbing truth good nearly everything write contain flash profundity observational genius seem call piece bitter irrational cynical call bomb heavy noisy destructive accurate description intelligent everything ever write bitter cynical character seldom ever act rational manner part nearly literary signature flaw cripple bitterness cynicism irrationality aimlessness story extremely simple immediate aftermath age professional soldier name refer simply travel meet old friend young paramour die heart disease believe demise imminent wish spend last day hunt din romance young infatuate detail final day much story revolve inner monologue service fail marriage terrible experience regimental assistant divisional commander campaign novelist always strong come gate sorry say worth much come superb writer rigidity style base brevity simplicity implication rather description work anywhere near well suffers acutely weakness shorter many work read heavy second third act full infuriate shallowness ugliness make damn difficult care character interest count number time character exchange sappy sophomoric love yous many time ask bitter old beau kind always long passage obsession city always great deal talk food drink lot facetious somewhat sophomoric banter amuse small dos almost intolerable long run exaggerate say exchange almost unreadable awhile way speak lover biographer friend make clear way anyone else planet speak come creepy strongest recall war serve serve war always touch time life prose come alive way seldom time greatly amuse many time bitterness cynicism display top brass especially war deification top leader full swing great shock readership learn many combat soldier despise even hat public top military idol venality egotism yes incompetence perform service scrap away whitewash wish reined pathological tendency ramble blather write clearly fully subject quite good position overall really recommend anyone fan experience work start somewhere else perhaps way exercise bitterness cynicism irrationality palatable warmed style go close like say greatest strength ability crush huge profound single sentence roughly poetic simplicity number quite enough salvage promise many way hemingway contain level genius even modest length feel long talk much say little point career almost god many public perhaps grown lazy good therefore comfort stumble greatest work still lay ahead excellent buy together want write serve unique way haunt portrayal actual battlefield condition take trench see warfare eye soldier fight story set context vivid describe war way tell character people unique feature particular version appendix show draft rewrite story section interest literary scholar love fast shipping exactly son need school master piece totally enjoy read love extra include contribute understanding background story result read order great product war often accuse seem ride side fence well write account soldier nurse awkward relationship take time result slow however great lot surface right story line truly appropriate go fascinating work really enjoy reading", "genres": ["Fiction & Literature", "WWI"], "summary": "The definitive edition of the classic novel of love during wartime, featuring all of the alternate endings: “Fascinating…serves as an artifact of a bygone craft, with handwritten notes and long passages crossed out, giving readers a sense of an author’s process” (The New York Times).\r\n\r\nWritten when Ernest Hemingway was thirty years old and lauded as the best American novel to emerge from World War I, A Farewell to Arms is the unforgettable story of an American ambulance driver on the Italian front and his passion for a beautiful English nurse. Set against the looming horrors of the battlefield—weary, demoralized men marching in the rain during the German attack on Caporetto; the profound struggle between loyalty and desertion—this gripping, semiautobiographical work captures the harsh realities of war and the pain of lovers caught in its inexorable sweep. \r\n\r\nErnest Hemingway famously said that he rewrote the ending to A Farewell to Arms thirty-nine times to get the words right. This edition collects all of the alternative endings together for the first time, along with early drafts of other essential passages, offering new insight into Hemingway’s craft and creative process and the evolution of one of the greatest novels of the twentieth century. Featuring Hemingway’s own 1948 introduction to an illustrated reissue of the novel, a personal foreword by the author’s son Patrick Hemingway, and a new introduction by the author’s grandson Seán Hemingway, this edition of A Farewell to Arms is truly a celebration.", "asin": "1476764522", "rank": "7103", "city": "Milan", "image": "https://images-na.ssl-images-amazon.com/images/I/51GxAgnDqVL.jpg", "country": "Italy", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}