{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 2865, "rating": 4.2, "reviews": [{"review_sentiment": 2.0, "review_text": "“The Time Traveler’s Wife” is one of those books so many people told, nay, demanded I read. All said it was fabulous, and I believed them. The premise sounded interesting, especially since I am an unapologetic fan of Doctor Who. A time traveling man in love with a woman who has to live life linearly with, and without him? I am hooked! Or I wanted to be. Which is why this review is hard. I did not love this book, in fact, I barely liked it. So buckle in, this is going to be a long review.Let me start off with what I liked, because frankly, that won’t take much time. I liked how Niffenegger made Henry’s time travel ability akin to a disease. So often we think how cool it’d be to time travel, to go to a place we want to in time and hang out for however long we want, then bounce when we’re done. Henry’s limitations with when and where he goes, and not being able to control it, as well as losing anything on his body (clothes, teeth fillings, you name it), was fascinating. I really enjoyed flipping that idea on its head. I also enjoyed Niffenegger’s prose. She is an exceedingly talented writer and I loved her prose and the imagery it invoked, sometimes despite the situation the characters found themselves in. I don’t feel as if many modern day writers are allowed to write in this manner because of the current publishing industry, so I enjoy this level of prose in popular novels when I encounter it.But that’s it. That was all I enjoyed. Just because you write beautifully, does not mean you write well. If you want a time travel book that does this concept 1000x better (love story and all), go read Kindred by Octavia Butler and thank me later. The “love” story was not an impassioned affair at all. It was basically like reading a teenage love affair where hormones reign supreme long past their welcome, but written in such a clinical manner for all things sex related (and there’s a lot of sex. Like, a lot, implied and otherwise) that it didn’t feel like the passionate love story it aimed to be. Plus, Henry and Clare sound the same when I’m reading, they use the same mannerisms and phrasing, making them feel like shallow reflections of one another rather than their own unique person. You take the time travel out, and really, they might as well be the same person.Clare does not exist without Henry. I cannot tell you how infuriating I found this. Clare has no purpose other than to be Henry’s wife. Her whole life revolves around him and waiting for him from age 6 and on. Age 6! And don’t get me started on the uncomfortable sexual tension Henry feels for teenage Clare when he’s in his late thirties to early forties. I don’t care if you know this woman will be your wife, right now she’s a child. Act your age, not like the horny eighteen-year old you never age out of, Henry. To me, this is not love, this is grooming a young woman to be dependent on this man for everything for the rest of her life. Also, Henry is, apparently, a womanizing dog with drug and alcohol problems that Clare doesn’t care about at all because, well, love and marriage and soul mates and blah, blah, blah. I’m sorry, but that needed to be addressed in a meaningful way beyond “I have met my wife, I am all better now. Please ignore all my flaws.” I don’t know, I found Clare’s lack of substance and Henry grooming his future wife from childhood to be unsettling not romantic, time travel be damned.Also ever single POC in this novel is boiled down to a stereotype. Clare’s rich family (who dresses for dinner as if they lived in a Jane Austen novel) employs servants who happen to be women of color. One of whom speaks in “Gone with the Wind” levels of colloquialism. Not to mention that Henry’s landlord, Kimy, speaks in a broken English that feels ripped from railroad-era cartoons portraying Asian Americans. This book was written in the early 2000’s, there is 0 excuse for ANY this. It wasn’t even done to be a social commentary, it was just done with what felt like no thought and therefore was just bad on the author and editor’s part for leaving that in the book. I understand that sometimes characters do speak in this manner, but when your only POC’s are all caricatures, that’s a big no-no for me.Lastly, there were so many instances strewn throughout the entirety of the book that just felt like the author was trying way too hard to prove that she knew what she was talking about. Long paragraphs with lists of punk-rock bands to show that Henry is the real deal. Name dropping several classically trained musicians to show Henry and Clare are cultured, so very cultured. Listing out every single detail to making paper art (multiple times) so you know that she knows her stuff when Clare is working in her art studio. Niffenegger even did this when listing out their groceries so we’d know she knew what she was talking about when she tells us Henry knows how to cook. It made the book slow and bogged down the lovely prose the author was otherwise employing. And for what? Doing research is important for fiction novels, absolutely, but give it a purpose. Show me how this information relates to your characters. Don’t tell me vis-à-vis a laundry list of names. Otherwise it just sounds like I’m having someone’s Google search dictated to me, and that’s not a fun read.So how to rate this book? A book with lovely literary writing, but with flat characters that lacked the emotional depth to make me feel like they weren’t both selfish and flat people? A book with a fascinating concept, but plagued with terrible POC representation and eye-roll levels of lists trying to prove the author did her research? I wanted to give this book at least 3 stars, but I can’t. Giving it 3 stars is just my guilt that I didn’t like it more. So I’m giving it 2 stars, sorry not sorry."}, {"review_sentiment": 1.0, "review_text": "Sorry, as an artist I know the difficulties artists have with themselves and their artmaking processes. Clare with all her common pleasures of being normal didn't convince me that she had the personality to be an artist. Moreover, I found the erotic more superficially described and frivolous than in books by Murakami. And finally I didn't find any of the descriptions of places or atmosphere to be deep enough to provide a proper backdrop for the story. So I wasn't remotely interested and felt merely obligated to finish the book."}, {"review_sentiment": 5.0, "review_text": "Awesome product"}, {"review_sentiment": 5.0, "review_text": "I️ needed a good love story to raise my spirits. This is a great book that I️ would recommend to anyone"}, {"review_sentiment": 4.0, "review_text": "It was hard for me to follow along with all the dates at first but I finally got a handle on it.  The story really picks up mid book and then it was hard to put down.  I loved the end!"}, {"review_sentiment": 5.0, "review_text": "really cool story"}, {"review_sentiment": 4.0, "review_text": "Good book."}, {"review_sentiment": 5.0, "review_text": "Sad, yet unique love story.  Great characters.  Easy to read and get swept in.  I really enjoyed this book and suggest it to anyone who likes non-cheesy love stories."}, {"review_sentiment": 5.0, "review_text": "Very few books in my life have made me cry. This is one of them. It was very well written and the story was beautiful. I'm so glad I found this book and read it. Definitely one of my favorites now."}, {"review_sentiment": 5.0, "review_text": "Amazing book. Very well written story."}]}, "authors": ["Audrey Niffenegger"], "isbn": "1476764832", "longitude": -87.6244212, "periods": ["2000s"], "title": "The Time Traveler's Wife", "word_cloud": "many people tell nay demand say fabulous believe premise sound interest especially unapologetic fan travel man woman live life linearly hook want hard love fact barely like so buckle go long start like frankly much like make travel ability akin disease so often think cool travel go place want hang however long want bounce do limitation go able control well lose anything body clothes teeth filling fascinate really enjoy flip idea head also enjoy exceedingly talented writer love prose imagery invoke sometimes situation character find feel many modern day writer allow write manner current publishing industry enjoy level prose popular novel encounter enjoy beautifully mean write well want travel concept better story thank later love story impassioned basically read teenage love affair hormone reign supreme long past welcome write clinical manner thing sex relate lot sex lot imply otherwise feel passionate love story aim sound read use mannerism phrase make feel shallow reflection rather unique person take travel really well tell infuriate find purpose whole life revolve wait age start uncomfortable sexual tension feel teenage late thirty early forty care know woman right child age horny old never age groom young woman dependent man everything rest life also apparently womanize dog drug alcohol problem care well love marriage soul mat blah blah sorry need addressed meaningful way meet better know find lack substance grooming future childhood unsettling romantic travel ever single boil stereotype rich family dress dinner lived employ servant happen woman color speak level colloquialism not landlord speak broken feel rip cartoon portray asian write early even do social commentary do felt think therefore bad author editor part leave understand sometimes character speak manner caricature big many instance strew entirety felt author try way hard prove know talk paragraph list band show real deal drop several classically trained musician show culture culture single detail make paper art multiple time know know stuff work art studio even list grocery know knew talk tell know make slow bogged lovely prose author otherwise employ research important fiction novel absolutely give purpose information relate character tell laundry list name otherwise sound someone search dictate fun rate lovely literary write flat character lack emotional depth make feel selfish flat people a fascinating concept plague terrible representation level list try author research want give least star give star guilt give star sorry sorry artist know difficulty artists art making process common pleasure normal convince personality artist moreover find erotic superficially describe frivolous finally find description place atmosphere deep enough proper backdrop story remotely interested felt merely obligate finish product need good love story spirit great anyone hard follow along date first finally get story really pick mid hard put love end really cool story good yet unique love story character get swept really enjoy suggest anyone like story very life make cry well write story beautiful glad find definitely favorite amazing very well write story", "genres": ["Fiction & Literature", "Science & Nature"], "summary": "The beloved, mega bestselling first novel from Audrey Niffenegger, “a soaring celebration of the victory of love over time.” Chicago Tribune\r\n\r\nA MOST UNTRADITIONAL LOVE STORY, this is the celebrated tale of Henry DeTamble, a dashing, adventuresome librarian who inadvertently travels through time, and Clare Abshire, an artist whose life takes a natural sequential course. Henry and Clare’s passionate affair endures across a sea of time and captures them in an impossibly romantic trap that tests the strength of fate and basks in the bonds of love.", "asin": "1476764832", "rank": "12740", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/5153JKewj9L.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}