{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 329, "rating": 4.6, "reviews": [{"review_sentiment": 4.0, "review_text": "Of an engaging nonfiction narrative, it’s often said—as a form of praise—that it “reads like a novel.” Presumably because the characters are well developed, the plot is interesting, the themes are relevant or perceptive, and the prose style is compelling or original or captivating in some way. While this book certainly tells the tale of what is perhaps still the most consequential feat of 20th-century journalism, it is not a nonfiction book that reads like a novel. It is, however, worth the read, if only to provide hope given the current chaotic mess that is the US Executive branch of government.The factors that prevent All the President’s Men from achieving the lauded “reads like a novel” status are perhaps beyond the control of Bernstein and Woodward, who prove themselves to be intrepid, reflective reporters who are not above admitting their own shortcomings or lapses in judgment. The story they uncover is such a byzantine quagmire of conflicting loyalties, stealthy connections, cloak-and-dagger schemes, and downright preposterous (yet true) accusations against the most esteemed government office in the US that one forgives them for failing to weave an intelligible plot out of the Gordian knot of intrigue that they discover. Furthermore, Bernstein and Woodward are not necessarily storytellers—they are journalists telling the story of their story.Over 40 years after the Watergate scandal, the paranoia, hypocrisy, and dishonesty that emanated from the office of the President of the United States feel all too palpable in the current era, when we are forced to endure what will undoubtedly be regarded as the most ignorant, embarrassing, arrogant, appalling, and absolutely batsh*t crazy administration of all time. I simply hope that somewhere, working for a newspaper or website like the Washington Post, there are journalists in the mold of Bernstein and Woodward who will someday tell the story of 45’s corruption and reveal him for the criminal that he is."}, {"review_sentiment": 5.0, "review_text": "Good read"}, {"review_sentiment": 5.0, "review_text": "A wonderfully well written narrative that is at once a political thriller and a day by day record of two journalists and their contribution to what became an historic event, namely, the downfall and resignation of a US President."}, {"review_sentiment": 5.0, "review_text": "Currently reading the book, which is such a great read. Wow, I remember when this was going down."}, {"review_sentiment": 5.0, "review_text": "As advertised"}, {"review_sentiment": 4.0, "review_text": "A gripping firsthand account of the Watergate investigation, told by the two Washington Post reporters who first broke the story and kept following up on its leads until the scandal ultimately brought down a president. It's easy for people like me, born long after Watergate, to not grasp how shocking all of this was at the time, or to let our later knowledge of Nixon's corruption color our understanding of his downfall as inevitable. But the truth is that Richard Nixon was a very popular president (winning 49 states when he ran for reelection even though the Watergate burglary was already common knowledge), and no one could have predicted where the Post story would lead. Woodward and Bernstein place us squarely in the context of that time, documenting every step of their quest to discover who was pulling the strings behind Watergate in the face of enormous political pressure and initial public disinterest. It's a fascinating story of the relentless pursuit of truth, and a clarion call for all journalists to put that pursuit over politics."}, {"review_sentiment": 5.0, "review_text": "Read this book with one eye on the current Trump administration.  You'll be shocked."}, {"review_sentiment": 5.0, "review_text": "It was a great book to see how reports do their investigations and what is involved to verify their information. Also, the movie could not tell all that Nixon and his men did. Great read."}, {"review_sentiment": 5.0, "review_text": "Great read for the summer of 2017.  Amazing how it parallels today's politics."}, {"review_sentiment": 5.0, "review_text": "This book is a cultural milestone."}]}, "authors": ["Bob Woodward", "Carl Bernstein"], "isbn": "1476770514", "longitude": -77.0366456, "periods": ["1900s"], "title": "All the President's Men", "word_cloud": "engage nonfiction narrative often form read character well develop plot interest theme relevant perceptive prose style compel original captivate way certainly tell tale perhaps still consequential feat journalism nonfiction read however worth provide give current chaotic mess branch factor prevent achieve laud read status perhaps control intrepid reflective reporter admit shortcoming lapse judgment story uncover byzantine quagmire conflict loyalty stealthy connection scheme downright preposterous yet true accusation esteem government office forgive fail intelligible plot intrigue discover necessarily journalists tell story year scandal paranoia hypocrisy dishonesty emanate office feel palpable current era force endure undoubtedly regard ignorant embarrass arrogant appal absolutely crazy administration time simply hope somewhere work newspaper website journalist mold someday tell story corruption reveal criminal good wonderfully well write narrative political thriller day day record journalist contribution become historic event namely downfall resignation currently read great remember go advertised gripping firsthand account investigation tell reporter first break story keep follow lead scandal ultimately bring president easy people bear long grasp shock time let later corruption color understand downfall inevitable truth popular president win state run reelection even burglary already common knowledge story place squarely context time document step quest discover pull string face enormous political pressure initial public disinterest fascinate story relentless pursuit truth clarion call journalist put pursuit politics eye current administration shock great report investigation involve verify information also movie summer parallel today politics cultural milestone", "genres": ["History", "Politics", "Journalism"], "summary": "With a new introduction by the authors for the fortieth anniversary of its publication, the most devastating political detective story of the century, two Washington Post reporters, whose brilliant, Pulitzer Prize-winning investigation smashed the Watergate scandal wide open, tell the behind-the-scenes drama the way it really happened.\r\n\r\nThe most devastating political detective story of the century: the inside account of the two Washington Post reporters who broke the Watergate scandal, now with a 40th anniversary Afterword on the legacies of Watergate and Richard Nixon. \r\n\r\nThis is the book that changed America. Published just months before President Nixon’s resignation, All the President’s Men revealed the full scope of the scandal and introduced for the first time the mysterious “Deep Throat.” Beginning with the story of a simple burglary at Democratic headquarters and then continuing through headline after headline, Bernstein and Woodward deliver a riveting firsthand account of their reporting. Their explosive reports won a Pulitzer Prize for The Washington Post, toppled the president, and have since inspired generations of reporters. \r\n\r\nAll the President’s Men is a riveting detective story, capturing the exhilarating rush of the biggest presidential scandal in US history as it unfolded in real time. It is, as Time magazine wrote in their All-Time 100 Best Nonfiction Books list, “the work that brought down a presidency...perhaps the most influential piece of journalism in history.”", "asin": "1476770514", "rank": "12492", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/41uYmY5UiEL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}