{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 2034, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "This was a very interesting book.  It gave so much insight into the plight of the Jewish people under the Nazis and how they pressured others."}, {"review_sentiment": 4.0, "review_text": "While there are some poorly written excerpts the story moves well and the characters are well developed. It is a good read."}, {"review_sentiment": 5.0, "review_text": "This is a well written book on one of the darkest periods in the history of humanity. I truly enjoyed reading it."}, {"review_sentiment": 4.0, "review_text": "Good realistic book, describing some awful situations during the II war world. It is also good to know that among so much misery were still some good heart people who never gave up in helping the ones in need."}, {"review_sentiment": 5.0, "review_text": "I didn't know what to expect when I chose this book.  It was so well written that it was hard to put down.  I hihhly recommend it."}, {"review_sentiment": 4.0, "review_text": "Fascinating look into the challenges facing Turkish citizens living abroad during the Nazi occupation of France and their efforts to return--and their determined efforts to help Turkish Jews and others escape. It was difficult in the beginning to keep up with characters, as successive chapters switched viewpoints, but it got easier to follow once I got deeper into the stories and the ways they intertwined. This is a translation which was a very smooth read in English."}, {"review_sentiment": 4.0, "review_text": "This book describes the little known role of Turkey in the second world war through the history of a Turkish family. Many of the real politicians are present in this novel. The daughter of the mentioned family marries a Jewish man. He belongs to a traditional and respected Jewish family, highly qualiified doctors for many generations. They descend from the Spanish Jews, ejected by the Catholic kings (Fernando end Isabel) in the 15th century and still keep their traditions. In Turkey they were well received and there was (and is) no antisemitism, but it is not tolerated that a high society muslim girl should marry a Jewish man, even if he comes from such a special origin. Therefore this new couple is ostracized by both families and they go to exile to Paris. When the Germans occupy Paris they move again to Marseille, under the Vichy government. When Jews are persecuted also there, they decide to travel back to Turkey, even if Tutkish Jews are protected, with great difficulty, by their neutral government. The history describes the enormous efforts of the Turkish diplomats to organize this special train which during a very long and dangerous journey through several countries finally deposits the Turks safely in Istanbul"}, {"review_sentiment": 3.0, "review_text": "While it had some suspense, the plot was fairly straight forward. It did give an interesting view of a country trying to remain neutral, while undergoing signficiant  pressure to pick sides."}, {"review_sentiment": 5.0, "review_text": "This novel depicts the horror of WWII."}, {"review_sentiment": 5.0, "review_text": "a great read. A bit heavy, not a light read, but a great insight as to the realities of War and the Hitler era."}]}, "authors": ["Ayse Kulin"], "isbn": "1477807616", "longitude": 2.3514992, "periods": ["1900s"], "title": "Last Train to Istanbul", "word_cloud": "interest give much insight plight jewish people pressure others poorly write excerpt story move well character well good well write darkest period history humanity truly enjoyed reading good realistic describe awful situation war world also good know much misery still good heart people never give help one need know expect choose well write hard put highly fascinate look challenge face turkish citizen live abroad nazi occupation effort return determine effort help others escape difficult begin keep character successive chapter switch viewpoint get easier follow get deeper story way intertwine translation smooth english describe little known role second world war history family real politician present daughter mention family marries jewish man belong traditional respected jewish family highly qualify doctor many generation descend spanish eject king end century still tradition well receive antisemitism tolerate high society muslim girl marry jewish man even come special origin therefore new couple ostracized family go exile occupy move government persecute also decide travel back even protect great difficulty neutral government history describe enormous effort turkish diplomat organize special long dangerous journey several country finally deposit safely suspense plot fairly straight interesting view country try remain neutral undergoing significant pressure pick side depict horror great bit heavy light great insight reality era", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "International bestseller by one of Turkey’s most beloved authors.\r\n\r\nAs the daughter of one of Turkey’s last Ottoman pashas, Selva could win the heart of any man in Ankara. Yet the spirited young beauty only has eyes for Rafael Alfandari, the handsome Jewish son of an esteemed court physician. In defiance of their families, they marry, fleeing to Paris to build a new life.\r\n\r\nBut when the Nazis invade France, the exiled lovers will learn that nothing—not war, not politics, not even religion—can break the bonds of family. For after they learn that Selva is but one of their fellow citizens trapped in France, a handful of brave Turkish diplomats hatch a plan to spirit the Alfandaris and hundreds of innocents, many of whom are Jewish, to safety. Together, they must traverse a war-torn continent, crossing enemy lines and risking everything in a desperate bid for freedom. From Ankara to Paris, Cairo, and Berlin, Last Train to Istanbul is an uplifting tale of love and adventure from Turkey’s beloved bestselling novelist Ayşe Kulin.", "asin": "1477807616", "rank": "113134", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51WXwtWXuCL.jpg", "country": "France", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}