{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 30.2711286, "ratings": {}, "authors": null, "isbn": "1477303650", "longitude": -97.7436995, "periods": ["2000s", "Recent Releases"], "title": "Invisible in Austin: Life and Labor in an American City", "word_cloud": "", "genres": ["Social & Cultural Studies"], "summary": "Austin, Texas, is renowned as a high-tech, fast-growing city for the young and creative, a cool place to live, and the scene of internationally famous events such as SXSW and Formula 1. But as in many American cities, poverty and penury are booming along with wealth and material abundance in contemporary Austin. Rich and poor residents lead increasingly separate lives as growing socioeconomic inequality underscores residential, class, racial, and ethnic segregation.\r\n\r\nIn Invisible in Austin, the award-winning sociologist Javier Auyero and a team of graduate students explore the lives of those working at the bottom of the social order: house cleaners, office-machine repairers, cab drivers, restaurant cooks and dishwashers, exotic dancers, musicians, and roofers, among others. Recounting their subjects’ life stories with empathy and sociological insight, the authors show us how these lives are driven by a complex mix of individual and social forces. These poignant stories compel us to see how poor people who provide indispensable services for all city residents struggle daily with substandard housing, inadequate public services and schools, and environmental risks. Timely and essential reading, Invisible in Austin makes visible the growing gap between rich and poor that is reconfiguring the cityscape of one of America’s most dynamic places, as low-wage workers are forced to the social and symbolic margins.\r\n\r\n\"These intimate, uniformly affecting profiles reveal how thoroughly Texas’s historic disregard for fair labor practices and basic social services pervades the lives of today’s working poor.\" Texas Monthly", "asin": "1477303650", "rank": "155725", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/51PcF97YPAL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}