{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 275, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "This mystery of greed and revenge set in Vermont and Costa Rica kept me wondering and anxious as to what would happen next, while the life of a man trapped in a disabled body waited in the balance."}, {"review_sentiment": 5.0, "review_text": "I really enjoyed the book."}, {"review_sentiment": 2.0, "review_text": "I cannot get on board with this book.  I finished it, but I am more disturbed by it than entertained.1.  the use of the word retard was beyond jolting.  Yes, I know the patients are clinically referred to as mentally retarded, but the author's use of the word retarded has other connotations.2.  really?  employees have sex in rooms with patients?  really?  a family member would have sex with someone with his uncle in the same room?3.  there were many questionable facts and statements that led me to stop reading, look it up, and then continue.  For example:  a woman with an IQ of 9.  A man receiving a degree from Cornell in Theatre.  These instances made me not trust the author.4.  there were several rushed moments where the reader is expected to just go along with it rather than the author building up the scene so the reader is taken for the ride.  Example:  a woman is missing, a young college student is curious that she is from the same town he used to spend family vacations, so he just hops on a plan to investigate?  This needs more.5.  the writing is rough.  The transitions are not good, there aren't too many descriptions, and the flow is jagged and forced at times.  There are some formatting issues within the book.I will say that it was an interesting choice to create a story that takes place in Vermont and Costa Rica.  There are strong themes of greed, money, and jealousy.  But that's it for me.  I finished the book quite disturbed and upset."}, {"review_sentiment": 5.0, "review_text": "Wes Pilson wants to find out why his  mentally challenged brother has random bruises almost every time he visits Eric at his facility. He discovers a whole lot of killing and cover-up and  they are now targeting Wes and Becca.. Very hard story to put down."}, {"review_sentiment": 5.0, "review_text": "Complex story.  Wes Pilson was a college student studying to be a lawyer & advocate for people like his brother born with severe medical problems.  Upon taking a job at the nursing home where his brother lived, he meets Becca Gatts.  Together they uncover some questions regarding a young woman from Costa Rica who worked there and disappeared.  Wes also has questions regarding some family history that confuses him and could possibly be connected to the young woman who disappeared.  He and Becca go to Costa Rica looking for answers, nearly getting killed twice while there.  When they return to the US, they stumble upon the answers to the family questions that have haunted him for 5 years.  Good read!"}, {"review_sentiment": 4.0, "review_text": "Great read, lots of twists and turns. Was able to figure out about 1/3 of the way through some of the story line and who Chet was. Ending was on point with a good wrap up."}, {"review_sentiment": 3.0, "review_text": "I really liked this novel. The story itself is rated PG, and keeps you guessing over and over. It's an easy read full of evil deeds and revenge."}, {"review_sentiment": 4.0, "review_text": "Good narrative with a very interesting underlying story and mystery, although I don't know if it engaged me enough to keep reading the saga, I think other of Wallace's books have been better (Crows Hollow eg)."}, {"review_sentiment": 4.0, "review_text": "The story was good, suspenseful and surprising.  Looking forward to reading more by Mr. Wallace.  Hope you enjoy it as well."}, {"review_sentiment": 5.0, "review_text": "Will buy next book in series by this author. Thrilling and kept me at the edge. Could not put the book down!"}]}, "authors": ["Michael Wallace"], "isbn": "1481927450", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "The Devil's Deep", "word_cloud": "mystery greed revenge set keep wonder anxious next life man trap disabled body wait balance really enjoy get board finish disturb use word retard jolt know patient clinically refer mentally retarded author use word retard really employee sex room patient really family member someone uncle room many questionable fact statement lead stop reading look continue example woman iq man receive degree instance make trust several rush moment expect go rather author build scene take ride woman miss young college student curious town use spend family vacation hop plan investigate need write transition good many description flow jag force time format issue say interesting choice create story take place strong theme greed money jealousy finish quite disturbed upset want mentally challenged brother random bruise almost time visit facility discover whole lot kill target hard story put story college student study lawyer advocate people brother bear severe medical problem take job nursing home brother live meet uncover question regard young woman work disappeared also question regard family history confuses possibly connect young woman disappear look answer nearly get kill twice stumble answer family question haunt year good lot twist turn able figure way story line point good wrap really like story rat keep guess easy full evil deed revenge good narrative interest underlying story mystery know engage enough keep reading saga think better eh story good suspenseful surprise look forward read enjoy well next series author keep edge put", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Chad Lett is a mute witness to an attempted murder. He suffers from total paralysis, locked within a prison of his own mind. After years of silence, he establishes contact with a young nurse's aid through a single blinking eye, but then she is abducted and a staff member begins to administer dropperfuls of cleaning solution into his communicating eye. \r\n\r\nA heart-pounding thriller that will stay with the reader long after the last page is turned, the Devil's Deep is a top rated suspense that travels from the hell of a long-term care facility to the rain forest of Costa Rica. And a crime committed under tropical waters, the dive known as El Bajo del Diablo--the Devil's Deep", "asin": "1481927450", "rank": "3018271", "city": "", "image": "https://images-na.ssl-images-amazon.com/images/I/41kMk1VRM1L.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}