{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 86, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "I read this occasionally. Every year. Every other year.It's too beautiful, dour, sour depressing.  I love it the most.The first time I read it I was in 8th grade English. I'm now 40."}, {"review_sentiment": 5.0, "review_text": "I love T.S. Eliot’s poetry books so I just had to add this one to my bookshelf. I’ve read it numerous times and each time I have a new-found appreciation for it."}, {"review_sentiment": 5.0, "review_text": "Many have said this is probably the most difficult poem of all time because of its complexity. It has been suggested that Eliot did not fully appreciate what he had created. This is a work that needs to be read many times. I was introduced to it in an advanced English class in high school. It will stand the test of time along with Shakespeare."}, {"review_sentiment": 5.0, "review_text": "Good read!"}, {"review_sentiment": 4.0, "review_text": "You can always count on Tommy Boy for a pick-me-up:\"After the torchlight red on sweaty facesAfter the frosty silence in the gardensAfter the agony in stony placesThe shouting and the cryingPrison and palace and reverberationOf thunder of spring over distant mountainsHe who was living is now deadWe who were living are now dyingWith a little patience\""}, {"review_sentiment": 3.0, "review_text": "The routine and regimented ways in which to write a T. S. Eliot poem in 10 easy steps are as follows, ahem:1. Come upon a cute turn of phrase,2. Pen a rambunctious title loosely related to said turn of phrase,3. Thumb the pages of Dante and pluck out an epigraph (preferably in the original Italian),4. Insert said epigraph beneath said title,5. Write slapdash quatrains,6. Insert said turn of phrase at a random place in said quatrains,7. Run the occasional line of said quatrains onto the next line,8. Allude to a Bible verse (preferably the Old Testament),9. Add italics to random words, and10. Tell short tales within the poem that have no connection to the others.Eliot is said to have ushered in the modernist movement in poetry. That is to say he largely did away with rhyming and sentimentality employed by the Victorians. He painted a dying world in the relatively few poems he gave us. \"The Waste Land\" is considered his best--perhaps because it is his longest. \"The Hollow Men,\" however, shines brightest with its Shakespearean and Heart of Darkness references. A number of songs have been written about Eliot's poems and the famous play Cats was based on his Old Possum's Book of Practical Cats.\"The Love Song of J. Alfred Prufrock\" \"Afternoons and Coffeespoons\" Crash Test Dummies God Shuffled His Feet 1993\"The Love Song of J. Alfred Prufrock\" \"Creep\" Radiohead Pablo Honey 1993\"The Love Song of J. Alfred Prufrock\" “Peaches” The Presidents of the United States of America Presidents of the United States of America 1995\"The Love Song of J. Alfred Prufrock\" “The Message” Grand Master Flash The Message 1982\"The Love Song of J. Alfred Prufrock\" \"Thick as a Brick\" Jethro Tull Thick as a Brick 1972Old Possum’s Book of Practical Cats Cats Musical Andrew Lloyd Webber\"The Wasteland\" \"The First Day of Spring\" Noah and the Whale\"The Wasteland\" “Wasteland”  Dan Bern  Dan Bern  1993Meh is how I would sum up the body of poetry Eliot left us. It certainly pails in scope and impact to the poems of Edgar Allan Poe. One has to wonder if he would be known at all without the litter of jellicle cat poems he penned, had more than nine lives on the West End and Broadway.#tseliot #reviewoftseliot"}, {"review_sentiment": 5.0, "review_text": "Very lovely writing. It paints a beautiful picture of each of its scenes. These poems are rhythmic, smooth, and fun."}, {"review_sentiment": 5.0, "review_text": "I hated this when I first read it in college. But the professor made it come to life when we covered it the next day. I have a whole new appreciation for this. Recently the professor has passed away, and I just had to re- read it."}, {"review_sentiment": 5.0, "review_text": "Eliot is postmodern \"he do the police in many voices\""}, {"review_sentiment": 3.0, "review_text": "It is more like a pamphlet. I was expecting a book. Has poems.."}]}, "authors": ["T. S. Eliot"], "isbn": "1482557053", "longitude": -0.12574, "periods": ["1900s"], "title": "The Waste Land", "word_cloud": "occasionally year every beautiful dour sour depress love first time grade english love poetry add bookshelf numerous time time appreciation many say probably difficult poem time complexity suggest fully appreciate create work need many time introduce advanced class high school stand test time good always count torchlight red sweaty faces after frosty silence gardens after agony stony places the shout crying prison palace reverberation of thunder spring distant mountains he live dead we live dying with little patience routine regiment way write poem easy step follow cute turn rambunctious title loosely relate say turn page pluck epigraph preferably original say epigraph beneath say slapdash say turn phrase random place say occasional line say quatrain next verse preferably italic random word short tale poem connection say ushered modernist movement poetry say largely away rhyme sentimentality employ paint die world relatively poems give consider best perhaps however shin brightest shakespearean reference number song write poems famous play base shuffle body poetry leave certainly pails scope impact poems wonder litter follicle cat poem pen life tseliot reviewoftseliot very lovely write paint beautiful picture scenes poem rhythmic smooth fun hat first college professor make come life cover next day whole new appreciation professor pass away postmodern police many voice pamphlet expect", "genres": ["Poetry"], "summary": "The Waste Land is a long poem by T. S. Eliot. It is widely regarded as one of the most important poems of the 20th century and a central text in Modernist poetry.\r\n \r\nPublished in 1922, the 434-line poem first appeared in the United Kingdom in the October issue of The Criterion and in the United States in the November issue of The Dial. It was published in book form in December 1922. Among its famous phrases are \"April is the cruellest month\", \"I will show you fear in a handful of dust\", and the mantra in the Sanskrit language \"Shantih shantih shantih\".\r\n\r\nEliot's poem loosely follows the legend of the Holy Grail and the Fisher King combined with vignettes of contemporary British society. Eliot employs many literary and cultural allusions from the Western canon, Buddhism and the Hindu Upanishads. Because of this, critics and scholars regard the poem as obscure. The poem shifts between voices of satire and prophecy featuring abrupt and unannounced changes of speaker, location, and time and conjuring of a vast and dissonant range of cultures and literatures.\r\n\r\nThe poem's structure is divided into five sections. The first section, The Burial of the Dead, introduces the diverse themes of disillusionment and despair. The second, A Game of Chess, employs vignettes of several characters—alternating narrations—that address those themes experientially. The Fire Sermon, the third section, offers a philosophical meditation in relation to the imagery of death and views of self-denial in juxtaposition influenced by Augustine of Hippo and eastern religions. After a fourth section that includes a brief lyrical petition, the culminating fifth section, What the Thunder Said, concludes with an image of judgment.\r\n\r\nWikipedia", "asin": "1482557053", "rank": "364210", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41a7dMEA7YL.jpg", "country": "England", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}