{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 46.4846583, "ratings": {"num_ratings": 5, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "As always, I found Jules Verne's writing as entertaining as ever. His characters are engaging and easy to like. It was a real page turner and had me guessing until the very end."}, {"review_sentiment": 5.0, "review_text": "First, in response to the one bad review, the physical quality of this book (from this publisher, this edition) was just fine - no issues whatsoever.  Second, in typical CreateSpace tradition, the digital to print translation is full of typos; only one or two words defy comprehension, but it is quite annoying.  Third, regarding the actual story, this edition contains both books and is a gem for the Verne completionist.  Without revealing anything, this is truly a voyage and a complex, humorous one at that.  The interpersonal dynamics are more developed than usual for Verne, and there are enough twists to hold one's attention from beginning to end."}, {"review_sentiment": 1.0, "review_text": "The materials this book is made from are substandard.  The glue used to hold the book together and the liniment on the cover began to come off shortly after I received the book."}, {"review_sentiment": 4.0, "review_text": "Having recently taken a cruise around the Black Sea, this book about a man who, in order not a pay a tax for traveling across the Bosphorus instead goes the other way, circumnavigating the Black Sea, is amusing.  Not one of Verne's greatest works, but well worth your time."}, {"review_sentiment": 4.0, "review_text": "A good yarn by the master of yarns, and it is good to see it in print again, as it hardly ever is, in English anyway. I give it four stars for content and pedigree, but drop one since although illustrated, the woodcuts have been reproduced rather blurry."}]}, "authors": ["Jules Verne"], "isbn": "148399905X", "longitude": 30.732564, "periods": ["1800s"], "title": "Keraban The Inflexible", "word_cloud": "always find write entertain ever character engage easy real page turner guess end response bad review physical quality publisher edition fine issue typical tradition digital print translation full typo word defy comprehension quite annoying regard actual story edition contain gem completionist reveal anything truly voyage complex humorous interpersonal dynamic develop usual enough twist hold attention begin end material make substandard glue use together liniment cover begin come shortly receive have recently take cruise man order pay tax travel instead go way circumnavigate amuse not greatest work well worth time good yarn master yarn good see print hardly ever english anyway give star content pedigree drop illustrated woodcut reproduce rather blurry", "genres": ["Fiction & Literature"], "summary": "Volume 24 of 54 of Jules Verne's \"Extraordinary Voyages\", first printed in 1883. \r\n\r\nKéraban, the strong-headed Turk, refuses to pay a meager tax newly imposed on those attempting to cross the Bosphorus by boat. Determined to 'go the long way', he sets out on the several-hundred league journey, with his only deadline being to return in time to secure his nephew's marriage, and the 100,000 pound inheritance that accompanies it.", "asin": "148399905X", "rank": "2878572", "city": "Odessa", "image": "https://images-na.ssl-images-amazon.com/images/I/31oZ5a-Z5IL.jpg", "country": "Ukraine", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}