{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 5, "rating": 2.0, "reviews": [{"review_sentiment": 2.0, "review_text": "Not what I expected. Too short, no detail. Not worth your time."}, {"review_sentiment": 1.0, "review_text": "Sucked.............making money off the real book \"The Gangs of New York. He should be ashamed selling this at the price, it's worth 99 cents & should be selling at the Dollar Stores. I'd give \"O\" but have to rate it something! Don't buy!!!!!"}, {"review_sentiment": 1.0, "review_text": "I was really, Really, REALLY  disappointed when I received this book. And calling it a BOOK is a generous gift of charity. This tome (sarcastic) measures 4.9\" x 7.9\",  about 40% of the size of a standard sheet of typing  paper.  It contains about 65 pages not inclusive of the table of contents, bibliography,  etc. The type face is overly large for a page of this size, and a full page of type has only about 32  short lines (3.50\" +/- per line) per page.  This is assuming the page has a full allotment of words.  Many of the pages contain only one quarter to one half of a page of text.  Very few of the pages are fully filled, and then the written matter is surrounded by big margins and a lot of white space below the text.  There are no photos, diagrams, or maps. etc.  Altogether this book (charitable again) contains an estimated equivalent of about ten pages of single spaced typed material, or about as much writing as a 12th grade English book report.  Speaking of book reports, that is how this paperback reads. The author quoted by name, well known author, Herbert Asbury several times.  It appears that Mr. Asbury's books may have been the source for much of what was written by Wallace Edwards, this book's author.  As a result Edward's book reads like an English assignment.  I do not claim plagiarism on Edward's part as I do not have time to re-read Mr. Asbury's books, or any other books which are part of my personal library to make comparisons.  But the facts, and stories in \"The Real Gangs of New York\" is very plentiful in the literature and Edward's book reads like many of them.  I personally own some of the sources stated in Edward's book, and other sources which are also close to that era.  I have read more detailed descriptions of all of the topics reported in Edward's book.  Nothing which Edwards wrote about is new or revealing.  As I previously stated, this book is very similar to a 12th grade English assignment in research, writing, topics covered, and word count.  Based on the foregoing, in my opinion, \"Gangs\" is not worth the money spent buying it, nor the time you would spend reading it.  But I do have one positive comment about the book I reviewed here.  \"The Real Gangs of New York\" makes a great outline for the writing of a more comprehensive book about that subject."}, {"review_sentiment": 3.0, "review_text": "This is a really concise non-in-depth study of the gangs that existed in New York in the 1800's.  It's quite thorough but lacks the deeper probe to come up with the quirky fact about the era that we aren't expecting.  This book reads a little friendlier than a text-book but doesn't transport us back to the era the way another writer, such as Luc Sante does with \"Low Life\", of the same topic.  In fact, I would recommend Luc Sante's book, but if you just want to 'find out' as opposed to total immersion, this book does its homework."}, {"review_sentiment": 3.0, "review_text": "This book is a short general overview of the history of the gangs of New York from about 1830 to 1900. It barely scratches the surface of the subject. I bought the kindle version because I got the idea it was more accurate than other books on the same subject. It is too short and lacks the detail to even determine if it is really accurate."}]}, "authors": ["Wallace Edwards"], "isbn": "149123430X", "longitude": 0.0, "periods": ["1800s"], "title": "The Real Gangs of New York", "word_cloud": "not expect short detail not worth time money ashamed selling price cent sell give o rate something really disappoint receive call generous gift charity tome sarcastic measure x size standard sheet type paper contain page inclusive table content bibliography etc type face overly large page size full page type short line line page assume page full allotment word many page contain quarter half page text page fully fill write matter surround big margin lot white space text photo diagram map etc altogether charitable contains estimate equivalent ten page single space typed material much writing grade report speak report paperback read author quote name well know author several time appear source much write author result read assignment claim plagiarism part time part personal library make comparison fact stories plentiful literature read many personally source state source also close era detail description topic report write revealing previously state similar grade assignment research write topic cover word count base foregoing opinion money spend buying time reading positive comment review make great outline write comprehensive subject really study exist quite lack deeper probe quirky fact era expect read little friendlier transport back era way writer topic fact want opposed total immersion homework short general overview history barely scratch surface subject buy kindle version get idea accurate subject short lack detail even determine really accurate", "genres": ["History", "Social & Cultural Studies"], "summary": "The subject of a classic history by Herbert Asbury and an Academy Award nominated film by Martin Scorsese, the gangs of The Five Points in New York have become the stuff of legend. But how much is legend and how much is fact? \r\n\r\nIn this short book we examine the original gangs of the Five Points in New York and see how accurate the film was (spoiler alert: not very) and what Asbury may have gotten wrong in his original research on this era. From the Bowery Boys to the Dead Rabbits, we look at the gangs that operated not just in the Five Points, but also those who wanted a piece of the action there and engaged in gang wars that would leave even modern thugs quivering in their boots!", "asin": "149123430X", "rank": "2394077", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41feIziRq7L.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}