{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 465, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "Warning: Plot spoilers ahead! This is more of a review than a preview.Wharton is evidently a novelist similar to Jane Austen. But while Austin writes about early 1800s England, Wharton writes about early 1900s America, and is a much more sophisticated writer. This novel centers around a secretly-unhappy beautiful 29-year-old who lives amongst the idle rich, or Old Money, of New York City. An exquisite but slow-paced and sad story.It could easily have had a happy ending. Wharton seems malevolent. Someone should rewrite the ending. Marry the two leads (obviously). Give Lily a job as a home decorator or art-seller, while having Selden be very successful, and make a lot of money, as a lawyer and confidant to the filthy rich."}, {"review_sentiment": 5.0, "review_text": "It was an excellent read that I was excited to pick up again each day."}, {"review_sentiment": 5.0, "review_text": "A great read with a complex, fascinating heroine Lilly Bart at the center."}, {"review_sentiment": 2.0, "review_text": "Felt like a high schoolteading assignment.  The book is not long (pages) but feels like an eternity to read.  Long, boring and depressing."}, {"review_sentiment": 3.0, "review_text": "I realize that this book is a commentary on turn of the century society in New York, but the author drags the reader into that setting too deeply and the entire experience of reading the book becomes unpleasant. The writing is excellent and the personal battles that the characters face are compelling, so I think I would have enjoyed reading the book more if it did not focus so much on social galas and proper manners. For me it simply did not translate to modern times well, though I can see how it earned its acclaim."}, {"review_sentiment": 5.0, "review_text": "Real living characters that will stay with me.  In fact that is what made this book so worth reading.  The heroine and hero have so much to learn that it is painfully true to life unlike many novels.  The reader is forced to learn their lessons.Tragic ending that did not go where I wanted it to, but will linger longer for that reason. Wharton does do a great job of reminding us of how trapped women were, how oppressed and vulnerable.But I also read it as a psychological thriller.  I kept wanting to shout at Lilly:  \"Yes, but You don't have to THINK that way.  You can think just outside the box enough to -- over time -- find a new life for yourself..\"  But like any great tragedy, so much happens in so short a time period. A great deal of psychological insight realistically portrayed... I experienced it not so much as satire but as a personal journey that could not find resolution.  I will eagerly read it again."}, {"review_sentiment": 2.0, "review_text": "The movie is good. God this book drags. I don't understand the hysteria over her writings. Austen she's not"}, {"review_sentiment": 5.0, "review_text": "Lily Bart is a beautiful, intelligent young woman in high society in New York in the late 1800s.  An orphan whose parents lost their money shortly before they died,  she is now dependent on an aunt who is willing to support her, but not in a lavish way, so that she never has quite enough money to keep up. Spending her time just as other wealthy women around her do, calling on friends, attending parties, and travelling. the only thing expected of her is that she marry a rich man and be amusing and decorative, but she cannot quite bring herself to marry JUST for money.Lily has a male friend she gets along with very well. They have known a each other a long time, and enjoy each others' company very much, but neither of them ever considered marriage because he is not rich; a lawyer who knows New York society and attends the same parties Lily does, but is not a candidate to marry one of the young women to be found there.The book explores how Lily and the man she loves and who loves her cannot be together because of the expectations of women in society at that time. It explores how Lily innocently earns the disapproval of society, and how impossible it is for her to make her own way in the world without her wealthy friends.. A beautifully written book about the restrictions on women and prejudices of society, it is a brilliant portrait and condemnation of the society at that time."}, {"review_sentiment": 2.0, "review_text": "I love Victorian novels, but this one was very disappointing - and a real downer.  It started out as a promising tale, but just got worse and worse and ended in complete tragedy.  The trouble is, you can't really empathize with the heroine!  She has plenty of choices, but she only makes bad ones.  I guess the author was trying to make a point about the limited view of women in that time.  The heroine couldn't see herself in any role but one, and she wouldn't try to move on with her life in any other role, like others did.  I kept hoping she would \"wake up and smell the roses,\" but she never did.  She squandered her God-given assets.  She just didn't have any backbone.  I was sad for her, but was not moved to tears."}, {"review_sentiment": 5.0, "review_text": "Readable and wonderful."}]}, "authors": ["Edith Wharton"], "isbn": "1491241810", "longitude": 0.0, "periods": ["1800s", "1900s"], "title": "The House of Mirth", "word_cloud": "warn spoiler ahead review evidently novelist similar write early write early much sophisticate writer center beautiful life among st idle rich exquisite sad easily happy end seem malevolent rewrite end lead obviously job home decorator successful make lot money lawyer confidant filthy rich excellent excite pick day great complex fascinate heroine center like high schoolteading assignment long page feel eternity boring depressing realize commentary turn century society author drag set deeply entire experience reading become unpleasant writing excellent personal battle character face compel think read focus much social gala proper manner simply translate modern time well see earned acclaim real living character stay fact make read heroine hero much learn painfully true life many novel force learn end want linger longer reason great job remind trapped woman oppress also psychological thriller keep want shout think way think box enough time new life great tragedy much happen short time period great deal psychological insight realistically portray experience much satire personal journey resolution eagerly movie good drag understand hysteria writing austen lily beautiful intelligent young woman high society late orphan parent lose money shortly die dependent aunt willing support lavish way never quite enough money spending time wealthy woman call friend attend party travel thing expect marry rich man amuse decorative quite bring marry male friend get along well know long time enjoy others company much ever consider marriage rich lawyer know society attend party candidate marry young woman find explores man love love together expectation woman society time explore lily innocently earn disapproval society impossible way world beautifully write restriction woman prejudice society brilliant portrait condemnation society time love victorian novel disappointing real downer start promise tale get worse worse end complete tragedy trouble really heroine plenty choice make bad one guess author try point limited view woman time heroine role life role others keep hop smell rose never squander asset backbone sad move tear readable wonderful", "genres": ["Fiction & Literature"], "summary": "\"She was so evidently the victim of the civilization which had produced her, that the links of her bracelet seemed like manacles chaining her to her fate.\"\r\n\r\nWhen it was first published in 1905, Edith Wharton's \"The House of Mirth\", received rave reviews, selling over 140,000 copies in its first three months. The New York Times called it \"a novel of remarkable power\" and established Wharton as a major American writer who would later become the first women to receive the Pulitzer Prize for literature.\r\n\r\nSaid to have accurately revealed the morality and manners of the golden age of New York aristocracy, Wharton satirically unfolds the descent of the beautiful but ill-fated Lilly Bart, as she sabotages her chances of a wealthy marriage, loses the sympathy of her unforgiving social circle, and descends into a life of poverty and despair.", "asin": "1491241810", "rank": "906571", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51wmnhvCcqL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}