{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 21.161829, "ratings": {"num_ratings": 51, "rating": 3.7, "reviews": [{"review_sentiment": 4.0, "review_text": "Good book"}, {"review_sentiment": 5.0, "review_text": "short but sweet"}, {"review_sentiment": 5.0, "review_text": "Thanks"}, {"review_sentiment": 1.0, "review_text": "Excellent book. I read it and took it with me to Cancun last week. It was a great reference after I listened to tour guides. Highly recommended."}, {"review_sentiment": 1.0, "review_text": "Has a lot of grammatical errors."}, {"review_sentiment": 5.0, "review_text": "Really helped make visit meaningful"}, {"review_sentiment": 5.0, "review_text": "Terrific book to read before our vacation"}, {"review_sentiment": 1.0, "review_text": "I could have printed this myself.  It is NOT in color, it is all black and white, like a newspaper actually, with thin pages.  It just looks very amateur, it does not look like a real book when you hold it in your hands.  The picture of the cover is very deceiving"}, {"review_sentiment": 4.0, "review_text": "Fun book to read. Gave a good detailed amount of information abt it's history but then just cuts off at the end and left me hanging."}, {"review_sentiment": 3.0, "review_text": "It's ok.  Nothing special."}]}, "authors": ["Jesse Harasta", "Charles River Editors"], "isbn": "149295585X", "longitude": -86.82505, "periods": ["500-1400s", "0-500s", "Pre Common Era"], "title": "Chichen Itza: The History and Mystery of the Maya's Most Famous City", "word_cloud": "good short sweet thanks excellent take last week great reference listen tour guide recommend lot grammatical error really help visit meaningful vacation black white newspaper actually thin page look amateur look real hand picture cover deceiving good detailed amount information cut end leave hanging special", "genres": ["History", "Ancient Civilizations"], "summary": "Many ancient civilizations have influenced and inspired people in the 21st century, like the Greeks and the Romans, but of all the world’s civilizations, none have intrigued people more than the Mayans, whose culture, astronomy, language, and mysterious disappearance all continue to captivate people. At the heart of the fascination is the most visited and the most spectacular of Late Classic Maya cities: Chichen Itza.\r\n\r\nChichen Itza was inhabited for hundreds of years and was a very influential center in the later years of Maya civilization. At its height, Chichen Itza may have had over 30,000 inhabitants, and with a spectacular pyramid, enormous ball court, observatory and several temples, the builders of this city exceeded even those at Uxmal in developing the use of columns and exterior relief decoration. Of particular interest at Chichen Itza is the sacred cenote, a sinkhole was a focus for Maya rituals around water. Because adequate supplies of water, which rarely collected on the surface of the limestone based Yucatan, were essential for adequate agricultural production, the Maya here considered it of primary importance. Underwater archaeology carried out in the cenote at Chichen Itza revealed that offerings to the Maya rain deity Chaac (which may have included people) were tossed into the sinkhole. \r\n\r\nAlthough Chichen Itza was around for hundreds of years, it had a relatively short period of dominance in the region, lasting from about 800-950 A.D. Today, tourists are taken by guides to a building called the Nunnery for no good reason other than the small rooms reminded the Spaniards of a nunnery back home. Similarly the great pyramid at Chichen Itza is designated El Castillo (“The Castle”), which it almost certainly was not, while the observatory is called El Caracol (“The Snail”) for its spiral staircase. Of course, the actual names for these places were lost as the great Maya cities began to lose their populations, one by one. \r\n\r\nChichen Itza was partially abandoned in 948, and the culture of the Maya survived in a disorganized way until it was revived at Mayapán around 1200. Why Maya cities were abandoned and left to be overgrown by the jungle is a puzzle that intrigues people around the world today, especially those who have a penchant for speculating on lost civilizations.\r\n\r\nChichen Itza: The History and Mystery of the Maya’s Most Famous City comprehensively covers the history of the city, as well as the speculation surrounding the purpose of Chichen Itza and the debate over the buildings. Along with pictures and a bibliography, you will learn about the Maya’s most famous city like you never have before, in no time at all. ", "asin": "149295585X", "rank": "316185", "city": "Cancun", "image": "https://images-na.ssl-images-amazon.com/images/I/51P5DvpKYfL.jpg", "country": "Mexico", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}