{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 29, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "A very mysterious and good read. We highly recommend this book for adventure lovers."}, {"review_sentiment": 4.0, "review_text": "I love the story, but do not buy the ebook. It needs to be heavily edited, and a lot of words get cut into two. (For example: do re strauch). It makes the book extremely difficult to read, but again it’s a great story."}, {"review_sentiment": 5.0, "review_text": "Good read. Have read all books pertaining to the Galapagos Islands and the \"affairs and murders\" . Everyone a different perspective. Interesting."}, {"review_sentiment": 3.0, "review_text": "A good read if you visit Florina in the Galapogos Islands."}, {"review_sentiment": 4.0, "review_text": "Saw \"The Galapagos Affair\" on Netflix and found it very interesting. I enjoy unsolved mysteries.Very interesting characters in this book. From the people on the island to the \"baroness\"  who came later. So many unanswered questions to this day.  Good read for anyone who can handle not know the answers at the end."}, {"review_sentiment": 4.0, "review_text": "This was the first story of all the books about the island.  It could have happened that way.  I am gullible as can be."}, {"review_sentiment": 4.0, "review_text": "This is a tale of human fortitude and mankind's inner quest to regain the tranquility of the legend garden of Eden. However mans innate nature Demonstrates the fallacy of such pursuits. The book Satan came to Eden really narrates in a most vivid way the turmoil of a couple whose longing for seclusion from the worldly baggage of life is sought in the serene but unrelenting islands of the Galapagos. Between the unforgiving nature of the lands they occupy, the dastardly spirits of ills of the past and the vulgar nature of mankind the book tells a tale of the triumph and failures of the author and her alienate in this journey."}, {"review_sentiment": 4.0, "review_text": "Having visited the Galapagos in July, I was intrigued by this story.  Written by one of the survivors, it held my interest."}, {"review_sentiment": 5.0, "review_text": "Written by a survivor of this mysterious adventure experienced by German ex-patriots on the island of Floreana late 1920's...mesmerizing"}, {"review_sentiment": 5.0, "review_text": "Such a good book. Keep in mind this is Dora's interpretation of what happened."}]}, "authors": ["Dore Strauch"], "isbn": "1497424321", "longitude": 0.0, "periods": ["1900s"], "title": "Satan Came to Eden: A Survivor's Account of the of the \"Galapagos Affair\"", "word_cloud": "mysterious good highly recommend adventure lover love story buy need heavily edit lot word get cut example strauch make extremely difficult great story good have pertain affair murder different perspective interesting good visit find interest enjoy unsolved interesting character people island baroness later so many unanswered question day anyone handle know answer end first story island happen way gullible tale human fortitude mankind inner quest regain tranquility legend garden however man innate nature demonstrate fallacy pursuits really narrate vivid way turmoil couple longing seclusion worldly baggage life seek serene unrelenting island unforgiving nature land occupy dastardly spirit ill vulgar nature mankind tell tale triumph failure author alienate journey have visit intrigue story survivor hold interest survivor mysterious adventure experienced german island late mesmerizing such good mind interpretation happen", "genres": ["Memoir", "Travel Writing", "True Crime"], "summary": "In 1929, Dr. Frederick Ritter and Dore Strauch fled the social and economic turmoil of post-World War I Germany, choosing to abandon the chaos of modern civilization, as well as their respective spouses. They began a quest to reclaim the purity of nature for themselves. They chose as their Eden the dry, uninhabited volcanic island of Floreana in the Galapagos chain. Their experiences in their new paradise—and the ensuing scandals—would captivate the Western world.\r\n\r\nFloreana's unforgiving environment hardly proved to be a idyllic choice, and were it not for the assistance of American yachters, Ritter and Strauch, naive and unprepared as they were, might easily have perished during their first year as colonists.\r\n\r\nYacht crews returned with news of the eccentric couple's adventures, and they became darlings of the Western press. This unwelcome publicity lead to the arrival of a second family on the island, soon followed by a pistol-wielding Austrian \"baroness\" and her two young lovers. While not without her charm, this mysterious \"aristocrat\" could also be sinister and controlling. Tensions grew rapidly, jealousies and resentments raged, and soon this island with a population of 9 was at war with itself.\r\n\r\nFloreana was to become rife with danger, suspicion, murderous thoughts, and a notorious scandal that still entices today. Who was the \"Satan\" who came to Eden? Was it a singular person, or was it the darkness of self-destruction that can arise in every human heart? It is a question for each reader to answer in their own way and it beckons to the aspiring detective in all of us.\r\n\r\nOriginally published in 1936, Satan Came to Eden meticulously recounts Ritter and Strauch's often bizarre, true-life struggle from a survivor's point of view—an account lost to the public for nearly 80 years. Editor Joseph Troise supplements Strauch's original memoir with previously unpublished photographs and an informative preface, introducing a new generation of readers to one of the strangest stories of the twentieth century.\r\n\r\n\"All the satisfaction of a well-plotted mystery adventure, with the added fun of its all being true\" San Francisco Chronicle", "asin": "1497424321", "rank": "740047", "city": "Galápagos Islands", "image": "https://images-na.ssl-images-amazon.com/images/I/51rsEIDJ4bL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}