{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 4612, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "I had held off reading this Dickens story because of its length and depressing title.  But it turns out to be a wonderful, riveting story.  And the narrator does it justice.  Wonderful book.  A real find, for me."}, {"review_sentiment": 5.0, "review_text": "I was a little skeptical about dickens... the long description paragraphs and the unending characters made the reading of my first dickens book ,great expectations, a little tiresome. but David cooperfield is a totally different book that you can't let down until you finish it, and when you do you can't believe it's over!The book is like an autobiography of David cooperfield life ... it has drama, excitement , and some romance:) all is kids suitable in my opinion.Now about this edition...  the cover is a textured textile and inside there are pictures ever pages or so.I would totally recommend this book:)"}, {"review_sentiment": 5.0, "review_text": "Oh what a lovely story.I fell in love with David in the first quarter of the novel; I was so moved when Aunt Betsy decided to take him and see to his education and wellbeing. I was crying when David made the trip to his aunt, and he explained how unhappy he was after his mother passed away; how he was abused, not educated, and he was thrown away in a wine bottling factory and made to fend for himself.Oh how I loved him and pulled for him, his goodness, his courage and open heart even page of the way..."}, {"review_sentiment": 5.0, "review_text": "I thoroughly LOVED this when I first saw it on American PBS' \"Masterpiece\" in 2007, and loved it just as much on my second viewing a decade later here on Amazon.  I gather from the IMDB that this version is essentially the original BBC edit, except that rather than 14 half hour episodes and 1 one hour episode, the Amazon version combines the shorter episodes for a total of 8 one hour episodes.  I have such vivid and delightful recollections of the first time that I watched \"Bleak House\" that I noticed that there were a few extra character \"color\" scenes in the PBS edit that aren't included in this version (Inspector Bucket bumming snuff from Mercury, for example), but the absence of these doesn't in any way detract from the story or overall impact.All of Dickens' work is a meditation on the simple fact that the only possible enduring meaning and value in life is to be found in the way in which we care for one another, and this production of \"Bleak House\" expresses this eloquently and beautifully.  100/100.  A+.  One for the ages."}, {"review_sentiment": 5.0, "review_text": "Wonderful beautifully acted presentation!"}, {"review_sentiment": 5.0, "review_text": "Classic Dickens made into a miniseries! Light up the fireplace and break out the popcorn!  Dickens doesn't just write stories, he published some great satire and this is arguably his best work.  \"Bleak House\" is the story of two orphans brought into the legal system as wards of the court while they wait for the long standing lawsuit which will decide how a large estate is split up.  Long standing as in lifetimes.  It is pointed out in the story that such a lawsuit is actually a curse which disrupts  the lives of the litigants who are waiting on a large monetary handout which could potentially occur at any time...but never happens. I have to agree with this assessment. Bleak house was I believe written to show the futility of a lawsuit in the legal system of 19th century England.  Dickens himself was involved in a lawsuit during his own childhood.  This story has everything, lost love, tragic death, greed, men who act with uncommon evil, and others who act with loving benevolence.  And don't forget the fragility of life in the 1800's when it was common for people to become ill and die quickly.  The top notch BBC cast includes (surprise) Jillian Anderson.  She is pure genius and hardly recognizable in her role as Lady Deadlock. The story is hard to follow at times due to the large cast and complex story lines. You will want to pay close attention to keep up.  The setting and costumes are passable only.  In one scene the Ada character lays in the grass with her fiance and  her cowboy boots are visible where her dress rides up.  No biggie though, this is still well worth watching due to the amazing actors and of course use of Dickens story."}, {"review_sentiment": 5.0, "review_text": "Excellent show!"}, {"review_sentiment": 5.0, "review_text": "One of the best books ever written. You will never forget David C! I don't know how I missed it growing up but a book reviewer in the WSJ  alluded to it and said that the main character in his book was much like David: you are sad at the end that you will never get more of him. I broke with my \"best seller\" policy, and love of spy novels and action books, and ordered it. I can't wait for bedtime to get another hour of reading in of this 1000 page paperback I got fro m Amazon. yes, the start is a little slow until one becomes accustomed to the language and phrasing of the time, but by page 50 the book owns you. Dickens really rocks~!"}, {"review_sentiment": 5.0, "review_text": "Wonderful. A splendid eight hours with Dickens , Director, Writer Cast and Crew!!!amazon.com/author/crawfordjohn"}, {"review_sentiment": 5.0, "review_text": "I just could not get into the actual book a few years back, but I was absolutely engrossed in this miniseries.  It reveals the  comfortable lifestyle of the rich which was not always filled with parties and holidays, but also bad choices, sadness & regret, the more numerous working class, and the desperate, and sometimes gritty,  lower-class's struggles to survive by any means.  You'll detest the villains and anxiously hope the innocent to prevail.  I loved how the personalities of each character were wonderfully developed and portrayed.  Very well acted!  Highly recommend."}]}, "authors": ["Charles Dickens"], "isbn": "149737104X", "longitude": -0.12574, "periods": ["1800s"], "title": "Bleak House", "word_cloud": "hold read story length depress title turn wonderful rivet story narrator justice real find little skeptical dickens long description paragraph unending character make read first dickens great expectation little tiresome cooper field totally different like autobiography cooper field life drama excitement romance kid suitable edition cover textured textile inside picture ever page totally lovely fell first quarter move decide see education well being cry make trip aunt explain unhappy mother pass away abuse educate away wine bottle factory make fend love pulled goodness courage open heart even way thoroughly first saw american love much second view decade later gather imdb version essentially original edit rather half hour hour episode version combine shorter episode total hour episodes vivid delightful recollection first time watch notice extra character color scene edit include version bum snuff example absence way detract story overall work meditation simple fact possible endure meaning value life find way care production express eloquently beautifully age beautifully act presentation classic make miniseries fireplace break popcorn write story publish great satire arguably best work story orphan bring legal system ward court wait long stand lawsuit large estate split standing lifetimes point story lawsuit actually curse disrupts live litigant wait large monetary handout potentially time never happen agree assessment believe write show futility lawsuit legal system century involve lawsuit childhood story everything lose tragic death greed men uncommon evil others act love benevolence fragility life common people become ill die quickly top notch cast include surprise jillian pure genius hardly recognizable role story hard follow time due large cast complex story line want close attention setting costume passable scene character lay grass fiance cowboy boot visible dress rid biggie still well worth watch due amazing actor course use story show best ever write never know miss grow reviewer allude say main character much sad end never get break best seller policy love spy novel action order bedtime hour reading page paperback get fro little slow become accustomed language phrasing time page own really splendid hour actual year back absolutely engross miniseries reveal comfortable lifestyle rich always fill party holiday also bad choice sadness regret numerous work class desperate sometimes gritty struggle survive mean detest villain anxiously hope innocent prevail love personality character wonderfully developed portray very well act", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Charles Dickens's masterful assault on the injustices of the British legal system\r\n\r\nAs the interminable case of 'Jarndyce and Jarndyce' grinds its way through the Court of Chancery, it draws together a disparate group of people: Ada and Richard Clare, whose inheritance is gradually being devoured by legal costs; Esther Summerson, a ward of court, whose parentage is a source of deepening mystery; the menacing lawyer Tulkinghorn; the determined sleuth Inspector Bucket; and even Jo, the destitute little crossing-sweeper. \r\n\r\nA savage, but often comic, indictment of a society that is rotten to the core, Bleak House is one of Dickens's most ambitious novels, with a range that extends from the drawing rooms of the aristocracy to the poorest of London slums. This edition follows the first book edition of 1853, and includes all the original illustrations by 'Phiz', as well as appendices on the Chancery and spontaneous combustion. \r\n\r\nTerry Eagleton examines characterisation and considers Bleak House as an early work of detective fiction. ", "asin": "149737104X", "rank": "519182", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41T%2Bvk0icSL.jpg", "country": "England", "story_arc": ["Tragedy", "Things only get worse"]}