{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 38.5052288, "ratings": {"num_ratings": 13, "rating": 2.8, "reviews": [{"review_sentiment": 4.0, "review_text": "An interesting approach to a complex man through the eyes of a teenager who grows, learns and celebrates with the ogre.The bumbling Brits never quite knew how to handle  Napoleon, but they took away his joy, and that of the family who did appreciate him.I learned much and enjoyed the book."}, {"review_sentiment": 3.0, "review_text": "A much -ado-about nothing attempt to milk the Napoleon legend."}, {"review_sentiment": 3.0, "review_text": "Perhaps it was the point-of-view character or my state of mind, but I couldn't seem to engage with this book. At times I found it interesting, but at other times it was a slog. It did, however, make me want to learn more about Napoleon."}, {"review_sentiment": 2.0, "review_text": "This story is based on Betsy Balcome diary. Before immigrating with her family to Australia, they lived on the island of St. Helena, where Napoleon Bonaparte was exiled.Betsy arrives at St. Helena Island at the age of 3. “Lack of education and social polish” takes her at the age of 8 and her sister, 10, back to England. Not happy at the academy, she defies her way back to the island, leaving her sister behind.In October 1815, after his defeat at the Battle of Waterloo, Napoleon is exiled to the island of St. Helena. He is introduced to Balcome family. They dine, wine, and sing together. From their conversations a bit of history is revealed.The first 100 pages, which are concentrated on Betsy’s story are fairly interesting. Once Napoleon arrives at the island, their interaction becomes quite boring. Her and her sister’s French translations, to improve their French forced on them by their father, involve stories around them, which are boring as well. Betsy’s complex friendship with Napoleon is rather annoying, not making it an interesting read."}, {"review_sentiment": 4.0, "review_text": "Keneally weaves fiction and fact together to relate the relationship between Betsy Malcombe and her sister and parents and the exiled Napoleon on the remote south Atlantic island of St Helena, a relationship which over the years developed in to friendship and respect. Although the narrative is at times plodding the author evokes a clear sense of Napoleon's isolation and despair caused by his fall from the highest pinnacle. The heavy handed manner with which the British governor, Hudson Lowe, enforced the emperor's confinement makes the reader wish that one of the plots to rescue Napoleon had succeeded. Because of its length and detail the book requires careful attention to the author's prolix paragraphs. In addition, Napoleon's time on St Helena is not described in a linear fashion requiring periodic returns to earlier chapters. Nevertheless when I finished the book I was pleased that I had made the effort. JCM"}, {"review_sentiment": 2.0, "review_text": "Napoleon was the titanic figure of his age, a man of destiny who ushered Europe from feudalism into the modern meritocratic world. His defeat after 20 years of almost continual warfare instigated by stubborn conservative forces led by Britain with its mastery of the seas is the theme of tragedy. His imprisonment on the rock of Saint Helena for giving man freedom is compared to Prometheus’s punishment for gifting man fire.Having just published a novel on the same topic, featuring the same characters, I was looking forward to reading this book. Sadly I was disappointed. There is no drama, no romantic interest, very little insight into how Napoleon dealt with his spectacular fall, hardly a mention of how he plotted obsessively to win his release. Instead there was much more than I wanted to read about the trivialities of the everyday life lived by too many minor characters on the claustrophobic little island.The only moment this rather stuffy, dull, overlong tale comes alive is when Betsy Balcombe, the narrator, walks in on an orgy at Longwood featuring her own mother and Napoleon dressed in drag who seems to be on the point of being mounted by his physician Barry O'Meara. Of course Betsy flees in horror. Curiously this traumatic event is soon forgotten by all concerned.I was reluctant the publish this review for obvious reasons so it comes as a relief that others seem to agree with me!"}, {"review_sentiment": 1.0, "review_text": "I hated this book. Interesting in terms of the history but my wilkipedia look up was more interesting than the book. The view from a thirteen year old girl was not very believable or interesting. I tried really hard but only got to page 150 and finally said, enough is enough. Life is too short."}, {"review_sentiment": 3.0, "review_text": "I haven't read this book yet, so I'm giving it 3 stars as the reviewers have done. But readers may be interested in \"The Last Love\" by Thomas B. Costain.  It was published in the early 60's and is based on the same historical footnote."}, {"review_sentiment": 3.0, "review_text": "I usually really enjoy historical fiction and am happy to suspend belief to go with the flow of the novel but this one just didn't engage me.Betsy should have been a good way of exploring Napolean's time in exile but sadly the story just dragged so regrettably, I did not finish.  THanks to netgalley for the ARC.  Try this one if you'd like a new perspective on Napoleon."}, {"review_sentiment": 3.0, "review_text": "Told from the view of a young girl/woman this book had so much potential for a behind the scenes glimpse of the final years of Napoleon.  The writing reflects the time period and is wonderfully done but the subject matter is lacking.  You get better insight into the life of Betsy Balcombe than Napoleon.  Betsy, described as a spirited girl, comes across as more stubborn and selfish than spirited.  The minor times when Napoleon is in the center of a scene the reading was enjoyable and the small sightings of his right hand man - Gourgaud are also interesting.I found this a slow read - which is not a negative comment as I enjoy a \"stroll\" through a book - unfortunately this was more of a dragging of the reader."}]}, "authors": ["Thomas Keneally"], "isbn": "1501128426", "longitude": -122.4700424, "periods": ["1800s", "Recent Releases"], "title": "Napoleon's Last Island", "word_cloud": "interesting approach complex man eye teenager grow learn celebrates bumble never quite know handle take joy family appreciate learn much enjoy much nothing attempt milk legend perhaps character state mind engage time find interest time slog however make want learn napoleon story base diary immigrate family live arrive age education social polish take age sister back not happy academy defies way back leave sister defeat exile introduce family dine wine sing together conversation bit history first page concentrate story fairly interesting arrive interaction become quite boring sister french translation force father involve story bore well complex friendship rather annoy make interesting weave fiction fact together relate relationship sister parent exile remote south relationship year develop friendship respect narrative time plod author evokes clear sense isolation despair cause fall highest pinnacle heavy hand manner british governor enforce emperor confinement make wish plot rescue succeed length detail require careful attention author prolix paragraph addition time describe linear fashion require periodic return earlier chapter finish please make effort titanic figure age man destiny usher feudalism modern meritocratic world defeat year almost continual warfare instigate stubborn conservative force lead mastery sea theme tragedy imprisonment rock give man freedom compare punishment gift man publish feature character look forward read sadly disappoint drama romantic interest little insight dealt spectacular fall hardly mention plot obsessively win release instead much want triviality everyday life live many minor character claustrophobic little moment rather stuffy dull tale come alive narrator walk orgy feature mother dress drag seem point mount physician course flee horror traumatic event soon forget reluctant publish review obvious reason come relief others seem hat interest term history wikipedia look interest view thirteen year old girl believable interesting try really hard get page finally say enough enough yet give star reviewer do reader publish early base historical footnote usually really historical fiction happy suspend belief go flow engage good way explore napoleon time exile sadly story drag regrettably finish t hanks net galley new perspective napoleon view young much potential scene glimpse final year napoleon writing reflect time period wonderfully do subject matter lack get better insight life describe spirited girl come stubborn selfish spirit minor time center scene read enjoyable small sighting right hand man also find slow negative comment enjoy stroll unfortunately drag", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "The bestselling author of Schindler’s List and The Daughters of Mars returns with an “insightful and nimble...consistently fresh and engaging” (The New York Times Book Review) novel about the remarkable friendship between a quick-witted young woman and one of history’s most intriguing figures, Napoleon Bonaparte, during the final years of his life in exile on St. Helena.\r\n\r\nIn October 1815, after his defeat at the Battle of Waterloo, Napoleon Bonaparte was sent to live the remainder of his life in exile on the remote Southern Atlantic island of St. Helena. There, on what he called “the cursed rock,” with no chance of escape, he found an unexpected ally: a spirited British teenager named Betsy Balcombe who lived on the island with her family. While Napoleon waited for his own accommodations to be made livable, the Balcombe family played host to the infamous exile, a decision that would have far-reaching consequences for them all.\r\n\r\nIn Napoleon’s Last Island, based on a true story, acclaimed author Thomas Keneally re-creates Betsy’s powerful and complex friendship with the man dubbed The Great Ogre, her clashes and alliances with his remaining courtiers, and her uneasy journey to adulthood as she begins to see the imperfections and weaknesses of human nature. As he brings a fascinating period vividly to life, Keneally shines a fresh light on one of history’s most enigmatic, charismatic figures.\r\n\r\n“The book is a complex and mesmerizing success,” raves the Christian Science Monitor, hailing it as “a masterpiece in miniature…unfailingly great reading [and] testimony to the fact that Keneally is our greatest living practitioner of historical fiction.”", "asin": "1501128426", "rank": "1099984", "city": "Saint Helena", "image": "https://images-na.ssl-images-amazon.com/images/I/51DwhZsceXL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}