{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 852, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "Good read"}, {"review_sentiment": 5.0, "review_text": "Good book."}, {"review_sentiment": 1.0, "review_text": "I looked forward to reading the books that inspired the Bones TV series. The first book is awful. The writing is ponderous, she'll take an insane amount of time describing a minor detail, and the dialogue is stilted. It's like an editor read the first draft and suggested that everyone swear a lot, even when it doesn't make sense in the context. It's sprinkled with French words & phrases that are only sometimes translated. The characters are so bad they're laughable. Obviously whoever wrote the screenplays was a much better writer!"}, {"review_sentiment": 5.0, "review_text": "I do love a good murder mystery. I think these books are better than the show Bones, and I love the show. Temperance is certainly a believable and fun heroine that got me hooked from the beginning. I'll be reading all of these, I can already tell 👍"}, {"review_sentiment": 4.0, "review_text": "One of our favorite authors."}, {"review_sentiment": 5.0, "review_text": "My wife loves the Kathy Reichs stories and it was great to be able to find her a First Printing of the first book!  Arrived quickly, well-packed and in fine condition.  Good news that it is now being re-printed!"}, {"review_sentiment": 5.0, "review_text": "Very good book"}, {"review_sentiment": 5.0, "review_text": "Fantastic thriller from our favorite author and personality."}, {"review_sentiment": 4.0, "review_text": "Okay first let me say if you are going into this thinking this is like the T.V. series, then this book isn't for you, it's actually nothing like the series other than her name and being an forensic anthropologist,.  There are a lot of facts in this book and can get very technical. I enjoy a good mystery this one was, however it just seemed a little dry as well, I gave it four stars because of the mystery and it went into details about what happens in a case like what they are working on, again as I stated this is nothing like the series."}, {"review_sentiment": 4.0, "review_text": "This book really kept my interest."}]}, "authors": ["Kathy Reichs"], "isbn": "1501122118", "longitude": -73.6103642, "periods": ["2000s"], "title": "Deja Dead: A Novel", "word_cloud": "good good look forward read inspire tv series first awful write ponderous insane amount time describe minor detail dialogue stilted editor first draft suggest everyone swear lot even make sense context sprinkle french word phrase sometimes translate character bad laughable obviously write screenplay much better writer love good murder mystery think better show bone love show certainly believable fun heroine get hooked beginning read already favorite author wife love stories great able find first arrive quickly fine condition news very good fantastic thriller favorite author personality first go think series actually nothing series name forensic anthropologist lot fact get technical enjoy good mystery however seem little dry well give star mystery go detail happen case work state nothing series really kept interest", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "The first Temperance Brennan novel in the “cleverly plotted and expertly maintained series” (The New York Times Book Review) from the #1 internationally bestselling thriller writer Kathy Reichs.\r\n\r\nHer life is devoted to justice—even for those she never knew.\r\n\r\nIn the year since Temperance Brennan left behind a shaky marriage in North Carolina, work has often preempted her weekend plans to explore Quebec. When a female corpse is discovered meticulously dismembered and stashed in trash bags, Temperance detects an alarming pattern—and she plunges into a harrowing search for a killer. But her investigation is about to place those closest to her—her best friend and her own daughter—in mortal danger…\r\n\r\n", "asin": "1501122118", "rank": "35540", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/51T-kRwUdKL.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}