{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1619, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "_Brooklyn_ is the first novel by Colm Tóibín that I've read. While I generally feel the need to read the book before watching the film adaptation, I encountered this work first in its cinematic form. The film captured my heart, so much so that I am now discussing it with one of my classes. Here is a love story that manages to captivate without falling into sentimentalism. I was happy to see the film adaptation nominated for an Academy Award; it seems that it is possible, after all, to receive recognition even if one does not follow contemporary formulas.There is much of Jane Austen in this \"quiet\" novel. There is no sensationalism here, but simply the story of Eilis Lacey--a young Irish woman who relocates to Brooklyn, NY--and an exploration of the stages she goes through as she tries to find her place in the world. Before she leaves Ireland, Eilis considers that she may lose forever the place that constitutes her world, \"that she [will] never have an ordinary day again in this ordinary place, that the rest of her life [will] be a struggle with the unfamiliar\" (31). I chose this concept as the title for this review because it sums up the novel--and the immigrant's experience--beautifully.One of the reasons why I enjoyed _Brooklyn_ so much is that, as an immigrant, I found it easy to identify with Eilis, and based on my experience I can say that Tóibín portrays an immigrant's emotional development with great accuracy. (The author himself lives in Dublin and in New York, so we may presume many of the observations and descriptions in this novel are based on his personal experience.) The initial stage is characterized by amazement in the face of a new culture, mixed with a longing for what one has left behind, or homesickness. At first the immigrant has one foot on the new country and the other on the old homeland. Like Janus, he or she looks both ahead and back. The new country is characterized by what the painter Thomas Cole called \"want of association;\" nothing seems to mean anything, in the sense that nothing triggers connections in the immigrant's mind. (For Cole, incidentally, this was something positive; he saw America as an endless source of inspiration for the artist.) In time, the immigrant develops a new life, and the places and the people around him or her begin to take on associations. The process is similar to the snake's shedding of its old skin. But all the time the immigrant keeps thinking of the old home, keeps dreaming of going back, even though, as we all know, it is impossible to go back; as Heraclitus put it, \"No man ever steps in the same river twice.\"One of the objections that will be raised against _Brooklyn_ is that Eilis's situation as an immigrant is in fact enviable. Not only does she have the necessary papers and a job waiting for her upon arrival, she also speaks English, and she is Caucasian. Wouldn't the story of an immigrant that has no papers and no job, speaks a different language, and belongs to a different race/ethnicity be more interesting and/or worthy of sympathy? That is beside the point. There are many novels out there that relate the stories of immigrants from a large number of different backgrounds. Tóibín's novel is focused; it traces the physical and emotional journey of a single immigrant, and explores the processes through which human beings create new ties and sever old ones, to the extent that the latter is possible.Those readers who have seen the film will agree that Nick Hornby's screenplay is quite a faithful adaptation of the novel. As tends to be the case, however, the novel provides more details, especially when it comes to the background of some of the characters. In the novel we also learn about Eilis's brothers, who have emigrated to England. Two scenes did not make it into the script: one depicting a baseball game, the other the Catholic sacrament of penance. I'd say the first one would have presented a technical difficulty for the filmmakers, while the latter may have come across as too prudish in our increasingly amoral age. One final comment regarding the adaptation: as I read the last part of the novel I realized that Eilis is a bit more complicated, a bit more conflicted in the text than she is in the movie. One obvious reason for this may be that in the novel the reader enters her mind and hears the thoughts that can only be suggested in the film.I may read another one of Tóibín's novels soon, maybe _Nora Webster_, maybe _The South_ (also a story of an Irish immigrant). His prose is elegant, precise, and measured. I may be simplifying things here, but the effect the prose had on me was similar to that produced by John Banville's magnificent _The Sea_ (2005).Thanks for reading, and enjoy the book!"}, {"review_sentiment": 3.0, "review_text": "Rmantic story written by a man...not very romantic. No great story of why she ended up with the man she did. Dessicated a lovely relationship to obligation. The descriptions of Brooklyn were interesting."}, {"review_sentiment": 3.0, "review_text": "The book was enjoyable until it ended.  I felt there was no ending it just stopped.  This was very disappointing to me!"}, {"review_sentiment": 4.0, "review_text": "3.51 stars - Have watched the film several times and enjoy it - listened to the book - while the overall narrative arc is the same between the two there are some significant differences in story-telling, both with merits, but in the end I like the film better - in the book, Eilis's sister receives more development and attention, as do her roommates at the boarding house - Eilis seems less likeable in the book: more self-absorbed and insular, than in the film; likewise, Tony is a bit more manipulative in the book than the film - and the story development is much slower in the book, but that's to be expected - I thought the screenwriter did an exceptional job with a climactic scene between Eilis and Mrs Kelly towards the end of the story than the author did - personally, I'm on \"Team Jim\" rather than \"Team Tony\" as regards her love interest - in any case, I think it's great to both read and watch and get the \"whole story\" - all in all, she really was \"tossed into the deep end of the pool\" and made the best of it"}, {"review_sentiment": 5.0, "review_text": "If you have watched the film, I highly recommend reading the book. I watched the film first but found the book to be much more a delightful read."}, {"review_sentiment": 4.0, "review_text": "A subtle slowly building coming-of-age story and reflection on two countries, the old and the new, and the dilemna of decision.."}, {"review_sentiment": 1.0, "review_text": "In early 1950s Ireland Eilis is unemployed and still living at home with her mom and big sister. There are few employment prospects in Ireland so when a kind priest offers to help her immigrate to Brooklyn Eilis is grateful for the opportunity.The rest of the book follows Eilis as she acclimatizes to America, her new job and newfound independence. Just as Eilis has found happiness with a nice man she is called back home to help the family overcome a tragedy.Eilis is a spineless and self-absorbed character. Her supporting female cast aren’t much better either. There is a closeted lesbian boss who abuses her power, an archetypal altruistic sister, an overbearing mother fond of emotional blackmail and a frigid landlord.Other than a cast full of one dimensional female characters Tóibín’s writing is dull and monotone. Brooklyn is a boring book and at the end I found myself asking,”What was the point?”"}, {"review_sentiment": 3.0, "review_text": "Ending is lackluster and sad."}, {"review_sentiment": 5.0, "review_text": "Great read looking back on immigrant experience."}, {"review_sentiment": 5.0, "review_text": "Good enough to plan to read more books b theauthor"}]}, "authors": ["Colm Toibin"], "isbn": "1501106473", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "Brooklyn", "word_cloud": "first generally feel need watching film adaptation encounter work first cinematic form film capture heart much discuss class here love story manages captivate fall sentimentalism happy see film adaptation nominate seem possible receive recognition even follow contemporary much quiet sensationalism simply story young woman relocate exploration stage go try find place world leaf considers forever place constitute world never ordinary day ordinary place rest life struggle unfamiliar choose concept title review sum immigrant experience reason enjoy much immigrant find easy identify base experience say portrays immigrant emotional development great accuracy author live many observation description base personal experience initial stage characterize amazement face new culture mixed long leave homesickness first immigrant foot new country old homeland look ahead back new country characterize painter call want association nothing seem mean anything sense nothing trigger connection immigrant mind incidentally something positive saw source inspiration artist time immigrant develop new life place people begin take association process similar snake shed old skin time immigrant keep think old home keep dream go back even know impossible back put man ever step river twice objection raise situation immigrant fact enviable not necessary paper job wait arrival also speak english story immigrant paper job speaks different language belongs different interest worthy sympathy beside point many novel relate story immigrant large number different background focus trace physical emotional journey single immigrant explore process human being create new tie sever old one extent latter reader see film agree screenplay quite faithful adaptation tends case however provide detail especially come background character also learn brother emigrate scene make script depict baseball game sacrament penance say first technical difficulty filmmaker latter prudish increasingly amoral age final comment regard adaptation last part realize bit complicate bit conflicted text movie obvious reason mind hears thought suggest novel soon maybe maybe also story irish immigrant prose elegant precise measure simplify thing effect prose similar produce magnificent reading enjoy romantic story write man romantic great story end man lovely relationship obligation description interesting enjoyable end felt end stop disappointing star have watch film several time enjoy listen overall narrative arc significant difference merit end like film better sister receives development attention roommate board house seem le likable insular film likewise bit manipulative film story development much slower expect think screenwriter exceptional job climactic scene towards end story author personally team rather regard love interest case think great watch whole story really toss deep end pool make best watch film highly recommend read watch film first find much delightful subtle slowly build story reflection country old new dilemma early unemployed still live home mom big sister employment prospect kind priest offer help grateful rest follow acclimatize new job newfound independence find happiness nice man call back home help family spineless character support female cast much better closeted lesbian bos abuse power archetypal altruistic sister overbear fond emotional blackmail frigid cast full dimensional female character write dull monotone boring end find ask point end lackluster sad look back immigrant experience good enough plan b the author", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Colm Tóibín’s New York Times bestselling novel—now an acclaimed film starring Saoirse Ronan and Jim Broadbent nominated for four Academy Awards including Best Picture—is “a moving, deeply satisfying read” (Entertainment Weekly) about a young Irish immigrant in Brooklyn in the early 1950s.\r\n\r\n“One of the most unforgettable characters in contemporary literature” (Pittsburgh Post-Gazette), Eilis Lacey has come of age in small-town Ireland in the hard years following World War Two. When an Irish priest from Brooklyn offers to sponsor Eilis in America, she decides she must go, leaving her fragile mother and her charismatic sister behind.\r\n\r\nEilis finds work in a department store on Fulton Street, and when she least expects it, finds love. Tony, who loves the Dodgers and his big Italian family, slowly wins her over with patient charm. But just as Eilis begins to fall in love, devastating news from Ireland threatens the promise of her future.\r\n\r\nAuthor “Colm Tóibín…is his generation’s most gifted writer of love’s complicated, contradictory power” (Los Angeles Times). “Written with mesmerizing power and skill” (The Boston Globe), Brooklyn is a “triumph…One of those magically quiet novels that sneak up on readers and capture their imaginations” (USA TODAY).", "asin": "1501106473", "rank": "19665", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51MITHVpyvL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}