{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 42.3604823, "ratings": {"num_ratings": 1510, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "As always, Stephen King delivers a terrifyingly plausible scenario.  His knowledge of people's behavior and ability to describe that behavior and the events surrounding his characters is spot on."}, {"review_sentiment": 1.0, "review_text": "This book is so awful. I am willing to join a class-action suit with anyone else who wants to try to get their money back. Just post on this review thread and I'll get back in touch."}, {"review_sentiment": 5.0, "review_text": "Very good book"}, {"review_sentiment": 3.0, "review_text": "Too little, too long to tell. The ending wasn't an ending. Blah, blah, blah. I read this book to assist a 10th grader with a reading assignment. No wonder our schools are not producing literate children! Ugh!"}, {"review_sentiment": 3.0, "review_text": "Steven king is my favorite author, however I was disappointed. It dragged on and lacked his flarr. Great concept. Loved the characters. Not crazy about the ending. It was worth the read."}, {"review_sentiment": 4.0, "review_text": "Fast paced and thought provoking until the end.  Typical SK captivating novel with many twists and turns.  Would have given a five star but the ending was left to your imagination.  I thought the last page was missing!"}, {"review_sentiment": 2.0, "review_text": "BORING"}, {"review_sentiment": 3.0, "review_text": "Well its a good thing I know Spanish because otherwise I would have to donate the book.  Description never said book is in Spanish."}, {"review_sentiment": 3.0, "review_text": "The other feeling I had reading it is that it's a re-hash of his other books like The Stand, The Mist, etc. You know, there's some sort of large scale catastrophe, there's a small group of survivors who come together, etc. etc. It even has an old woman with cat's-eye glasses who spouts religious gibberish (reminded me of the religious woman in The Mist). Also there's a character who reminded me of Randall Flagg from The Stand. The characters even share the same dreams just like in The Stand."}, {"review_sentiment": 4.0, "review_text": "This is how cell phones can go wrong. This story starts out with people on their cell phones when the pulse happens. The people then go crazy and become like zombies. The story follows a group of people who eventually meet up that didn't have cell phones and so they were not affected. This group tries to figure out what is going on and how to fix it. I liked it and found myself wanting to keep turning the pages to see what when happen now."}]}, "authors": ["Stephen King"], "isbn": "150112224X", "longitude": -71.0595678, "periods": ["2000s", "Recent Releases"], "title": "Cell", "word_cloud": "always delivers terrifyingly plausible scenario knowledge people behavior ability describe behavior event surround character spot awful willing join suit anyone else want money back post review thread get back touch very good too little long tell end end blah blah assist grader reading assignment wonder school produce literate child king favorite author however disappoint drag lacked flare concept character not crazy end worth pace think provoke end captivate many twist turn give star end left imagination think last page miss boring well good thing know spanish otherwise never say spanish feeling read etc know sort large scale catastrophe small group survivor come together etc etc even old woman glass spout religious gibberish remind religious woman also character remind character even share dream phone go wrong story start people phone pulse happen people go crazy become zombie story follow group people eventually meet phone affect group try figure go fix like want turning page see", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "The next call you take could be your last in this terrifying #1 New York Times bestseller by Stephen King—now a major motion picture starring Samuel L. Jackson and John Cusack.\r\n\r\n“If any of them looks over here, sees us, and decides to come after us, we’re done. We won’t have a hope in hell.” \r\n\r\nOn October 1, God is in His heaven, the stock market stands at 10,140, most of the planes are on time, and graphic artist Clayton Riddell is visiting Boston, having just landed a deal that might finally enable him to make art instead of teaching it. But all those good feelings about the future change in a hurry thanks to a devastating phenomenon that will come to be known as The Pulse. The delivery method is a cell phone—everyone’s cell phone. Now Clay and the few desperate survivors who join him suddenly find themselves in the pitch-black night of civilization’s darkest age, surrounded by chaos, carnage, and a relentless human horde that has been reduced to its basest nature...and then begins to evolve. There’s really no escaping this nightmare. \r\n\r\nBut for Clay, an arrow points the way home to his family in Maine, and as he and his fellow refugees make their harrowing journey north, they begin to see the crude signs confirming their direction. A promise of a safe haven, perhaps, or quite possibly the deadliest trap of all....", "asin": "150112224X", "rank": "22581", "city": "Boston", "image": "https://images-na.ssl-images-amazon.com/images/I/51GfoUqzhKL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}