{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 6, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "Even if you do not contemplate a trip to Sydney, Australia, this novel that moves between three time periods will give you a meaningful sense of place and human endeavor.  Moving."}, {"review_sentiment": 4.0, "review_text": "Ashley Hay's fictional The Body in the Clouds is about our perception of reality. William Dawes, Ted Parker and Dan Kopek, three men from three different times, are brought together by their stories- the stories they collect, the stories they share about themselves and the stories they share about others.  Written with beautiful imagery and strong, well-honed characters, Hays weaves together these men's stories to share with us the connectivity of man's hopes and dreams while artfully asking the question, 'what is your truth?'.  I particularly enjoyed William Dawes' story of settling in the foreign and harsh world of the late 18th century antipodes, especially his collection of native words. I would recommend this book to serious readers and book clubs."}, {"review_sentiment": 3.0, "review_text": "This has an interesting premise but it's slow. I liked the atmospheric Sydney setting. Sometimes In these situations, the writing can carry me through but this time the prose is florid and I think the book would have benefited from a strong edit. I recognize that this is a reissue and thank Netgalley for the ARC,"}, {"review_sentiment": 5.0, "review_text": "I like the weaving of stories around the Sydney Harbour Bridge over a couple of centuries, the linking of people's lives and working out of their relationships. Ashley Hay's novels are enjoyable."}, {"review_sentiment": 4.0, "review_text": "Loved this story spanning 3 different times on Sydney's beautiful Harbour. Ashley Hay's words paint the landscape and people so well. I recently saw some of William Dawes botanical illustrations and was able to match  these to the images created in Ashley Hays fictional account."}, {"review_sentiment": 5.0, "review_text": "\"The Body in the Clouds\", by Ashley Hay, has been described as a luminous novel: this is an apt description. It is full of rich imagery which captures the mood of the place and the time. The characters, while often looking at life and events with quite a different perspective from the rest of us, are realistic and full of depth. Set in three different centuries, the stories are entwined by common threads, places and objects. Within those stories, more stories, some centuries old, some more recent, which resonate with the three main characters.Ashley takes small pieces of history and legends, and fills in the everyday bits: the descriptions, the thoughts and feelings of the participants. A bit like taking a line drawing and adding the colour and shading to make it real for us. Ashley's depth of research into that history and legend is evident.In addition, Ashley introduces the singular concept that certain events leave a trace, an imprint of themselves, as it were, both before and after they happen.\"The Body in the Clouds\" was an absolute pleasure to read. Let us hope Ashley will continue to share her literary talent with her readers."}]}, "authors": ["Ashley Hay"], "isbn": "1501165119", "longitude": 151.2164539, "periods": ["1700s", "1900s", "2000s", "Recent Releases"], "title": "The Body in the Clouds", "word_cloud": "even trip move time period give meaningful sense place human endeavor move fictional perception reality men different time bring together story collect story share story share others beautiful imagery strong character hay weave together men story share connectivity man hop dream artfully ask question truth particularly enjoy story settle foreign harsh world late century antipode especially collection native word serious reader club interesting premise slow like atmospheric set sometimes situation write carry time prose florid think strong edit recognize reissue thank like weave story couple century link people live work relationship novel enjoyable story span different time beautiful word paint landscape people well recently saw botanical illustration able match image create fictional account describe luminous apt description full rich imagery capture mood place time character often look life event quite different perspective rest realistic full depth different century story entwine common thread place object story stories century old recent resonate main take small piece history legends fill everyday bit description thought feeling participant bit take line draw add color shade make real depth research history legend addition introduces singular concept certain event leave trace imprint absolute pleasure continue share literary talent reader", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "From the acclaimed author of the “exquisitely written and deeply felt” (Geraldine Brooks, author of The Secret Chord) novel The Railwayman’s Wife comes a magical and gorgeously wrought tale of an astonishing event that connects three people across three hundred years.\r\n\r\nImagine you looked up at just the right moment and saw something completely unexpected. What if it was something so marvelous that it transformed time and space forever?\r\n\r\nThe Body in the Clouds tells the story of one such extraordinary moment—a man falling from the sky, and surviving—and of the three men who see it, in different ways and at different times, as they stand on the same piece of land. An astronomer in the 1700s, a bridge worker in the 1930s, and an expatriate banker returning home in the early twenty-first century: all three are transformed by this one magical event. And all three are struggling to understand what the meaning of “home” is, and how to recognize it once you’re there.\r\n\r\nWidely praised for her “poetic gifts” (Booklist) and “graceful, supremely honest, [and] thought-provoking” (Kirkus Reviews) prose, Ashley Hay has crafted a luminous and unforgettable novel about the power of story, its ability to define the world around us, and the questions that transcend time.", "asin": "1501165119", "rank": "144536", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51gtRdpBQzL.jpg", "country": "Australia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}