{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 3, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "I loved these stories from across the globe. The authors told great tales that were interesting and showed how talent indeed exists everywhere. I highly recommend this book."}, {"review_sentiment": 1.0, "review_text": "I read this book based on the recommendation from Dave Eggers whose \"Zeitoun\" I found an excellent read.  But this book I found very hard to enjoy.  Each chapter is a short story that seems to end before you understand what happened to the character.  The story flow in some of the chapters was confusing.  There are also numerous \"F-word\" occurrences and it also helps if you can interpret Ebonics in some chapters."}, {"review_sentiment": 5.0, "review_text": "Maxine Beneba Clarke demonstrates remarkable range in Foreign Soil. The stories shift between Australia and less developed countries, as Clarke explores triumphs and tragedies that connect lives in cultures that are quite different from each other.“David” tells the story of two Sudanese women in Australia. One fled from her village with two sons and memories of a third. The younger woman faces the older woman’s disapproval because she wears her hair short, dresses in jeans, has abandoned religion, and rides a bicycle. Yet it is ultimately the bicycle rather than Sudanese tradition that binds the two women in this touching, sad story. It’s easily my favorite in the collection.“Harlem Jones” is a young man whose parents moved to London from Trinidad. He establishes his individual identity by joining a group protest against the police killing of a black man. The story is honest in its refusal to paint a more uplifting picture of forsaken lives.“Hope” is about a girl from the mountains who goes to Kingston to find her place in the world and instead learns hard lessons about love. It’s a sweet “slice of life” story that should please fans of romance (as opposed to fans of romance fiction).“Foreign Soil” tells the story of Angela, who falls in love with Mukasa and leaves Australia behind when he takes her to Uganda. In his own world, however, Mukasa seems like a different person. The story is bleak and troublingly unfinished.“Shu Yi” is the name of the new kid in school. The story’s narrator, a brown-skinned girl named Ava, is relieved that someone has replaced her as the target of bullies in their white suburban Australian neighborhood. When Ava’s mother forces her to be Shu Yi’s friend, the outcome is surprising. This is my third-favorite story in the collection.“Railton Road” is the Brixton headquarters of young black rebels who are assembling to express their growing discontent. The story highlights characters who take different approaches to black empowerment while sniping at each other and treating women as slaves.“Gaps in the Hickory” is a story of poverty, prejudice, and pride. Poverty should transcend race as a unifying force, but some characters in the Mississippi setting of this story are blinded by bigotry as they rage against people of different races and sexual identities. The themes are particularly relevant today, as bigots cling to an imagined past that never existed. This story, like some others in the collection, is masterful in its use of dialect. Its combination of an ugly present and a hopeful future make it my second-favorite story in the volume.“Big Islan” is about the restlessness of life in Jamaica. The story is again notable for its use of dialect.“The Stilt Fishermen of Kathaluwa” tells the story of Ansanka, a boy soldier who fled from Sri Lanka and is now being detained in Australia. The story alternates between Ansanka’s harrowing young life and the unsatisfying life of the lawyer who interviews him in a detention facility. I love the story’s contrast between people who think they have problems and people who really have problems.A girl who gets stuck hanging upside down symbolizes life’s deeper problems in “The Sukiyaki Book Club.” The writer enters the story to explain that she doesn’t know how to rescue the girl. Parental fear -- the writer’s need to assure that her own kids are safe and well adjusted (or at least safe) -- is the story’s focus. I’m not fond of stories in which writers intrude into the narrative, so this was my least favorite.In “Aviation,” a woman whose husband was killed on 9/11 is asked to become an emergency caregiver for a Middle Eastern child no family will take. The story is a brief but powerful look at misdirected prejudice.None of the stories in Foreign Soil are bad, most are quite good, and a handful are excellent. I appreciate the attention to important themes that are overlooked by modern authors who so often devote themselves to the trivial. If I could, I would give Foreign Soil 4 1/2 stars, rounded up to 5 because this is an impressive group of stories."}]}, "authors": ["Maxine Beneba Clarke"], "isbn": "1501136364", "longitude": 151.2164539, "periods": ["2000s", "Recent Releases"], "title": "Foreign Soil: And Other Stories", "word_cloud": "love globe author tell great tale interest show talent indeed exist everywhere highly recommend base recommendation find excellent find hard enjoy chapter short story seem end understand happen character story flow chapter confuse also numerous occurrence also help ebonics chapter demonstrate remarkable range shift le developed country explore triumph tragedy connect live culture quite different tell story sudanese woman flee village son memory third younger woman face older woman disapproval wear hair short dress jean abandon religion ride bicycle yet ultimately bicycle rather sudanese tradition bind woman touch sad story easily favorite young man parent move establish individual identity join group protest police kill black man story honest refusal paint uplifting picture forsake girl mountain go place world instead learn hard lesson love sweet slice life story please fan romance oppose fan romance fiction tell story fall leave take world however seem different person story bleak troublingly name new kid school story narrator girl name relieve someone replace target bully white suburban australian neighborhood mother force friend outcome surprising story headquarters young black rebel assemble express grow discontent story highlight character take different approach black empowerment snip treat woman story poverty prejudice pride transcend race unify force character set story blind bigotry rage people different race sexual identities theme particularly relevant today bigot cling imagine past never exist story others collection masterful use dialect combination ugly present hopeful future make story restlessness life story notable use tell story boy soldier flee detain story alternate harrowing young life unsatisfying life lawyer interview detention facility love story contrast people think problem people really girl get stuck hang upside symbolize life deeper problem writer enters story explain know rescue girl fear writer need assure kid safe well adjust least safe story focus fond writer intrude narrative least woman husband kill ask become emergency caregiver child family story brief powerful look misdirect bad quite good handful excellent appreciate attention important theme overlook modern author often devote trivial star round impressive group", "genres": ["Fiction & Literature"], "summary": "From a new voice in international fiction, a prize-winning collection of stories that cross the world—Africa, London, the West Indies, Australia—and express the global experience “with exquisite sensitivity” (Dave Eggers).\r\n\r\nIn this collection of award-winning stories, Maxine Beneba Clarke gives voice to the disenfranchised, the lost, and the mistreated. Her stories will challenge you, move you, and change the way you view this complex world we inhabit.\r\n\r\nWithin these pages, a desperate asylum seeker is pacing the hallways of Sydney’s notorious Villawood detention centre; a seven-year-old Sudanese boy has found solace in a patchwork bike; an enraged black militant is on the war-path through the rebel squats of 1960s Brixton; a Mississippi housewife decides to make the ultimate sacrifice to save her son from small-town ignorance; a young woman leaves rural Jamaica in search of her destiny; and a Sydney schoolgirl loses her way.\r\n\r\nIn the bestselling tradition of novelists such as Chimamanda Ngozi Adichie and Marlon James, this urgent, poetic, and essential work announces the arrival of a fresh and talented voice in international fiction.", "asin": "1501136364", "rank": "448878", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/510ORF82eYL.jpg", "country": "Australia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}