{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 29.3797091, "ratings": {"num_ratings": 8, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "The surface of any tale of war is always an iceberg tip. This book breaks that and takes us deep inside the personal experiences of wartorn Kuwait of the early 1990s in a way that most firsthand looks do not."}, {"review_sentiment": 5.0, "review_text": "Excellent writing by Mr. Al Sarraf. These stories are important for us to hear and ponder.The author did an excellent job of capturing the psychological as well as spiritual impact of war on people's lives. He captures many perspectives throughout each story. I got the sense that he was a young man during the invasion and that he held onto, and pondered deeply, what happened to himself and those around him during that time. There is no condemnation of any group of people or individual in his writing. He simply tells the stories and allows the story itself to bring its own awakening to his characters, as well as to his readers.Although it is dark and full of horrifying scenes - war - I found myself oddly uplifted. I found an awakening for myself through his words. I highly recommend this book of stories to any who were involved in the invasion. And if you did not live through it, I very highly recommend you read this and other accounts of that time.Learn, ponder, awaken.'It was a testing time for her, for she tested her own ideologies of what she thought were true and false. Tested in ratio to what were false and true.` From the Chapter `Metamorphoses`"}, {"review_sentiment": 4.0, "review_text": "This isn't the type of book I would normally pick up but I found the topic interesting and the author's personal experiences brought a thorough and seemingly unbiased view to the subject matter. Alsarraf's poetic background was obvious in the text and it brought some beauty to some of the horrific situations portrayed in the stories. At times it was hard to read one after another because the warfare and pain the Kuwaiti were put through during the invasion are something most Americans are lucky enough never to have to witness. It certainly gives perspective. The stories were well ordered giving an natural build up in tension and some closure at the end. I loved the way Alsarraf gave a voice to many different types of people so that readers could gain a comprehensive perspective. Highly recommended!"}, {"review_sentiment": 5.0, "review_text": "Dr. Haitham Alsarraf is brilliant at evoking all your senses with an unfailing eye for detailYou become immersed in the harsh realities of a country at war and the enduring spirit of the many people that call Kuwait, home.This collection of stories has truly haunted me, I don't know how I would of persevered through such turmoil. I admire the courage to all that survived such horrors.A must read!"}, {"review_sentiment": 5.0, "review_text": "I just finished reading \"Invasion Occupation Awakening\" by Haitham Alsarraf. This book was transcendent. From the very 1st pages you find your self in the midst of a war zone painted for you so purely in details. Every sentence was so cleverly written that it teleports you into the story effortlessly; it captivates your mind and imprisons it while making you believe that you are part of this story, and that you are living every moment of it. You start to feel the emotions that you are reading about, and the ones that the characters feel and embody as you take in every character and walk in his shoes.While reading, you are introduced to every character in a unique indirect way. You are not handed all the information about them all at once; you  get to learn this and that about each character as you continue reading, and it is acquired with what fits the situation so you can understand the character well. You start to develop a connection with some and start to visualize faces and appearances; trying to fit a personality with a look. You start to develop an interest in them wishing for the survival of some and the demise of others.The Element of anticipation was the key to this book. You get engrossed in the details of the story, and you find your self wanting a way out. You live a terror you have never experienced and a helplessness that you never want to experience; needing this war to be over and for freedom to release everyone with its presence.Then, there is the imagery that was written vigorously. Just like the entrancing words of a poet, Dr. Haitham bewitched the reader with his style of writing. It was rich, intriguing and gripping.Frankly speaking, had this book been ordinary I would have lost interest from the start, simply because I have a particular taste when it comes to reading and this book did not disappoint my expectations; I am pleased with that because it was written by someone that I respect and admire majorly."}, {"review_sentiment": 4.0, "review_text": "I was married to a Lebanese man. We met in 1984. He had extremely horrifying dreams from when the U.S. laid siege of Beirut in 1982. His family kept hearing air raid to go to the underground parking while bombing took place. We were still together when Iraq invaded Kuwait. Like one girl in the book said, all we learned came from CNN (and they basically kept the truth from us). This book tells ten different vignettes about what different people endured and saw first hand. This book is not for the faint of heart, as any veteran of war can explain.  Even so, I believe that these stories needed to be told. Americans back home can't understand what people in that part of the world see, hear, and experience all of the time. So many children grow up knowing nothing but war and hatred all their lives. These stories scared me into getting nauseous, if not straight out terrified out of my wits. I was only reading about the atrocities that most of the teens and young adults who were the main characters in the stories had to deal with. Their experiences all change each and every one of them in some very profound way. I am glad that Mr. Alsarraf, through each of his stories, let us get a taste of what people in the Middle East have been going through for decades (after WWII when Palestinians were displaced from their homelands to create Israel). We are so spoiled here when we have to go crazy over a parking space close to the door.*I was given a copy of this book by Goodreads First Read, to read and give my honest review."}, {"review_sentiment": 5.0, "review_text": "I recently read Invasion Occupation Awakening, by Haitham Alsarraf. It was an honor to step into this uniquely painted telling of the Iraqi invasion of Kuwait. I found Mr. Alsarraf's writing style to be intriguing in his use of imagery and poetic rhythm. Mr. Alsarraf's descriptions are cleverly formed and direct. The short storied delivery allows for the emotion to fully settle on the reader, without being overshadowed by lengthy character developments. He lays bare, for us, the struggles and fears associated with war. Taking care to show how each tale has more than one side. More than one wrong or right. Showing how confusing and difficult such experiences would have been. How the circumstances affect the lives and minds of those involved.Through reading Invasion Occupation Awakening, I have been allowed a glimpse into another time and culture. I appreciate the raw exposure of the sorrowful human on human atrocities which occur during times of war. As someone who was too young to realize the scope of what was happening in 90-91, I take away from this reading a greater sense of the loss and hurt which took place. As the old saying goes, learn from the past. This is a book which we should all learn what we can from."}, {"review_sentiment": 5.0, "review_text": "This is an amazing book!!  I have read it twice now and each time I discover more within each character.  The descriptions of what really happened during the occupation of Kuwait are astonishing.  I really feel the characters metamorphoses as the story goes on.  This is a unique story that anyone interested in the psychology of what happens to people during an occupation should read. I highly recommend it to anyone!!!"}]}, "authors": ["Mr. Haitham Alsarraf"], "isbn": "1502565633", "longitude": 47.9735629, "periods": ["1900s", "Recent Releases"], "title": "Invasion Occupation Awakening", "word_cloud": "surface tale war always iceberg break take deep personal experience war torn early way firsthand look excellent write story important hear author excellent job capture psychological well spiritual impact war people live capture many perspective story get sense young man hold ponder deeply happen time condemnation group people individual write simply tell story allow story bring character well dark full horrify scene war find oddly uplifted find word highly recommend story involve live highly recommend account test time test ideology think true false ratio false chapter type normally find topic interesting author personal experience bring seemingly unbiased view subject matter poetic background obvious text bring beauty horrific situation portray story time hard warfare pain put something lucky enough never certainly give perspective story well order give natural build tension closure end love way give voice many different type people reader comprehensive perspective recommend brilliant evoking sens unfailing eye detail you become immersed harsh reality country war endure spirit many people call collection story truly haunt know turmoil admire courage survive finish read transcendent page find self midst war zone paint purely detail sentence cleverly write teleport story effortlessly captivate mind imprisons make believe part story living moment start emotion read one character feel embody character walk reading introduce character unique indirect way hand information get learn character continue read acquire fit situation understand character well start connection start visualize face appearance try fit personality look start interest wish survival demise anticipation key get engross detail story find self want way live terror never experience helplessness never want experience need war freedom release everyone imagery write vigorously entrance word poet bewitch style write rich intrigue speak ordinary interest start simply particular taste come read disappoint expectation please write someone respect admire majorly marry lebanese man meet extremely horrify dream lay siege family keep hear air raid go underground parking bomb take place still together invade girl say learn come basically keep truth tell ten different vignette different people endure saw first hand faint heart war explain even believe story need tell back home people part world see hear experience time so many child grow know nothing war hatred live story scar get nauseous straight terrify wit read atrocity teen young adult main character story deal experience change profound way glad story let taste people go decade displace homeland create spoil crazy park space close door give copy honest review recently honor step uniquely paint tell find write style intriguing use imagery poetic rhythm description cleverly form direct short storied delivery allow emotion fully overshadow lengthy character development lay struggle fear associated war care show tale side more wrong right show confuse difficult experience circumstance affect live mind read allow glimpse time culture appreciate raw exposure sorrowful human human atrocity occur time war someone young realize scope happen take away read greater sense loss hurt take place old saying go learn learn amazing twice time discover character description really happen astonishing really character metamorphose story go unique story anyone interested psychology happen people highly recommend anyone", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "When Iraq invaded Kuwait in 1990, many traumatic experiences were molded. Each chapter details different characters that undergo the seven-month occupation and consequent liberation of the country. Through turmoil of war to self-examination, the characters come to grips both psychologically and philosophically with their newly acquired environments and face their freshly constructed realities. In them, their humanity is not only invaded and occupied, but it is metamorphosed and awakened.\r\n\r\nInvasion Occupation Awakening is a book of short fictional stories about the 1990 Iraqi invasion, subsequent occupation, and 1991 liberation of Kuwait, also called the first Persian Gulf War.\r\n\r\n\"His book Invasion Occupation Awakening is unique in its coverage of the events of the Iraqi invasion and subsequent occupation, with his experiences and eye-witness accounts forming a large part of the book's narrative.\" The Times Kuwait", "asin": "1502565633", "rank": "5199720", "city": "Kuwait", "image": "https://images-na.ssl-images-amazon.com/images/I/518%2BRdMdK7L.jpg", "country": "Kuwait", "story_arc": ["Tragedy", "Things only get worse"]}