{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 523, "rating": 4.3, "reviews": [{"review_sentiment": 3.0, "review_text": "Blatant errors like “79 days” scanned as “751 days”... come on Amazon can we get some quality control here!Story is good, but it does feel a bit dated and stiff in many places."}, {"review_sentiment": 3.0, "review_text": "Great story, but weak binding:  all the pages fell out of the book. Which was kind of a hassle as you were trying to read!"}, {"review_sentiment": 5.0, "review_text": "I had a copy of A Journey to the Center of the Earth from the same publisher with the same illustrator when I was a kid. Pablo Marcos' illustrations are fantastic (to be expected from the guy who also illustrated Batman comics in the '60s and '70s). This adaptation is abridged in a way that leaves out little of any importance while still being succinct enough and including plenty of explanations for young readers. And, with a caption with every illustration and an illustration on every second page, it's easy for even children as young as my kindergartners to fall in love with, even if they can't read the whole thing yet. Just maybe, if you're reading it to very young children like I did, skip over the two or three pages where Detective Fix drugs Passepartout in a Chinese opium den (or be ready to give some sort of alternative explanation!)"}, {"review_sentiment": 3.0, "review_text": "A much enjoyed classic of Jules Verne.  Though, I have found Butcher translations of Verne not the best version of translations. Butcher , in my opinion, does not ‘hold true’ to basic commonly used verbiage. He uses MANY words when he could have and should have used fewer. (In other words, he is long winded). Again, this is just my opinion on That topic. On the whole, a very very good book ."}, {"review_sentiment": 5.0, "review_text": "Just finished reading this to my children! Such an enjoyable journey to follow. It's full of suspense and twists. It also contains great geographic and cultural education opportunities. Lots of questions to find answers to for readers."}, {"review_sentiment": 5.0, "review_text": "Grate book"}, {"review_sentiment": 5.0, "review_text": "Its exciting, intriguing, and flows wonderfully. Short enough to finish in good time, long enough to keep interest. Definitely suggest the read."}, {"review_sentiment": 5.0, "review_text": "These are the classics of sci-fi.  The imagination of Jules Verne is something that every sci-fi fan must explore at some point in their life.  He envisioned so many of the technologies that we take for granted today and used them to create worlds that are rich with legendary adventures, edge of your seat  suspense and characters that you will never forget.PLEASE ... if you are going to read Jules Verne, do NOT just buy any copy that you come across.  Jules Verne wrote in French and, if you can't read French fluently, you must find an edition that was translated by a true expert in Verne's writing and style.  Poor translations are literally filled with omissions, errors and shabby translations that completely destroy the subtle humor and style of Jules Verne.  Three experts that are often highly recommended by Jules Verne advocates are: Stanford Luce, Walter James Miller and Frederick Paul Walter.This particular edition was the 1873 translation by George Makepeace Towle.  Towle was a 19th century contemporary of Jules Verne and is remembered for this particularly outstanding translation of Around the World In Eighty Days.  You may find the 19th century English grammar and syntax a bit challenging, but it is well worth the effort."}, {"review_sentiment": 5.0, "review_text": "i bought this classic for make my english reading better..that was easy to read and fun..i have all series from great illustrated classics.."}, {"review_sentiment": 5.0, "review_text": "Excellent book by an amazing author. I love Jules Verne"}]}, "authors": ["Jules Verne"], "isbn": "1503215156", "longitude": 0.0, "periods": ["1800s"], "title": "Around the World in 80 Days", "word_cloud": "blatant error scan quality control good feel bit dated stiff many place story weak binding page fell kind hassle try copy publisher illustrator kid illustration fantastic expect guy also illustrate comic adaptation abridge way leave little importance still succinct enough include plenty explanation young reader caption illustration illustration second page easy even child young kindergartner fall even thing yet maybe read young child skip page drug opium den ready give sort alternative explanation much enjoy classic find translation best version translation opinion hold true basic commonly used verbiage use many word use word long wind opinion topic whole good just finish read child such enjoyable journey full suspense twist also contain great geographic cultural education opportunity question find answer reader grate excite intriguing flow wonderfully enough finish good time long enough keep interest definitely suggest classic imagination something fan point life envision many technology take grant today use create world rich legendary adventure edge seat suspense character never go copy come write french fluently edition translate true expert write style translation literally fill omission error shabby translation completely destroy subtle humor style expert often highly recommended advocate particular edition translation century contemporary remember particularly outstanding translation century grammar syntax bit challenge well worth effort bought classic make english reading easy series great illustrated excellent amaze author love jules", "genres": ["Fiction & Literature", "Travel Writing"], "summary": "Around the World in Eighty Days is a classic adventure novel by the French writer Jules Verne, published in 1873. \r\n\r\nIn the story, Phileas Fogg of London and his newly employed French valet Passepartout attempt to circumnavigate the world in 80 days on a £20,000 wager set by his friends at the Reform Club. It is one of Verne's most acclaimed works. \r\n\r\nThe story starts in London on Tuesday, October 1, 1872. Fogg is a rich English gentleman living in solitude. Despite his wealth, Fogg lives a modest life with habits carried out with mathematical precision. Very little can be said about his social life other than that he is a member of the Reform Club. Having dismissed his former valet, James Foster, for bringing him shaving water at 84 °F (29 °C) instead of 86 °F (30 °C), Fogg hires a Frenchman by the name of Jean Passepartout as a replacement. \r\n\r\nAt the Reform Club, Fogg gets involved in an argument over an article in The Daily Telegraph stating that with the opening of a new railway section in India, it is now possible to travel around the world in 80 days. He accepts a wager for £20,000 (equal to about £1.6 million today) from his fellow club members, which he will receive if he makes it around the world in 80 days. \r\n\r\nAccompanied by Passepartout, he leaves London by train at 8:45 P.M. on Wednesday, October 2, 1872, and is due back at the Reform Club at the same time 80 days later, Saturday, December 21, 1872.", "asin": "1503215156", "rank": "23150", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51XOe02htCL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}