{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 240, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "I love the adventures of Katharine and Philippe and all their friends and relatives. Very charming. I enjoyed learning more French words as well as the the Christmas customs, meals and traditions. I want to buy some santons of my own. Thanks Patricia! Beautiful writing!"}, {"review_sentiment": 3.0, "review_text": "The food n scenery details were sometimes lengthy, but it was a nice quiet story. If you’re looking for a very calm book to read before bed, this is recommended."}, {"review_sentiment": 4.0, "review_text": "As someone who has spent some time in this area and speaks French, I absolutely enjoyed this series.The details were excellent. I am so hungry for the French cuisine and the countryside! Thanks Patricia."}, {"review_sentiment": 5.0, "review_text": "Second book in a trilogy. Excellent writing. Mature characters in believable stories. A virtual travelogue of Toronto and Provence. One should read all three of this trilogy to find out where the romance leads Kat. The friendships that are developed in book one continue to deepen and remain throughout each book. There is a mystery that begins in this book, but also wraps up quite nicely. One isn't able to guess what will happen. It is quite the surprise. I borrowed this book from my local library."}, {"review_sentiment": 5.0, "review_text": "i am enjoying this story so much!"}, {"review_sentiment": 5.0, "review_text": "France has always been a favorite country, to read about and was lucky enough to visit twice about 10 yrs ago.  Two weeks & ten days the second time with my granddaughter who was 19.  Visited Paris, but would love to see so. France as described in the books.  My family is French Canadian, Provence of Quebec....Quebec city being only a two hr drive......  Visited many times. And delighted in just being there...  Nothing like u describe of France...But fun to explore.  I have read the first two books. And will continue with the third tomorrow.  please keep on writing.\"..  I have read all the James Patterson books, but these books I am enjoying thoroughly.....  You feel like you could just go visit with all the charecters and be comfortable with the whole theme....  And the locale...o my goodness....  Thank you for all the written enjoyment...  Feel like you r there"}, {"review_sentiment": 4.0, "review_text": "I have so enjoyed these first two books of the series. This one dragged a little for me regarding the drug trafficking and I didn't really feel that part of the storyline had closure. But perhaps that is something we are yet to discover in the next book! I would definitely recommend this series."}, {"review_sentiment": 2.0, "review_text": "So far book one and two are more travel guide than story. But it isn't an unpleasant story after you get through all the descriptions. A little too detailed for me."}, {"review_sentiment": 5.0, "review_text": "Following up on the decadent love affair with France for middle-aged Katherine Price and her own newly found chance at loves comes Promises to Keep telling the what comes after the Happily Ever After.Promises to Keep is the second book in the Love in Provence series and continues the story begun in book one, The Promise of Provence.  It also continues my deepening love for this story and the narrator.  I found the first book thoughtful, engaging, and a decadence for the senses, but this book solidified all I enjoyed and added just that extra bit of sparkle that I can't even explain.There is a suspense element, but this is not a suspenseful story.  No, it is the ongoing gentle love affair Katherine feels for Phillipe and for this corner of France.  I enjoyed getting more of Phillipe's past and his present as well as his stronger presence in the story scenes.  Katherine is still the main narrator, but Phillipe's occasional thoughts are there.There were new friends to meet and deepen friendship from a lady artist living high in a medieval mountain town, to family in Leon, and another older and mysterious lady artist living in seclusion near the village.  Trips to Marseilles, truffle hunting in the season, back to Provence farm country for visits to old friends, and other interesting places encourage Kat to follow her passion for photography and join Phillipe in his for cheese.What remained the same was the joy of exploring places, people, art, music, and yes... the cuisine of the region.  As this book's events were largely over the holiday season there are beautiful home for the holidays, village preparation and celebration, and personal holiday scenes that were heartwarming and beautiful.  Have I mentioned just how lush and colorful this author's writing is?I think the suspense element tightened up the story for me, but also the fact that introductions are over as well as some of the earlier, painful growth moments for Kat after her husband left her.  She's more than reconciled to her new life with just a few hesitations and she is ready to embrace new adventures.  The tone of the book is overall joie de vivre.Janet Metzger continues to wrap her gentle yet husky voice around the story with a lovely command of accents, emotions, pace, and description.  She is such a fantastic match for this story and a very talented narrator.All in all, this series just keeps getting better and I look forward to the final leg of the trilogy after a startling situation arises at the end of this book.  Those who enjoy women's fiction, travel fiction, mild contemporary romance, foodie stories, friendship stories, or any and all the above are definitely the target group for my recommendation."}, {"review_sentiment": 5.0, "review_text": "If you love France or have never been but always wanted to go... Enjoy it thru reading these books...I loved all three and hope Patricia Sands writes a 4th!"}]}, "authors": ["Patricia Sands"], "isbn": "1503947335", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Promises to Keep (Love in Provence)", "word_cloud": "love adventure friends relatives very charming enjoy learn french word well custom meal tradition want buy canton thank write food n scenery detail sometimes lengthy nice quiet story look calm bed recommend someone spend time area speak french absolutely enjoy detail excellent hungry french cuisine countryside second trilogy writing character believable story a virtual travelogue trilogy find romance lead friendship develop continue deepen remain mystery begin also wrap quite nicely able guess quite surprise borrow local library enjoy story much always favorite country lucky enough visit twice yr ago week ten day second time granddaughter family city hr drive visit many time delight u describe fun explore first third tomorrow please enjoy thoroughly feel visit character comfortable whole theme locale goodness write enjoyment r enjoy first series drag little regard drug trafficking really part story line closure perhaps something yet discover next definitely series so far travel guide story unpleasant story description little detailed follow decadent affair newly find chance love come tell come happily ever second series continue story begin also continue deepen story narrator find first thoughtful engage decadence sens solidify enjoy add extra bit sparkle even element suspenseful story ongoing gentle affair feel corner enjoy get past present well stronger presence story scene still main narrator thought new friend meet deepen friendship lady artist live high medieval mountain town family older mysterious lady artist live seclusion village hunt season back farm country visit old friend interesting place encourage follow passion photography join remain joy explore place people art music cuisine region event largely holiday season beautiful home holiday village preparation celebration personal holiday scene heartwarming beautiful have mention lush colorful author write think suspense element tighten story also fact introduction well earlier painful growth moment husband leave reconcile new life hesitation ready embrace new adventure tone overall join continue gentle yet husky voice story lovely command accent emotion pace description fantastic match story talented series keep get better look forward final leg trilogy startle situation arises end enjoy woman fiction travel fiction mild contemporary romance foodie story friendship story definitely target group recommendation love never always want read love hope writes", "genres": ["Fiction & Literature", "Romance", "Women's Fiction"], "summary": "Book 2/3 in the Love in Provence Series\r\n\r\nThe painful memories from her life back in Toronto will never be distant enough, but Katherine Price finds peace under the autumn sky in the South of France…and a deepening, dizzying love with Philippe. Together, they savor the delicacies and splendor of life, toasting to a future filled with happiness and hope—a life far away from the heartache they both knew so well.\r\n\r\nBut during a trip to the medieval village of Entrevaux, a strange note turns into a dangerous car chase. Philippe reveals he has a troubling secret—and the couple’s new life together threatens to crumble before it can begin. Now that Katherine has everything she’s ever wanted, is she about to lose it all?\r\n\r\nPromises to Keep is the heartfelt second addition to award-winning author Patricia Sands’s Love in Provence trilogy—and a stirring reminder that it’s never too late to be joyfully surprised by love, life, or even yourself.", "asin": "1503947335", "rank": "584641", "city": "Provence", "image": "https://images-na.ssl-images-amazon.com/images/I/51IyWEeKt3L.jpg", "country": "FR", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}