{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 27, "rating": 3.8, "reviews": [{"review_sentiment": 3.0, "review_text": "It was okay but a little boring at times Readable"}, {"review_sentiment": 3.0, "review_text": "Here’s a book I’ve been meaning to read for a long time.  I knew that The Awakening, published in 1899, represented an important expression of feminist ideas, a controversial subject at the time.  I did not know that it is also a story about depression.How to be happy inside oneself.  That is Edna Pontellier’s chief struggle.  The novel begins at Grand Isle, a vacation resort in the Gulf of Mexico, off the shores of New Orleans.  Edna is twenty-eight, married to Leonce, a successful businessman and they are summering with their young boys and other wealthy families.  It is during this summer that Edna begins to question her marriage, her role as a mother and the choices that led to them.  A close relationship with Robert Lebrun, the son of Grand Isle’s proprietor, teeters on the edge of infidelity.Edna’s outward appearance suggests happiness and success, but her inner self has always known something darker.  She begins to feel that above all else, she will not be happy until she tends to this side.  Instead of merging her outward persona with her private identity, however, Edna’s two beings bang up against each other.Chopin writes:\"At a very early period she had apprehended instinctively the dual life – that outward existence which conforms, the inward life which questions.\"Edna’s modern ideas are bound to shake up her life, during a time when women played submissive roles in marriage and society.  Women were expected to fit into the conventional scheme.  To sacrifice for their husbands and their children.  But Edna, in an argument with her friend Madame Ratignolle, states that she would never sacrifice herself for her children, or for anyone.\"I would give up the unessential; I would give my money, I would give my life for my children; but I wouldn’t give myself.\"From this point begins Edna’s awakening, and when Robert abruptly departs for Mexico, Edna suddenly feels that she has been denied his love.  Summer ends and nothing will be the same when the Pontelliers return to New Orleans.  Edna exhibits increasingly reckless and alarming behavior and it’s only a matter of time before something gives.I’ll leave out the ending and simply state that its finish made me completely change my feelings about Edna’s character.  I was sympathetic and supportive at first, but her final actions make me think two things.  One, that Edna had a pretty good life before her awakening.  She had money, servants, and people to take care of her children.  While Leonce had certain expectations of Edna and her role as wife and mother, he took his role as husband and money-maker seriously.  It seems natural for him to think that she hasn’t held up her end of the deal.  My second opinion is that this first idea can’t apply to Edna’s character, because, above everything else, she is suffering from depression and no amount of logic or reason can change her thoughts.  How strange, however, to merge an awakening of feminist thinking with depression.  I’m left unsure of the story’s message."}, {"review_sentiment": 2.0, "review_text": "I liked the concept of the book, especially considering when it was written. It's about a woman discovering herself in a time when a woman's role was to be a wife and mother. So why only two stars? The book was painfully slow moving and I had no emotional connection to Edna or any of the other characters as there was no depth there."}, {"review_sentiment": 5.0, "review_text": "There's a reason this blew up in the 70s. It's great!"}, {"review_sentiment": 5.0, "review_text": "There is a slow start to this book but hold on to your seat because you will be taken on a rollercoaster of emotions."}, {"review_sentiment": 5.0, "review_text": "I've never read it, but both of my kids had to for a College Eng class. They both enjoyed it."}, {"review_sentiment": 1.0, "review_text": "The story sounded interesting when I first looked at it but it ended up being slow paced. I was often frustrated with the direction that the story took and also did not like the format it was written in"}, {"review_sentiment": 3.0, "review_text": "School Project!"}, {"review_sentiment": 5.0, "review_text": "Classic!"}, {"review_sentiment": 1.0, "review_text": "This is without question or shadow of a doubt the WORST BOOK I HAVE EVER READ. This is supposed to be a \"hallmark of the feminist awakening\", but all it is is a rich wife complaining about her life, experimenting with lesbianism, and eventually committing suicide. Oops, sorry to spoil the ending. Oh well, Chopin's writing is so poor I had to reread the last chapter three times to be sure the main character was (finally) dead. She swims out into the surf and drowns herself. And once I was sure that what was what happened I was elated. It would have been a much better book if the main character had simply divorced (or murdered) her husband in the first chapter."}]}, "authors": ["Kate Chopin"], "isbn": "1503293181", "longitude": -90.0701156, "periods": ["1800s"], "title": "The Awakening", "word_cloud": "okay little boring time readable here mean long time know publish represent important expression feminist idea controversial subject time know also story happy chief struggle begin vacation resort shore marry successful businessman summer young boy wealthy family summer begin question marriage role mother choice lead close relationship son proprietor teeter edge outward appearance suggest happiness success inner always know something darker begin else happy tends side instead merge outward persona private identity however being bang writes early period apprehend instinctively dual life outward existence conforms inward life question modern idea bind life time woman play submissive role marriage society expect fit conventional scheme husband child argument friend state never child anyone unessential money life child give point begin abruptly depart suddenly feel deny end nothing return exhibit increasingly reckless alarm behavior matter time something leave end simply state finish make completely change feeling character sympathetic supportive first final action make think thing pretty good life money servant people take care child certain expectation role wife take role husband seriously seem natural think hold end deal second opinion first idea apply character everything else suffer depression amount logic reason change strange however merge feminist think depression leave unsure story message like concept especially consider write woman discover time woman role wife so star painfully slow move emotional connection character depth reason blow great slow start seat take roller coaster emotion never kid class enjoy story sound interesting first look end slow paced often frustrated direction story take also like format write classic question shadow doubt have ever suppose hallmark feminist rich wife complain life experiment lesbianism eventually commit suicide sorry spoil end well write poor reread last chapter time sure main character finally dead swim surf drowns sure happen elate much better main character simply divorce murdered husband first chapter", "genres": ["Fiction & Literature"], "summary": "The Awakening, originally titled A Solitary Soul, is a novel by Kate Chopin, first published in 1899. Set in New Orleans and the Southern Louisiana coast at the end of the nineteenth century, the plot centers on Edna Pontellier and her struggle to reconcile her increasingly unorthodox views on femininity and motherhood with the prevailing social attitudes of the turn-of-the-century American South. \r\n\r\nIt is one of the earliest American novels that focuses on women's issues without condescension. It is also widely seen as a landmark work of early feminism, generating mixed reaction from contemporary readers and criticism. \r\n\r\nThe novel's blend of realistic narrative, incisive social commentary, and psychological complexity makes The Awakening a precursor of American modernist literature; it prefigures the works of American novelists such as William Faulkner and Ernest Hemingway and echoes the works of contemporaries such as Edith Wharton and Henry James. \r\n\r\nIt can also be considered among the first Southern works in a tradition that would culminate with the modern masterpieces of Faulkner, Flannery O'Connor, Eudora Welty, Katherine Anne Porter, and Tennessee Williams.", "asin": "1503293181", "rank": "32980", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/414baqeBhlL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}