{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 683, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "I loved reading about life in one of my favorite places in the world to visit. It was all so accurate that I could feel myself once again enjoying the countryside of Provence. Thank you for sharing."}, {"review_sentiment": 5.0, "review_text": "I became stronger reading this book.  It felt as though I was there visiting France myself.  I experienced and faced my own emotions of fear, anger, sadness, excitement, joy, and happiness through this book.  It was so well written.  My heartfelt applause to Ms. Sands for her incredible gift of writing.  This book offers an exciting future for us all."}, {"review_sentiment": 5.0, "review_text": "Characters well developed and believable. Story thoroughly enjoyable. Read it with Google handy to look up all the areas mentioned in the story. The descriptions of the areas visited in the book were very inviting and created a desire within me to go to Provence."}, {"review_sentiment": 3.0, "review_text": "The descriptions of France were interesting, but there was too much useless information not pivotal to the story that made the story drag.  The mother's story was the highlight of the book.  The character development was non existent and the main character seemed too much of a Pollyanna for me.  It irritated me that she just let the guy at the hotel off the hook."}, {"review_sentiment": 5.0, "review_text": "Excellent romance with a travel guide of Provence. This author not only has a well developed story, but also describes the places in Toronto and Provence so well that one feels as if they are there as part of the scenery. The characters are mature adults in believable relationships. It is exciting to escape to previously unknown destinations. I borrowed this book from my local library."}, {"review_sentiment": 5.0, "review_text": "Finally! A romance that was so relatable. And such a beautiful place to be taken to. It made me feel like life is far from over just because you’re over 30. I am definitely going to any number of the places described in this novel and on top of that, I will be buying a lot of wine and cheese! Going to look into the Home exchange too."}, {"review_sentiment": 5.0, "review_text": "such a powerful, real story! i felt i was a part of the story of pain, new love and happiness."}, {"review_sentiment": 5.0, "review_text": "Couldn't put the book down.Felt every emotion of the main character!!Looking forward to book 2."}, {"review_sentiment": 3.0, "review_text": "It's a really slow read but the historical facts of France are great.  I'm glad she finally found who she needed to be with in the end."}, {"review_sentiment": 4.0, "review_text": "I have done some traveling in the areas mentioned in the book. Not only traveling the globe, but I also have traveled the path of several losses and having to create new identities through each journey. The author has done a great job in conveying it in the story.What was so enjoyable about the book were the descriptions of the villages in Provence and later in the story; the descriptions of the Antibes area. The descriptions of S. France assisted giving the story more depth & color.The issues of loss, renewal of identity, and friendships were dealt with and written in a realistic manners. Also loved, that the story continued to develop and did not just stop, as a lot of other authors have done in the writing of their stories.Kudos to you, Patricia! Looking forward to reading Book #2👍🏾😉"}]}, "authors": ["Patricia Sands"], "isbn": "1503945642", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "The Promise of Provence (Love in Provence)", "word_cloud": "love read life favorite place world visit accurate enjoy countryside share become stronger read felt visit experience face emotion fear anger sadness excitement joy happiness well write heartfelt applause incredible gift write offer exciting future character well develop believable thoroughly enjoyable handy look area mention story description area visit invite create desire go description interest much useless information pivotal story make story mother story highlight character development non existent main character seem much irritate let guy hotel hook excellent romance travel guide author well developed story also describe place well feel part scenery character mature adult believable relationship excite escape previously unknown destination borrow local library finally romance repeatable beautiful place take make feel life far definitely go number place describe top buy lot wine cheese go exchange powerful real story felt part story pain new love happiness put emotion main character look forward really slow historical fact great glad finally find need end do travel area mention not travel globe also travel path several loss create new identity journey author do great job convey enjoyable description village later story description area description assist give story depth issue loss renewal identity friendships dealt write realistic manner also love story continue stop lot author do write look forward read", "genres": ["Fiction & Literature", "Romance", "Women's Fiction"], "summary": "Book 1/3 in the Love in Provence Series\r\n\r\nOn the evening of her twenty-second wedding anniversary, Katherine Price can’t wait to celebrate. But instead of receiving an anniversary card from her husband, she finds a note asking for a divorce.\r\n\r\nFifty-five and suddenly alone, Katherine begins the daunting task of starting over. She has her friends, her aging mother, and her career to occupy her, but the future seems to hold little promise—until, after a winter of heartbreak, Katherine is persuaded to try a home exchange holiday in the South of France.\r\n\r\nIn Provence, bright fields of flowers bloom below medieval hilltop villages with winding cobblestone streets. Charmed by the picturesque countryside, the breathtaking Côte d’Azur, and the enchantment-filled boulevards of Paris, Katherine feels life opening up once again. Lavender perfumes the air, and chance encounters hint at romance and passion. But memories of heartbreak and betrayal linger—and her former life waits for her back home. Can she find the courage to begin again?\r\n", "asin": "1503945642", "rank": "241631", "city": "Provence", "image": "https://images-na.ssl-images-amazon.com/images/I/51WG8Ji9iCL.jpg", "country": "FR", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}