{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 642, "rating": 4.4, "reviews": [{"review_sentiment": 1.0, "review_text": "Fake book"}, {"review_sentiment": 4.0, "review_text": "I had to read this book for my French lit class and out of all the books I read in the class this was my favorite."}, {"review_sentiment": 1.0, "review_text": "The Kindle version of this edition was received without chapter 1.  It had the preface but started the story at chapter 2.  I verified this by comparing the chapter heading with information on-line .  Sadly I had to return the book."}, {"review_sentiment": 3.0, "review_text": "I expected something a bit more profound from Voltaire."}, {"review_sentiment": 5.0, "review_text": "Doesn't get much better than this amusing, ironic, and philosophic send up from the 18th century. Teaching it is as fun as reading it. When your students get the gags and the contemporaneous political statements it is so rewarding. Timeless."}, {"review_sentiment": 4.0, "review_text": "A good take on the twists and turns, ups and downs of life. I admire Voltaire’s exploration of these events and the philosophy which underlined the way one perceives them."}, {"review_sentiment": 4.0, "review_text": "Voltaire had an interesting and sometimes tumultuous relation with \"The Church\" and religious thought of his time.  In Candide, he takes great pains to ridicule the writings of both Milton and Alexander Pope, more specifically the latter in An Essay on Man, in which both writers attempt to \"vindicate the ways of God to man\".  To understand this, or better, to have read these writings will further illuminate what Voltaire is attempting in Candide.Candide is the protagonist and is a seemingly good-hearted but rather simple fellow whose mentor, Pangloss, teaches him that no matter what happens it is always for the best.  As a note, pay attention to each of the main characters names as they seem to me to have a descriptive quality to them, e.g. Pan, meaning \"all\" and gloss from the Greek glossa, meaning tongue, to get a name that roughly means \"all talk\".The story begins with Candide and his love interest being suddenly separated and the events of his life from there.  What follows in the story is a series of horrible events mixed with some virtuous ones that Pangloss continuously explains to Candide that whatever happens is for the best.Even if you have no philosophical interest, the book is both funny and sad, entertaining yet thought provoking with a couple of memorable passages.  I consider it a pretty good read and, as a bonus, a quick one."}, {"review_sentiment": 5.0, "review_text": "Great"}, {"review_sentiment": 5.0, "review_text": "A great classic - and relevant today!"}, {"review_sentiment": 5.0, "review_text": "Really great read!"}]}, "authors": ["Voltaire"], "isbn": "1503253791", "longitude": -9.1365061, "periods": ["1700s"], "title": "Candide", "word_cloud": "fake french lit class class favorite version edition receive chapter preface start story chapter verify compare chapter head information sadly return expect something bit profound much better amuse ironic philosophic send century fun read student get gag contemporaneous political statement reward timeless good take twist turn ups down life admire exploration event philosophy underline way perceives interesting sometimes tumultuous relation religious think time take great pain ridicule writing specifically latter man writer attempt vindicate way man better writing illuminate attempt protagonist seemingly rather simple fellow mentor teach matter happen always best note pay attention main character name seem descriptive quality meaning gloss gloss mean tongue get name roughly mean talk story begin love interest suddenly separate event life follow story series horrible event mixed virtuous one continuously explain happen philosophical interest funny sad entertaining yet think provoke couple memorable passage consider pretty good bonus quick great great classic relevant today really great", "genres": ["Fiction & Literature"], "summary": "Candide is a French satire first published in 1759 by Voltaire, a philosopher of the Age of Enlightenment. It begins with a young man, Candide, who is living a sheltered life in an Edenic paradise and being indoctrinated with Leibnizian optimism (or simply \"optimism\") by his mentor, Professor Pangloss. The work describes the abrupt cessation of this lifestyle, followed by Candide's slow, painful disillusionment as he witnesses and experiences great hardships in the world. \r\n\r\nVoltaire concludes with Candide, if not rejecting optimism outright, advocating a deeply practical precept, \"we must cultivate our garden\", in lieu of the Leibnizian mantra of Pangloss, \"all is for the best\" in the \"best of all possible worlds\". Candide is characterised by its sarcastic tone as well as by its erratic, fantastical and fast-moving plot. A picaresque novel with a story similar to that of a more serious bildungsroman, it parodies many adventure and romance clichés, the struggles of which are caricatured in a tone that is mordantly matter-of-fact. \r\n\r\nStill, the events discussed are often based on historical happenings, such as the Seven Years' War and the 1755 Lisbon earthquake. As philosophers of Voltaire's day contended with the problem of evil, so too does Candide in this short novel, albeit more directly and humorously. Voltaire ridicules religion, theologians, governments, armies, philosophies, and philosophers through allegory; most conspicuously, he assaults Leibniz and his optimism. \r\n\r\nAs expected by Voltaire, Candide has enjoyed both great success and great scandal. Immediately after its secretive publication, the book was widely banned because it contained religious blasphemy, political sedition and intellectual hostility hidden under a thin veil of naïveté. However, with its sharp wit and insightful portrayal of the human condition, the novel has since inspired many later authors and artists to mimic and adapt it. \r\n\r\nToday, Candide is recognized as Voltaire's magnum opus and is often listed as part of the Western canon; it is arguably taught more than any other work of French literature. ", "asin": "1503253791", "rank": "38560", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/41TVWxre4xL.jpg", "country": "Portugal", "story_arc": ["Tragedy", "Things only get worse"]}