{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 3747, "rating": 4.3, "reviews": [{"review_sentiment": 3.0, "review_text": "Not a great story.  I would have preferred if it wasn't told as him telling a story.  In would have preferred if it had been told as it was happening. Glad it was short as in probably would have put it down after the first couple of chapters."}, {"review_sentiment": 5.0, "review_text": "As described - great condition!"}, {"review_sentiment": 5.0, "review_text": "Great reading"}, {"review_sentiment": 5.0, "review_text": "The story often thrilling is under scored by a genuine fear that over takes the reader of a future that promises nothing when all human efforts is expunged by forces we have no say. Only by the most minute  elements of our nature made by the Creator saves us. When all that is lost is suddenly given back do we have the sense of all we over looked in life is now seen differently. War of the Worlds is more than a thrilling story of invasion but rather an insight to ourselves."}, {"review_sentiment": 5.0, "review_text": "Ralph Ellison takes the reader on a tumultuous journey, following our protagonist, from the moment his troubles began at the Golden Day, till the moment he truly became invisible in the avant-garde, or perhaps the rear, of the underground. This book is as actual in 2017, as it was fifty years ago. Superb read."}, {"review_sentiment": 2.0, "review_text": "Typically, I really enjoy the classics, but H.G. Wells' Invisible Man didn't do it for me.  The story was slow paced, which usually isn't an issue with me, but that was coupled with the fact that the characters and writing were dull.  I lost interest very quickly."}, {"review_sentiment": 5.0, "review_text": "I like big butts and I won't lie, and this did not contain big butts, but the story was rather decent."}, {"review_sentiment": 3.0, "review_text": "This review is for the Kindle version of the Audible edition.The narration was excellent. I find the story to be of shallow imagination, narrow, and short-sighted vision of possibilities open to a person of higher education and strong intelligence such as the protagonist of the story. His avenues of possible options were so common and lacked creativity. What could have been done with such an advantage is far greater than the author perceived and pursued in this rather disappointing story."}, {"review_sentiment": 5.0, "review_text": "good quick read!"}, {"review_sentiment": 5.0, "review_text": "This is a great book. His description of the planet's landscape and animal life after the sun starts to die made the hair stand up on the back of my neck. It's beautifully written."}]}, "authors": ["H. G. Wells"], "isbn": "1505852595", "longitude": -0.12574, "periods": ["1800s"], "title": "The Time Machine", "word_cloud": "not great story tell tell story tell happen short probably first couple chapter describe great condition reading story often thrill score genuine fear take future promise nothing human effort expunge force say only minute element nature make save lose suddenly give sense look life see differently thrill story invasion rather insight take tumultuous journey follow protagonist moment trouble begin moment truly become invisible perhaps rear actual fifty year ago typically really classic story slow pace usually issue couple fact character write dull lose interest quickly like big butt contain big butt story rather decent review version narration excellent find story shallow imagination narrow vision possibility open person higher education strong intelligence protagonist story avenue possible option common lack creativity do advantage far greater author perceive pursue rather disappointing story good quick great description planet landscape animal life sun start die make hair back neck beautifully write", "genres": ["Fiction & Literature", "Science Fiction"], "summary": "The Time Machine is a science fiction novel by H. G. Wells, published in 1895. Wells is generally credited with the popularisation of the concept of time travel by using a vehicle that allows an operator to travel purposefully and selectively. \r\n\r\nThe term \"time machine\", coined by Wells, is now universally used to refer to such a vehicle. This work is an early example of the Dying Earth subgenre. The portion of the novel that sees the Time Traveller in a distant future where the sun is huge and red also places The Time Machine within the realm of Eschatology; that is the study of the end times, the end of the world, and the ultimate destiny of mankind. \r\n\r\nThe Time Machine has since been adapted into two feature films of the same name, as well as two television versions, and a large number of comic book adaptations. It has also indirectly inspired many more works of fiction in many media.", "asin": "1505852595", "rank": "30017", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41wZrlOx3WL.jpg", "country": "England", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}