{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 10, "rating": 3.7, "reviews": [{"review_sentiment": 2.0, "review_text": "Imagine you're in late 19th century and  Martians are invading London. The main charter must survive a dangerous invasion on the city . He is low on supplies and is scared. What would you do to live? Where would you go? Find out what he does in war of the worlds?  War of the Worlds is a great book with a great topic. The reason why I didn't like it and gave it two stars is its description. The books has little description. The main charter has no name. Even though it boring and low on description, it's still a great book and a classic.  A good book should be compelling War of the Worlds was not. You could  almost predict what the main charters next actions will be. For example; \"After the glimpse I had of the Martians emerging from the cylinder in which they had come to Earth from.\" (Page 22).To me it does not hook you in and make you want to read more.  War of the Worlds, that name sticks out. Sounds like action packed book... No War of the Worlds is dull and boring. There is a whole page dedicated to a crack in the wall!!! The book is mostly talking, describing, and inner thinking not a lot of action. Here is another example, \"I did not dare to go back towards the pit, but I felt a passionate longing to peer back into it.\" (Pg. 25). This was part of a whole page of narrator making up his mind to go to the pit or not.  This novel gave a weak reaction to me as a reader. It was dull and confusing. The book gives no description and no laughter. Overall very very  boring. A final piece of evidence on , \"When I should have stood up, though I died for it and called upon them to repent, repent.\"(page 155). This was a super boring and confusing part of this book.  In Conclusion War of the Worlds is a boring, dull, non-action packed book. War of the Worlds is a classic book and was made when I wasn’t even born yet. It was made in December 1897. So quite a while ago. Thank you for reading."}, {"review_sentiment": 5.0, "review_text": "Classic!!"}, {"review_sentiment": 1.0, "review_text": "This is a review for the copy of the War of the Worlds I received, not for the book itself.  The actual book is a classic and H. G. Wells is an author worth reading more of.  I actually read this book once in the context of an environmental history class, and in that consideration, War of the Worlds has a very different flavor!No, my one-star review is for this particular edition of WotW.  I ordered the paperback version from this listing.  To summarize, this printing is horribly formatted and clearly was made to minimize production costs.  This comes at the expense of the reading experience.  I feel for anyone who read WotW for the first time from this copy - they probably hated it.To start with, the cover features a really low resolution image.  The image looks like it would be fine as a thumbnail, not blown up as a horribly pixelated book cover.Second, unlike with other books, there is minimal division between chapters.  Whereas in other books, a new chapter would be denoted by the turn of a page, this book cut that \"unnecessary\" extra space in lieu of a single carriage return and a bolded headline with the chapter's name and number.  There's no acknowledgement of the break that chapters provide - the printers just wanted to minimize empty space.Then, instead of italicizing certain words and titles that appear throughout the book, the printers opted to emphasize them by simply throwing them into all caps.  This is incredibly distracting when reading; I'd be struggling through the other crappy features of this edition when all of a sudden, my inner reading voice shouts like the \"Daily Mail\" was being broadcast via bullhorn.In addition, there are a myriad of instances where the printing breaks a word by a hyphen followed by a space.  Needless to say, this is just plain aggravat- ing.Then there are the times when the justified text makes zero consideration for a shorter line and spreads out the words at the end of a paragraph like they're on some Medieval torture device.The formatting issues are not ones that I feel are overly picky to point out.  They interrupt the flow of the reading and distract from the superb quality of the story.  It's as if the printers put a Dr. Martin Luther King, Jr. quote on a poster but with comic sans font, bright red lettering, and a neon-green drop shadow.  These issues take away from a classic of science fiction.  Honestly, it's a crying shame that's gotten me all smarmy.Overall, I do not recommend this paperback copy of this excellent book to anyone.  The printers of this edition clearly valued efficiency and price over representing this hallmark of literature with honor."}, {"review_sentiment": 5.0, "review_text": "One of the characters in War of the Worlds talks about how people live their lives in fear. They buy insurance because they fear catastrophe. They work at jobs they hate because they fear a loss of security. They scurry home and stay indoors because they are afraid of the dark. On Sundays they fear the hereafter. They want only “safety in their one little miserable skedaddle through the world.” Now they have something real to fear -- Martians. Even after the invasion, some will be happy to be caught and caged, because to “submit to persecution and the will of the Lord” is easy, and what people really fear is thinking for themselves.I think that little speech by a soldier in the second part of War of the Worlds highlights one of the novel’s best themes. You’re either content to be a rabbit in a cage or you have the will to take risks. The soldier thinks that most people can’t be saved from the Martians but most aren’t worth saving. Knowledge and ideas are worth saving, the sum of human accomplishment. With time and rescued knowledge, humankind will be able to fight the Martians (or so the soldier hopes), to stage a comeback after a devastating defeat. But is that realistic or is it folly? The book’s narrator calls the soldier a “strange undisciplined dreamer of great things,” but perhaps those are the people we should strive to be in time of crisis.Focused myopically on their own lives, early twentieth century humans failed to appreciate that Martians might exist or that humans might have something Martians would desire: a healthy planet. Mars and the life it sustains are coming to an end. The Martians want Earth.The narrator of War of the Worlds is curious when a cylindrical object crashes near his home. He’s still curious when the top unscrews and creatures with tentacles scramble into the crater that was created by their crashing vessel. He’s vexed when the creatures assemble a heat ray that systematically sets trees, buildings, and people on fire. Fortunately, the sweep of the heat ray is not extensive (hiding behind the nearest hill provides adequate protection) so the narrator assumes the military will make short work of the Martians. That assumption gives way to panic when more cylinders fall and mechanized tripods begin to wander about, deploying heat rays and poisonous black clouds to wipe out cities and their defenses.As you probably know, the Martians kick human butt for most of the novel. War of the Worlds is about badly behaving Martians, but it is also about badly behaving humans. Running from the Martians, people trample each other, throw each other from escaping boats, take advantage of weakness, and generally put their own lives above everyone else’s. The narrator’s brother is an exception, and there are a few others, including the soldier mentioned at the beginning of this review, but Wells’ view of mankind as a whole is rather dim. The epilogue, on the other hand, suggests an optimistic vision of the future.Most people who have not read The War of the Worlds probably know how it ends, but I won’t spoil it for those who don’t. I will say only that the ending is a testament not only to Wells’ vivid imagination, but to his understanding that human beings (and even Martians) are not necessarily the most powerful entities in this vast universe. It is only hubris that makes us (or Martians) believe we thrive and survive because we are superior. Wells makes clear that humility always defeats hubris. That is the other timeless theme that makes The War of the Worlds an enduring contribution to the history of literature."}, {"review_sentiment": 5.0, "review_text": "I always enjoy reading the odd classic now and then. There's something to be said about the way the early masters portrayed stories. Much effort was spent on character emotions. The ability to emote with the protagonist was very easy.Another enjoyable aspect is the setting. When written, the author made the story at that current time. Now, over one hundred years later, the setting is from an age gone past and made the details so much more picturesque.For anyone looking to immerse themselves in classic science fiction, they need look no further than this one."}, {"review_sentiment": 5.0, "review_text": "My world of science fiction is still mostly Morlocks and Martians.And so is the world of science fiction in general, due to H. G. Wells. Just as J. R. R. Tolkien defined modern literary fantasy, H. G. Wells defined science fiction - but even more definitively. Whereas one might classify fantasy as Tolkien and pre-Tolkien, it is hard to even identify anything prior to Wells as recognizably science fiction. Similarly to Tolkien for fantasy, he is commonly hailed as the father of science fiction, but more so than Tolkien, as there are few contemporaries or predecessors that can rival this parental title. Some claim Jules Verne as the father of science fiction, but he lacks the same impact for me. Brian Aldiss more justifiably claimed Mary Shelley as the mother of science fiction, although she still seems more Gothic fantasy to me - particularly without all the, you know, science that we see in the cinematic adaptations. (Shelley was understandably scant on the process of the monster's creation and does not describe it in her narrative, other than vague references to chemistry experiments - as opposed to the electricity and \"it's alive!\" and the rest of the monster's creation that is the most iconic part of the cinematic adaptations).However, Wells gave science fiction its most archetypal themes and tropes, notably time travel and alien invasion (not to mention steampunk) - and he did so in just two short novels, The Time Machine and The War of the Worlds. Indeed, those two novels are arguably the mythic heart of science fiction.Wells' The War of the Worlds, published in 1898, was similar to other works in the genre of British 'invasion literature' at that time, but with a fundamental distinguishing feature that made it a definitive work of science fiction - as opposed to invasions by human armies (typically German but also French or Russian), this was a genuinely alien invasion from Mars, as is made clear in its immortal opening line:\"Yet across the gulf of space, minds that are to our minds as ours are to those of beasts that perish, intellects vast and cool and unsympathetic, regarded this earth with envious eyes, and slowly and surely drew their plans against us\".And so the Martians descend upon Britain (near Woking in Surrey) in their spaceship 'cylinders' and attack the heart of the British Empire in their tripods armed with heat rays - although in the actual narrative, the Martian forces are not as strong as one might expect for advanced aliens able to invade other planets through space (and tripods would seem to be even less stable and more useless than Imperial Walkers). After all, Martian tripods are destroyed by nineteenth century artillery and ironclad ship. Pathetic! We'd mop the floor with those Martians with our modern military forces. In the end, however, it is the Martians mopping up Britain, just as the British Empire wiped out the indigenous people of Tasmania, a pointed observation made by Wells. The Martians nourish themselves on human blood like space vampires, matched by their red weed vegetation choking out Earth's native plant life. Fortunately, the Martians and their vegetation succumb to Earth's bacteria and viruses, in what must rank as one of the most incredible oversights by an invading alien force although more infinitely more credible than the computer virus in Independence Day.The War of the Worlds has a large sphere of narrative or thematic influence in science fiction, amongst them the Alien films. For that matter, it (like The Time Machine) has so many adaptations (including parallel or sequel stories) that I'm beginning to think it actually happened. (After all, there is a statue of a Martian tripod in Woking). And in a way it did happen - twice - but by human nations fighting their own war of the world…RATING: IT'S A RAVE - 5 STARS*****"}, {"review_sentiment": 4.0, "review_text": "This book is indisputably a classic; there are things I really enjoyed about it. While I was very impressed with both H.G. Wells's imagination and scientific forethought, parts of this book were quite difficult to read. War of the Worlds in divided in Book I and Book II. Book I is very slow moving, and the narrator frequently stops moving the plot forward in order to give highly detailed descriptions of the scene around him. While I know that this is important to demonstrate the horror of the situation, it was tedious for me to read. I nearly gave up. But Book II is fantastic. The story moves along quickly, and it is full of astute observations on human nature.I've never seen any of the movies. I'm glad I began with the book and did not have to purge from my brain ghastly images other reviewers have mentioned."}, {"review_sentiment": 5.0, "review_text": "I love this novel."}, {"review_sentiment": 3.0, "review_text": "ok"}, {"review_sentiment": 4.0, "review_text": "Good show"}]}, "authors": ["H. G. Wells"], "isbn": "1505260795", "longitude": -0.12574, "periods": ["1800s"], "title": "The War of the Worlds", "word_cloud": "late century invade main charter dangerous invasion city low supply scar great great topic reason like give star description little description main charter name even bore low description still great classic good compelling almost main charter next action example glimpse emerge cylinder come hook want name stick sound action pack dull boring whole page dedicate crack wall mostly talk describe inner thinking lot action here example dare back pit felt passionate longing peer back part whole page narrator make mind give weak reaction dull confuse give description laughter bore final piece evidence stand die call repent repent page super boring confuse part bore dull packed classic make even bear yet make quite ago reading classic review copy receive actual classic author read actually context environmental history class consideration different flavor review particular edition order paperback version list printing horribly format clearly make minimize production cost come expense read experience feel anyone first time copy probably hat start cover feature really low resolution image image look thumbnail blown horribly pix elated minimal division chapter new chapter turn page cut unnecessary extra space lieu single carriage return bode headline chapter name number acknowledgment break chapter provide printer want minimize empty instead italicize certain word title appear printer opt emphasize simply throw cap incredibly distract read struggle crappy feature edition sudden inner read voice shout broadcast addition myriad instance print break word hyphen follow space say plain time justified text make consideration shorter line spread word end paragraph torture format issue one feel overly picky point interrupt flow reading distract superb quality story printers put quote poster comic sans font bright red lettering drop shadow issue take away classic science fiction cry shame gotten recommend paperback copy excellent anyone printer edition clearly value efficiency price represent hallmark literature honor character talk people live life fear buy insurance fear catastrophe work job hate fear loss security scurry home stay indoors afraid dark sunday fear hereafter want safety little miserable skedaddle now something real fear invasion happy catch caged submit persecution easy people really fear think little speech soldier second part highlight best theme either content rabbit cage risk soldier think people save worth save idea worth save sum human accomplishment time rescue knowledge humankind able fight soldier hope stage comeback devastating defeat realistic folly narrator call soldier strange undisciplined dreamer great thing perhaps people strive time myopically live early twentieth century human fail appreciate human something healthy planet life sustains come end want narrator curious cylindrical object crash home still curious top unscrews creature tentacles scramble crater create crash vessel vex creature assemble heat ray systematically set tree building people fire fortunately sweep heat ray extensive hiding nearest hill provide adequate protection narrator assume military short work assumption give way panic cylinder fall mechanize tripod wander deploy heat ray poisonous black cloud wipe city probably know kick human butt badly behave also badly behave human run people trample throw escape boat take advantage weakness generally put life everyone else narrator brother exception others include soldier mention begin review view mankind whole rather dim epilogue hand suggest optimistic vision people probably know end spoil say end testament vivid imagination understand human being even necessarily powerful entity vast universe hubris make believe thrive survive superior make clear humility always defeat hubris timeless theme make endure contribution history literature always enjoy read odd classic something say way early master portray story much effort spend character emotions ability emote protagonist enjoyable aspect set write author make story current time now year later set age go past make detail much anyone look immerse classic science fiction need look world science fiction still mostly world science fiction general due define modern literary fantasy define science fiction even definitively one fantasy hard even anything prior recognizably science fiction fantasy commonly hail father science fiction contemporary predecessor rival parental title claim father science fiction lack impact justifiably claim mother science fiction still seem fantasy particularly know science see cinematic adaptation understandably scant process monster creation describe narrative vague reference chemistry experiment oppose electricity alive rest monster creation iconic part cinematic adaptation give science fiction archetypal theme tropes notably time travel alien invasion mention steampunk short novel indeed novel arguably mythic heart science publish similar work genre british literature time fundamental distinguishing feature make definitive work science fiction oppose invasion human army typically also french genuinely alien invasion make clear immortal opening line gulf space mind mind beast perish intellect vast cool unsympathetic regard earth envious eye slowly surely drew plan descend spaceship attack heart tripod arm heat ray actual narrative martian force strong advanced alien able invade planet space tripod even le stable useless tripod destroy nineteenth century artillery ironclad ship mop floor modern military force end however mop british wipe indigenous people point observation make nourish human blood space vampire match red weed vegetation choke native plant life fortunately vegetation succumb bacteria virus incredible oversight invade alien force infinitely credible computer virus large sphere narrative thematic influence science fiction film matter many adaptation include parallel sequel story begin think actually happen statue martian tripod way happen twice human nation fight indisputably classic thing really enjoy impress imagination scientific forethought part quite difficult divide slow move narrator frequently stop move plot forward order highly detailed description scene know important demonstrate horror situation tedious nearly give fantastic story move quickly full astute observation human never see movie glad begin purge brain ghastly image reviewer mention love ok good show", "genres": ["Fiction & Literature", "Science Fiction"], "summary": "The War of the Worlds is a science fiction novel by English author H. G. Wells. It first appeared in serialized form in 1897, published simultaneously in Pearson's Magazine in the UK and Cosmopolitan magazine in the US. The first appearance in book form was published by William Heinemann of London in 1898. \r\n\r\nIt is the first-person narrative of an unnamed protagonist in Surrey and that of his younger brother in London as Earth is invaded by Martians. Written between 1895 and 1897, it is one of the earliest stories that detail a conflict between mankind and an extraterrestrial race. The novel is one of the most commented-on works in the science fiction canon. \r\n\r\nThe War of the Worlds has two parts, Book One: The Coming of the Martians and Book Two: The Earth under the Martians. The narrator, a philosophically inclined author, struggles to return to his wife while seeing the Martians lay waste to the southern country outside London. Book One also imparts the experience of his brother, also unnamed, who describes events as they deteriorate in the capital, forcing him to escape the Martian onslaught by boarding a paddle steamer near Tillingham, on the Essex coast.", "asin": "1505260795", "rank": "356735", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41t5FlQEplL.jpg", "country": "England", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}