{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 113, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Great guide to visit Mexico City. The book is organized by sections of the city making it easy to plan your day. We tried several of the suggested restaurants and were not disappointed. The guide helped us have an amazing experience."}, {"review_sentiment": 5.0, "review_text": "I have probably read most of the guides to Mexico City, while making annual trips there to visit family.  This one was discovered by chance on my last trip, but it is now probably my favorite.  The author is an artist and he brings an artistic sensibility to his choice of sights, activities, and restaurants that is very close to my own.  In addition to listings, the book contains 16 walking tours that include the standard sights and off-beat ones as well -- some of his discoveries could be made only by someone who loves Mexico City and is willing to explore its more unusual haunts."}, {"review_sentiment": 5.0, "review_text": "Just returned from CDMX and had an amazing trip.  I used this book in planning the trip and as a reference while I was there.  For a travel book, I found this well organized and easy to read.  I only had four days there so I only used a couple of the walking tours.  I hired a local guide (who grew up and lived in CDMX) to take me to Teotihuacan and so many of the recommendations our guide made reconciled with this book.  I highly recommend.  Note:  The Fonart store near the Alameda has permanently closed."}, {"review_sentiment": 4.0, "review_text": "As someone else commented, this book is mostly walking tours.  I had just a weekend in CDMX and appreciated the walking tours as a way to see a lot of the city in a relatively short time"}, {"review_sentiment": 5.0, "review_text": "Very helpful on my 4 day trip.  Hope to go back and will use this guide again.  What a great city and country."}, {"review_sentiment": 5.0, "review_text": "Loved it..."}, {"review_sentiment": 3.0, "review_text": "Very superficial review of the different places, specially museums. It is a very basic guide. I really prefer Fodor's guides that give much more useful and detailed information."}, {"review_sentiment": 5.0, "review_text": "My wife,14 year old son and I traveled to Mexico City, we used this book as our primary guide of what to do there. I bought it because the sample made it clear that the guide was comprised of walking tours of various neighborhoods, that's exactly what we (at least my wife and I), want to do. This guide saved me hours digging through each neighborhood and finding the highlights. My two cents would be to use this as a starting point, if he's sending you to places or architecture you're not super interested in, you can pass by quickly or skip. He clearly knows and loves the city, we covered maybe 7 of his tours in our 5 days and found it an ideal way to explore and enjoy Mexico City (and yes, we also loved Mexico City)."}, {"review_sentiment": 5.0, "review_text": "Great for my travels. ."}, {"review_sentiment": 5.0, "review_text": "good guide"}]}, "authors": ["Jim Johnston"], "isbn": "1511448334", "longitude": -99.1333416, "periods": ["2000s", "Recent Releases"], "title": "Mexico CIty: An Opinionated Guide for the Curious Traveler", "word_cloud": "visit organized section city make easy plan day try several suggested restaurant disappoint help amaze experience probably guide make annual trip visit family discover chance last trip probably favorite author artist bring artistic sensibility choice sight activity restaurant close addition listing contain walking tour include standard sight one well discovery someone love willing explore unusual haunt just return amazing trip use plan trip reference travel find well organize easy day use couple walking tour hire local grow lived many recommendation make reconcile highly recommend note store permanently close someone else comment mostly walk tour weekend appreciate walk tour way see lot city relatively short time very helpful day trip go back use great city country love very superficial review different place specially museums basic really prefer guide give much useful detail information year old son travel use primary buy sample make clear comprise walking tour various neighborhood exactly least wife want save hour dig neighborhood find highlight cent start point send place architecture super interested pas quickly skip clearly know love city cover maybe tour day find ideal way enjoy also love travel good", "genres": ["History", "Travel Writing"], "summary": "Mexico City, as one of the largest metropoli on the planet, can overwhelm even the most adventurous visitor. Thankfully, Mexico City: An Opinionated Guide for the Curious Traveler lends a thorough, guiding hand to help make the visitor's stay outstanding. \r\n\r\nWritten by a longtime resident who knows the city inside and out, this travel guide delivers detailed walking tours of the city that include the most popular tourist sights as well as lesser-known spots. Johnston knows where to stay, what to do, and where to eat: everything from authentic market food to sophisticated Mexican cuisine.\r\n\r\nWhat began as a collection of notes to share with good friends is now available to every newcomer looking for a joyful, memorable stay in Mexico City. \r\n\r\n\"This is the guidebook that I want. Wonderfully written, airtight information, organized in the smartest possibly way. I can't imagine a better Mexico City guide for these times.\" - Tony Cohan, author of Mexican Days and On Mexican Time. \r\n\r\n\"Johnston is the friend you wish you had in every great city, toting you from palace to museum to park but never missing the exquisite pastelería, the grand hotel lobby or the clean public bathroom.\" -San Francisco Chronicle", "asin": "1511448334", "rank": "15339", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/51Mi2HOxZeL.jpg", "country": "Mexico", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}