{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 42.3604823, "ratings": {"num_ratings": 1719, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Love the book."}, {"review_sentiment": 4.0, "review_text": "This review is for the Kindle version.There are a number of the classic fiction novels with which I was not impressed. This book is not one in which I am disappointed. It is a wonderful example of the author's masterfully skillful command of the English language and ability in writing a novel that flows effortlessly from idea to idea and from point to point from beginning to the end of the novel. I also cannot go without mentioning wonderful expansive vocabulary. His words were a treat to the ear. He describes a historically inspired story in profound details covering the era and the Puritans with full confidence in his knowledge of both. His explanation of his character's cognitive and emotive forces is wonderfully impeccable and in which I found at no time any cause for a fault on his part. I very much enjoyed the book and I am pleased I have allotted the time in my life for which to give it space to be read."}, {"review_sentiment": 5.0, "review_text": "Nathaniel Hawthorne does a great job of including detail, I think that is one of this book's strengths. It also has a very believable moral message, which makes it the classic known around the world. Classic is a repulsive word though, this book doesn't contain all the boring and repetitive characteristics of classics written 6,000 years ago. The book isn't just some ancient work written in an Italian province either. It was written here in america, maybe a little under 200 years ago. Classic maybe, but this is the only classic I'll read."}, {"review_sentiment": 3.0, "review_text": "The Scarlet Letter by Nathanial Hawthorne was a book assigned to me to read and I was prepared to hate it. Upon reading it, however, I found it to be a wonderful novel which still makes valid points today, almost 200 years after it's publication. Hawthorne was deeply insightful in this novel about the intricacies of human nature. The entire novel is a perfect view of all of the flaws in the human race including the vices of jealousy, passion and cowardice. Through the actions of the Reverand Dimmesdale, Hester Prynne and Roger Chillingworth, Hawthorne was able to portray all aspects of emotion. Chillingworth's actions can all be justified by his love for Hester and the intense jealousy he felt for Dimmesdale. Hester's strengths and weakenesses were shown through the great courage she had in staying where she was hated and also in never making her accomplice own up to his actions. I loved this book and even though it was tough to read, it was well worth it."}, {"review_sentiment": 5.0, "review_text": "I couldn't put it down.  Loved it!  Trying to read these classics that I heard of,  but never read.."}, {"review_sentiment": 1.0, "review_text": "I love the Scarlet Letter, but could not get the audio download to work."}, {"review_sentiment": 5.0, "review_text": "Classic American novel dealing with sin, adultery, and religion. Hawthorne has always been one of my favorites, as it is books like these that make him so likable. Highly recommend."}, {"review_sentiment": 5.0, "review_text": "Just as described!"}, {"review_sentiment": 2.0, "review_text": "I just really hated this book.  I hated the whole premise of the story.  I couldn't wait until we were done with it in school"}, {"review_sentiment": 3.0, "review_text": "got it for English assignment"}]}, "authors": ["Nathaniel Hawthorne"], "isbn": "1512090565", "longitude": -71.0595678, "periods": ["1800s"], "title": "The Scarlet Letter", "word_cloud": "review number classic fiction novel impress disappoint wonderful example author masterfully skillful command language ability write flow effortlessly idea idea point point begin end also go mention wonderful expansive vocabulary word treat describe historically inspired story profound detail cover era full confidence knowledge explanation character cognitive emotive force wonderfully impeccable find time cause fault part much enjoy please allot time life space great job include detail think strength also believable moral message make classic know world repulsive word contain boring repetitive characteristic classic write year ancient work write italian province write maybe little year ago maybe classic assign prepare hate read however find wonderful still make valid point today almost year publication deeply insightful intricacy human nature entire perfect view flaw human race include vice jealousy passion cowardice action able portray aspect emotion action justify intense jealousy felt strength weakness show great courage stay hat also never make accomplice action love even tough well classic hear never love audio download work classic american deal sin adultery religion always favorites make likable recommend just describe really hat hat whole premise story do school get english assignment", "genres": ["Fiction & Literature"], "summary": "Like all of Hawthorne's novels, \"The Scarlet Letter\" has but a slender plot and but few characters with an influence on the development of the story. Its great dramatic force depends entirely on the mental states of the actors and their relations to one another, —relations of conscience, — relations between wronged and wrongers. \r\n\r\nIts great burden is the weight of unacknowledged sin as seen in the remorse and cowardice and suffering of the Rev. Arthur Dimmesdale. Contrasted with his concealed agony is the constant confession, conveyed by the letter, which is forced upon Hester, and has a double effect, — a healthful one, working beneficently, and making her helpful and benevolent, tolerant and thoughtful ; and an unhealthful one, which by the great emphasis placed on her transgression, the keeping her forever under its ban and isolating her from her fellows, prepares her to break away from the long repression and lapse again into sin when she plans her flight. \r\n\r\nRoger Chillingworth is an embodiment of subtle and refined revenge. The most striking situation is perhaps \"The Minister's Vigil,\" in chapter xii. The book, though corresponding in its tone and burden to some of the shorter stories, had a more startling and dramatic character, and a strangeness, which at once took hold of a larger public than any of those had attracted. \r\n\r\nThough imperfectly comprehended, and even misunderstood in some quarters, it was seen to have a new and unique quality; and Hawthorne's reputation became national.", "asin": "1512090565", "rank": "25922", "city": "Boston", "image": "https://images-na.ssl-images-amazon.com/images/I/41OgsFocWEL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}