{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 29.3797091, "ratings": {"num_ratings": 8, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Inshallah Habibi (God Willing, Beloved), the Perfect Phrase that Explains the Middle East!!Inshallah Habibi shows the male dominated world of the Middle East. Alsarraf writes about the true tribulations that take place in the Arab world specially the Arabian Gulf. Having lived in that part of the world, I can say he portrays misogyny, taboos and sheikhdom corruption very clearly. If Westerners want to know what goes on in that region, Inshallah Habibi will wake you up to what Western media hides to us here in our safe, comfortable and sheltered world. \"Inshallah Habibi\" is the proverbial catch phrase to \"screw you\"."}, {"review_sentiment": 1.0, "review_text": "There's no story here. Just self absorbed, self righteous ramblings. The reviews & back cover really attracted me, I kept waiting for the shift in the story, but nothing really happens (at all in this book). Not a pleasant read either. It's filled with metaphor after metaphor and horrible pretentious dialog."}, {"review_sentiment": 5.0, "review_text": "A thought provoking story that includes a lesson in the culture of Kuwait and its people that you will not regret having sat still for."}, {"review_sentiment": 5.0, "review_text": "This is a difficult read.  I intend that as a compliment. The writing is excellent. He provokes at every turn.  It is not light reading.I enjoy the style of writing he uses. His words flow much like a wild mountain river. Bouncing, bubbling, rushing, speeding up then slowing, and sometimes nearly still. When an author can capture a character's voice and make them seem real, that is when reading is at it's greatest for me. He takes the reader into Mohammed's world simply by immersing us in it. I found myself intrigued and desiring to learn more of both the character, as well as the culture he lives in. How did he get to where he was when the book started? What had he faced and experienced that caused him to be where he found himself? The same could be asked about the culture around him (my own culture as well). How did it become like it is? What is driving it still?"}, {"review_sentiment": 5.0, "review_text": "I found Mohammed dishearten with society as a whole. So much corruption. So much hypocrisy. In his own way he strives to make a change. He provokes/challenges his friends, family and acquaintances to open their way of thinking. Or perhaps he thrives on pushing those mental/emotional buttons. His favorite escape from the mundane is releasing/relishing his primal needs with any of his collection of lovers. He loves the idea of romance, but not the commitment. He hates to be vulnerable, always in control. But, when he eventually does open up, it's his vulnerability that got to me."}, {"review_sentiment": 4.0, "review_text": "I have and will continue to recommend this book to people I know, with the disclaimer that the summary provided is not an accurate representation of what I found the story to be about. I would describe it as a narrative of the playboy lifestyle of a divorced Kuwaiti man who is trying to mask his pain and loneliness by acting out against the cultural norms and attempting to rationalize his doing so by questioning their validity. It provides a rare insight into a corner of the world most American’s know extremely little about and driving intrigue to learn more. I was surprised to find it both more stimulating and relatable then I would expected. The minimal introduction to the language is especially interesting and fairly well explained. The journey evokes emotion through exploring universal voids and desires which trigger the reader’s own self-introspection. I found myself relating personally to certain sections; to be doing so from a character in a world and situation so unlike my own was astonishing and is a credit to the author’s ability. Most of the secondary characters are notably likeable and despite loving to hate the main character, the reader longs to understand more of the causes and consequences for his self-destruction. The range of emotion elicited ultimately ending with pity and a desire to save was surprising and rare in a novel. In a thought provoking manner, the author ends with a paradox similar with which he starts, including a pointedly more deflated and darkened tone. The tempo becomes significantly decreased as, after spending the great majority of the story questioning, even mocking, the societal norms and practices, the main character’s refusal to submit to them leaves him in the most sullen, depressed state explored. Potentially arguing for one’s need to succumb to mainstream culture/customs in order to achieve true contentment, as opposed to, the fleeting pleasures experienced throughout. The crudeness of some of the adult content is unnecessarily over the top at times and some topics, often explored for only one chapter, drag and feel unrelated to the story; thus the 4. Overall an easy, quick read different enough from most mainstream fiction to feel deeper, more interesting, and leaves the reader wanting a greater understanding of the subjects explored."}, {"review_sentiment": 4.0, "review_text": "Alsarraf's dry, flirty humor is the sandy wind that curls around your knees, inviting you to open, welcome, and accept his hypnotic, witty truths about the gentrification of Kuwait in his first satirical fiction Inshahallah, Habibi.Stark, familiar, stereotypical Arabic landscapes, marriages, and fashions, juxtaposed against elite American shopping and coffee shop conversations, give way to visions of moonlit parties, pulsing music, and little emotional investment: the narrator and central figure, Mohammed, is quite a player and a self-described \"lucky\" stock broker with a penchant for emotionally dissecting friends and lovers alike. Mohammed pursues many (hetero)sexual conquests, never using actual names to describe female lovers. The Source, a Young Bisexual, or the Psychiatrist: each is successfully kept at an emotional distance while numbly observing social hypocrisies, including his own.What is the danger, to Kuwait, to Mohammed? Why hold onto secret lives that do not ultimately serve the purpose of furthering the city, the country?  Is Alsarraf teasing his country of origin, for allowing themselves to continue with traditions that no longer serve, while ignoring the richness of history in the region, allowing the Arabic culture to fade to oblivion? Is Alsarraf fumbling over ideals and doctrines? Is Kuwait not the first Gentrified Country of the World?While Alsarraf's \"fiction\" is thinly veiled, and while Mohammed stops short of labeling Kuwait gentrified, gentrification is at the core of Mohammed's Vegas-style landscape and Long-Island behavior. The arrival of wealthier people in the existing urban district of Kuwait City, a related increase in rents and property values, and changes in the district's character, create a caricature of Kuwaiti culture that is alluded to, but remains largely unexplored, unrevealed, or explained, ostensibly due to Western culture overwhelm. Analogies to Arabic and Western holidays serve to \"sustain plastic hope,\" yet give way to metaphysical abstraction.Skimming the surface, attempting to define Kuwaiti disillusion without exploring the female as human being, avoiding the emotional depths for pop psychology and financial gain: each chapter oozes droll humor. Mohammed's increasingly repugnant self-centeredness further distances the reader, discouraging investment in either Mohammed or his socio-cultural dilemma. When Mohammed faces a very real pregnancy scare that could change the trajectory of his facile living, blithe silence and devoid feeling seal a plot rampant with hollow indifference.INSHALLAH, HABIBI feels like a novel waiting to happen. Kuwait City is an excellent focal point for atmosphere and context, but geography and infrastructure cannot compensate for the non-specific political unraveling playing out under Kuwait's larger world-stage presence. The lack of emotions that drive Mohammed toward his visible goal does not encourage examination or consideration. Perhaps that is the magic of Alsarraf's style; perhaps, in order to pay attention to the subtleties of Western cultural insidiousness, Americans need to be practiced at stillness, to know the habits of our mind, and be skilled at dancing with them, not to be controlled or dominated by them.  Perhaps the Kuwaiti ability to witness thoughts and feelings, without allowing such emotion to overwhelm, dominate, and control their lives, is the ultimate joke on Western invaders."}, {"review_sentiment": 5.0, "review_text": "WOW...Haitham Alsarraf's new book starts off describing all of Middle East with just two words: Inshallah and Habibi. The first two paragraphs sets off the first peel of an onion that will reduce you to tears of laughter and thinking:--------------------\"lnshallah, habibi.\"This is the reply I get in Arabic from my floor manager. I request a three-day vacation and all I get back is inshallah, habibi. Not just any inshallah, either. It is the third and most ridiculous one. One being the true religious term, God-willing, which is said with the most seriousness. The second means a careless and ambiguous maybe. This third one, though, is the most potent.It is the least sincere, given without direct eye contact, combed onto a nonchalant smirk and hand-gestured with dramatic, semi-pleading palms. It means there is no way in hell you will get what you request. It is just wishful thinking. Take your pathetic pleading somewhere else. Leave my sight.--------------------"}]}, "authors": ["Haitham Alsarraf"], "isbn": "1515064794", "longitude": 47.9735629, "periods": ["1900s", "Recent Releases"], "title": "Inshallah, Habibi: A Satirical Novel in Disguise", "word_cloud": "show male dominate world write true tribulation take place world specially live part world say portrays misogyny taboo sheikdom corruption clearly want know go region wake western medium hide safe comfortable shelter world proverbial catch phrase screw story self absorb righteous ramblings review back cover really attract keep wait shift story nothing really happen not pleasant fill metaphor metaphor horrible pretentious dialog thought provoke story include lesson culture people regret sat still difficult intend compliment writing excellent provoke turn light enjoy style write use word flow much wild mountain river bubbling rush speed slow sometimes nearly still author capture character voice make seem real reading greatest take world simply immerse find intrigue desire learn character well culture live start face experienced cause find culture culture well drive still find dishearten society whole so much corruption so much hypocrisy way strives make change friends family acquaintance open way think perhaps thrives push button favorite escape mundane primal need collection lover love idea romance commitment hat vulnerable always control eventually open vulnerability get continue recommend people know disclaimer summary provide accurate representation find story narrative playboy lifestyle divorce man try mask pain loneliness act cultural norm attempt rationalize question validity provide rare insight corner world extremely little drive intrigue learn surprise stimulating repeatable expect minimal introduction language especially interesting fairly well explain journey evoke emotion explore universal void desire trigger find relate personally certain section character world situation astonish credit author ability secondary character notably likable love hate main character longs understand cause consequences range emotion elicit ultimately end pity desire save surprise rare thought provoke manner author end paradox similar start include pointedly deflate darken tempo become significantly decreased spending great majority story question even mock societal norm practice main character refusal submit leave sullen depressed state explore potentially argue need succumb mainstream order achieve true contentment oppose fleeting pleasure experience crudeness adult content unnecessarily top time topic often explore chapter drag feel unrelated story thus easy quick different enough mainstream fiction interest leaf want greater understanding subject explore dry flirty humor sandy curl knee invite open welcome accept hypnotic witty truth gentrification first fiction familiar stereotypical landscape marriage fashion juxtapose elite american shopping coffee shop conversation give way vision moonlit party pulse music little emotional investment narrator central figure quite player lucky stock broker penchant emotionally dissect friend lover alike pursue many hetero sexual conquest never use actual name describe female lover successfully keep emotional distance numbly observe social hypocrisy include danger hold secret life ultimately serve purpose further city country be tease country origin allow continue tradition longer serve ignore richness history region allow culture fade oblivion be fumble ideal doctrine first gentrified fiction thinly veil stop short label gentrified gentrification core landscape behavior arrival wealthier people exist urban district related increase rent property value change district character create caricature culture allude remain largely unexplored unrevealed explain ostensibly due western culture overwhelm holiday serve sustain plastic hope yet give way metaphysical surface attempt define disillusion explore female human avoid emotional depth pop psychology financial gain chapter ooze droll humor increasingly repugnant distance discourage investment dilemma face real pregnancy scare trajectory facile live blithe silence devoid feel seal plot rampant hollow feel wait happen excellent focal point atmosphere context geography infrastructure political unravel play larger presence lack emotion drive visible goal encourage examination consideration perhaps magic style perhaps order pay attention subtlety western cultural insidiousness need practice stillness know habit mind skilled dancing control dominate perhaps ability witness thought feeling allow emotion dominate control live ultimate joke western invader new start describe word first paragraph set first peel onion tear laughter think lnshallah habit reply get arabic floor manager request vacation get back inshallah habit not third ridiculous true religious term say second mean careless ambiguous maybe third least sincere give direct eye contact comb nonchalant smirk dramatic palm mean way hell get wishful think pathetic pleading somewhere else", "genres": ["Fiction & Literature", "Historical Fiction", "Satire"], "summary": "When the Twin Towers are hit on September 11, 2001, Mohammed’s success as a stockbroker in a tiny Middle Eastern country quickly escalates, encouraging his love to debauch women while fighting off traditional marriage, incessant social corruption and Western hegemony, all in a closed wealthy Muslim country, until he soon realizes that his promiscuous life erodes and corrodes his sanity. \r\n\r\nHe eventually meets a younger bisexual woman who he thinks might be worthy of marriage. However, that changes when she takes him farther in a downward spiral of self-analysis and destruction. \r\n\r\nBy the summer of 2008, when worldwide financial markets are about to correct, Mohammed ultimately senses his own spirituality being stolen by the very individuals he has confronted and the society he has loved to hate. The story is a satire yet a serious social critique depicting many critical points which have (mis)shaped Kuwait, leading Mohammed to point out the absurdities of the personalities and situations he finds himself in.", "asin": "1515064794", "rank": "4563718", "city": "Kuwait", "image": "https://images-na.ssl-images-amazon.com/images/I/51sxiQccywL.jpg", "country": "Kuwait", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}