{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 5, "rating": 3.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Title says it all. I loved it."}, {"review_sentiment": 1.0, "review_text": "Very nice work"}, {"review_sentiment": 3.0, "review_text": "I became interested in Daudet after visiting his windmill in the South of France."}, {"review_sentiment": 5.0, "review_text": "Brilliant, fresh and enlightening"}, {"review_sentiment": 5.0, "review_text": "In the late 1860s when Alphonse Daudet set out to write stories about his native Provence in serial form for a newspaper, I seriously doubt that he was aware that he was going to leave a masterpiece behind. Luckily for us, he has done just that. The stories are not linked by any particular theme and they all concern the humorous and sometimes tragic goings-on of local characters. Daudet has a peculiarly powerful way of displaying his sympathy for these people and the beautiful countryside they live in. These stories almost seem to have an air of medieval romance to them, though Daudet's writing is very modern in its simplicity of style. The plots display a range from uproarious comedy to a sweet melancholia. Always there is a whiff of nostalgia in the air as Daudet witnesses the very beginnings of modern life and its impact on his beloved Provence. This is a book to treasure and to share with your best friends. If you have not seen the old 1954 black and white French film version in English subtitles, by all means track it down. It's a classic."}]}, "authors": ["Alphonse Daudet"], "isbn": "1516911784", "longitude": 0.0, "periods": ["1800s"], "title": "Letters from my Windmill", "word_cloud": "say love very nice work become interested visiting fresh enlightening late set write story native serial form newspaper seriously aware go leave masterpiece do story link particular theme concern humorous sometimes tragic local character peculiarly powerful way display sympathy people beautiful countryside live story almost seem air medieval romance write modern simplicity style plot display range uproarious comedy sweet melancholia whiff nostalgia air witness beginning modern life impact beloved treasure share best friend see old black white french film version subtitle mean track classic", "genres": ["Fiction & Literature"], "summary": "The stories are all told by the author in the first person, typically addressing a Parisian reader. The author, having relocated his home from Paris, recounts short bucolic tales about his new life in Provence as well as his trips to Corsica and French Algeria. Considered to be light-hearted, and often a bit tongue-in-cheek, the stories vary from day-to-day events in southern France to Provençal folk-tales, and often feature professions and faunal references characteristic of Provence.", "asin": "1516911784", "rank": "3924684", "city": "Provence", "image": "https://images-na.ssl-images-amazon.com/images/I/41TPYeC7IHL.jpg", "country": "FR", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}