{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 1185, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Real classic."}, {"review_sentiment": 5.0, "review_text": "Superb  transaction! Great Amazon purchase!"}, {"review_sentiment": 4.0, "review_text": "The book starts very boring but as it goes on gets better. After the 5th chapter the descriptions of the actions are quite enjoyable."}, {"review_sentiment": 5.0, "review_text": "Knowing the basic story and having seen the movie I recall a much more 1st person telling of the tale but the book is anything but. Really is more of a strange case than a scary novel but worth the read."}, {"review_sentiment": 5.0, "review_text": "Excellent!"}, {"review_sentiment": 1.0, "review_text": "This is false advertising. There are no annotations that I can find"}, {"review_sentiment": 5.0, "review_text": "This is a great resource! Text on one side with words underlined. On the other are the highlighted words with definitions! Super helpful!"}, {"review_sentiment": 4.0, "review_text": "This has been my students' favorite book all year! It is a great story with fabulous literary devices that hint just enough of the story."}, {"review_sentiment": 5.0, "review_text": "I got this series of books to read to my grandson, then sign and date it for his library."}, {"review_sentiment": 5.0, "review_text": "Thin book.  Quick read"}]}, "authors": ["Robert L. Stevenson"], "isbn": "1517731860", "longitude": -0.12574, "periods": ["1800s"], "title": "The Strange Case of Dr. Jekyll and Mr. Hyde", "word_cloud": "real classic superb transaction purchase start boring go get better chapter description action quite enjoyable know basic story see movie recall much person tell tale anything scary worth excellent false advertising annotation find great resource side word underline highlighted word definition helpful student favorite year great story fabulous literary device hint enough story get series grandson sign date library", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Instantly the spirit of hell awoke in me and raged...I was suddenly struck through the heart by a cold thrill of terror.'\r\n\r\nStevenson's short novel, published in 1886, became an instant classic. It was a Gothic horror that originated in a feverish nightmare, whose hallucinatory setting in the murky back streets of London gripped a nation mesmerized by crime and violence. The respectable doctor's mysterious relationship with his disreputable associate is finally revealed in one of the most original and thrilling endings in English literature. \r\n\r\nIn addition to Jekyll and Hyde, this edition also includes a number of short stories and essays written by Stevenson in the 1880s, minor masterpieces of fiction and comment: 'The Body Snatcher', 'Markheim', and 'Olalla' feature grave-robbing, a sinister double, and degeneracy, while 'A Chapter on Dreams' and 'A Gossip on Romance' discuss artistic creation and the 'romance' form. ", "asin": "1517731860", "rank": "1687728", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/513mpkNxOnL.jpg", "country": "England", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}