{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 6, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "I'm surprised this book isn't taught in schools.  It would get those little minds thinking, which is clearly not possible using Edith Wharton."}, {"review_sentiment": 4.0, "review_text": "Satisfied"}, {"review_sentiment": 4.0, "review_text": "Good story, the 'old' Creole language is a bit difficult, but I enjoyed reading an old novel written by an old New Orleans novelist."}, {"review_sentiment": 3.0, "review_text": "Difficult to read because of language and dialect differences but worth the effort."}, {"review_sentiment": 4.0, "review_text": "The Grandissimes by George Washington Cable was published in 1880 after first appearing as a serial novel and tells the tale of two Creole families in early 1800 New Orleans.I was disappointed that my Kindle edition didn't include the illustrations that accompany the original book.  However, I looked them up on Gutenberg.org.The Grandissimes is a fine piece of literature.  There are many well drawn characters and descriptions of life in the exotic setting of New Orleans at the time of the Louisiana Purchase.  Using the character of Frowenfeld, a northerner of German extraction, as our guide, Cable educates us about Louisiana Creole society and uses Frowenfeld to voice the author's criticisms of slavery.I found the book to be challenging reading for a number of reasons, all of which I blame on my own shortcomings:1.  The 19th Century writing style is difficult to acclimate to for this modern reader.  I took about 9-10 chapters to fully settle into the novel. Even so, I sometimes found myself confused as to what exactly was meant by the author.2.  Cable wrote the dialogue in Creole and Plantation dialect and he did so exceptionally well.  However, I found it slowed down my reading quite a bit as I needed to speak the dialogue aloud to myself in order to comprehend what was being said.3.  The style of prose included long descriptions of the landscape and environs interspersed with the narrative also served to limit forward movement of the storyline.I did learn a lot about the European Creoles, the mixed race Creoles and their interactions with each other and with the slave population.For anyone who's interested in New Orleans and Creole culture, this book is worth the effort. I'm glad I read The Grandissimes."}, {"review_sentiment": 5.0, "review_text": "While masterpiece may be stretching it, Cable's soup opera plot, set against the exotic, tension-filled Creole landscape of slave era New Orleans is a solid, juicy read."}]}, "authors": ["George Washington Cable"], "isbn": "1517312744", "longitude": -90.0701156, "periods": ["1800s"], "title": "The Grandissimes", "word_cloud": "surprise taught school little mind think clearly possible use satisfied good story language bit difficult enjoy read old write old novelist language dialect difference worth effort publish first appear serial tell tale family early disappointed edition include illustration accompany original however look fine piece literature many well draw character description life exotic set time character northerner german extraction guide educate society use voice author criticism find challenge read number reason blame writing style difficult acclimate modern take chapter fully even sometimes find confused exactly mean write dialogue dialect exceptionally well however find slow read quite bit need speak dialogue aloud order comprehend style prose include long description landscape environs intersperse narrative also serve limit forward movement learn lot european mix race interaction slave anyone interested culture worth effort glad masterpiece stretch soup opera plot set exotic landscape slave era solid juicy", "genres": ["Fiction & Literature"], "summary": "The Grandissimes: A Story of Creole Life is a novel by George Washington Cable, published as a book in 1880 by Charles Scribner's Sons after appearing as a serial in Scribner's. \r\n\r\nThe historical romance depicts race and class relations in New Orleans at the start of the 19th century, immediately following the Louisiana Purchase in 1803. The book examines the lives and loves of the extended Grandissime family, which includes members from different races and classes in Creole society.\r\n\r\nThe novel juxtaposes a romanticized version of the French Creole culture with the atrocities committed under the European-American system of slavery in the United States.", "asin": "1517312744", "rank": "956120", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/41fLVI0AgEL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}