{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 118, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "a short but very powerful story about a friendship dissolved by Nazi ideology.  The subtlety of this story is sublime."}, {"review_sentiment": 5.0, "review_text": "Gigantic!"}, {"review_sentiment": 4.0, "review_text": "This is a well written and thoughts provoking sad story.  I would like to make two points about the story:1. As a middle-aged Chinese, I have elderly relatives who had been through the Cultural Revolution in China from 1966 to 1976 and I have been countless real-life horror stories from that period.  I know for fact that people living under an authoritarian regime have zero freedom of expression.  Death sentence is nearly guaranteed for anyone persevering with it.2. Martin brought the demise to himself and his family for writing that cold-blooded letter to Max to inform him of the death of his sister.  But on the other hand, let's consider a hypothetical question: if someone goes to the IS and gets killed, and a person remarks that it's silly for him to have gone, does this person deserves a sentence of concentration camp or death?"}, {"review_sentiment": 5.0, "review_text": "Great book. You can read it in an hour but the last page blows you away."}, {"review_sentiment": 5.0, "review_text": "This is one of the best books I have ever read, incredibly insightful in its historic context....I've read it in French and for a second time in English. It is powerful. It is short. It will repeat on you."}, {"review_sentiment": 5.0, "review_text": "Address Unknown is a chilling epistolary novella written a year before the outbreak of World War Two.  It is a series of letters between two former business partners and close friends, one a German-American living in San Francisco who is Jewish and the other a German Christian who, having lived in the United States, has returned to Germany.  Over the initial series of letters, it is revealed that the partner in Germany has become enthralled with Hitler and Nazism.  The ensuing letters reveal duplicity, betrayal and, ultimately, revenge.  This is a classic that, despite its age, is timeless.  It will leave the reader open-mouthed in shock."}, {"review_sentiment": 5.0, "review_text": "A very moving fictional story, portrayed through letters, about racism and the Nazi debacle."}, {"review_sentiment": 5.0, "review_text": "although written so many years ago it was timely and just as it could again be in the US.  A warning."}, {"review_sentiment": 5.0, "review_text": "I use this book in my Holocaust class with good success. Another teacher and I read the book as though we are the two characters in the book, a dramatic reading of sorts. This works well because it's a live performance and the story is so short that it can be finished in one class period, usually only taking 35-40 minutes. This gives some time for a brief discussion afterwards allowing the students to react to what they've just heard. The classes are usually surprised to learn that it was written as fiction well before the beginning of the mass killing of the Jews in Europe associated with the Holocaust."}, {"review_sentiment": 5.0, "review_text": "I loved this book - especially in light of the current political climate I found it very timely, disturbing and frightening."}]}, "authors": ["Kressmann Taylor"], "isbn": "1518869769", "longitude": 13.3888599, "periods": ["1900s"], "title": "Address Unknown", "word_cloud": "short powerful story friendship dissolve ideology subtlety story sublime gigantic well write thought provoke sad story point chinese elderly relative cultural countless horror story period know fact people live authoritarian regime zero freedom expression sentence nearly guarantee anyone persevere bring family write letter inform death sister hand let hypothetical question someone go get kill person remark silly go person deserve sentence concentration camp death hour last page blow away best ever incredibly insightful historic context french second time english powerful short repeat chill epistolary novella write year outbreak series letter former business partner close friends living jewish live return initial series letter reveal partner become enthral ensue letter reveal duplicity betrayal ultimately classic age timeless leave shock move fictional story portray letter racism debacle write many year ago timely warning use holocaust class good success teacher character dramatic reading sort work well live performance story short finish class period usually take minute give time brief discussion afterwards allow student react hear class usually surprise learn write fiction well begin mass kill associate love especially light current political climate find timely disturb frighten", "genres": ["Fiction & Literature"], "summary": "A rediscovered classic, originally published in 1938, and now an international best-seller, it reveals the extraordinary power of the pen as a weapon.\r\n\r\nFirst published in 1938 in Story magazine as a wake-up call warning Americans of the true nature of the Nazi menace, this punchy epistolary tale enacts a stunning drama of friendship, betrayal and vengeance. \r\n\r\nIn 1932, San Francisco art-gallery owner Max Eisenstein, a Jew who grew up in pre-Nazi Germany, bids farewell to his longtime friend and business partner Martin Schulse, who returns with his family to Munich, where he becomes a Nazi. \r\n\r\nThrough their letters to one another, which quickly move from warmth to a chilling disregard, we watch as the once-liberal Martin, seduced by grandiose visions of German destiny and by the rantings of \"our Glorious Leader,\" vents an anti-Semitism that he tortuously rationalizes. \r\n\r\nMax, alarmed by reports of anti-Jewish persecution in Germany, asks Martin to look after his actress sister, Griselle, who is performing in Berlin. When she is murdered by Nazi storm troopers after being refused refuge at the Schulse house, Max takes revenge through a clever epistolary ploy that provides a satisfying surprise ending. \r\n\r\n“This modern story is perfection itself. It is the most effective indictment of Nazism to appear in fiction.” The New York Times \r\n\r\n“A tale already known and profoundly appreciated by members of my generation. It is to our part in World War II what Uncle Tom’s Cabin was to the Civil War.” Kurt Vonnegut\r\n\r\nFirst published in 1938, Address Unknown resonated within the United States, changing many Americans’ views of the growing conflict in Europe. Kressmann Taylor’s revealing tale of the consequences of genocidal fascism remains as sadly relevant today as when it was first written.", "asin": "1518869769", "rank": "642863", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/41Hl7xLyE3L.jpg", "country": "Germany", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}