{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 3, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "The unnamed main character of Henry James’ 1898 novella In the Cage is a postal clerk who reads the telegrams upper class residents send to each other – making dinner appointments, coordinating vacation schedules, arranging trysts – and has decided that one of them, the Captain – who has manners, speaks well, dresses to the nines – is simply the most attractive man she has ever seen. And, (shades of a Woody Allen movie) in spite of being engaged to one Mr. Mudge, she lets her feelings run rampant.She begins to walk out of her way going home to pass by the apartment building of Captain Everard on the chance that they might meet.Meanwhile, she learns more of the life of the beautiful people from her newly rekindled friendship with Mrs. Jordan the widow of a bishop, and in her youth the neighbor who shared the poverty that she, her sister and mother lived in. Now, with her booming business – taking care of the flowers in the apartments of the well to do – Mrs. Jordan is able to fill in some of the picture the heroine desperately wants to be part of, even offering her a job – which she declines.Then, on one of her evening walks home she miraculously does meet the Captain. This chance encounter allows them to converse outside the formal confines of the postal substation in the tonier part of London that she works in – and at the end of their conversation she tells him that she would do anything (in the sense of  “take a bullet”) for him.The highpoint of her life – far exceeding the proposal of marriage that she gets from Mr. Mudge while on a week’s vacation in the autumn of the year – is the appearance of the Captain at the postal substation who asks her to retrieve a telegram he sent sometime in August. With a feeling of complete control over the fate of the Captain, she is able to tell him the content he is so interested in.Later, Mrs. Jordan tells her about the Captain who, it turns out, has been blackmailed, apparently, into marrying one of his consorts whose husband has just died; and, most likely hers and the Captain’s paths will never cross again.She now accepts her fate – a life of marriage to the dependable and devoted Mr. Mudge.In the Cage illustrates clearly why James is called the novelist of the psychological.He draws with superb detail:The infatuation the heroine has for an essential stranger.Perhaps you remember sitting on your bicycle parked in front of the house of the schoolgirl you thought was perfection but who never acknowledged your existence (except years later when she offers you a ride home from church in her brand new Chevrolet Impala – and you don’t ask her for coffee – some chances really only do come once in a lifetime).The superiority she feels toward her fiancé, her friend and her coworkers.Everyone knows the feeling of intellectual – even moral – superiority to the guy standing in front of you on line to the theater who strikes up a conversation with you and you immediately realize that this person is not someone who has been or ever will be part of your world.The envy she has of the upper class people who patronize the postal substation.Who hasn’t wished they were walking into their office, with a handful of messages and a sign on the door that says: “See my secretary for an appointment.”Her control when she is able to repeat from memory the message that Captain Everard needs to retrieve.Who has not felt the power knowing you have what someone wants – a word, a key, a nod, a gesture pointing them to the service others must still wait for; or, the relief whensomeone solves your problem, like the cook’s pass to pay for your breakfast tomorrow because you forgot your wallet today when he says: “I know you – you’re in here all the time.” And, you thought he never even saw you let alone remembered you.The ennui when Mrs. Jordan reveals the Captain’s true story.Who has not been punched in the gut of learning the truth about someone that is not the truth you had constructed in your mind – maybe a growing relationship that is suddenly cut off, leaving you with no address, no missive, no nothing – literally falling off the face of the earth (and you thought she liked you, wanted you, enjoyed your company but, in fact, you were probably just a diversion).The impression you get as you read some of the longest sentences you will ever read is that to take out even a single word would somehow detract from the whole which is indeed great. It is James’ perfect sense of the human condition that makes the story so appealing. In the Cage is nothing more or less than a perfect mirror.Look at it and smile."}, {"review_sentiment": 5.0, "review_text": "had to have this book for my american literature class at UGA. i love the tools that you can use such as highlighting and the insert of notes."}, {"review_sentiment": 3.0, "review_text": "I was required to read this book for my American Lit class in college, and though I had heard that James was a bit verbose and that the plot of the novel was purportedly about the life of a telegraph-girl, I nevertheless enjoyed it thoroughly. The novel centers on a young girl who works at the sounding board of an English store. Because she is the main operator, she is privy to all of the customer's private affairs, for she transcribes all of their personal notes. Some of her insights regarding relationships and the often-intimate details of her state of mind seemed to articulate some of my own thoughts. The \"hook\" of the plot(as concern other female-heroines of her time) revolves around her intense fatuation with a male customer, with whom she eventually falls in love. \"In the Cage\" is taut, well-written, and eerily similar to the trials and tribulations of everyday life in the present era."}]}, "authors": ["Henry James"], "isbn": "1519382782", "longitude": -0.12574, "periods": ["1800s"], "title": "In the Cage", "word_cloud": "unnamed main character novella postal clerk read telegrams upper class resident send make dinner appointment coordinate vacation schedule arrange tryst decide manner speak well dress nine simply attractive man ever see shade movie spite engage let feeling begin way go home pas apartment building chance life beautiful people newly rekindle friendship widow bishop youth neighbor share poverty sister mother live now boom business take care flower apartment well able fill picture heroine desperately want part even offer job evening walk home miraculously meet chance encounter allow converse formal confines postal substation part work conversation tell anything bullet high point life far exceed proposal marriage get week vacation year appearance postal substation asks retrieve telegram sent sometime feel complete control fate able tell content interested tell turn blackmail apparently marry consort husband die likely path never cross accepts fate life marriage dependable devote illustrate clearly call novelist draw superb detail infatuation heroine essential remember sit bicycle park front house schoolgirl think perfection never acknowledge existence year later offer home church brand new coffee chance really come lifetime superiority feel fiance friend know feel intellectual even moral superiority guy stand front line theater strike conversation immediately person someone ever part envy upper class people patronize postal wish walk office handful message sign door say secretary control able repeat memory message need felt power know someone want word key nod gesture point service others still relief when someone solve problem cook pas pay breakfast tomorrow forget wallet today say know think never even saw alone remember ennui reveals true punch gut learn truth someone truth construct mind maybe grow relationship suddenly cut leave address missive nothing literally fall face earth think liked want enjoy company fact probably diversion impression longest sentence ever take even single word detract whole indeed great perfect sense human condition make story appeal nothing le perfect smile american literature class love tool use highlight insert note require american class college hear bit verbose plot purportedly life nevertheless enjoy thoroughly center young girl work sound board english store main operator privy customer private affair transcribe personal note insight regard relationship detail state mind seem articulate thought hook plot concern time revolve intense infatuation male customer eventually fall love taut eerily similar trial tribulation everyday life present era", "genres": ["Fiction & Literature"], "summary": "In the Cage is a novella by Henry James, first published in 1898. This story centres on an unnamed London telegraphist. She deciphers clues to her clients' personal lives from the often cryptic telegrams they submit to her as she sits in the \"cage\" at the post office. Sensitive and intelligent, the telegraphist eventually finds out more than she may want to know.", "asin": "1519382782", "rank": "2368873", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/61fGhfZr95L.jpg", "country": "England", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}