{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 81, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Just relax and let Earl Derr Biggers take you back to a time when murder was gentler.  A great description of the life and times of a Hawaii long gone by.  The hero is not likeable, but then, he is not supposed to be; just a guy from a social class that has also all gone by.  I enjoy all the Charley Chan books, as I enjoyed the movies on late night TV in the early 50's.  The book has held up well over time; better than I."}, {"review_sentiment": 1.0, "review_text": "Massive formatting errors -- virtually on every page -- making it very, very unpleasant to read. A ripoff."}, {"review_sentiment": 4.0, "review_text": "Great nostalgic crime yarn. Appealing characters, pleasant conjured-up tropical settings, well paced plot plus suspence. Great fun!"}, {"review_sentiment": 4.0, "review_text": "Fascinating for descriptions of old Honolulu and an introduction to the character of Charlie Chan.  Some language may seem racist to modern readers, but Charlie and other Asians and native Hawaiians depicted are treated with dignity.  Chan's English may seem broken, but not his logic.  The plot is interesting to the last page.  Problems include lack of pagination and a placement of text that looks like it was copied from a magazine without being reset, and the type is small."}, {"review_sentiment": 5.0, "review_text": "Thanks"}, {"review_sentiment": 5.0, "review_text": "I love the Charlie Chan books!  Written nearly a hundred years ago, this story isn't old fashioned or dated; the dialogue is sophisticated, the characters are original and not stereotyped, and the mystery .... well, see if you figure it out!  Highly recommend this book"}, {"review_sentiment": 5.0, "review_text": "First Charlie Chan novel ever. What's not to love about that?"}, {"review_sentiment": 5.0, "review_text": "1920, Boston, MA. John “Johnnie” Quincy Winterslip (Grace’s son, nephew, Boston bond trader, Harvard) was aboard the President Tyler (ship).He was going to visit Aunt Minerva Winterslip (50+, Boston, MA., Sympathy Hall) in Honolulu, Hawaii.Minerva had Kamaikui (f), & Haku (Japanese servant) go look in the living room. She had heard a commotion, so she thought.Dan Winterslip (Jedidiah’s son, wealthy, cousin, former 1st. Officer) had been murdered.Minerva called Amos Winterslip (Jedidiah’s son) right away.Captain Hallet (Honolulu PD) had called on the aide of DS Charlie Chan (Chinese, Honolulu PD).Mr. Jim Egan (English) was being questioned.A mysterious box with T.M.B. had been found.Captain Hallet & DS Chan were whittling their list of suspects down.I did not receive any type of compensation for reading & reviewing this book. While I receive free books from publishers & authors, I am under no obligation to write a positive review. Only an honest one.A very awesome book cover, great font & writing style. A very well written murder mystery book. It was very easy for me to read/follow from start/finish & never a dull moment. There were no grammar/typo errors, nor any repetitive or out of line sequence sentences. Lots of exciting scenarios, with several twists/turns & a great set of unique characters to keep track of. This could also make another great murder mystery movie, or better yet a mini TV series. A very easy rating of 5 stars.Thank you for the free eBooksDaily; Amazon Digital Services LLC; bookTony Parsons MSW (Washburn)"}, {"review_sentiment": 3.0, "review_text": "A little slow."}, {"review_sentiment": 5.0, "review_text": "Charlie Chan is always a good read"}]}, "authors": ["Earl Derr Biggers"], "isbn": "1522881980", "longitude": -157.8556764, "periods": ["1900s"], "title": "The House Without a Key", "word_cloud": "just let time murder gentler great description life time long go hero likable suppose guy social class also go enjoy enjoy movie late night tv early hold well time better massive formatting error virtually page make unpleasant ripoff nostalgic crime yarn appeal character pleasant tropical setting well pace plot suspense fun fascinate description old introduction character language racist modern reader native depict treated dignity broken plot interest last page include lack pagination placement text look copied magazine reset type small thanks love nearly year ago story old fashion dated dialogue sophisticated character original stereotype mystery well figure recommend ever son nephew bond trader ship go visit f servant look living room hear commotion son wealthy cousin former call son right call aide mysterious box whittle list suspect receive type compensation read review receive free publisher author obligation write positive review only honest awesome cover great font write style well write murder mystery easy never dull moment error repetitive line sequence sentence excite scenario several great set unique character track also great murder mystery movie better yet mini tv series easy rating free ebooksdaily book tony little slow always good", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "This is the classic novel in which Charlie Chan makes his debut as Inspector of the Honolulu Police Department. Earl Derr Biggers brings Honolulu to life with deft descriptions of the landscape and of its hybrid ethnic communities. \r\n\r\nWith the creation of Detective Chan, Biggers also shatters stereotypes and is ahead of his time in highlighting the positive aspects of Chinese-Hawaiian culture, just as his skillful rendering of San Francisco is noteworthy of its modernity and keen sense of place.", "asin": "1522881980", "rank": "3262054", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/31LdwZYYa-L.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}