{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 28.6517178, "ratings": {"num_ratings": 325, "rating": 3.2, "reviews": [{"review_sentiment": 5.0, "review_text": "It is certainly different than her earlier book but in my opinion-no less brilliant.Her writing is sometimes pure poetry, sometimes steeped in sorrow, pain, and so much heart.Being an Indian, we have of course come to live with the issue of Kashmir's struggles but mostly turned a blind eye and a deaf ear because there just wasn't anything we thought we could do. But at least we could learn and educate ourselves on the issues from both sides..this book is an attempt at that education and very relate able."}, {"review_sentiment": 2.0, "review_text": "Extremely complicated and difficult to follow. Intricate stories interweaved in the main story line, hard to follow. Did not enjoy the book. Hard to tell what was reality and what was not. Additionally I could not tell if the picture of India depicted here was accurate. Probably not."}, {"review_sentiment": 4.0, "review_text": "This was as usual for Roy, a great novel but with a deep message about inequality and difference and the suffering that we inflict on each other."}, {"review_sentiment": 2.0, "review_text": "When I first started the book I was fascinated by the story of Anjum. There were moments, however, that I was a bit lost with the characters and had to go back several pages and re-read to get up to speed.If that was bad, than wait until you get to the second part of the story. I was hoping we would get more depth into Anjum’s story, however it essentially started a brand new book with dozens of new characters and tons of political scenes that are hard to follow.I kept reading, hoping to find the “aha” moment where both stories collided-but was disappointed.Had the author focused on Anjum’s story I think it would have been a beautiful book, however this was just too messy to read."}, {"review_sentiment": 3.0, "review_text": "The author is great to read, the story is quite rich and beautiful.  At times the writing becomes spacey and dreamlike, and a bit hard to follow."}, {"review_sentiment": 3.0, "review_text": "Very convoluted and complicated story.  Hard to follow the multitude of different characters.  Also there were too many bits in Urdu or Hindi that were not translated for the reader.  I only started enjoying the book in the last quarter."}, {"review_sentiment": 4.0, "review_text": "Heartrending and warming story delightfully told. Just wished I knew more of Kashmir history as I was confused at times"}, {"review_sentiment": 3.0, "review_text": "The book cannot be compared to her novel “the God of lesser things”,which was written for International public. And was excellent. This new one is mostly understandable by Indians."}, {"review_sentiment": 3.0, "review_text": "Roy is a great creative writer, and I think I had set the bar high on this one, after reading  \"God of small Things\" several times - so the book, although it had a great start with the introduction of the character Anjum, I was a bit disconnected towards the middle, when the story shifted to the other characters such as Musa and Tilo ...however, It did come together again towards the third quarter when all the characters were intertwined in each other's lives."}, {"review_sentiment": 1.0, "review_text": "I only read a couple of chapters.  I just couldn't get involved or feel compassion for any of the characters and found myself getting frustrated with the plot"}]}, "authors": ["Arundhati Roy"], "isbn": "1524733156", "longitude": 77.2219388, "periods": ["1900s", "2000s", "Recent Releases"], "title": "The Ministry of Utmost Happiness", "word_cloud": "certainly different earlier le write sometimes pure poetry sometimes steep pain much indian course come live issue struggle mostly turn eye deaf anything think least issue education relate able extremely complicate difficult follow story interweave main story line hard follow tell reality picture depict accurate probably usual great deep message inequality difference suffer inflict first start fascinate story moments however bite lost character go back several page get bad wait second part story hop depth story however essentially start brand new dozen new character ton political scene hard keep read hop aha moment story author focused story think however messy author great story quite rich beautiful time write becomes spacey bit hard follow very convoluted complicate story follow multitude different character also many bit translate start enjoy last quarter heartrending warm story delightfully tell wish know history confuse time compare lesser thing write public excellent new mostly understandable indian great creative writer think set bar high reading small several time great start introduction character bite disconnected towards middle story shift character however together towards third quarter character intertwine life couple chapter involve compassion character find get frustrate plot", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A dazzling, richly moving new novel by the internationally celebrated author of The God of Small Things\r\n\r\nThe Ministry of Utmost Happiness takes us on an intimate journey of many years across the Indian subcontinent—from the cramped neighborhoods of Old Delhi and the roads of the new city to the mountains and valleys of Kashmir and beyond, where war is peace and peace is war.\r\n\r\nIt is an aching love story and a decisive remonstration, a story told in a whisper, in a shout, through unsentimental tears and sometimes with a bitter laugh. Each of its characters is indelibly, tenderly rendered. Its heroes are people who have been broken by the world they live in and then rescued, patched together by acts of love—and by hope.\r\nThe tale begins with Anjum—who used to be Aftab—unrolling a threadbare Persian carpet in a city graveyard she calls home. We encounter the odd, unforgettable Tilo and the men who loved her—including Musa, sweetheart and ex-sweetheart, lover and ex-lover; their fates are as entwined as their arms used to be and always will be. We meet Tilo’s landlord, a former suitor, now an intelligence officer posted to Kabul. And then we meet the two Miss Jebeens: the first a child born in Srinagar and buried in its overcrowded Martyrs’ Graveyard; the second found at midnight, abandoned on a concrete sidewalk in the heart of New Delhi.\r\n\r\nAs this ravishing, deeply humane novel braids these lives together, it reinvents what a novel can do and can be. The Ministry of Utmost Happiness demonstrates on every page the miracle of Arundhati Roy’s storytelling gifts.\r\n\r\n“Propulsive, playful . . . this new book finds Roy the artist prospering with stories, and writing in gorgeous, supple prose. Again and again beautiful images refresh our sense of the world. Sections of the book filled me with awe—not just as a reader, but as a novelist—for the sheer fidelity and beauty of detail—a terrific novelistic noticing. Roy writes with astonishing vividness.” The New York Times", "asin": "1524733156", "rank": "5575", "city": "Delhi", "image": "https://images-na.ssl-images-amazon.com/images/I/51W0Yr9vsKL.jpg", "country": "India", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}