{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 48.8566101, "ratings": {}, "authors": ["Emile Zola"], "isbn": "1533596972", "longitude": 2.3514992, "periods": ["1800s"], "title": "Nana", "word_cloud": "", "genres": ["Fiction & Literature"], "summary": "Nana tells the story of Nana Coupeau's rise from streetwalker to high-class prostitute during the last three years of the French Second Empire. Nana first appeared near the end of Zola's earlier novel Rougon-Macquart series, L'Assommoir (1877), where she is the daughter of an abusive drunk. \r\n\r\nAt the conclusion of that novel, she is living in the streets and just beginning a life of prostitution. Nana opens with a night at the Théâtre des Variétés in April 1867 just after the Exposition Universelle has opened. Nana is eighteen years old, though she would have been fifteen according to the family tree of the Rougon-Macquarts Zola had published years before starting work on this novel. Zola describes in detail the performance of La blonde Vénus, a fictional operetta modeled after Offenbach's La belle Hélène, in which Nana is cast as the lead. All of Paris is talking about her, though this is her first stage appearance. When asked to say something about her talents, Bordenave, the manager of the theatre, explains that a star does not need to know how to sing or act: \"Nana has something else, dammit, and something that takes the place of everything else. I scented it out, and it smells damnably strong in her, or else I lost my sense of smell.\" Just as the crowd is about to dismiss her performance as terrible, young Georges Hugon shouts: \"Très chic!\" From then on, she owns the audience. \r\n\r\nZola describes her appearance only thinly veiled in the third act: \"All of a sudden, in the good-natured child the woman stood revealed, a disturbing woman with all the impulsive madness of her sex, opening the gates of the unknown world of desire. Nana was still smiling, but with the deadly smile of a man-eater.\"", "asin": "", "rank": 0, "city": "Paris", "image": "", "country": "France", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}