{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 41.8933203, "ratings": {}, "authors": ["Nathaniel Hawthorne"], "isbn": "1535161272", "longitude": 12.4829321, "periods": ["1800s"], "title": "The Marble Faun", "word_cloud": "", "genres": ["Fiction & Literature"], "summary": "Nathaniel Hawthorne’s final novel, examines two of the problems that interested its author late in his career: the complications of living abroad and the possible benefits of human suffering.\r\n\r\n Considered by some to be less successful than his earlier works, the novel nevertheless offers a unique picture of the effects of a foreign culture upon American lives and values.\r\n\r\nThe Marble Faun: Or, The Romance of Monte Beni, also known by the British title Transformation, was the last of the four major romances by Nathaniel Hawthorne, and was published in 1860. The Marble Faun, written on the eve of the American Civil War, is set in a fantastical Italy. The romance mixes elements of a fable, pastoral, gothic novel, and travel guide.\r\n\r\nThis romance focuses on four main characters: Miriam, Hilda, Kenyon, and Donatello.\r\n\r\nMiriam is a beautiful painter with an unknown past. Throughout the novel, she is compared to many other women including Eve, Beatrice Cenci, Judith, and Cleopatra. Miriam is pursued by a mysterious, threatening man who is her “evil genius” through life. Hilda is an innocent copyist. She is compared to the Virgin Mary and the white dove. Her simple, unbendable moral principles can make her severe in spite of her tender heart. Miriam and Hilda are often contrasted.\r\n\r\nKenyon is a sculptor who represents rationalist humanism. He cherishes a romantic affection towards Hilda. Donatello, the Count of Monte Beni, is often compared to Adam and is in love with Miriam. Donatello amazingly resembles the marble Faun of Praxiteles, and the novel plays with the characters’ belief that the Count may be a descendant of the antique Faun. Hawthorne, however, withholds a definite statement even in the novel’s concluding chapters and postscript.\r\n\r\nWikipedia", "asin": "1535161272", "rank": "7209798", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51XWfhbFlRL.jpg", "country": "Italy", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}