{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 50.110653, "ratings": {"num_ratings": 2, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "I bought this book to get a copy of the short \"first love.\" The other two stories are ok, but they stand pale in comparison of \"first love.\" I would try to find a version that has other stories that accompany \"first love,\" but that is also being presumptuous that Turgenev's other stories are better than the other two that are a part of the book."}, {"review_sentiment": 5.0, "review_text": "I bought these Turgenev stories since I read that Philip Roth described them as the best short stories ever written. I don't know if Roth's evaluation is correct but they are a terrific read."}]}, "authors": ["Ivan Sergeevich Turgenev"], "isbn": "1543258050", "longitude": 8.682093, "periods": ["1800s"], "title": "The Torrents of Spring", "word_cloud": "buy copy short first love story ok stand pale comparison first version story accompany first also presumptuous story better part buy story describe best short story ever write know evaluation correct terrific", "genres": ["Memoir", "Fiction & Literature"], "summary": "Despite its fictional overlay, Torrents of Spring is inspired by the events of Turgenev's life during his 1838-1841 tour of the German States. Although Fathers and Sons remains Turgenev's most famous novel, Torrents of Spring is significant in its revealing of the author's life, thoughts, and most intimate emotions.\r\n\r\nIt was written by Ivan Turgenev during 1870 and 1871 when he was in his fifties. The story centers around a young Russian landowner named Dimitry Sanin who falls deliriously in love for the first time while visiting the German city of Frankfurt. It is widely held as one Turgenev's greatest novels as well as being highly autobiographical in nature.", "asin": "1543258050", "rank": "3771779", "city": "Frankfurt", "image": "https://images-na.ssl-images-amazon.com/images/I/41rl2d3nxbL.jpg", "country": "Germany", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}