{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 7, "rating": 2.7, "reviews": [{"review_sentiment": 2.0, "review_text": "A rather slow moving book  which gave the impression that Lawrence was not pleased with Australia or indeed, himself.  The author mayhave been going through a difficult time in his life and this could be reflected in his book."}, {"review_sentiment": 3.0, "review_text": "Slow and pretentious."}, {"review_sentiment": 2.0, "review_text": "Such an ill-formed beast - Lawrence at his most artless - and hardly a novel at all - for long stretches little more than an unpleasant, self-pitying rant... And yet, it is so revealing of the true Lawrence, the frail, brilliant 'pilgrim of eternity' wandering the face of the earth, trying to find - what? the 'dark god' within? struggling, struggling with his mortal limitations and those of absolutely everybody around him... Well, there are stunning evocations of Frieda, perhaps clearer than anywhere else in the oeuvre, and the nostalgia on leaving Australia at the end is surprisingly sentimental, oddly moving. The inner Lawrence seems preternaturally aware that the homeland and rest he is searching for in this world cannot be found short of a greater elsewhere. It is a pitiable spectacle, shot through with occasional apprehensions of remarkable beauty."}, {"review_sentiment": 3.0, "review_text": "I'm only half way through and it's just beginning to get interesting. The author likes to use a lot of words to say so little. Not really enjoyable reading for my taste."}, {"review_sentiment": 2.0, "review_text": "Highly introspective and self indulgent.  D.H Lawrence attempts to probe the Australian Psyche and that of Somers and let's face it he seemed to have a good knowledge of place.  I found the dissertations on the so called attempts to improve society spearheaded by the Australian Diggers back from the war lacking in clarity and the god like figure of Kangaroo somewhat mysterious and not very credible.  Both the chief characters of Somers and Harriet shadowy and not particularly engaging to say the leastA highly static novel with particularly dense writing"}, {"review_sentiment": 4.0, "review_text": "Book was as advertised and arrived promptly. I only wish it had been a bit cheaper."}, {"review_sentiment": 3.0, "review_text": "I have just finished reading this book and to be honest I found it quite tough going.  Recommended to me by an academic of Lawrence's work, he had to concede afterwards that perhaps it wasn't the ideal introduction to a new reader.  What this story lacks mostly is a good old fashioned yarn, but instead seems to be a vehicle for the author to convey many of his thoughts on relationships between men and men, men and women and politics in general.I can't be too specific on the authors ideas as I freely admit that much of this went \"in one ear and out the other\" as I frequently found after reading certain paragraphs I was left thinking \"I have no idea what he was just talking about\".  Concentration therefore was fundamental to enjoying this book, and on the few occasions when I was truely focussed and emmersed, some of the ideas were interesting and rewarding.This is a semi autobiographical account of Lawrence's own experiences in Australia, but strangly I found the most interesting part of the book was the \"Nightmare\" chapter, dedicated to the character's account of being in England during World War One.  This too, mirrors the authors own experiences during this turbulent time.Maybe I should go for the better known novels next time..."}]}, "authors": ["D. H. Lawrence"], "isbn": "1543248373", "longitude": 151.2164539, "periods": ["1900s"], "title": "Kangaroo", "word_cloud": "rather slow move give impression please indeed author may have go difficult time life pretentious such beast artless hardly long stretch little unpleasant rant yet reveal true frail brilliant eternity wander face earth try find god struggle struggle mortal limitation absolutely everybody around well stunning evocation perhaps anywhere else oeuvre nostalgia leave end surprisingly sentimental oddly move inner seem preternaturally aware homeland rest search world find short greater elsewhere pitiable spectacle shot occasional apprehension remarkable beauty way begin interest author like use lot word say little not really enjoyable reading taste highly introspective self indulgent attempt probe australian let face seem good knowledge place find dissertation call attempt society spearhead australian back war lacking clarity god figure somewhat mysterious credible chief character shadowy particularly engage say least a highly static particularly dense write advertise arrive promptly wish bit cheaper finish read honest find quite tough go recommended academic work concede afterwards perhaps introduction new story lack mostly good old fashion yarn instead seem vehicle author convey many thought relationship men men men woman politics specific author ideas freely admit much go ear frequently find read certain paragraph leave think idea talk fundamental enjoy occasion truly focus immersed idea interest semi autobiographical account experience strangely find interest part chapter dedicate character account mirror author experience turbulent go better know novel time", "genres": ["Fiction & Literature"], "summary": "Kangaroo is an account of a visit to New South Wales by an English writer named Richard Lovat Somers and his German wife Harriet in the early 1920s. This appears to be semi-autobiographical, based on a three-month visit to Australia by Lawrence and his wife Frieda, in 1922. \r\n\r\nThe novel includes a chapter (\"Nightmare\") describing the Somers' experiences in wartime St Ives, Cornwall, vivid descriptions of the Australian landscape, and Richard Somers' sceptical reflections on fringe politics in Sydney. Kangaroo's movement, and the \"great general emotion\" of Kangaroo himself, do not appeal to Somers, and in this the novel begins to reflect Lawrence's own experiences during World War I. Somers also rejects the socialism of Struthers, which emphasizes \"generalized love\".", "asin": "1543248373", "rank": "3965646", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51DDonIOtDL.jpg", "country": "Australia", "story_arc": ["Tragedy", "Things only get worse"]}