{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 15, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "A riveting yet delicate high-stakes political drama, with all the requisite seductions, subtle gamesmanship, and (Victorian) sex.  Set in Reconstruction Era United States, a compelling battle of pathos erupts between virtù (Desire for Truth) on one hand, and the corresponding vices of ambition and lust on the other. It gets better: the novel is a master class of symbolic character development and the illusive writing of complex and meaningful ideas into dramatic plot.For those interested in the trajectory of Democracy/History/Culture in the United States (and the World), the book is absolutely essential. We owe this partly to the credentials of the author, Henry Adams. His upper-crust shoulder rubbing in the political elite of Europe and United States combined with his psychologist's temperament (on full display in his book, Education of..) make for an invaluable contribution to world culture. Adams lived through a very critical era for modern understanding: Post-Civil War industrialism and modern capitalism and the corresponding influence on contemporary party politics. It bears repeating that this novel is as relevant today as anything currently written.Although the dialogue heavy plot and prominence of the character-study are not ideally suited for modernity's fixation on thrill and shock, one who also has an appreciation for a novel of ideas will be delighted nonetheless. I consider the book to be a Brave New World for Democracy, as opposed to the Mendelian Dystopia which BNW exposed."}, {"review_sentiment": 5.0, "review_text": "The problem, according to Henry B. Adams in his fascinating novel, \"Democracy,\" isn't really with the government. It's with you -- at least, it is if you're part of a country in which the people (not dictators operating through decree) are the real governing body. I found this quotation from Adams' book to sum it up best:\"No representative government can long be much better or much worse than the society it represents. Purify society and you purify the government. But try to purify the government artificially and you only aggravate failure.\"Librivox.org has a well-read audio version of this book, free for the downloading."}, {"review_sentiment": 3.0, "review_text": "\"Democracy - An American Novel\" was published anonymously in 1880, and it was not to be revealed until after his death in 1918 that Henry Adams was the author.  Henry Adams was son of Charles Francis Adams Sr., who served in the House of Representatives for one term, and then as the U.S. Ambassador to Great Britain under Abraham Lincoln and Andrew Johnson.  He was also the grandson of John Quincy Adams and the great grandson of John Adams both of whom held the highest office for one term, so it is hardly surprising that he was familiar with politics.  Henry Adams himself was a journalist, acting as the anonymous correspondent for the New York Times while he was there during the time his father was Ambassador. Adams continued as a Journalist after returning to the U.S. switched to being an historian for a while, before continuing to work in both fields after moving to Washington D. C.  \"Democracy\" is one of two novels that he wrote, the rest of his works were non-fiction, including his autobiographical work \"The Education of Henry Adams\" for which he is most well known.The main focus of the novel is Madeleine Lee, a young widower who moves from New York society to Washington looking for a political gem.  The time is shortly after the election of a new President.  There are no years given, but based on comments by characters in the novel it would take place around the time it was published, but the characters are fictional even though they reference real politicians from the past.  The President is referred to by a nickname of \"Old Granite\" that the President had, which clearly reveals both Andrew Jackson (\"Old Hickory\") and Ulysses Grant as two of the people on which he was based.  The President is mostly a side-character in this novel though, as the key character to represent the problems with politics is Senator Silas P. Ratcliffe, a man whose political ambition leads to the White House, and he sees Madeline as an asset to help him achieve that goal.Ratcliffe is the kind of man who goes to church because he needs the church votes, and who can excuse any action by pointing to politicians being a reflection of their society and thus one must first purify society before one can purify politics.  Ratcliffe's political nemesis is the new President, though they are of the same party.  The President aims to bring Ratcliffe into his cabinet and frustrate him by thwarting his every move, before letting him go.  Ratcliffe's moral opponent is John Carrington, a Southern politician from Virginia who fought on the side of the Confederacy.  Ratcliffe is extremely powerful, and he artfully works his way to foil both the President and Carrington, but Carrington proves he has a few tricks left as he out maneuvers Ratcliffe in the end.The discussions in the novel often concern the politics of the time, so it is worthwhile to read up on the history of that period to fully appreciate the novel.  Some sections though don't require that, such as the visit to Mount Vernon where the characters are obliged to tear-down the memory of Washington to bring him down to their level.  Adams turns the story about the cherry tree on its head as one character describes him as cutting down all his father's fruit-trees in a fit of passion, and then threatening his father with the hatchet.  One might think that Henry Adams had become very cynical about politics when reading this novel, but the fact that Carrington is able to influence Madeleine Lee at the end, shows that he had at least some hope left for Democracy.Overall I think this is an enjoyable satire, but I was a bit disappointed in the lack of accompanying material in the Penguin Classics edition.  Earl N. Harbert's introduction is very good, but there are no notes for the text, and no historical timeline.  The lack of notes is the thing I missed the most, as I think the reading experience would have been enhanced with references discussing the political and social issues of the time to which Adams referred.  Thus I give this book three stars, but it could easily have been four if the supporting material were better."}, {"review_sentiment": 4.0, "review_text": "This is a fine novel, but don't buy the 106 p. Feather Trail Press publication unless you enjoy eye strain.  The type is tiny (8 pt?). The lines are jammed on the page.  Also, besides various typos, the typesetting is strange: for some unknown reason random paragraph breaks are inserted after \"Mrs.\" and \"Mr.\" on occasions too numerous to list. Buy another edition!"}, {"review_sentiment": 5.0, "review_text": "Henry Adams was a scion of the famous Adams family which produced two American Preisdents in John and his son John Quincy. Henry Adams (1838-1918) is best known as the author of \"Mont Saint Michel\", \"Chartes\" and his influential autobiography, \"The Education of Henry Adams.' Adams wrote \"Democracy\" in 1880 publishing it anonymously. It is his only novel charming us with its wit, elegance and backstage look at corruption in high places in the national capital.  The plot concerns Madeline Lee a wealthy New York socialite. Madeline has lost her husband and her son to diptheria. As a widow she is engrossed in good and philanthropic charities. She is approaching thirty thirsting for a sip from the cup of political power. She and her younger sister the lovely Sybil journey to DC.  Madeline is soon being courted by the corrupt Senator (and later Secretary of the Treasury) the corruptible Silas P. Ratcliff from Illinois. He has presidential aspirations but after his past dirty dealinig is revealed to Madeline she dumps him for a jaunt to Europe. Another man Mr. Carrington a Virginian and Civil War veteran also is in love with her. Their romance is not resolved as the short novel reaches its final page.  One who reads this work will realize that corruption, nepotism and stupidity are not new to American politics! Minor characters such as the humorous Victoria Dare and the British diplomat Lord Skye add humor to the social swirl. Adams charms us with his discussion of the characters visits to the homes of George Washington at Mount Vernon and Robert Edward Lee in Arlington House.  This is one of the best novels ever written dealing with national politics. Henry Adams wrote it with years of experience and knowledge of poltics. It is well worth a close read and is a little gem of a book!"}, {"review_sentiment": 4.0, "review_text": "Henry Adams' trenchant observations on politics in the 19th century is every bit as relevant today.  Fatuous, self-important senators apparently have some shared genetic code that has survived through the ages.Unfortunately, I bought a soft copy from Cosimo Classics <[...]>. It is the worst published book I have ever owned.  There was at least one typo per page, and the typesetter placed a hard carriage return after \"Mrs.\" most of the time so that a new paragraph started with the name \"Lee\".  The publishing errors were so bad and distracting that I had a hard time finishing the story and I just threw the book away when finished because it wasn't even worth giving away.  I'll never make a purchase from these publishers again, but I would recommend the story to anyone."}, {"review_sentiment": 5.0, "review_text": "While this book/pamplet was written a good while back in American history it's message still holds true!  This is a written look at a period of American history that should never be forgotten."}, {"review_sentiment": 5.0, "review_text": "Excellent.  Simply excellent!"}, {"review_sentiment": 4.0, "review_text": "Henry Adams, the direct descendent of two presidents, published his novel, Democracy, anonymously in 1880.  About one hundred years had passed since the launching of the great American political experiment and through his novel Adams takes stock of its results.The novel also seems to be a catharsis for Adams, an internal monologue explaining to himself why, burdened by society's considerable expectations and helped by powerful family connections, he eschews a career in elective politics.Adams speaks through the novel's protagonist, Mrs. Lightfoot Lee, and sometimes through Mr. Nathan Gore, a literary man.  Other personages are caricatures, representing types of people, such as the obvious Mr. Hartbeest Schneidekoupon, a rich, amateur politician, whose German last name means \"coupon clipper,\" a nineteenth-century term for the idle rich.  Old World diplomats, duty-bound officials, skirt chasers, sanctimonious reformers and down-in-the-dirt politicians are Mrs. Lee's and Mr. Gore's foils as they visit Washington to examine the engine room of democracy.Corruption, the role of money in politics and the ignorance of powerful politicians give Adams concern for the health of the American political system.  These concerns are woven throughout the novel's action.  \"Surely something can be done to check corruption.  Are we for ever to be at the mercy of thieves and ruffians?  Is respectable government impossible in a democracy?\" asks Adams through Mrs. Lee.  In light of these obvious defects, Adams wonders if America's great experiment is right or wrong.Adams' picture of 1880 Washington politics contrasts starkly with the noble principles debated by the country's founders and enshrined in its founding documents.  Today's politicians, according to Adams, only give lip service to principles.  Lofty ideas are only useful when they help you get what you want.  Politics has become a bazaar, where money reigns.  As Senator Ratcliffe, a corrupt Washington power broker, states:  \"Public men ... cannot be dressing themselves to-day in Washington's old clothes. If Washington were President now, he would have to learn our ways or lose his next election.\"While a foreign diplomat who claims intimate knowledge with world corruption predicts that Washington will in one-hundred years become the world's most corrupt city, Adams doesn't despair for democracy.  As Nathan Gore states: \"I grant it is an experiment, but it is the only direction society can take that is worth its taking; .... Every other possible step is backward, and I do not care to repeat the past.\"  Adams concludes, however, that as a man for whom principles are important, he's not suited for a career in elective politics.While Adams' novel was written about one hundred years after the United States' founding, another hundred years has passed. Adams was a knowledgeable and perceptive political observer of his time.  A reader might pause to ask:  What's changed?  Are Adams' observations still relevant?  Is his somewhat subdued enthusiasm for democracy still grounds for optimism?  Is every other possible step backward?"}, {"review_sentiment": 4.0, "review_text": "\"Democracy\" is what \"Primary Colors\" would have been if the latter had been well-written. Like Joe Klein, Adams published his book anonymously and skewered a number of contemporary politicians (including President Rutherford B. Hayes). But Adams goes two steps further: his novel is a scathing commentary more on the American political system in general than on one administration in particular, and his characters are iconic and recognizable in any era.In \"Democracy,\" the nation's capital \"swarms with simple-minded exhibitions of human nature; men and women curiously out of place, whom it would be cruel to ridicule and ridiculous to weep over.\" But Adams is not hesitant about being cruel in his portrayal of Washington's residents, and he saves his weeping for the true victims in his novel: the American people. The typical American senator combines \"the utmost pragmatical self-assurance  and overbearing temper with the narrowest education and meanest personal experience that ever existed in any considerable government.\" (Plus ca change, plus c'est la meme chose!)The story concerns Madeleine Lee, an intelligent and well-meaning (if somewhat naive) New York widow, who, bored with her cosmopolitan lifestyle, travels to Washington to learn what makes the nation tick. She and her sister are quickly surrounded by a diverse group of politicians, lobbyists, and foreign diplomats, and she finds herself courted by Silas Ratcliffe, a senator with presidential aspirations whose talent \"consisted in the skill with which he evaded questions of principle.\" During one heated (and humorous) argument about George Washington's merits, Ratcliffe sums up his view of politics: \"If virtue won't answer our purpose, then we must use vice, or our opponents will put us out of office.\"Adams's prose is almost Jamesian in its measured pacing (and this may simply bore some readers); the initial chapters are unhurried as he weaves the web of the plot and sketches his all-too-believable characters. Along the way he tosses barbed zingers at every target. The climactic passages are among the most comically riveting, emotionally intense, and morally satisfying finales I've read in a satire: as you might expect, nobody gets exactly what they want, but everyone gets what they deserve."}]}, "authors": ["Henry Adams"], "isbn": "1544277288", "longitude": 0.0, "periods": null, "title": "Democracy", "word_cloud": "riveting yet delicate political drama requisite seduction subtle gamesmanship victorian sex compel battle pathos erupts virtue hand correspond vice ambition lust get better master class symbolic character development illusive writing complex meaningful idea dramatic interested trajectory absolutely essential owe partly credential author shoulder rub political elite combine psychologist temperament full display make invaluable contribution world culture live critical era modern understanding industrialism modern capitalism correspond influence contemporary party politics bear repeat relevant today anything currently dialogue heavy plot prominence ideally suit modernity fixation thrill shock also appreciation idea delight nonetheless consider oppose mendelian expose problem accord fascinate really government least part country people dictator operate decree real govern body find quotation sum best representative government long much better much worse society represent society purify government purify government artificially aggravate failure audio version free downloading american publish anonymously reveal death author son serve representatives term also grandson great grandson hold highest office term hardly surprising familiar politics journalist act anonymous correspondent time father continue return switch historian continue work field move novel write rest work include autobiographical work well main focus young widower move society look political gem time shortly election new year give base comment character place time publish character fictional even reference real politician refer nickname clearly reveal people base mostly key character represent problem politics man political ambition lead see asset help kind man go church need church vote excuse action point politician reflection society thus society purify politics political nemesis new party aim bring cabinet frustrate thwarting move let go moral opponent politician fight side extremely powerful artfully work way foil prove trick leave maneuver discussion often concern politics time worthwhile history period fully section require visit character oblige memory bring level turn story cherry tree head character describe cut father fit passion threaten father hatchet cynical politics read fact able influence end show least hope leave think enjoyable satire bite disappointed lack accompany material edition introduction good note text historical timeline lack note thing miss think read experience reference discuss political social issue time refer give star easily support material better fine buy publication enjoy eye strain type tiny pt line jam page also besides various typo typeset strange unknown reason random paragraph break insert occasion numerous list edition scion famous family produce american president son best know author influential autobiography write publish anonymously charm wit elegance backstage look corruption high place national capital plot concern wealthy socialite lose husband son diphtheria widow engross good philanthropic charity approach thirty thirst sip cup political power younger sister lovely journey soon court corrupt later corruptible presidential aspiration dirty dealing reveal dump man veteran also love romance resolve short reach final page read work corruption nepotism stupidity new american politics minor character humorous diplomat humor social swirl charm discussion character visit home best novel ever write deal national politics write year experience knowledge politics well close little gem trenchant observation politics century bit relevant today senator apparently share genetic code survive buy soft copy worst publish ever own least typo page typesetter place hard carriage return time new paragraph start name publishing error bad distract hard time finish story throw away finish even worth give away never make purchase publisher story anyone write good back american history message still hold true write look period american history never forget excellent direct descendant president publish anonymously year pass launch great american political experiment take stock also seem catharsis internal monologue explain burden society considerable expectation help powerful family connection eschew career elective speaks protagonist sometimes literary man other personages caricature represent type people obvious rich amateur politician german last name mean coupon clipper term idle rich diplomats official skirt chaser sanctimonious reformer politician foil examine engine room role money politics ignorance powerful politician give concern health political system concern woven action surely something do check corruption ever mercy thief ruffian be respectable government impossible ask light obvious defect wonder great experiment right picture politics contrast starkly noble principle debate country founder enshrine found document today politician accord give lip service principle idea useful help want become bazaar money reign corrupt power broker state men dress old clothes way next election foreign diplomat claim intimate knowledge world corruption predict year become world corrupt city despair state grant experiment direction society worth take possible step backward care repeat past conclude however man principle important suit career elective write year found year pass knowledgeable perceptive political observer time change observation still relevant be somewhat subdued enthusiasm still ground optimism be possible step backward publish anonymously skewer number contemporary politician include go step scathing commentary american political system general administration particular character iconic recognizable nation capital swarm exhibition human nature men woman curiously place ridicule ridiculous weep hesitant cruel portrayal resident save weep true victim american people typical senator combine utmost pragmatical overbear temper narrowest education meanest personal experience ever exist considerable government meme story concern intelligent somewhat naive widow bore cosmopolitan lifestyle travel learn make nation sister quickly surrounded diverse group politician lobbyists foreign diplomat find court senator presidential aspiration talent consist skill evade question principle heat humorous argument merit sum view politics virtue purpose vice opponent put office prose almost jamesian measure pacing simply reader initial chapter unhurried weave web plot sketch character way toss barb zinger target climactic passage comically rivet emotionally intense morally satisfy finale satire nobody get exactly want everyone get", "genres": ["Fiction & Literature", "Politics"], "summary": "An instant bestseller when first published in 1880, Democracy is the quintessential American political novel. At its heart is Madeleine Lee, a young widow who comes to Washington, D.C., to understand the workings of power. Pursued by Silas Ratcliffe, the most influential member of the Senate, Madeleine soon sees enough of power and its corrupting influence to last her a lifetime.\r\n\r\nFirst published anonymously, it wasn't until the 1925 edition that Adams was listed as author. Henry Adams remarked (ironically as usual), \"The wholesale piracy of Democracy was the single real triumph of my life.\"—it was very popular, as readers tried to guess who the author was and who the characters really were.\r\n\r\n“[One] of the most perceptive books ever written about Washington.” Maureen Dowd, The New York Times \r\n", "asin": "1544277288", "rank": 0, "city": "", "image": "https://images-na.ssl-images-amazon.com/images/I/41Fujcj1HRL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}