{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 46.4846583, "ratings": {"num_ratings": 12, "rating": 4.5, "reviews": [{"review_sentiment": 4.0, "review_text": "Fine reflections of the era."}, {"review_sentiment": 4.0, "review_text": "This novel about Russian houses of prostitution is sympathetic towards the women who work there. The translation by Bernard Guilbert Guerney is excellent."}, {"review_sentiment": 5.0, "review_text": "I love this novel and read it through several times. It deserves every star it could possibly be given. The reason I am writing this review is the fact that the author's name is misspelled. It was written by ALEXANDER Kuprin, one of most talented Russian writers of the \"silver\" era in literature. I can't believe a publisher would overlook such a mistake. I would readily buy this edition, as I want to gift it to a friend of mine because I like the cover best compared to other editions (granted some others have the misspelled name on the cover as well), but this is just reprehensible."}, {"review_sentiment": 5.0, "review_text": "Such insight regarding a much-abused-purposely misunderstood subject; world class writing from Russia's Golden Age. I discovered the book quite by accident; am so happy I did."}, {"review_sentiment": 4.0, "review_text": "B.G. Guerney's translations from Russian are amazingly good.  I admit that my knowledge of Russian is imperfect, but all a reader who has no Russian need do is compare B.G.G.'s translations of Turgenev's FATHERS AND SONS or Gogol's DEAD SOULS with other existing translations to see the qualitative difference.  (Nabokov, the cruelest judge ever of translators from the Russian, praised Guerney's Gogol.)Unfortunately, his magnificent talent is wasted on Kuprin's lurid study of life in a 19th century Russian brothel.  This is not a \"classic\" of Russian literature, unless you think, say, Nelson Algren is a \"classic\" of American literature.Why the devil someone didn't commission Guerney to translate the major novels of Dostoevsky or Tolstoy is an unfathomable mystery to me.I suppose the status of Constance Garnett was unquestioned (probably partly for extra-literary reasons, though her translations are not as bad as some would claim), but Guerney's version of THE IDIOT is a book that I wish existed, in spite of Garnett, McDuff, and Peaver & friend."}, {"review_sentiment": 5.0, "review_text": "The interesting thing about Kuprin is the speed of his novels. Kuprin, both in Yama and in The Duel, spends about 2/3 of the novel setting up a scene, a situation, a reality for the reader. This can be slightly tedious if one is not willing to participate in the author's will. If you are slightly interested in going along with the story, and by that I mean putting in a bit of time and effort into reading the beginning, the this book will rivet you to it for the second half, draining all of your energy by the time you have finished. I was surprised myself when I read the book, considering I tend to be a bit estranged from Russian fiction, despite my continued enjoyment of the genre. The comments it has about the human condition are wonderful and grim at the same time, leaving the reader much to consider. That is a great thing I like about this book compared to the regular Dostoevsky and Tolstoy, that it gives you a scene and lets you determine the solution, meaning, thesis, etc. instead of pushing it down your throat in rather obvious manners like the aforementioned authors rather specific views on religion, not that those detract from the interest of those authors anyways.Overall, if you are interested in Russian literature, I highly suggest this underrated and overlooked author."}, {"review_sentiment": 5.0, "review_text": "Written between 1909 and 1915 in three parts by the enfant terrible of Russian literature, Alexander Kuprin's Yama is an extraordinarily frank and in-depth look at the nature of prostitution that must certainly have been revolutionary for its time as it is no less powerful and relevant today. The novel recounts the lives of the prostitutes of a run-down outlying district of a large southern Russian town of Odessa, the district known as Yamaskaya, or, more commonly, Yama - The Pit.Inevitably, the depiction of the impoverished circumstances of the lifestyle of the girls at Anna Markovna's house of ill repute - a lower quality 2-rouble establishment on Little Yamaskaya (the more upmarket brothels operating in Greater Yamaskaya) - is grim, sordid and degrading, but the novel looks realistically at the outlook maintained by the women and the lives that they have escaped from that permits them to endure the hardships of their profession. Some of the clients are indeed foul and the women are at the mercy of murderous pimps, but each of the girls although inclined to gossip and compete with each other, are determined to please as women, wishing to be seen or treated as special - a perhaps surprising notion, but one that is clearly accurately related to basic human nature.That kind of perceptive observation is related, by extension through the clients from all walks of life that the women receive, out into society in general, reflecting other less savoury aspects of Russian life, attitudes and behaviour. Divided into three parts, it's expansive in this respect, considering the social and moral implications of prostitution, examining the case of one woman Liubka who leaves the brothel under the tutelage of a \"benefactor\", and that of another, Jennka, who succumbs to the psychological pressures and medical hazards of the prostitute, taking in along the way journalists, students and a baroness, all of them trying to form a moral view on the subject that they can reconcile with their own natures, as well as a travelling salesman who traffics the women from one part of the country to another and in the process even extending his business into a multinational operation.Yama is an extensive and expansive look then at all aspects of the commerce of prostitution, the need for the profession and the morality of it as it relates to different parts of society, but it's no mere academic exercise. There is a remarkable degree of detail accurately observed in the psychology and behaviour of many of the characters, the whole subject vividly and colourfully depicted with precision and authenticity."}, {"review_sentiment": 4.0, "review_text": "For some reason I had never even heard of Yama until recently.  Just imagine my surprise upon picking this up and finding a spectacular classic.  Kuprin does indeed tread that fine line between cheese and morality (both being boorish methods of storytelling) to create a truly human picture of Russian society.  If you are interested in the glorification of vice and youthful indiscretions, please reread Burroughs, Miller or Selby.  Likewise, if you are interested in moral high ground, stick to Tolstoy.  Here, Kuprin deftly defies the clichés to create not only a wonderful illustration of Russian life but a great story as well.  This is amazing considering the time period in which it was written."}, {"review_sentiment": 5.0, "review_text": "This book was widely praised by the Bolsheviks during and just after the Russian Revolution even though the author fought with the White Russians and was forced into exile in Paris at the conclusion of the Revolution. The book was made into a film in 1936 by the Japanese director Kenji Mizoguchi."}, {"review_sentiment": 5.0, "review_text": "ALEXANDER KUPRIN (1870 ~ 1938) was a Russian who opposed the Bolshevic revolution and thus found himself an exile in Paris. he wrote strong novels of realism. Yama: The Pit shocked the world with its graphic presentation of life in Russian brothels and the inherent violence prevelent in the underside of Russian urban life. It is a brutal, but honest portrayal and, even through translation, one realizes that Kuprin was a great writer with a strong style."}]}, "authors": ["Aleksandr Kuprin"], "isbn": "1545253803", "longitude": 30.732564, "periods": ["1900s"], "title": "Yama: The Pit", "word_cloud": "fine reflection era russian house prostitution sympathetic towards woman work translation excellent love several time deserve star possibly give reason write review fact author name misspell write talented russian writer silver era literature publisher mistake readily edition want gift friend mine like cover best compare edition grant others misspell name cover well reprehensible such insight regard misunderstood subject world class write discover quite accident happy translation russian amazingly good admit knowledge russian imperfect need compare translation exist translation see qualitative difference cruelest judge ever translator praise magnificent talent waste lurid study life century russian brothel classic russian literature think say classic devil someone commission translate major novel unfathomable mystery suppose status unquestioned probably partly reason translation bad version wish exist spite friend interesting thing speed novel spend set scene situation reality slightly tedious willing participate author slightly interested go story mean put bit time effort read begin rivet second half drain energy time finish surprise consider tend bit estranged russian fiction continued enjoyment genre comment human condition wonderful grim time leave much consider great thing like compare regular give scene let determine solution mean thesis instead push throat rather obvious manner aforementioned author rather specific view religion detract interest author interested russian literature highly suggest underrated overlook author part infant terrible russian literature extraordinarily frank look nature prostitution certainly revolutionary time le powerful relevant today recount live prostitute outlying district large southern russian town district know commonly lama depiction impoverish circumstance lifestyle girl house ill lower quality establishment upmarket brothel operate grim sordid degrade look realistically outlook maintain woman live escape permit endure hardships profession client indeed foul woman mercy murderous pimp girl inclined gossip compete determine please woman wish see treat special perhaps surprising notion clearly accurately related basic human kind perceptive observation relate extension client walk life woman receive society general reflect le savory aspect russian life attitude behavior divide part expansive respect consider social moral implication prostitution examine case woman leave brothel tutelage benefactor succumb psychological pressure medical hazard prostitute take way journalist student try form moral view subject reconcile nature well travel salesman traffic woman part country process even extend business multinational extensive expansive look aspect commerce prostitution need profession morality relate different part society mere academic exercise remarkable degree detail accurately observe psychology behavior many character whole subject vividly colorfully depict precision authenticity reason never even heard recently imagine surprise pick find spectacular classic indeed tread fine line cheese morality boorish method storytelling create truly human picture russian society interested glorification vice youthful indiscretion please reread interested moral high ground stick here deftly defy cliche create wonderful illustration russian life great story well amaze consider time period write widely praise russian even author fight force exile conclusion make film japanese director oppose revolution thus find write strong novel realism lama shock world graphic presentation life russian brothel inherent violence prevalent underside russian urban life brutal honest portrayal even translation realize great writer strong style", "genres": ["Fiction & Literature"], "summary": "The Pit is a novel by Alexander Kuprin published in installments between 1909 and 1915. The book, centering on a brothel, owned by a woman named Anna Markovna, caused much controversy in its time.\r\n\r\nAlexander Kuprin started collecting the material for his work in Kiev in 1890s, and it is in this city that the novel's action takes place. Speaking in 1909 to a local newspaper correspondent about prototypes, he commented: \"Characters I've made cannot be seen as copying real people. I picked up a lot of small details from the real life, but that was by no means copying the reality, which is something I detest doing.\" He added that his observations were by no means restricted to Kiev. \"The Pit is Odessa, Petersburg and Kiev,\" Kuprin said.\r\n", "asin": "1545253803", "rank": "5576415", "city": "Odessa", "image": "https://images-na.ssl-images-amazon.com/images/I/51P%2BBgYoWBL.jpg", "country": "Ukraine", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}