{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 2, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Enjoyable read prior to our trip to the Galapagos."}, {"review_sentiment": 5.0, "review_text": "What prompts sixty thousand people per year to visit an isolated group of barren, arid, volcanic islands?  They tramp dusty trails, peer into bushes and caves, suffer equatorial sun and strange animals almost without a murmur of complaint.  A few, like Paul Quarrington are seeking some answers.  Sometimes it's The Answer that's sought.  These pilgrims are trailing the man who conceived the best idea anyone, any time, ever had.  They retrace the footsteps of Charles Robert Darwin, who visited the Galapagos Islands, then returned home to think about what he'd seen.  What Darwin saw and thought led to the first understanding of how life, the universe and everything, actually works.Quarrington visited the Islands with his daughter Carson, seven years old, and his father, \"ten times that age\".  Quarrington, in an illustrious account, sought what Darwin found - a Great Insight.  In keeping with that quest, his narrative is highly personalized and introspective.  That is, after all, what \"insight\" is - looking inward.  He recounts his boyhood adoption of divine Special Creation of the universe.  Over the years, however, he came to understand how unsatisfying divine creation is in explaining life.  As with those thousands of others, he came to see a pilgrimage to the islands as a likely source of enlightenment.He admits the symbolism of visiting the Galapagos with three generations.  The account explains his travails as both a son and a parent.  Where does \"natural selection\" fit in his dealings with his father and his daughter?  He examines his own life, what he knows of his father's and how confesses to how adroitly Carson manipulates him.  Through it all, Quarrington gives snippets of Darwin's life and thinking, that of natural selection's critics and how many questions have been pondered and answered.  In order to accomplish this, he relies on a bevy of writers listed in a five-page bibliography.  That's an enterprising effort for a writer listed as a \"humourist\".  Yet, the humour, rich with ironies, is in full flower in this lucid account.  Between the science, the charming [and sometimes not so charming] wit, he has provided a singularly readable account of one man's wrestling with the attempt to find something divine, where divinity has no place.  It's a book reflecting what many have experienced, although likely with less success.In the end, Quarrington does achieve an insight.  Perhaps even an Insight.  While it's doubtlessly his own, unique in a way that may keep only its conceiver satisfied.  Still, he accomplishes it after strenuous effort.  He achieves it very early one morning in his kitchen, sipping a single malt and expressing contentment at what he has wrought.  That's not a bad environment for gaining Insight.  If he attains well-being from what he's wrought, who are we to dismiss it?  He's made the effort, laid out his own path, and, like those pilgrims following Darwin's trail, perhaps we can follow Quarrington's example.  [stephen a. haines - Ottawa, Canada]"}]}, "authors": ["Paul Quarrington"], "isbn": "1550547011", "longitude": 0.0, "periods": ["2000s"], "title": "The Boy on the Back of the Turtle", "word_cloud": "enjoyable prior trip prompt sixty people year visit isolate group barren arid volcanic island tramp dusty trail peer bush cave suffer equatorial sun strange animal almost murmur complaint like seek answer sometimes seek pilgrim trail man conceive best idea anyone time ever retrace footstep visit return home think see saw thought lead first understanding life universe everything actually visit daughter year old father ten time age illustrious account seek find keep quest narrative highly personalized introspective insight look inward recount boyhood adoption divine universe year however come understand unsatisfying divine creation explain life thousand others come see pilgrimage island likely source admits symbolism visit generation account explain travail son parent natural selection fit dealing father daughter examine life know father confesses adroitly manipulate give snippet life think natural selection critic many question ponder answer order accomplish relies bevy writer list bibliography enterprising effort writer list humorist yet rich irony full flower lucid account science charm sometimes charm wit provide singularly readable account man wrestle attempt find something divine divinity place reflect many experience likely le end achieve insight perhaps even doubtlessly unique way conceive satisfy still accomplish strenuous effort achieve early morning kitchen sip single malt express contentment work bad environment gain attains work dismiss make effort laid path pilgrim follow trail perhaps follow example stephen gaines", "genres": ["Memoir", "Travel Writing"], "summary": "Seeking God, Quince Marmalade, and the Fabled Albatross on Darwin's Islands\r\n\r\nIn The Boy on the Back of the Turtle, Quarrington attempts to discover his own little niche in the cosmos. Cruising the volcanic Galapagos Islands on a 90-foot liner called the Corinthian in the company of his daughter, age 7, and his father, age 73, he tries to find his place as a Son, as a Father, as a Mortal frolicking beneath the heavens. \r\n\r\nOne of the funniest and most talented writers on the planet, Quarrington employs his trademark combination of wry wit and poignant observation as he takes readers on a wide-ranging investigation of everything from blue-footed boobies, careerism, taxonomy and the nature of creation to pirates, frigate birds, Herman Melville and the precarious ecology of the islands and the planet. \r\n\r\nAnd as the Corinthian travels in the belly of night from one island to another, Quarrington wrestles with questions great and small. Given that the Galapagos is the historic site of God’s greatest setback, he points out, it is a fitting place to play out the battle within himself. A more engaging--and entertaining--battle has seldom been waged.", "asin": "1550547011", "rank": "350332", "city": "Galápagos Islands", "image": "https://images-na.ssl-images-amazon.com/images/I/51YGXdf89aL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}