{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 2, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "A great book, thoroughly researched and a good read."}, {"review_sentiment": 5.0, "review_text": "A sweet little book, I read much of it while out walking around the South End of Boston (walking while reading is one of my many bad habits). Soderstom has woven together elements of social history (the stories of Baron Haussmann and Paris, Jane Jacobs and New York and Toronto), with personal narrative and policy analysis. She makes you want to get out and walk around, and travel, travel even to such unexpected places as Don Mills Ontario (now there is a sentence I had never expected to write).This book is a gentle introduction to what we need to do to make our towns and cities more walkable and our lives healthier and more enjoyable. It is especially recommended as it covers nit just North American (New York, Toronto, Carlsbad CA, Don Mills, North Vancouver), but other places as well - Europe (mostly Paris), Asia (Singapore) and Africa (Lushoto, Tanzania).I have been fortunate to always have lived in cities that were walkable (Montreal, Ottawa, Tokyo, Copenhagen, Vancouver, Boston) and now I will only live in a place where I can walk to a good fish monger, green grocer and bookstore, where I can get downtown by foot, and where I can cycle or walk to work. My current home in the South End of Boston is perfect, as is the place where my wife and I raised our children, Kitsilano in Vancouver.One small point - there is little in this book about cycling. I hope that the cities and towns of the future will blend walking, cycling, low impact public transit and good access to interurban transportation that pushes feelers out into the coutryside. Perhaps Soderstrom will follow up this book with something on urban cycling - an edgier experience than walking, but vital to our future transportation (I hope).In any case, I liked this book enough to go out and order her other two books: Green City: People Nature and Urban Places and Recreating Eden: A Natural History of Botanical Gardens."}]}, "authors": ["Mary Soderstrom"], "isbn": "1550652435", "longitude": -79.387207, "periods": ["1800s", "1900s", "2000s", "Recent Releases"], "title": "The Walkable City: From Haussmann's Boulevards to Jane Jacobs' Streets and Beyond", "word_cloud": "great thoroughly research good sweet little much walk walk read many bad habit woven together elements social history story personal narrative policy analysis make want walk travel travel even unexpected place sentence never expect write gentle introduction town city life healthier enjoyable especially recommend cover nit north american place well mostly fortunate always live city live place walk good fish monger green grocer bookstore get downtown foot cycle walk work current home perfect place wife raise child small point little cycling hope city town future blend walk cycle low impact public transit good access interurban transportation push feeler countryside perhaps follow something urban cycling edgier experience walk vital future transportation hope case like enough go order green", "genres": ["Art & Architecture", "History", "Travel Writing", "Urbanism"], "summary": "Through Paris, New York City, Toronto, North Vancouver, and Singapore, this examination depicts how the architectural evolutions of major cities have changed the lives of their ordinary citizens—in both positive and negative ways. According to this account, making a metropolis navigable by foot again is crucial, and it suggests how people can reorganize their personal lives in order to make this possible again. \r\n\r\nFrom Baron George Eugene Haussmann and his ruthless transformation of Paris to the redevelopment of North America to adapt to automobiles, this chronicle investigates the dramatic changes that have occurred in the past 200 years, providing a valuable critique of the ideas regarding how cities should be designed.", "asin": "1550652435", "rank": "3561892", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/41yfet4whbL.jpg", "country": "Canada", "story_arc": ["Tragedy", "Things only get worse"]}