{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 49.262428, "ratings": {"num_ratings": 13, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Love Grant's colourful and hilarious story telling about coastal adventures!  Each summer we pull out the book to read excerpts to visiting friends and laugh all over again.  Sure to be a permanent family-favourite to become tattered and torn due to over-affection over the years!"}, {"review_sentiment": 5.0, "review_text": "Wonderful book. We read this while sailing Desolation Sound and took turns reading out loud. Poignant and funny."}, {"review_sentiment": 4.0, "review_text": "Loved it. Read while on our boat in Desolation Sound. Found Grant's cabin in the Sound and saw so many of the places mentioned in the book. Loved the humor and truth."}, {"review_sentiment": 4.0, "review_text": "I gave it four of five stars because it starts rather slow. But once it takes off, it's out the gate and around the bend. And you feel like you  are with him in Desolate Sound, falling in love over and over with an isolated area sprinkled with eccentrics, laced with mysteries, and surrounded by beauty, both heartbreaking and dangerous."}, {"review_sentiment": 5.0, "review_text": "LOVE this book, great writing, and I want to go to Desolation Sound."}, {"review_sentiment": 5.0, "review_text": "Great book, normally I'm not a reader but this one grabbed me. I read in during my trip to Europe and the plane ride flew by. Highly recommend."}, {"review_sentiment": 5.0, "review_text": "We read out loud to each other often as we live on our boat and sail often, a perfect activity for our lifestyle. These stories are funny, filled with history and reminders to live life well.  We are ready for the next book that Grant writes.We have bought a boat load of copies to hand to friends.  We read to them during their visits with us.  One chapter and they are hooked. We send them home with their own copy.Makes a great gift."}, {"review_sentiment": 2.0, "review_text": "Before going to spend some time kayaking in British Columbia, I decided to purchase this book to read more about the Desolation Sound area. It sounded like this would be humorous and also contain some information. Well, the humor part was the big mistake. Grant Lawrence presented himself as a whiney twit, both as a child and adult. I only read a couple of chapters and then gave the book away. Not funny or entertaining."}, {"review_sentiment": 5.0, "review_text": "...you'll enjoy Grant Lawrence's first book.In many ways this feels like a travel book - Grant conveys a real sense of place as he takes you to Desolation Sound (found on the west coast of British Columbia, at the top Georgia Strait and east of Vancouver Island). But this is as much an autobiography and reminiscence as it is about this obscure corner of the world.The book is the better for this personal perspective. We learn about Desolation Sound and its quirky residents through the eyes of Grant Lawrence, from his reluctant childhood introduction to this Canadian Outback through to his fully embrace of its charms as an adult.The stories Grant relates are often funny and more than occasionally touching. Grant's wry, self-deprecating wit and matter of fact prose will remind readers of Bill Bryson or Garrison Keillor. Make no misatke though, Grant's voice is his own.Reading Adventures in Solitude, we see Desolation Sound through eyes that are keen in their insight and affectionate in their gaze. The best compliment I can give is that I spent much of the book looking at Google Maps and dreaming of a summer vacation past the end of the road."}, {"review_sentiment": 5.0, "review_text": "When I wrote 'Up the Lake: Coastal British Columbia Stories' I attempted to do what Grant Lawrence did so successfully with this book. His adventures are in the same area as mine, but I've limited most of my explorations to Powell Lake and its floating cabins. What a tremendous region, as captured by one of CBC's best-know commentators. This book shows how easily a person can be changed by the surrounding environment -- from a youth that turns his head away from the beauties of living in remote areas to a more mature (but fun-loving) attitude toward this wonderful section of British Columbia. Coastal BC is one of the few areas in the world where the population has deceased in the past century, and that's part of it's charm. For an off-the-grid adventure, tune in to the charm Desolation Sound with Grant Lawrence."}]}, "authors": ["Grant Lawrence"], "isbn": "1550175149", "longitude": -123.11554, "periods": ["2000s", "Recent Releases"], "title": "Adventures in Solitude: What Not to Wear to a Nude Potluck and Other Stories from Desolation Sound", "word_cloud": "colorful hilarious story tell coastal summer pull excerpt visit friend laugh sure permanent become tattered torn due year sail take read loud funny love boat cabin saw many place mention humor truth give star start rather slow take gate bend feel fall love isolate area sprinkle eccentric laced mystery surround beauty heartbreaking dangerous great write want go normally grab trip plane ride fly loud often live boat sail often perfect activity funny fill history reminder live life well ready next buy boat load copy hand friends visit chapter hook send home great gift go spend time kayak british decide purchase area sound also contain information humor part big mistake present whine twit child adult couple chapter give away funny entertain enjoy first many way feel travel conveys real sense place take find west coast british top east much autobiography reminiscence obscure corner better personal perspective learn quirky resident eye reluctant childhood introduction fully embrace charm relate often funny occasionally touch wry wit matter fact remind reader mistake voice see eye keen insight affectionate gaze best compliment give spend much look dream summer vacation end road write attempt successfully area mine limit exploration float cabin tremendous region capture commentator show easily person change surround environment youth turn beauty live remote area mature attitude wonderful section area world population decease past century part charm adventure tune charm", "genres": ["Memoir", "Travel Writing"], "summary": "From Captain George Vancouver to Muriel \"Curve of Time\" Blanchet to Jim \"Spilsbury's Coast\" Spilsbury, visitors to Desolation Sound have left behind a trail of books endowing the area with a romantic aura that helps to make it British Columbia's most popular marine park. In this hilarious and captivating book, CBC personality Grant Lawrence adds a whole new chapter to the saga of this storied piece of BC coastline.\r\n\r\nYoung Grant's father bought a piece of land next to the park in the 1970s, just in time to encounter the gun-toting cougar lady, left-over hippies, outlaw bikers and an assortment of other characters. In those years Desolation Sound was a place where going to the neighbours' potluck meant being met with hugs from portly naked hippies and where Russell the Hermit's school of life (boating, fishing, and rock 'n' roll) was Grant's personal Enlightenment--an influence that would take him away from the coast to a life of music and journalism and eventually back again.\r\n\r\nWith rock band buddies and a few cases of beer in tow, an older, cooler Grant returns to regale us with tales of \"going bush,\" the tempting dilemma of finding an unguarded grow-op, and his awkward struggle to convince a couple of visiting kayakers that he's a legit CBC radio host while sporting a wild beard and body wounds and gesticulating with a machete. With plenty of laugh-out-loud humour and inspired reverence, Adventures in Solitude delights us with the unique history of a place and the growth of a young man amidst the magic of Desolation Sound.", "asin": "1550175149", "rank": "756469", "city": "Vancouver", "image": "https://images-na.ssl-images-amazon.com/images/I/51gSk-s3X5L.jpg", "country": "Canada", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}