{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 49.262428, "ratings": {"num_ratings": 3, "rating": 4.1, "reviews": [{"review_sentiment": 3.0, "review_text": "It was interesting. Purchased it because I was by the club when I visited Vancouver this spring.  It was a bit sparse when it came to much history. Also little expansion about celebs who had visited there."}, {"review_sentiment": 5.0, "review_text": "Having grown up in Vancouver, I'd been hearing about this book for some time from my friends and finally had a chance to read it on my kindle this summer.  This part of Vancouver's past has a little bit of Vegas, a little bit of mafia and is very interesting throughout.  I was surprised at first at how factually it is written, but came to appreciate that is was more historical or journalistic than anything mean to embellish what is already a pretty unreal story.  Fun and easy read."}, {"review_sentiment": 5.0, "review_text": "This is the story of the Penthouse Nightclub in Vancouver, B.C. by Aaron Chapman. I appeared there in about 1980 and had no idea of the colorful history of the nightclub. The Penthouse has been in business since 1947 and is still in business and still run by the Filippone family. The book is well researched with lots of great photos and newspaper clippings.  A VERY interesting read!  The Filippone family broke down a lot of barriers in Vancouver sharing their hospitality with some of the greatest entertainers in the world including Sammy Davis Jr., the Mills Brothers, Frank Sinatra and more.  They fought the legal system (winning sometimes and losing sometimes) to stay in business but they always supported their community and each other.  A colorful story of the law and the Filippone family.Magically yours,Dusty Summers"}]}, "authors": ["Aaron Chapman"], "isbn": "1551524880", "longitude": -123.11554, "periods": ["1900s", "Recent Releases"], "title": "Liquor, Lust and the Law: The Story of Vancouver's Legendary Penthouse Nightclub", "word_cloud": "interest purchase club visit spring bite sparse come much history also little expansion celebs visit have grow hear time friend finally chance kindle summer part past little bit little bit mafia interest surprise first factually write come appreciate historical journalistic anything mean embellish already pretty unreal easy appear idea colorful history business still business still family well researched lot great photo newspaper clippings very interest family break lot barrier share hospitality greatest entertainer world include fight legal system win sometimes lose sometimes business always support community colorful law", "genres": ["History", "Pop Culture"], "summary": "Few Vancouver nightspots evoke such a fabled history as the Penthouse Nightclub. Founded in 1947 by the Filippone family, the Penthouse became the place to see and be seen in Vancouver in the 1950s and '60s; acts like Sammy Davis Jr., Nat King Cole, and Duke Ellington regularly performed on the Penthouse stage, and the venue was one of the few in town not only to welcome African American entertainers, but to lodge them as well, at a time when Vancouver hotels refused to. Audiences often included visiting stars such as Frank Sinatra, Errol Flynn, Gary Cooper, and many others.\r\n\r\nIn the 1970s, the Penthouse became infamous for its exotic dancers, resulting in a colorful, lurid history involving vice squads, politicians, judges, and con men, and culminating in the murder of co-owner Joe Filippone in the Penthouse's office in 1983. However, through decades of evolving social mores and changing cultural styles in a city constantly trying to reinvent itself, the Penthouse has somehow survived, a testament to its storied history and the fortitude of the Filippone family that still owns it.\r\n\r\nRife with nostalgia and just a hint of scandal, Liquor, Lust and the Law is a fascinating history of a Rat Pack-era nightclub that also reveals a darkly beautiful and slightly naughty view of Vancouver after dark.\r\n\r\nAaron Chapman is a writer and musician with a special interest in entainment history. He lives in Vancouver, British Columbia.\r\n\r\n\"Aaron Chapman's lively history is written in razzle-dazzle journalistic prose.\" Quill and Quire ", "asin": "1551524880", "rank": "1249890", "city": "Vancouver", "image": "https://images-na.ssl-images-amazon.com/images/I/51WM0D63YLL.jpg", "country": "Canada", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}