{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 49.262428, "ratings": {"num_ratings": 3, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Great photos and imagery! I recommend it greatly."}, {"review_sentiment": 5.0, "review_text": "Thoroughly enjoyed this book about Vancouver.  Expected to dry history which would give me some insights into the development of the city and peoples. I got the latter part of this but it was certainly not a dry history - it was a funny read.... sometimes laugh out loud funny.  I even suggested to my son who lives in Vancouver that he should give the book a try."}, {"review_sentiment": 4.0, "review_text": "Vancouver Special tells an authentic story of Vancouver, warts and all. The story starts with it's cover and layout. The book itself is austere and colorless, filled with stark, black and while photographs. It is reflective of a particular image of Vancouver--the overcast drizzle that is all too familiar to residents.The title refers to the much maligned houses production houses that were built in droves between the late sixties and early eighties. Their homely, boxy shape has been the butt of many jokes. Despite the these jabs, Vancouver Specials have become a nostalgic favorite of many Vancouverites. They may be homely and have many shortcomings, but they are authentic and they are 'ours'. As such, it is a perfect title for a book that highlights the cities many shortcomings, but still manages to conveys that authors earnest love of the city.Demers' takes readers on a tour of the city. But instead of providing short vignettes, it provides longer essays. After an introduction sets that stage, Demers takes readers through several Vancouver's neighbourhoods in the first section  The second section looks at the various cultures and races of people that live here.  The third section is where it get most interesting.  Here Demers takes an in-depth look at various aspects of culture that define the city, from pot to peaceVancouver Special is also filled with great photography--haunting black and white shots of everyday life in the city. These picture reinforce the authentic feel of the book.if the book has a flaw, it is Demers' unflinching leftist take on the challenges Vancouver faces. This could alienate some readers."}]}, "authors": ["Charles Demers"], "isbn": "1551522942", "longitude": -123.11554, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Vancouver Special", "word_cloud": "photo imagery recommend greatly thoroughly enjoy dry history insight development city people get latter part certainly dry history funny sometimes laugh loud funny even suggest son life give try tell authentic story warts story start cover austere colorless fill stark black photograph reflective particular image overcast drizzle familiar title refers much malign house production house build drove late sixty early eighties homely boxy shape butt many joke jab nostalgic favorite many vancouverites homely many shortcoming authentic perfect title highlight city many shortcoming still manage conveys author earnest love take reader tour city instead provide short vignette provide longer essay introduction set stage take reader several neighborhood first section second section look various culture race people live third section get interest here take look various aspect culture define city pot peace vancouver also fill great photography haunt black white shot everyday life city picture reinforce authentic feel flaw unflinching leftist take challenge face reader", "genres": ["Essay", "History", "Travel Writing", "Urbanism"], "summary": "Vancouver is at a crossroads in its history—host to the 2010 Winter Olympics and home to the poorest neighborhood in Canada, it is a young, multicultural city with a vibrant surface and a violent undercoat. In Vancouver Special, an alternative guidebook, writer and performer Charles Demers digs deep to examine the past, present, and future of Vancouver, shedding light on the various strategies and influences that have made the city what it is today (and what it should be).\r\n\r\nVancouver Special is a love letter to the city, taking a no-holds-barred look at Lotusland with verve, wit, and insight.", "asin": "1551522942", "rank": "2915368", "city": "Vancouver", "image": "https://images-na.ssl-images-amazon.com/images/I/51dxMzV%2BH8L.jpg", "country": "Canada", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}