{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 62, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Hilarious, articulate, and all around a great read."}, {"review_sentiment": 4.0, "review_text": "It's unlike any point of view you've ever read. I thoroughly enjoyed it. It's a quick read that you could finish in an afternoon."}, {"review_sentiment": 5.0, "review_text": "just perfect."}, {"review_sentiment": 2.0, "review_text": "Not at all what I was expecting and was rather disappointed. It was highly recommended but is basically a tale of random superheroes with not so super of powers. Could have just been published as a list of awkward heroes or something. The actual story part of it is basically a short story that has been stretched by adding a bunch of the awkward hero names/powers"}, {"review_sentiment": 1.0, "review_text": "I really didn't like this book"}, {"review_sentiment": 1.0, "review_text": "Takes a strong liquor bottle next to bed to continue reading. Too bad I quit... With the booze. Total disappointment. Uninteresting and unreadable"}, {"review_sentiment": 5.0, "review_text": "I loved this book. It was so beautiful and whimsical and unlike anything I'd read before. I read it all in one sitting. It's my new favourite book."}, {"review_sentiment": 5.0, "review_text": "Creative, profound, fun!"}, {"review_sentiment": 5.0, "review_text": "Witty, unique, and relatable this was a perfect rainy-day read to engage the mind and fuel the lit-lover's soul."}, {"review_sentiment": 5.0, "review_text": "the title of this short story caught my attention.  Written from the main character's point of view, as he navigates his relationships-giving other's nicknames that relate better to who they are rather than their given name. So clever! And such a study of human nature. Engaging, charming and even thought provoking."}]}, "authors": ["Andrew Kaufman"], "isbn": "1552452700", "longitude": -79.387207, "periods": ["2000s"], "title": "All My Friends Are Superheroes", "word_cloud": "hilarious articulate great point view ever thoroughly enjoy quick afternoon perfect not expect rather disappoint highly recommend basically tale random super power list awkward hero something actual story part basically short story stretch add bunch awkward hero really take strong liquor bottle next bed continue read bad quit booze disappointment unreadable love beautiful whimsical anything sit new favorite creative profound fun unique repeatable perfect engage mind fuel soul title short story catch attention main character point view navigate nickname better rather give name clever study human nature charm even think provoke", "genres": ["Fiction & Literature"], "summary": "All Tom's friends really are superheroes. There's the Ear, the Spooner, the Impossible Man. Tom even married a superhero, the Perfectionist. But at their wedding, the Perfectionist was hypnotized (by ex-boyfriend Hypno, of course) to believe that Tom is invisible. Nothing he does can make her see him. Six months later, she's sure that Tom has abandoned her. So she's moving to Vancouver. She'll use her superpower to make Vancouver perfect and leave all the heartbreak in Toronto. With no idea Tom's beside her, she boards an airplane. Tom has until the wheels touch the ground in Vancouver to convince her he's visible, or he loses her forever.", "asin": "1552452700", "rank": "443288", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51b5De9ps8L.jpg", "country": "Canada", "story_arc": ["Tragedy", "Things only get worse"]}