{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 1, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "This is THE BEST GUIDE BOOK ever.My son lives in Toronto...I live in Texas, and we both think it is outstanding!Kudos!"}]}, "authors": ["Shawn Micallef"], "isbn": "1552452263", "longitude": -79.387207, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Stroll: Psychogeographic Walking Tours of Toronto", "word_cloud": "son live live think outstanding", "genres": ["History", "Travel Writing"], "summary": "Winner: 2011 Toronto Heritage Award of Merit\r\n\r\nWhat is the ‘Toronto look’? Glass skyscrapers rise beside Victorian homes, and Brutalist apartment buildings often mark the edge of leafy ravines, creating a city of contrasts whose architectural look can only be defined by telling the story of how it came together and how it works, today, as an imperfect machine.\r\n\r\nShawn Micallef has been examining Toronto’s streetscapes for a decade. His psychogeographic reportages, some of which have been featured in EYE WEEKLY and Spacing magazine, situate Toronto's buildings and streets in living, breathing detail, and tell us about the people who use them; the ways, intended or otherwise, that they are being used; and how they are evolving.\r\n\r\nStroll celebrates Toronto's details – some subtle, others grand – at the speed of walking and, in so doing, helps us to better get to know its many neighbourhoods, taking us from well-known spots like the CN Tower and Pearson Airport to the overlooked corners of Scarborough and all the way to the end of the Leslie Street Spit in Lake Ontario.\r\n\r\nStroll features thirty-two walks, a flâneur manifesto, a foreword by architecture critic John Bentley Mays, dozens of hand-drawn maps by Marlena Zuber and a full-colour fold-out orientation map of Toronto.", "asin": "1552452263", "rank": "2269647", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/41uR4AkDfuL.jpg", "country": "Canada", "story_arc": ["Tragedy", "Things only get worse"]}