{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 1, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "I chose to read this because it is this year's \"Toronto reads\" novel, and I was actually headed to one of the events. Living in Toronto, I always really enjoy fiction set in Toronto, and this one had a lot of great settings - the university, the hospitals, the PATH, the ravines, late night clubs, etc. It's a bit of an angsty twenty-something book, which seems to be very common for Toronto novels, but I quite enjoyed it. There is something oppressive over the book, a sense of threat and impermanence, with the virus or contamination, the diabetes and need to control the blood sugar, the flashbacks and sense of loosing control through love... A bit uneven, but all in all a really good read."}]}, "authors": ["Maggie Helwig"], "isbn": "1552451968", "longitude": -79.387207, "periods": ["2000s", "Recent Releases"], "title": "Girls Fall Down", "word_cloud": "choose year read actually head event live always really enjoy fiction set lot great setting university hospital ravine late night club etc bite angst seem common novel quite enjoy something oppressive sense threat impermanence virus contamination diabetes need control blood sugar flashback sense loose control bit uneven really good", "genres": ["Fiction & Literature", "Science Fiction"], "summary": "The 2012 One Book Toronto title and Shortlisted for the Toronto Book Award\r\n\r\nA girl faints in the Toronto subway. Her friends are taken to the hospital with unexplained rashes; they complain about a funny smell in the subway. Swarms of police arrive, and then the hazmat team. Panic ripples through the city, and words like poisoning and terrorism become airborne. Soon, people are collapsing all over the city in subways and streetcars and malls.\r\n\r\nAlex was witness to this first episode. He’s a photographer: of injuries and deaths, for his job at the hospital, and of life, in his evening explorations of the city. Alex’s sight is failing, and as he rushes to capture his vision of Toronto on film, he encounters an old girlfriend – the one who shattered his heart in the eighties, while she was fighting for abortion rights and social justice and he was battling his body’s chemical demons. But now Susie-Paul is in the midst of her own crisis: her schizophrenic brother is missing, and the streets of Toronto are more hostile than ever.\r\n\r\nMaggie Helwig, author of the critically lauded Between Mountains, has fashioned a novel not of bold actions but of small gestures, showing how easy and gentle is the slide into paranoia, and how enormous and terrifying is the slide into love.\r\n\r\n'Prose of astonishing rhythm and precision ... The real success of Girls Fall Down lies in its thematic scope ... This is serious stuff, but it never reads like a polemic; instead, Helwig's ability to manage tension lends her novel the feel of a controlled thriller.' The Walrus", "asin": "1552451968", "rank": "3853245", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51tu3tbZuzL.jpg", "country": "Canada", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}