{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 1, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "This is an excellent and beautiful little book. It is well formatted and arranged, and contains short insightful essays and interviews. The decision to publish with b&w; photos (i.e. there is not an ounce of color in the print) seems appropriate for a book on concrete architecture. Overall, a great reference and read."}]}, "authors": null, "isbn": "1552451933", "longitude": -79.387207, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Concrete Toronto: A Guide to Concrete Architecture from the 1950s - 70s", "word_cloud": "excellent beautiful little well format arranged contains short insightful essay interview decision publish b w photo ounce color print seem appropriate great reference", "genres": ["Art & Architecture", "History"], "summary": "Toronto is a concrete city. From international landmarks to civic buildings to cultural institutions to metropolitan infrastructure and the single-family home, reminders of the era of 'brutalist' architecture surround Torontonians. But for how long? As architectural fashion has shifted to the glass-and-steel neomodernism of today, these concrete structures have been increasingly ignored – and in some cases, demolished.\r\n\r\nConcrete Toronto takes readers on a guided tour of Toronto's concrete architecture. Editors Michael McClelland and Graeme Stewart have assembled a diverse group of industry experts – architects, university faculty, local practitioners, city planners, historians and journalists – to examine the unique and important qualities and the past and future of Toronto's concrete buildings in interviews, articles, archival photos, drawings and case studies.\r\n\r\nAppealing to both the average reader and the enthusiast, Concrete Toronto provides a refreshing look not only at the neglected buildings, but also at the trends that produced them and the impact and consequences that resulted from their construction.", "asin": "1552451933", "rank": "2648336", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51WJucU5RnL.jpg", "country": "Canada", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}