{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 49.262428, "ratings": {"num_ratings": 18, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Emily Carr is better known for her paintings.  Later in life she achieved acclaim as a writer, and this book is an excellent example.  She clearly shows her shortcomings, hurdles and final successes."}, {"review_sentiment": 5.0, "review_text": "love everything about Ms Carrsaw a great exhibition in Vancouver"}, {"review_sentiment": 5.0, "review_text": "I used this book as a reference for a paper in my visual arts class. Very informative. I am still reading it. Emily Carr was an eccentric, and very talented in her writing and painting. This is her autobiography, and gives a great insight to her as a person."}, {"review_sentiment": 4.0, "review_text": ".most of the stories are sad some more than others, so if you are sensitive ,you might not want to read this book"}, {"review_sentiment": 5.0, "review_text": "Surprisingly darling and engaging."}, {"review_sentiment": 5.0, "review_text": "Perfect! As described and delivered on time! Thanks!"}, {"review_sentiment": 5.0, "review_text": "Such a great writer! Love her books!"}, {"review_sentiment": 5.0, "review_text": "I love Emily Carr's books.  This was an exceptional example.  The gently used book was a pleasure to receive.  Thanks"}, {"review_sentiment": 1.0, "review_text": "The book had been water damaged and fell apart page by page as I read it. It had been rated as a little less than perfect condition, but this was a disaster."}, {"review_sentiment": 5.0, "review_text": "Interesting and well written.  she is an awesomeCanadian painter.  I did not know that she also was such a great writer  She not only wrote this  autobiography, but many other books as well."}]}, "authors": ["Emily Carr"], "isbn": "1553650840", "longitude": -123.11554, "periods": ["1900s"], "title": "The Heart of a Peacock", "word_cloud": "emily better know painting life achieve acclaim writer excellent example clearly show shortcoming hurdle final success everything great exhibition use reference paper visual art class very informative still read eccentric talented write paint autobiography give great insight person story sad others sensitive surprisingly darling engage describe delivered time thanks such great writer love emily exceptional example gently use pleasure receive thanks water damage fell apart page page rat little le perfect condition disaster interest well write awesome canadian painter know also great writer write autobiography many well", "genres": ["Fiction & Literature"], "summary": "A collection of short stories about people and animals by the legendary Emily Carr that mingle the sad and the joyous, the cruel and the tender, in her unique style.\r\n\r\nThe Heart of a Peacock is a collection of 51 short stories by the legendary writer and painter Emily Carr. The stories are arranged in themes such as her experiences with Native people, her adventures with various beloved creatures (particularly birds), her love of nature, and a whole section of stories about her mischievous pet monkey Woo. Together, they underline Emily Carr’s place as a writer with the sharp yet tender eye of an artist, with a deep feeling for the tragedies of life and with a rich sense of the comic. The Heart of a Peacock has been in print ever since its publication in 1953, and, like her other books, has been read and loved by a couple of generations. The book is enhanced by seven of Carr’s own line drawings of scenes from nature.\r\n\r\nCarr’s first book, published in 1941, was titled Klee Wyck, won the Governor General’s Literary Award for non-fiction. Her writing is vital and direct, aware and poignant, as well regarded today as when first published.", "asin": "1553650840", "rank": "2703848", "city": "Vancouver", "image": "https://images-na.ssl-images-amazon.com/images/I/51vG2MPfZCL.jpg", "country": "Canada", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}