{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 1, "rating": 3.0, "reviews": [{"review_sentiment": 3.0, "review_text": "This work presents the urban history of Toronto from the very beginnings of settlement to the 20th century with numerous maps and illustrations of great interest.However, although the book was published in 2009, one wonders if it is not a barely updated re-edition of an older book since very little is developed with respect to recent years.Also, in our age of computer graphics, the lay-out is extremely conservative.  For instance, the drab background, presumably imitating parchment colour, succeeds mainly in being . . . drab.In that sense, this book does not compare in quality with the Historical Atlas of New York City.Nevertheless, this book is recommended to anyone interested in the history of Toronto's development."}]}, "authors": ["Derek Hayes"], "isbn": "1553654978", "longitude": -79.387207, "periods": ["1700s", "1800s", "1900s", "Recent Releases"], "title": "Historical Atlas of Toronto", "word_cloud": "work present urban history beginning settlement century numerous map illustration great publish wonder barely update older little developed recent age computer graphic extremely conservative instance drab background presumably imitate parchment color succeed mainly sense compare quality recommend anyone interested history development", "genres": ["History"], "summary": "Renowned map historian Derek Hayes provides a unique perspective on Toronto's colourful past.\r\n\r\nIn just two centuries, Toronto has grown from a tiny outpost of the British Empire to a world-class city, by far the largest in Canada. First a native village, then a French trading fort, the site became the capital of the newly established Upper Canada in 1793. The little settlement survived two attacks by the American army in the War of 1812, and became a city—Toronto—in 1834, just as it became necessary to withstand the challenge of armed rebellion from within, led by William Lyon Mackenzie, who had been the first mayor of Toronto. The city went on to become a railway hub, and developed an industrial and trading base the equal of no other.", "asin": "1553654978", "rank": "3061036", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/61WzaZxnq1L.jpg", "country": "Canada", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}