{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 49.262428, "ratings": {"num_ratings": 17, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "I picked this book up at a friends while caring for her kitty.  I began reading and was instantly drawn into this intimate view of a Time now gone.  In a Northwest I’m familiar with I could see and smell and feel her adventure and the glimpse into the lives of the “Indians”.  People who have stayed with me.  Haunting.  Simple. Real."}, {"review_sentiment": 5.0, "review_text": "Very interesting. Enjoyable"}, {"review_sentiment": 5.0, "review_text": "\"Klee Wyck\" is a simple and lovely record of events from Emily Carr's life. I am so drawn to her spirit of openness and acceptance to  the indigenous people and the natural world around her.  I had to visit her part of the world for myself.  She captivated me.."}, {"review_sentiment": 5.0, "review_text": "How could this be less than wonderful, anyway, given its extraordinary author. Klee Wyck has given me many new insights on the paintings that already were intriguing."}, {"review_sentiment": 5.0, "review_text": "This is a series of beautifully written vignettes of life in Haida Gwaii by the great painter, Emily Carr."}, {"review_sentiment": 5.0, "review_text": "A Very Interesting Book @a Good Price, Condition & Swift Delivery as well :) !"}, {"review_sentiment": 5.0, "review_text": "Painter Emily Carr's early 19th-century ability to empathize with Western Canada's native peoples, and her scathing remarks on missionary obtuseness, are amazingly clear, direct, and insightful.  And the fact that her writings were in print for 50 years only in expurgated form must be horrifying to any writer. A native \"face-reader\" sums her up: \"she has no fear, she's not stuck up, and she knows how to laugh.\"  Her writings bear him out perfectly."}, {"review_sentiment": 5.0, "review_text": "Excellent!"}, {"review_sentiment": 5.0, "review_text": "One of the most amazing persons and such an excellent writer. Her descriptions of the places she visits and the people she meets along the way are so vivid. she does not write in abstract thoughts but with vivid images. Make sure you also view the book, Emily Carr Country, with photographs by Courtney Milne, of the some of places and totem poles described in Klee Wyck."}, {"review_sentiment": 5.0, "review_text": "a wonderful read"}]}, "authors": ["Emily Carr"], "isbn": "1553650255", "longitude": -123.11554, "periods": ["1900s"], "title": "Klee Wyck", "word_cloud": "pick friend care kitty begin read instantly draw intimate view go familiar smell adventure glimpse life stay very interesting enjoyable simple lovely record event emily life draw spirit openness acceptance indigenous people natural world visit part world captivate wonderful anyway give extraordinary author give many new insight painting already intrigue series beautifully write vignettes life great painter very interesting well early ability western native people scathing remark missionary obtuseness amazingly clear direct insightful fact writing print year expurgate form writer native sum fear stuck know writing bear perfectly excellent amazing person excellent writer description place visit people meet way write abstract thought vivid image make sure also view emily photograph place totem pole describe wonderful", "genres": ["Fiction & Literature", "Ancient Civilizations"], "summary": "Emily Carr’s first book, published in 1941, was titled Klee Wyck (\"Laughing One\"), in honour of the name that the Native people of the west coast gave to her. \r\n\r\nThis collection of twenty-one word sketches about Native people describes her visits and travels as she painted their totem poles and villages. \r\n\r\nVital and direct, aware and poignant, it is as well regarded today as when it was first published in 1941 to instant and wide acclaim, winning the Governor General’s Award for Non-fiction. \r\n\r\nIn print ever since, it has been read and loved by several generations of Canadians, and has also been translated into French and Japanese.", "asin": "1553650255", "rank": "516536", "city": "Vancouver", "image": "https://images-na.ssl-images-amazon.com/images/I/51bocNzdv7L.jpg", "country": "Canada", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}