{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 49.262428, "ratings": {"num_ratings": 18, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Emily Carr is better known for her paintings.  Later in life she achieved acclaim as a writer, and this book is an excellent example.  She clearly shows her shortcomings, hurdles and final successes."}, {"review_sentiment": 5.0, "review_text": "love everything about Ms Carrsaw a great exhibition in Vancouver"}, {"review_sentiment": 5.0, "review_text": "I used this book as a reference for a paper in my visual arts class. Very informative. I am still reading it. Emily Carr was an eccentric, and very talented in her writing and painting. This is her autobiography, and gives a great insight to her as a person."}, {"review_sentiment": 4.0, "review_text": ".most of the stories are sad some more than others, so if you are sensitive ,you might not want to read this book"}, {"review_sentiment": 5.0, "review_text": "Surprisingly darling and engaging."}, {"review_sentiment": 5.0, "review_text": "Perfect! As described and delivered on time! Thanks!"}, {"review_sentiment": 5.0, "review_text": "Such a great writer! Love her books!"}, {"review_sentiment": 5.0, "review_text": "I love Emily Carr's books.  This was an exceptional example.  The gently used book was a pleasure to receive.  Thanks"}, {"review_sentiment": 1.0, "review_text": "The book had been water damaged and fell apart page by page as I read it. It had been rated as a little less than perfect condition, but this was a disaster."}, {"review_sentiment": 5.0, "review_text": "Interesting and well written.  she is an awesomeCanadian painter.  I did not know that she also was such a great writer  She not only wrote this  autobiography, but many other books as well."}]}, "authors": ["Emily Carr"], "isbn": "1553650832", "longitude": -123.11554, "periods": ["1800s", "1900s"], "title": "Growing Pains: The Autobiography of Emily Carr", "word_cloud": "better know painting life achieve acclaim writer excellent example clearly show shortcoming hurdle final success everything great exhibition use reference paper visual art class very informative still read eccentric talented write paint give great insight person story sad others sensitive surprisingly darling engage describe delivered time thanks such great writer love exceptional example gently use pleasure receive thanks water damage fell apart page page rat little le perfect condition disaster interest well write awesome canadian painter know also great writer write many well", "genres": ["Memoir", "Art & Architecture"], "summary": "This autobiography by Emily has been called \"probably the finest... in a literary sense, ever written in Canada.\"\r\n\r\nCompleted just before Emily Carr died in 1945, Growing Pains tells the story of Carr’s life, beginning with her girlhood in pioneer Victoria and going on to her training as an artist in San Francisco, England and France. Also here is the frustration she felt at the rejection of her art by Canadians, of the years of despair when she stopped painting. She had to earn a living, and did so by running a small apartment-house, and her painful years of land-ladying and more joyful times raising dogs for sale, claimed all her time and energy. Then, towards the end of her life, came unexpected vindication and triumph when the Group of Seven accepted her as one of them. Throughout, the book is informed with Carr’s passionatate love of and connection with nature.\r\n\r\nCarr is a natural storyteller whose writing is vivid and vital, informed by wit, nostalgic charm, an artist’s eye for description, a deep feeling for creatures and the foibles of humanity--all the things that made her previous books Klee Wyck and Book of Small so popular and critically acclaimed.\r\n", "asin": "1553650832", "rank": "987690", "city": "Vancouver", "image": "https://images-na.ssl-images-amazon.com/images/I/41fWcROuP9L.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}