{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 49.262428, "ratings": {"num_ratings": 15, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Terrific preview for my first visit to city of Vancouver:  Made me ache for such a book on every great city, written by a native who loves his hometown so much and has such a breadth of perspective to share."}, {"review_sentiment": 5.0, "review_text": "Excellent seller and excellent product"}, {"review_sentiment": 2.0, "review_text": "This book consists of poorly organized vignettes on Vancouver. I was hoping for something that would give me a feel for the city. At best this book provides a shallow picture. The only long narrative in the book comes from a time when Coupland was slumming in a dive hotel and hanging around with people who had various substance problems."}, {"review_sentiment": 4.0, "review_text": "City of Glass reminds Vancouverites why we live here, and tells guests why they should visit. It is the book you leave in the guest bedroom to inspire and delight out-of-towners.It's brochure like quality starts with the books physical form. City of Glass is bright and colorful--reminiscent of a sunny day in the city. Its cover is even colored in the omnipresent green and blue of Vancouver's branding.The title of the book comes from Vancouver's large number of skyscrapers with glass or mirror fronts. Like the glass of it's title, Coupland's book reflects his personal memories of the city he loves.Inspired by Japans underground `zines', the book is an illustrated collection of vignettes and reflections on Vancouver. it takes readers on an alphabetical tour, from BC Ferries to YVR. Along the way, Coupland drops a lot of personal observations, historic trivia and often overlooked facts.The book also includes a report of Coupland's essay, \"My Hotel Year,\" previously published in Life After God. The essay is a nice intermission from the vignettes. It provides readers with a glimpse beyond the glass and into a gritty reality that is also part of Vancouver.Interspersed throughout the book are some photographs of Vancouver at it's best and pictures of Vancouver, ephemera such as Campbell's soup cans with trilingual Cantonese/English/French labels and a salmon `color fan.'"}, {"review_sentiment": 4.0, "review_text": "The weakness of traditional tourist or travel guides is that they're good at providing practical information but relatively weak on helping you understand the essence of a place.  The things that make a place special or unique do not translate easily to an itinerary of museums and historical sites.This book provides one person's well-considered views on things, people and events - some everyday and some profound - that make Vancouver the special place it is.  Any given reader, and certainly some natives of the city may not agree with everything.  You will come away with an interesting perspective on this very wonderful city.The book's primary weakness is that it needs to be updated, particularly now that the Olympics have rolled over and through Vancouver but there was a strong argument for a new visit even before that just on the basis of the book being more than ten years old."}, {"review_sentiment": 5.0, "review_text": "A humorous, personal portrait of a gorgeous and quirky city. Coupland's narration is funny and dead on. The photos are generally quite good and go a long way toward capturing the mood of the place. He also plugs a lot of little known facts -- like about Greenpeace -- that Yankies like myself were not aware of.I hope he does a follow up book."}, {"review_sentiment": 5.0, "review_text": "Vancouver is great city (at least for a few dry months) and deserve a good book for the visitors. This book meets my needs and is not the typical guide book with maps and names and addresses. But for those who try to get a sense of the pulse of the city, it's character and quirks, I would recommend.After reading others', suspect that my copy (recently bought) has the insert that others don't. \"My Hotel Year\" was a wonderful read, and for those who remember the 60's bohemian Haight Ashbury, there is an echo DC evoked at the human level here that still resonates. \"Van\" is \"San Fran\" was, with more flowers and no jobs, at least the kinds you can build wealth. Ob-La-Di! Ob-La-Da!"}, {"review_sentiment": 4.0, "review_text": "Sure, it's only one person's view of Vancouver. But at least it's Douglas Coupland's view. In \"City of Glass,\" the author of \"All Families Are Psychotic\" and \"Generation X\" strays from fiction to write about his home city. The result is a subdued love ode to Vancouver, peppered with photographs.Coupland describes Vancouver with many page-long vignettes, sort of like a patchwork quilt: he describes feng shui in Vancouver, Japanese teenagers, a harbour full of sulfur piles, American couples on \"love boats,\" monstrous houses, and the quiet detachment that Vancouver feels from the Rest of Canada. (Which has its own entry -- really!)Coupland's fiction is generally distinguishable for its contemplative, cynically witty tones. But he drops all that for \"City of Glass.\" Okay, there is a chunk of \"Life After God\" in the middle, blurry text and pics. And occasionally the transcripts of Coupland's memories remind one of his fiction, seeming sadder and darker.Most of the time, he sounds fond and reminiscent, as if reliving the memories that come with salmon and fleece. Not to mention funny, such as when describing the confusing disagreements about feng shui (\" this space should flowwwwww\" or \"flow is to be avoided at all costs\"). And the photographs are quite good as well, with Coupland taking pictures of the prosaic subjects of his book -- a sleepy-looking Japanese teen, a fleece vest, a boat floating out on a light-filled harbor, a skiier in mid-twist on a sunlit hillside.\"City of Glass\" isn't exactly going to make you race to Vancouver, but it will make you appreciate the little hidden facets of the city -- and perhaps make you notice the ones in your own."}, {"review_sentiment": 5.0, "review_text": "This is my homesick book, my security blanket, my Postcards from Home.For Vancouverites, it's a source of boosterist pride, a good chuckle at some in-jokes, and perhaps enlightenment on why things are as they are. For people who have moved away, it's a book of memories, recollections of a city of glass and the people who make it. For people who have never been there, it's the tourist guide that talks about things the Lonely Planet won't. It's like having Mr Coupland sitting next to you as you make your way through our city. It's probably as close to an autobiography as he's ever written. The mark of Vancouver is on him as it's on me, and on everyone else who was raised there.Yeah, I love my hometown."}, {"review_sentiment": 3.0, "review_text": "Imagine following Highway 99 south from Whistler down through West and North Vancouver, across the Second Narrows Bridge, along Boundary Road, crossing into Richmond, picking up the 99 again, and driving straight through to Seattle. Now, pay attention only to what you can see (Mount Baker, for instance), or things that are to your right -- west of the Vancouver-Burnaby border. Observe and comment on those things lucidly and with humour. But ignore the vast suburbs stretching to the east. Spend more time on Bellingham than on New Westminster. You have an idea of this book. Like Coupland's other works, it demonstrates keen insight about a limited part of its subject -- this case, Vancouver. He is a North Shore boy, and it shows. Worth reading, but definitely only one person's view."}]}, "authors": ["Douglas Coupland"], "isbn": "1553653599", "longitude": -123.11554, "periods": ["2000s", "Recent Releases"], "title": "City of Glass: Douglas Coupland's Vancouver", "word_cloud": "preview first visit ache great write native love hometown much breadth perspective share excellent seller excellent product consist poorly organize vignette hop something best provide shallow picture long narrative come time slum dive hotel hang people various substance problem remind live tell guests visit leave guest bedroom inspire delight brochure quality start physical form bright colorful reminiscent sunny day cover even color omnipresent green blue title come large number skyscraper glass mirror front glass title reflect personal memory underground illustrate collection vignette reflection take reader alphabetical tour way drop lot personal observation historic trivia often overlook also include report previously publish essay nice intermission vignettes provide reader glimpse glass gritty reality also part photograph best picture ephemera soup can trilingual label salmon fan weakness traditional tourist travel guide good provide practical information relatively weak help understand essence place thing make place special unique translate easily itinerary museum historical provide person view thing people event everyday profound make special place give certainly natives everything come away interesting perspective wonderful primary weakness need update particularly roll strong argument new visit even basis year old humorous personal portrait gorgeous quirky narration funny dead photo generally quite good long way capture mood place also plug lot little known fact aware hope follow great least dry month good visitor meet need typical guide map name address get sense pulse character quirk read others suspect copy recently buy insert others wonderful remember bohemian echo evoke human level still resonate flower job least kind build wealth sure person view least view author stray fiction write home result subdue ode pepper describes many vignette sort patchwork quilt describe fen shew japanese teenager harbor full sulfur pile american couple love boat monstrous house quiet detachment feel entry really fiction generally distinguishable contemplative cynically witty tone drop chunk middle blurry text pic occasionally transcript memory remind fiction seem sadder time sound fond reminiscent relive memory come salmon fleece not funny describe confuse disagreement fen shew space flowwwwww flow avoid cost quite good well take picture prosaic subject japanese teen fleece vest boat float harbor skier sunlit hillside exactly go race make appreciate little hidden facet perhaps notice one homesick security blanket source boosterist pride good chuckle perhaps enlightenment thing people move away memory recollection glass people make people never tourist guide talk thing lonely sit next make way probably close autobiography ever write mark everyone else raise love hometown follow south cross pick drive straight now pay attention see instance thing right west border comment thing lucidly humor ignore vast suburb stretch east spend time idea work demonstrate keen insight limit part subject case boy show read definitely person view", "genres": ["Travel Writing"], "summary": "This irresistible little book offers a very different take on Vancouver, one of the world's most beautiful cities. Douglas Coupland applies his unique sensibility to everything from the Grouse Grind to glass towers, First Nations to feng shui, Kitsilano to Cantonese. \r\n\r\nCleverly designed to mimic an underground Japanese magazine, this edition is fully updated and revised with riffs on Vancouver as a neon city, a land of treehuggers, and more.\r\n\r\n\"Subjective in tone and sexy to look at, City of Glass is a delightfully outlandish travel book -- just the sort of whacked-out guide you wish every was available for every great city in the world.\" The Globe & Mail ", "asin": "1553653599", "rank": "1432769", "city": "Vancouver", "image": "https://images-na.ssl-images-amazon.com/images/I/5191BkMGfML.jpg", "country": "Canada", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}