{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 49.262428, "ratings": {"num_ratings": 2, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "This was a gift from friends when I had asked about the history of several Vancouver landmarks.  I was really impressed with this book - it is beautifully laid out softcover book with copious color maps from various periods in the Vancouver history.  Each page has one or more maps and large amounts of text describing the maps and the history of the area.  It's an interesting approach to the history of a location by using maps (some actually used and others never followed) to really let the story of Vancouver emerge.This is a larger sized softcover book but the inside presentation is very creative - at no time do you feel like you a reading a textbook.  Photographs from the era are welcome additions to further detail the antique maps.In all, I felt I had a great grasp of the fascinating history of Vancouver and was very pleased to receive this as a present.  It really is a gorgeous book, beautifully presented, richly detailed, and very informative."}, {"review_sentiment": 5.0, "review_text": "In the text there are more than 370 original maps charting the growth and development of the Vancouver region from the years of discovery and exploration.  They depict its days as a fledgling colonial outpost, its appearance on the the world scene after the arrival of the Canadian Pacific Railway, through to its emergence as a post-war Pacific metropolis.  Many lesser known facets of Vancouver's history are uniquely illustrated.  Numerous intriguing maps show plans for a very different city-with a dam at the Second Narrows Bridge, an airport in English Bay, a vast dockland on the tip of Point Grey, a city extended well out into the Strait of Georgia, a network of downtown freeways, and many other schemes that were not followed through with.You will discover how government reserves shaped Vancouver and who was responsible for North Vancouver's Grand Boulevard or West Vancouver's British Properties.  Read of the railway barons' competition for routes into Vancouver and urban planners and much more.Interesting, historical book..."}]}, "authors": ["Derek Hayes"], "isbn": "1553652835", "longitude": -123.11554, "periods": null, "title": "Historical Atlas of Vancouver & the Lower Fraser Valley", "word_cloud": "gift friends ask history several landmark really impress beautifully lay softcover copious color map various period history page map large amount describe map history area interesting approach history location use map actually use others never follow really let story larger size softcover presentation creative time feel read textbook era welcome addition detail antique felt great grasp fascinate history please receive present really gorgeous beautifully present richly detailed informative text original map chart growth development region year discovery exploration depict day fledgling colonial outpost appearance world scene arrival emergence metropolis lesser know facet history uniquely illustrate numerous intriguing map show plan different dam second airport vast dockland tip city extend well network downtown freeway many scheme follow discover government reserve shape responsible railway baron competition rout urban planner much", "genres": ["History", "Urbanism"], "summary": "Map researcher and collector Derek Hayes here presents the sixth in a series of critically acclaimed, award-winning historical atlases. Gathered together in a single volume for the first time, here are the maps that shaped Vancouver and the surrounding Lower Fraser Valley. \r\n\r\nMore than 370 original maps chart the region’s development beginning with the years of discovery and exploration. They depict its days as a fledgling colonial outpost, its appearance on the world scene after the arrival of the Canadian Pacific Railway, through to its emergence as a postwar Pacific metropolis. \r\n\r\nThese maps evoke such historic events and developments as the founding of Fort Langley, the first settlements on the inlet, and the filling in of False Creek, along with more recent aspects of this richly diverse area such as the real estate boom and the explosive growth of Vancouver. \r\n\r\nIncluded are many fascinating plans for schemes that never got off the drawing board.", "asin": "1553652835", "rank": "3405397", "city": "Vancouver", "image": "https://images-na.ssl-images-amazon.com/images/I/518nWlCTsgL.jpg", "country": "Canada", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}