{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 6, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "A must read!!! Just hilarious and real. Great observations."}, {"review_sentiment": 5.0, "review_text": "Gift, and well loved."}, {"review_sentiment": 5.0, "review_text": "Let's be honest, this is a hard book to carry around in public, hence the kindle is the ideal format for reading! I had previously read Americanah, and this, though much briefer and rawer, offers the same outsider look at a culture. It is funny, engaging, and enlightening. It feels very modern although there are a few reminders that this was written more than 30  years ago.It was a book group selection and I approached it with hesitation, it wouldn't have been my choice. After reading it...I've recommended it!"}, {"review_sentiment": 5.0, "review_text": "Good book on issues"}, {"review_sentiment": 5.0, "review_text": "I was asked to review this book, and I was really thinking it was going to be kind of like instruction or a manual or something like that.  That is so not the case.  I agree that it is brilliant!!These two black men are living in a run down apartment.  They are visited by various white women.  They all have names like \"miz beauty\" or \"miz literature\". I loved the different names they came up with.  It's better than just saying a normal name.  The names they give show a better picture of the women they are with.Finally, a book that isn't all serious!  This book was so hilarious! If you are looking for a serious book about how to make love, this isn't it!!!  Even though it isn't actually a manual on the act of making love, it can get pretty explicit.\"Miz Beauty does not speak. You've got to discover her erogenous zones, her favorite subjects of conversation, her sign, all on your own. Meanwhile, Miz Piggy's coming like an express train. She doesn't get it every day. And she's hell-bent to make the most of it. She wants more, more, more.\"' Dany Laferrière, How to Make Love to a Negro\"Making love to a Negro isn't frightening; sleeping with him is. Sleep is complete surrender. It's more than nude; it's naked. Anything can happen during the night, when reason sleeps.\"' Dany Laferrière, How to Make Love to a NegroI highly recommend this book!  Enough of all the serious books, pick up How to Make Love to a Negro Without Getting Tired and prepare yourself for laughter!CherylBlack Diamond's Book Reviews"}, {"review_sentiment": 5.0, "review_text": "You probably shouldn't read this book if you'd be offended by interracial intercourse explicitly described, interracial psychology boldly satirized, or injunctions from the Koran quoted at profane moments.Dany Laferrière's first novel seems designed to offend everybody, but it's quite funny and an addictive binge-read of juicy, jazzy prose.Basically the non-plot follows the musings and meanderings of two black men living in a filthy apartment on rue St-Denis in Montreal in the 1980s. They are immigrants with no visible means of support, but lots of white female visitors. One is a Muslim or Buddhist saint (depending on convenience) following the Path of Inertia on a lumpy sofa. The other is our well-read, jazz-loving, philosophical narrator.I picked up this book purely (or impurely) because of the title. Every now and then I shop irresponsibly. The subject is outdated, and that's part of the charm. The narrator himself admits that the heyday of the black lover is over. The Japanese lover is now preferred. Nonetheless the narrator seems to find plenty of action in the bars, bookstores and literary circles of Montreal.As I see it, Laferrière is not trying to corrupt the reader. He's doing an artistic analysis of a social phenomenon that may be dead anyway: \"Put black vengeance and white guilt in the same bed and you had a night to remember!\"The translator's introduction is well written and insightful. He gives us the big picture. At one level, he suggests, this is an immigrant story. At another level the book is about class, ethnic, and historical conflict.Anyway, you've been warned. If you do get the book, hope you enjoy it as much as I did."}]}, "authors": ["Dany LaFerrière"], "isbn": "1553655850", "longitude": -73.6103642, "periods": ["1900s"], "title": "How to Make Love to a Negro Without Getting Tired", "word_cloud": "just hilarious real observation well love honest hard carry public hence kindle ideal format reading previously much briefer rawer offer outsider look culture funny engage enlighten feel modern reminder write year group selection approach hesitation choice read recommend good issue ask review really think go kind instruction manual something case agree brilliant black men live run apartment visit various white woman name miss beauty miss literature love different name come better say normal name name give show better picture woman serious hilarious look serious even actually manual act make get pretty explicit speak get discover erogenous zone favorite subject conversation sign meanwhile come express train get day want frighten sleep complete surrender nude naked happen night reason sleep highly recommend serious pick prepare laughter probably offend interracial intercourse explicitly describe interracial psychology boldly satirize injunction quote profane first seem design everybody quite funny addictive juicy jazzy follow musing meanderings black men live filthy apartment rue immigrants visible mean support lot white female visitor saint depend convenience follow lumpy philosophical pick purely impurely title shop irresponsibly subject outdated part charm narrator admit heyday black japanese lover prefer narrator seem find plenty action bar bookstores literary circle see laferrière try corrupt artistic analysis social phenomenon anyway black vengeance white guilt bed night translator introduction well write insightful give big picture level suggest immigrant story level class ethnic historical warn get hope enjoy much", "genres": ["Fiction & Literature"], "summary": "Brilliant and tense, Dany Laferrière's first novel, How to Make Love to a Negro Without Getting Tired, is as fresh and relevant today as when it was first published in Canada in 1985. With ribald humor and a working-class intellectualism on par with Charles Bukowski's or Henry Miller's, Laferrière's narrator wanders the streets and slums of Montreal, has sex with white women, and writes a book to save his life. \r\n\r\nWith this novel, Laferrière began a series of internationally acclaimed social and political novels about the love of the world, and the world of sex, including Heading South and I Am a Japanese Writer. It launched Laferrière as one of the literary world's finest provocateurs and continues to draw strong comparisons to the writings of James Baldwin, Henry Miller, Charles Bukowski, and Jack Kerouac. The book was made into a feature film and translated into several languages.\r\n\r\n\"A heady meditation, a psychic tussle that resonates with the furious stuff in James Baldwin’s essays or Louis Armstrong’s smiling trumpet or Martin Luther King’s oratory… honest, brash, unsappy, new.” The Village Voice", "asin": "1553655850", "rank": "16246", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/51iIjE8lZsL.jpg", "country": "Canada", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}