{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Russel Smith sets this novel in what feels like lost corners of Toronto, which is appropriate given his lost protagonist, Justin. As he begins to bounce along his erotic journey we sense his unraveling and inability to make sense of a world that is more chaotic and disturbing that he anticipated. From sex through video games he seems unable to locate his core and move forward. While proccupied with an object of desire in the end she only seems to reinforce his emptiness. Smith is a good stylist; it is easy to place yourself in the story; to see and feel what the characters experience. He puts his sideline as a fashion writer to good use by providing us with a clear eye on an uncertain world. Worth reading."}]}, "authors": ["Russell Smith"], "isbn": "1554685346", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Girl Crazy", "word_cloud": "set feel lose corner give lost protagonist begin bounce erotic journey sense unravel inability make sense world chaotic disturb anticipate sex video game seem unable locate core move forward preoccupy object desire end seem reinforce emptiness good stylist easy place story see feel character experience put sideline fashion writer good use provide clear eye uncertain world read", "genres": ["Fiction & Literature"], "summary": "Tightly plotted and fast paced, Girl Crazy is a cinematic ride through one man’s obsession with a younger woman. Justin, a dissatisfied community college teacher, meets Jenna and is attracted at once to her mixture of toughness, vulnerability and ripe sexuality. Jenna is unlike anyone Justin has ever known -- through her he discovers a world of drugs and sex, casual violence and intimidation that at first frightens and then thrills him.\r\n\r\nJustin falls deeper into Jenna’s thrall, particularly as her erratic behaviour keeps him guessing. When Jenna ends the relationship abruptly, Justin finds he isn’t willing to let go of this new life, or of Jenna, without a fight.\r\n\r\n\"Daring and well executed. ...Most will likely fixate on the sex in Girl Crazy, and why not? Smith writes it well; nary a cringe-worthy adjective, and raw enough to be real. But Girl Crazy is more about class than it is about sex. ...Girl Crazy is a hot floor show for those of us desperate for the present to finally get its time in the Canadian literary spotlight.\" Globe and Mail", "asin": "1554685346", "rank": "7013240", "city": "", "image": "https://images-na.ssl-images-amazon.com/images/I/41s-X0XfZrL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}