{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 46, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Wonderful writing and really quirky humor make up for the aimless and perhaps pointless story. I am eager to read more by this author."}, {"review_sentiment": 5.0, "review_text": "Funny as hell"}, {"review_sentiment": 5.0, "review_text": "Witty, smart, funny and page flipper.  Great and memorable characters.  Would recommend book to others.Everett is a talented writer who's brilliance should b celebrated."}, {"review_sentiment": 5.0, "review_text": "This book is great. It has humor,  drama and all with a lesson to learn and understand and fine your identy"}, {"review_sentiment": 4.0, "review_text": "Well written and humorous. Overall, and enjoyable read."}, {"review_sentiment": 5.0, "review_text": "I loved the book. Quite comical yet very intriguing. I would recommend to anyone. The kindle reader made the words appear much larger and therefore made it easier to read."}, {"review_sentiment": 5.0, "review_text": "For ENC1101 got an A"}, {"review_sentiment": 4.0, "review_text": "While not a typical read, I like that it made me think about experiences very foreign from my own."}, {"review_sentiment": 5.0, "review_text": "Entranced by Everett's short stories, I decided to try this novel. At first the somewhat manic tone of one of the main characters resulted in my putting it down. But I picked it up, and I am glad I did. Great humor and absolutely intriguing structure. With the laughs come a real and unique invitation to think about identity, personality, and individual development. Bravo."}, {"review_sentiment": 4.0, "review_text": "Following Mr. Poitier thru his exploits was a journey in humor and frivolity. The unusual nature of this books narrative had me expecting a much deeper plot that never materialized (or maybe I was just too shallow to catch it). Still, the winding path of the protagonist remained enjoyable, humorous and unpredictable. I'm sure I'll read it again."}]}, "authors": ["Percival Everett"], "isbn": "1555975275", "longitude": -118.244476, "periods": ["2000s", "Recent Releases"], "title": "I Am Not Sidney Poitier: A Novel", "word_cloud": "wonderful write really quirky humor make aimless perhaps pointless story eager author hell smart funny page flipper memorable character talented writer brilliance b celebrate great humor drama lesson learn understand fine identity well write humorous enjoyable love comical yet intrigue anyone kindle make word appear much larger therefore make easier get typical like make think experience foreign short story decide try first somewhat manic tone main character result put pick glad humor absolutely intriguing structure laugh come real unique invitation think identity personality individual development follow thru exploit journey humor frivolity unusual nature narrative expecting much deeper plot never materialize maybe shallow catch still wind path protagonist remain enjoyable humorous unpredictable sure", "genres": ["Fiction & Literature"], "summary": "I Am Not Sidney Poitier is an irresistible comic novel from the master storyteller Percival Everett, and an irreverent take on race, class, and identity in America\r\n\r\nI was, in life, to be a gambler, a risk-taker, a swashbuckler, a knight. I accepted, then and there, my place in the world. I was a fighter of windmills. I was a chaser of whales. I was Not Sidney Poitier.\r\n\r\nNot Sidney Poitier is an amiable young man in an absurd country. The sudden death of his mother orphans him at age eleven, leaving him with an unfortunate name, an uncanny resemblance to the famous actor, and, perhaps more fortunate, a staggering number of shares in the Turner Broadcasting Corporation.\r\n\r\nPercival Everett's hilarious new novel follows Not Sidney's tumultuous life, as the social hierarchy scrambles to balance his skin color with his fabulous wealth. Maturing under the less-than watchful eye of his adopted foster father, Ted Turner, Not gets arrested in rural Georgia for driving while black, sparks a dinnertable explosion at the home of his manipulative girlfriend, and sleuths a murder case in Smut Eye, Alabama, all while navigating the recurrent communication problem: \"What's your name?\" a kid would ask. \"Not Sidney,\" I would say. \"Okay, then what is it?\"\r\n\r\n“Percival Everett has made a career out of flouting expectations . . . [forging] a nervy, caustic body of work that defies easy categorization.” Los Angeles Times", "asin": "1555975275", "rank": "174001", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/41upiwOBR4L.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}