{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 5, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Great read. Amazing stories."}, {"review_sentiment": 5.0, "review_text": "I'm quoting Graywolf Press: \"Obabakoak is a quixotic, gem-like collection about life in Obaba, a remote,exotic Basque village\"."}, {"review_sentiment": 3.0, "review_text": "I hoped I had bought the spanish edition - so I am sorry to say: It was not a succes."}, {"review_sentiment": 5.0, "review_text": "\"Bernardo Axtaga is among those Basque writers whose work has been recognized and widely disseminated beyond the borders of Eusquera. His best-known is perhaps Obabakoak, which received the National Literature Prize granted by the Spanish Ministry of Culture. Obabakoak is a collection of finely honed, humorous and ironic short stories. The stories are all set in Obaba, a somewhat magical imaginary region in the Basque country. A magnificent work of universal scope.\"  This work was selected to be included in the definitive guide to reading in Spanish \"The New Essential Guide to Spanish Reading\" which is published by America Reads Spanish: a campaign aimed to increase the use and reading of the Spanish language through the thousands of libraries, schools and book stores in the US."}, {"review_sentiment": 5.0, "review_text": "Written by Bernardo Atxaga, a contemporary author who writes in euskera, the language of the Basque country, Obabakoak is alternately called a novel and a short story collection. Too loose to fit the definition of a novel for most people, it still has some repeating characters, and the ending of the book depends on the reader's careful notice of details among the stories at the beginning. The integration of the beginning and the end make this a more connected group of offbeat stories than one usually sees.Set in Obaba in the Basque country, the book allows myth and magic to overlap with theological questions in a story about a poor, ignored, and lonely boy who may or may not have turned into a white boar, which attacks and kills the cruelest people in the village and terrifies the priest. Animism adds pleasure to the life of an eleven-year-old girl living in the most remote corner of the village, as she walks with her grandfather, saying hello to the bat Gordon, her dog Toby, her horse Kent, and Frankie the chicken. In other stories, a nine-year-old boy meets a man who cannot stop talking and cannot function because his memories are so vivid, and then later meets an old friend in a psychiatric hospital who has had electroshock treatment and now has no memories at all. A young boy is seduced by the village teacher, frustrated because she has not heard from her lover at home, wantonly destroying the boy's life.Angels appear and disappear, dreams and nightmares become real, and characters becomes incarnations of the devil. While religion seems to inform the lives of the characters, religion here is a cultural characteristic built from the stories the characters have shared from their own lives, and not a religion based on external doctrine. The deaths, and even murders, which are at the root of many of these stories are often attributed more to fate or superstition than to any sense of religious destiny, and as the stories of these deaths are repeated a village heritage and history are formed.The second half of the book, \"In Search of the Last Word,\" consists of many very short stories, most of them traditional plots common to other parts of the world, and as Atxaga develops these stories, the characters also talk about writing and what stories tell about the culture and the characters who tell and retell them. One section, entitled \"How to Write a Story in Five Minutes,\" a playful and teasing examination of the creative process, is hilarious, while another, \"How to Plagiarize,\" gets into the ironies and humor of developing themes that have existed for generations. The conclusion will leave the reader with a huge smile of recognition as old characters come back for an encore, not necessarily pleasant.Ultimately, \"Life,\" however, \"is a journey full of difficulties in which Chance and Free Will intervene in equal measure, a journey, in which, despite those difficulties...it is possible to advance and safely reach that final pond where the Great Mother Goose awaits us.\" Stories within stories within stories take the reader on dozens of journeys to discover new places, new and strange characters, and old themes seen in new incarnations. And the book is really fun! Mary WhippleThe Accordionist's Son: A Novel (Lannan Translation Selection (Graywolf Paperback))"}]}, "authors": ["Bernardo Atxaga"], "isbn": "1555975518", "longitude": 0.0, "periods": ["1900s"], "title": "Obabakoak: Stories from a Village", "word_cloud": "quote quixotic collection life remote exotic hop buy spanish edition sorry say success writer work recognize widely disseminate border perhaps receive grant spanish collection finely hone humorous ironic short set somewhat magical imaginary region country magnificent work universal scope work select include definitive guide read publish campaign aim increase use read spanish language thousand libraries school store us contemporary author write husker language country alternately call short story collection loose fit definition people still repeat character end depends careful notice detail begin integration begin make connect group offbeat usually country allow myth magic overlap theological question story poor ignore lonely boy white boar attack kill cruelest people terrifies priest add pleasure life girl live remote corner walk grandfather say hello bat dog horse chicken boy meet man talk function memory vivid later meet old friend psychiatric hospital electroshock treatment memories young boy seduce teacher frustrate heard lover home wantonly destroy boy appear disappear dream nightmare become real character become incarnation devil religion seem inform live character religion cultural characteristic build character share life religion base external doctrine death even murder root many often attribute fate superstition sense religious destiny death repeat heritage history second half last consist many short traditional plot common part world develop character also talk write tell culture character tell section entitle playful tease examination creative process hilarious get irony humor develop theme exist generation conclusion leave huge smile recognition old character come back necessarily however journey full difficulty equal measure journey difficulty possible advance safely reach final pond await take dozen journey discover new place new strange character old theme see new incarnation really fun", "genres": ["Fiction & Literature"], "summary": "Obabakoak is a shimmering, mercurial collection about life in Obaba, a remote, exotic Basque village. A schoolboy's mining engineer father tricks him into growing up, an unfortunate environmentalist rescues deceptively harmless lizards, and a rescue mission on a Swiss mountain-climbing expedition in Nepal turns into murder. \r\n\r\nObaba is peopled with innocents and intellectuals, shepherds and schoolchildren, while everyone from a lovelorn schoolmistress to a cultured but self-hating dwarf wanders across the page. Hints of darker undercurrents mingle with moments of wry humor in this dazzling collage of stories, town gossip, diary excerpts, and literary theory, all held together by Bernardo Atxaga's distinctive and tenderly ironic voice. \r\n\r\nAn unforgettable work from an international literary giant, whom The Observer (London) listed among the top twenty-one writers of the twenty-first century.", "asin": "1555975518", "rank": "226540", "city": "Basque Country", "image": "https://images-na.ssl-images-amazon.com/images/I/51N1ajhd26L.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}