{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 128, "rating": 4.0, "reviews": [{"review_sentiment": 1.0, "review_text": "I think the topic is definitely worthwhile to write/read about but just I HATED her style. I found it nearly impossible to enjoy. Far too experimental for my taste."}, {"review_sentiment": 5.0, "review_text": "The criticism is blunt, but refreshing, and the memoir is framed so beautifully that the final culmination of the main points is exhilarating to read. Incredible read!"}, {"review_sentiment": 4.0, "review_text": "Very raw.  Don't let your kids read it, but a very visceral story of experience."}, {"review_sentiment": 5.0, "review_text": "Nelson's reflections on many varied quotations, often from poets, but also from a wide variety of other writers, offers very interesting responses. Her unguarded honesty offers a humble self-examination within her ongoing joy over the endless differences in human life."}, {"review_sentiment": 4.0, "review_text": "I enjoyed this book! Found it a bit wordy, but the honesty outweighed it. It's not for everyone, but it should be!"}, {"review_sentiment": 1.0, "review_text": "Five thumbs down"}, {"review_sentiment": 4.0, "review_text": "I am writing this review primarily to warn others NOT to buy the Kindle edition, but to get the print copy instead. The Kindle version omits the margin citations, which attribute quoted passages to their sources. To me, these attributions are essential to the text. It was not until I saw a print copy from the library that I realized what had been missing in the electronic version. When I went back and re-read the passages with attribution, I had an entirely different experience of reading the book.So unless the publisher revises the Kindle edition to include these references, do NOT buy on Kindle. Get the print copy instead.An engaging and brave work that deserves to be read in its original, nuanced format."}, {"review_sentiment": 5.0, "review_text": "EVERYONE should read this."}, {"review_sentiment": 5.0, "review_text": "Powerful and potent.  Her personal revelations and social analysis come together to form a compelling description of family, love and desires for transformation."}, {"review_sentiment": 1.0, "review_text": "All my friends and family has been talking about this book and loves it and they gifted it to me so I could talk about it with them, well It took me forever to read it and I must confess, I didnt finish it. I can read bad book and some book as so bad, or not according to my taste  that I cant finish reading them and this was one of them. Some parts I read over and over to get an understanding of what the heck the author was trying to say and after a while I realised it was just nonsens.I do NOT understand peoples fascination over this book. For me, it was so bad and boring that I couldnt even finish it and the reading was painful, slow and boring. So cleanly this is not a book for everyone. Its amasing that 160 pages could feel so long as they did in this book, or at least the 135 pages I manage to read before seriously thinking I was about to die of boredom."}]}, "authors": ["Maggie Nelson"], "isbn": "1555977359", "longitude": -118.244476, "periods": ["2000s", "Recent Releases"], "title": "The Argonauts", "word_cloud": "think topic definitely worthwhile hat style find nearly impossible enjoy experimental taste criticism blunt refresh memoir frame beautifully final culmination main point exhilarate incredible very raw visceral story experience reflection many varied quotation often poet also wide variety writer offer interesting response unguarded honesty offer humble ongoing joy endless difference human life enjoy bit wordy honesty outweigh everyone thumb write primarily others edition get print copy instead version omit margin citation attribute quote passage source attribution essential saw print copy library realize miss electronic version go back passage attribution entirely different experience reading publisher revise edition include reference print copy engage brave work deserve original nuanced format everyone powerful potent personal revelation social analysis together form compel description family love desire transformation friend family talk love gift take forever dint finish bad bad accord taste cant finish read part get understanding heck author try say realize understand people fascination bad boring couldn't even finish read painful slow boring cleanly everyone amassing page long least page manage seriously think die boredom", "genres": ["Fiction & Literature", "LGBT"], "summary": "An intrepid voyage out to the frontiers of the latest thinking about love, language, and family\r\n\r\nMaggie Nelson's The Argonauts is a genre-bending memoir, a work of \"autotheory\" offering fresh, fierce, and timely thinking about desire, identity, and the limitations and possibilities of love and language. At its center is a romance: the story of the author's relationship with the artist Harry Dodge. This story, which includes Nelson's account of falling in love with Dodge, who is fluidly gendered, as well as her journey to and through a pregnancy, offers a firsthand account of the complexities and joys of (queer) family-making. \r\n\r\nWriting in the spirit of public intellectuals such as Susan Sontag and Roland Barthes, Nelson binds her personal experience to a rigorous exploration of what iconic theorists have said about sexuality, gender, and the vexed institutions of marriage and child-rearing. Nelson's insistence on radical individual freedom and the value of caretaking becomes the rallying cry of this thoughtful, unabashed, uncompromising book.\r\n\r\n“Maggie Nelson is one of the most electrifying writers at work in America today, among the sharpest and most supple thinkers of her generation.”  The Guardian", "asin": "1555977359", "rank": "10330", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/51joIqA3RML.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}