{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 89, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "I have been to a reading that Everett gave at my university and that alone was something very special to me. This was my first Everett novel and it was no surprise to me that I couldn't put it down. I don't care what anybody else says about this book or his other works, his style speaks to me in ways other authors just cant scratch. Its both beautiful and dark, so I think i'll keep reading his novels."}, {"review_sentiment": 5.0, "review_text": "Well written and conceived.  A riddle inside an enigma.  A writer writes about a writer, who pretends to be another writer.  You wouldn't think it would be good, but it was great!"}, {"review_sentiment": 5.0, "review_text": "This guy needs to turn his books into movies.  Great social commentary and funny as hell"}, {"review_sentiment": 5.0, "review_text": "Erasure blew me away. The novel’s central character, Monk, an author and scholar, seeks to place a new novel, after years of a modestly successful publishing career. He is told, by the literary establishment, that if he would only write about his experiences as a black man, he would be more commercially successful. Unsurprisingly, he rejects this idea as artistic sellout and a reinforcement of casual racist stereotypes. Can we imagine a white author being given this advice?Meanwhile, a novel called We's Lives in Da Ghetto by a new writer, a book filled with stereotypes playing to white expectations, explodes as a best seller. In a moment of pique, Monk bangs out a novel in the same vein, but light years from reality, blatant in its satire. He sends it to his agent, under a pseudonym, expecting, hoping maybe, that it will be seen for the ridiculousness that it is.Monk’s fake book becomes an instant hit. He is swimming in much-needed new money as he is forced into pseudonymic role-playing to hide his true authorship. Literary craziness ensues. In parallel, Monk is dealing with a complicated personal life that includes a mother slowly descending into the madness of Alzheimer’s.Throughout, Everett plays with form, inserting imagined conversations between well-known historical figures, mostly artists and philosophers, about the nature of art, knowledge and commerce of both, drops in Latin phrases that summarize the moment (which I had to look up) and even includes Monk's full fake novel within the larger \"real\" novel, weaving all these elements together into a satisfying whole. It’s a heady mix that kept me deeply engaged while deftly and comically challenging readers to ponder the existential meaninglessness of race as a category for understanding human experience.  Highly recommended. This review is excerpted from a longer blog post at Pumpjack Press."}, {"review_sentiment": 5.0, "review_text": "LIKE NOTHNG I HAVE READ. I LOVED IT!A BIT CHALLENGING---BRAVO!TRULY A DARING BOOK, WHEN YOU SIT BACK AND THINK ABOUT IT.I'M HOOKED ON THE AUTHOR-- JUST STARTED ANOTHER OF HIS BOOKS; ENJOYING IT SO FAR, VERY MUCH--PRETTY HIGH PRAISE,I KNOW, BUT DESERVING."}, {"review_sentiment": 5.0, "review_text": "I would not label myself an avid reader of novels. With that said, Erasure is a great book that really makes you think instead of just giving you the answers upfront. It's ironic, satirical, relatable and deep. I own both a digital and hard copy because the book makes you jump back and forth to put puzzle pieces together. 5 out 5, hands down."}, {"review_sentiment": 4.0, "review_text": "I enjoyed this novel very much.  I just discovered Percival Everett.  I read this book after reading his latest, So Much Blue."}, {"review_sentiment": 5.0, "review_text": "A contemporary that feels like a classic."}, {"review_sentiment": 5.0, "review_text": "If I had to describe this book in one word it would be \"intense\"."}, {"review_sentiment": 5.0, "review_text": "This is one of the most brilliant novels on race I've ever read, and I've read many.  As hilarious as it is troubling.  Also a great book on coming to terms with a  parent's demise.  So many profound statements reinforcing and defying stereotypes.  Should be required reading in every high school English class in America."}]}, "authors": ["Percival Everett"], "isbn": "1555975992", "longitude": -118.244476, "periods": ["2000s", "Recent Releases"], "title": "Erasure: A Novel", "word_cloud": "read give university alone something special first surprise care anybody else say work style speak way author cant beautiful dark think reading novel well write conceive riddle inside enigma writer write writer pretend writer great guy need turn movie social commentary funny hell erasure blow away central character author scholar seek place new year modestly successful publishing career tell literary establishment experience black man commercially successful reject idea artistic sellout reinforcement casual racist stereotype white author give advice meanwhile call live new writer fill stereotype play white expectation explodes best seller moment pique bang vein light year reality blatant satire send agent pseudonym expect hop maybe see ridiculousness fake becomes instant hit swim new money force pseudonymic hide true authorship craziness ensues parallel dealing complicate personal life include slowly descend madness play insert imagined conversation historical figure mostly artists philosopher nature art knowledge commerce drop phrase summarize moment look even include full fake larger real weaving element together satisfy whole heady mix keep deeply engage deftly comically challenge reader ponder existential meaninglessness race category understanding human experience recommend review excerpt longer blog post have read love very know avid novel say great really make think instead give answer upfront ironic satirical repeatable deep digital hard copy make jump back forth put puzzle piece together hand enjoy much discover read latest so much contemporary feel classic describe word brilliant novel race ever many hilarious trouble also great come term parent demise so many profound statement reinforce defy stereotype reading high school class", "genres": ["Fiction & Literature"], "summary": "Percival Everett's blistering satire about race and writing, available again in paperback\r\n\r\nThelonious \"Monk\" Ellison's writing career has bottomed out: his latest manuscript has been rejected by seventeen publishers, which stings all the more because his previous novels have been \"critically acclaimed.\" He seethes on the sidelines of the literary establishment as he watches the meteoric success of We's Lives in Da Ghetto, a first novel by a woman who once visited \"some relatives in Harlem for a couple of days.\" Meanwhile, Monk struggles with real family tragedies―his aged mother is fast succumbing to Alzheimer's, and he still grapples with the reverberations of his father's suicide seven years before.\r\n\r\nIn his rage and despair, Monk dashes off a novel meant to be an indictment of Juanita Mae Jenkins's bestseller. He doesn't intend for My Pafology to be published, let alone taken seriously, but it is―under the pseudonym Stagg R. Leigh―and soon it becomes the Next Big Thing. How Monk deals with the personal and professional fallout galvanizes this audacious, hysterical, and quietly devastating nov", "asin": "1555975992", "rank": "96512", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/41ze42DysuL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}