{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 81, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Exactly what I was hoping for! I wanted an in-depth broad history and intellectual feel and that's what I've gotten so far. The narrator's light drawl, intonation, and perfect French pronunciation are key to keeping the book as fluid and easy to follow and enjoy as possible."}, {"review_sentiment": 5.0, "review_text": "A very detailed book."}, {"review_sentiment": 5.0, "review_text": "Well researched and very well written."}, {"review_sentiment": 2.0, "review_text": "Lots of facts, but no vibrancy. Reads like a college essay."}, {"review_sentiment": 5.0, "review_text": "Minutely researched and documented, fascinating in bringing historical context to bear, well-written, and enlightening on so many topics. A must-read for those who have any love for New Orleans and her traditions in their hearts. I found myself highlighting passage after passage to revisit later.If you want to understand the \"how\" and the \"why\" and the \"what\" and the \"who\" of New Orleans, I can think of nothing more effective than reading this book.The timeline covered ranges from pre-Columbian to post-Katrina and encompasses the entire Western world as needed to tell the story of this special, spiritual place."}, {"review_sentiment": 5.0, "review_text": "A beautiful and wise book about the history of New Orleans, with fascinating insights into its many connections with the Caribbean and the old world and the rest of the United States, with particular insight into the musical history of our most musical city."}, {"review_sentiment": 5.0, "review_text": "Simply wonderful.  I learned so much about both New Orleans, but also about American history.  While reading this, it replaced my usual story opener of \"So I heard this story on NPR....\" because there were so many interesting tidbits strewn throughout the book.  The author has a wonderful writing style."}, {"review_sentiment": 5.0, "review_text": "great read!"}, {"review_sentiment": 5.0, "review_text": "very interesting read."}, {"review_sentiment": 5.0, "review_text": "Very well written. NOLA has an amazing history."}]}, "authors": ["Ned Sublette"], "isbn": "1556529589", "longitude": -90.0701156, "periods": ["1800s", "1900s", "2000s", "Recent Releases"], "title": "The World That Made New Orleans: From Spanish Silver to Congo Square", "word_cloud": "exactly hop want broad history intellectual feel get far narrator light drawl intonation perfect french pronunciation key keep fluid easy follow enjoy possible detailed well research well write lot fact vibrancy college essay minutely research document fascinate bring historical context enlighten many topic love tradition hearts find highlight passage passage revisit want understand think nothing effective reading timeline cover range encompass entire western need tell story special spiritual place beautiful wise history fascinate insight many connection old rest particular insight musical history musical city wonderful learn much also history read replace usual story hear story many interest tidbit strew author wonderful writing style great interest very well write amazing history", "genres": ["History"], "summary": "New Orleans is the most elusive of American cities. The product of the centuries-long struggle among three mighty empires--France, Spain, and England--and among their respective American colonies and enslaved African peoples, it has always seemed like a foreign port to most Americans, baffled as they are by its complex cultural inheritance.\r\n \r\nThe World That Made New Orleans offers a new perspective on this insufficiently understood city by telling the remarkable story of New Orleans’s first century--a tale of imperial war, religious conflict, the search for treasure, the spread of slavery, the Cuban connection, the cruel aristocracy of sugar, and the very different revolutions that created the United States and Haiti. It demonstrates that New Orleans already had its own distinct personality at the time of Louisiana’s statehood in 1812. By then, important roots of American music were firmly planted in its urban swamp--especially in the dances at Congo Square, where enslaved Africans and African Americans appeared en masse on Sundays to, as an 1819 visitor to the city put it, “rock the city.” \r\n \r\nThis book is a logical continuation of Ned Sublette’s previous volume, Cuba and Its Music: From the First Drums to the Mambo, which was highly praised for its synthesis of musical, cultural, and political history. Just as that book has become a standard resource on Cuba, so too will The World That Made New Orleans long remain essential for understanding the beautiful and tragic story of this most American of cities.", "asin": "1556529589", "rank": "46920", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51nThBIjYUL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}