{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 1118, "rating": 3.9, "reviews": [{"review_sentiment": 1.0, "review_text": "Was looking forward to gifting this book to my husband but it’s impossible to read. The font is tiny that you would need a magnifying glass to read it."}, {"review_sentiment": 1.0, "review_text": "The words are so small!!"}, {"review_sentiment": 3.0, "review_text": "Font size is very small and hard to read, pages aren't numbered either. Text is ripped straight from a .pdf."}, {"review_sentiment": 3.0, "review_text": "The characters are super super super small."}, {"review_sentiment": 1.0, "review_text": "Kafka is magnificent. This print is not 'cuz the type is teensy (7 pt?) and super lightweight which makes is headachey to read. Besides, there is a lot of white space around the print on the page which means the type could easily be larger. Saving money on toner, I guess.  Dumb and amateurish, so save your money and spend it on a better version.  THIS IS NOT A REVIEW OF THE DOVER EDITION, IT IS THE GUTENBERG.ORG EDITION THAT IS IMPOSSIBLE."}, {"review_sentiment": 5.0, "review_text": "as advertised, satisfied buyer"}, {"review_sentiment": 4.0, "review_text": "I had read Kafka's \"Metamorphosis\" a while ago, and while I had found it interesting and morbid, had not thought about it in broader terms. I re-read the story again recently, wondering if it presented parallels for our age of mute communication enabled by the Internet. The Metamorphosis deals with themes of social alienation (often self-imposed) and existential anxiety. It’s worth understanding the context in which the story was written. This context involves Kafka’s own life and personality. Kafka held himself in low self-esteem and thought himself inadequate socially and sexually; he seems to have had several relationships with women but also visited prostitutes. Most importantly in the context of “The Metamorphosis”, he feared that people would find him physically and mentally repulsive and seems to have suffered from an eating disorder.These qualities of self-loathing are inherent in the story. The protagonist Gregor Samsa finds himself transformed into a giant insect who his parents and sister naturally find repellant. He also starts hating most food, including even the rotten food that his loving sister tearfully puts in his room. It is clear that the insect loathes himself and understands why his own family would loathe him and wish him gone. It’s also significant that while Samsa can perfectly understand what his family is saying about him, his own speech is now grotesquely that of an insect and incomprehensible to them. Torn between an inability to communicate and a perfect ability to understand, the insect naturally feels both alienation and existential angst.We should not have to look too far to find parallels in the digital age for most of Kafka’s afflictions. Technology and especially social media has sequestered us away from human contact in the same way that Samsa’s fundamental transformation shut him out. We spend hours on the Internet in our home, and yet can legitimately claim to have no real, human connection to the world outside. This is reflected in our “friendship” with hundreds of people on social media which translates to nihilistic friendlessness outside this medium. We also think that we can perfectly understand what people outside are saying, but just like the insect, keep on banging on the walls of our self-imposed prison because we cannot make ourselves heard above the din outside. We make a lot of noise, but very little sound.A lot of the existential anxiety which we feel results from this dissonance between the clear, one way-mirror of the outside world and the opaque prison of the inside, a prison which nevertheless occasionally gives us the illusion of being able to communicate before the whole façade regularly comes tumbling down. Just like the giant insect, our minds are torn between wanting to communicate and wanting to believe that we can.Most deaf are the technology companies which in our age seem to play the role of Samsa’s family; they claim to know what we are saying and even pretend to love us, but what they are offering us is a diet of information addiction and distraction which is being force fed to us. Like Samsa, we find ourselves in a love-hate relationship with these companies; on one hand we want to reject their sustenance, but on the other we find ourselves increasingly unable to survive without it. We hate ourselves for craving the food that the tech companies send our way, and we pity ourselves if we don’t have it.The role of Samsa’s parents can also be ascribed to the global internet community which pretends to be our friend but whose main function is to publicly shame, vilify and abandon us the moment we say something they disagree with. The sense of alienation which Samsa feels partly comes from not being able to communicate with his parents and partly from their anger and disgust at his transformation. Similarly, the global internet community pretends to care about us because we are part of the same digital ecosystem, while being able to turn on us in disgust and indignation in a moment when we undergo our own transformation, a transformation perhaps to an unpopular social or political viewpoint. Veering away from the community and tech companies’ groupthink will be our version of the Metamorphosis. Is is therefore not surprising that we find ourselves suffering extreme feelings of alienation, facing censure, ostracism and indifference from a community that from the outside seems to look just like us but which really is so different as to be an actual alien species, again like Samsa’s giant insect.The end of “The Metamorphosis” involves Samsa becoming infected and rueful and finally dying from shame, neglect and self-imposed starvation. A similar fate would likely befall the Gregor Samsas of today’s globally connected world, signified perhaps by these modern day vermin turning into brainwashed internet addicts who have completely surrendered their privacy, creative potential and personal dignity to both Internet companies and the global social media community. The original Gregor Samsa died, but this kind of complete surrender of mind and body would likely be a fate worse than death, perhaps not appreciated fully by the victims because of their delusional state, but real nonetheless.However it need not be so. Gregor’s mistake was in pretending that his family would want a normal relationship with him even after his transformation. While it would have been difficult, it would not have been impossible for him to be proactive in severing his connections with them, perhaps running away into the sewers or streets and starting an independent existence as a free insect. Such a lifestyle would have been challenging to say the least, but it would have led to a strange and exhilarating kind of freedom from dependence on his parents’ approval and love.The metaphor for our Internet age would be freedom from both the tech companies’ and the digital community’s feigned love toward us. The more we keep craving their approval, the more we will keep on becoming a victim of our own self-imposed existential angst. That way would lie catastrophe. Severing the bond with these two entities would not be easy and I don’t know what the best way to do it is. But there have certainly been some opinions offered toward this goal. What I do know is that when a Gregor Samsa from this world decides to escape, even into the sewers, he or she would find it much easier if other Gregor Samsas are already waiting in there."}, {"review_sentiment": 5.0, "review_text": "Perfect"}, {"review_sentiment": 4.0, "review_text": "Interesting and held my attention.  Though I tried to imagine what actual kinds of changes the main character went through, I really could not visualize the bug he says he had become."}, {"review_sentiment": 5.0, "review_text": "nice"}]}, "authors": ["Franz Kafka"], "isbn": "1557427666", "longitude": 14.4212535, "periods": ["1900s"], "title": "The Metamorphosis", "word_cloud": "look forward gift husband impossible font tiny magnify glass word small size small hard page number rip straight character super super super small magnificent print type teen pt super lightweight make headache lot white space print page mean type easily larger save money toner guess dumb amateurish money better version be be be advertise satisfy buyer kafka find interest morbid think broader term story recently wonder present parallel age mute communication enable deal theme social alienation often existential anxiety understand context story write context involve life personality hold low thought inadequate socially sexually seem several relationship woman also visit prostitute most importantly context fear people physically mentally repulsive seem suffered eat quality inherent story protagonist find transform giant insect parent sister naturally repellent also start hat food include even food love sister tearfully put room clear insect loathes understands family wish go also significant perfectly understand family say speech grotesquely insect incomprehensible inability communicate perfect ability understand insect naturally feel alienation existential look far find parallel digital age affliction especially social medium sequester human contact way fundamental transformation shut spend hour home yet legitimately claim real human connection world reflected friendship hundred people social medium translate nihilistic friendlessness medium also think perfectly understand people say insect bang wall prison make hear din make lot noise little lot existential anxiety feel result dissonance clear outside world opaque prison prison nevertheless occasionally give illusion able communicate whole facade regularly come tumble giant insect mind torn want communicate want believe deaf technology company age seem role family claim know say even offer diet information addiction distraction force feed find relationship company hand want reject sustenance find increasingly unable survive hate crave food tech company send way pity role parent also ascribe global internet community pretend friend main function publicly shame vilify moment say something disagree sense alienation feel partly come able communicate parent partly anger disgust transformation similarly global internet community pretend part digital ecosystem able turn disgust indignation moment undergo transformation transformation perhaps unpopular social political viewpoint veer away community tech company group think version be therefore surprising find suffer extreme feeling alienation face censure ostracism indifference community seem look really different actual alien specie giant end involve become infect rueful finally die shame neglect starvation similar fate likely today globally connect world signify perhaps modern day turn brainwashed internet addict completely surrender privacy creative potential personal dignity company global social medium community original die kind complete surrender mind body likely worse death perhaps appreciate fully victim delusional state real need pretend family normal relationship even transformation difficult proactive sever connection perhaps run away sewer street start independent existence free insect such lifestyle least strange exhilarate kind freedom dependence parent approval metaphor age tech company digital community feign love keep craving approval become victim existential angst way catastrophe sever bond entity know best way certainly opinion offer goal know world decide even sewer much easier already wait perfect interest hold attention try imagine actual kind change main character go really bug say nice", "genres": ["Fiction & Literature"], "summary": "\"The Metamorphosis\" (original German title: \"Die Verwandlung\") is a short novel by Franz Kafka, first published in 1915. It is often cited as one of the seminal works of fiction of the 20th century and is widely studied in colleges and universities across the western world. The story begins with a traveling salesman, Gregor Samsa, waking to find himself transformed into an insect.", "asin": "1557427666", "rank": "8253", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/51BwQxQJI-L.jpg", "country": "Czechia", "story_arc": ["Tragedy", "Things only get worse"]}