{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 28, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "I love Coleman Andrews books! I first became aware of this book from reading about it in one of my mom's old Gourmet magazines, IIRC.  They described the \"recipe\" for Pa amb Tomaquet, a solid slice of country bread, toasted over a fire and rubbed with garlic, I think, and an almost overripe tomato.  Finished off with a drizzle of fruity olive oil and a sprinkling of salt, it sounded like heaven to me.  Food like this is now to be found everywhere, but back then, it was a revelation.  I was young enough that a cookbook was a big investment, but I had to have it. It introduced me to a whole new way of looking at ingredients.  I grew up with homemade raviolis, garlic bread, great salads and so on.  While these recipes used many of the same ingredients, it was fresh and different, and I loved it.Coleman Andrews does his research, spending time in the locations he writes about, meeting the cooks, learning about the culture.  When you've bought one of his books, you can't help but feel like you've been there and met those people, that you understand the basis of their cuisine.  The book is a learning tool as well as a great cookbook. That original volume is packed away now, but I missed it enough to be delighted to find the Kindle version.  If you like this book, you might also enjoy his, The Country Cooking of Ireland, also available in Kindle format, as well as print.  I tried to insert the link, but for some reason, this review app is sending me to a German book of some sort.  I tested the link in my browser, and it went to the right book, but...sigh.  You'll have to do the search yourself, but it will be worth it."}, {"review_sentiment": 2.0, "review_text": "We have been to Catalonya numerous times and what we find in this book is not what we have experienced in the culinary arts in the area.  The way this book is written is boring and we will be returning it."}, {"review_sentiment": 5.0, "review_text": "I had been hoping for recipes, but what a got was MORE. I got a little history of food and Catalan culture."}, {"review_sentiment": 4.0, "review_text": "Many people associate Catalan cuisine with Spain (and indeed, the author writes extensively about the Catalan culture in Spain within this cookbook). but I was introduced to Catalan Cuisine on a weekend trip to Andorra (that tiny country nestled between France and Spain) a few years ago. It was love at first sight and I knew I wanted a Catalan cookbook to add to my collection. Spanish tortilla, shrimp in garlic butter, creme Catalan - all the classics are here in one volume plus so much more.  I love to put together dinner parties featuring an assortment of small plates drawn from this cookbook and there hasn't been a recipe I've tried yet from Colman's book that hasn't turned out well."}, {"review_sentiment": 4.0, "review_text": "Many of the recipes are purportedly tested by Mr. Andrews's recipe tester, Zimmerman.  But a significant number of recipes have badly mistaken ingredient measurements, such as for the Catalan cheesecake pastry dough which is completely wrong.  Even if correct, it is a lousy recipe.  Use Paula Wolfert's recipe for pate sucree' instead."}, {"review_sentiment": 3.0, "review_text": "I have prepared many of the recipes in Andrews's revised edition of Catalan cooking.  Unfortunately, despite his occasional reference to his alleged recipe tester named Zimmerman, it is apparent that Andrews is in the great British tradition of a collector, not an actor in the kitchen.  Many of his recipes are just wrong, some of them incredibly wrong, especially in proportions and in cooking times.  For example, he has a Majorcan recipe for a flan or torte with a risen crust using (here in the USA) ricotta, eggs, cream, sugar, lemon juice and peel, et al.  However, the crust recipe is WAY off, and I know because I have baked thousands of loaves of bread over the past 45 years, and so I know a cockamamie recipe for any kind of bread dough when I see one.  Make the crust dough according to Andrews' specs and not only will you have enough dough for TWO large flans/tortes, but it will be a sort of thick griddle cake batter instead of a dough.  Similarly, the filling uses way too much liquid and too little ricotta, so that you don't get a filling with his proportions but rather a viscous mess that will never set up firmly enough.  Finally, the cooking time for a 4-egg recipe is insane -- you can't set a 4 egg recipe even with a radical pruning of the cream by a third unless you bake the flan for nearly an hour at 350F.Many other recipes in the book are similarly wrong-headed so that the inventive and experienced cook must use the conceptual template of each recipe without succumbing to the quantities and proportions, which are sometimes so wrong that the result is a disaster."}, {"review_sentiment": 5.0, "review_text": "A terrific presentation of a delightful and in depth dive into a culture through it's interesting food."}, {"review_sentiment": 5.0, "review_text": "This is a wonderful collection of some of my favorite dishes growing up in Andorra.  What a great find!  The recipe for canalons and for romesco are worth the cost of purchase alone."}, {"review_sentiment": 4.0, "review_text": "I like reading about the history of the foods and some of the recipes I tried were very\"homey\" but in a good way."}, {"review_sentiment": 5.0, "review_text": "Given as a gift to my granddaughter who is fascinated with the Catalan culture."}]}, "authors": null, "isbn": "1558323295", "longitude": 2.1774322, "periods": ["1900s", "2000s"], "title": "Catalan Cuisine: Vivid Flavors From Spain's Mediterranean Coast", "word_cloud": "love first become aware read mom old magazine describe recipe am solid slice country bread toast fire rub garlic think almost overripe tomato drizzle fruity olive oil sprinkle salt sound heaven find everywhere back revelation young enough cookbook big investment introduce whole new way look ingredient grow homemade ravioli garlic bread great salad recipe use many ingredient fresh different love research spending time location write meet cook learn culture buy met people understand basis cuisine learning tool well great cookbook original volume pack away miss enough delighted find version like also also available format well print try insert link reason review sending german sort test link browser go right sigh search worth numerous time find experienced culinary art area way write boring return hop recipe get more get little history food culture many people associate cuisine indeed author writes extensively culture cookbook introduce weekend trip tiny country nestle year love first sight know want add collection spanish tortilla shrimp garlic butter creme classics volume much love put together dinner party feature assortment small plate draw cookbook recipe try yet turn well many recipe purportedly test recipe tester significant number recipe badly mistake ingredient measurement cheesecake pastry dough completely wrong even correct lousy recipe recipe pate scree instead prepare many recipe andrew revise edition cook unfortunately occasional reference allege recipe tester name apparent great british tradition collector actor kitchen recipe wrong incredibly wrong especially proportion cook time example recipe flan torte rise crust use ricotta egg cream sugar lemon juice peel al however crust recipe know bake thousand loaf bread year know cockamamie recipe kind bread dough see crust dough accord spec enough large sort thick griddle cake batter instead fill use way much liquid little ricotta filling proportion rather viscous mess never set firmly enough finally cook time recipe insane egg even radical prune cream third bake flan nearly hour recipe similarly inventive experienced cook conceptual template recipe succumb quantity proportion sometimes wrong result disaster terrific presentation delightful depth dive culture interest food wonderful collection favorite dish grow great find recipe canal romesco worth cost purchase alone like read history food recipes try homey good way give gift granddaughter fascinate culture", "genres": ["History", "Food and Wine"], "summary": "Catalonia, located in Spain’s far north-east corner and centred around the port of Barcelona, has its own cuisine and culture which has spread to encompass Valencia, the Balearic Islands (Majorca, Minorca and Ibiza), Andorra, the ancient region of France formerly known as Roussilon, and a single city on the Italian island of Sardinia. \r\n\r\nColman Andrews explores this whole territory of Catalan cooking, from its French, Roman and Moorish roots to today’s modern interpretation. Along the way he creates a portrait of the food, wine, history and culture of the region.", "asin": "1558323295", "rank": "335907", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/61rmX6GyJ0L.jpg", "country": "Spain", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}