{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 18.4801972, "ratings": {"num_ratings": 11, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "GOOD BOOK"}, {"review_sentiment": 5.0, "review_text": "Great product!"}, {"review_sentiment": 5.0, "review_text": "Very insightful and documented story of the assassination (well done) of Rafael Leonidas Trujillo."}, {"review_sentiment": 5.0, "review_text": "Anyone interested in a thorough and accurate description of the events surrounding the assassination of Trujillo should read this book."}, {"review_sentiment": 5.0, "review_text": "Anyone wanting to understand Latin America or the Kennedy Administration's approach to Latin America, Castro and the Alliance for Progress must read this book.I served as an American diplomat in Santo Domingo 20 years after the assassination.  There I met several people intimately familiar with events leading up to the assassination and afterwards.  Donald Reid Cabral, who was involved in planning for a civilian, elected government (but was not a shooter), told me that \"everything in the book is true, but not everything that is true is in the book.  We talked to Diederich, but we had to protect our friends.\"This book is valuable far beyond the immediate facts of Trujillo's death.  Explicit or implicit in all this is how the New Frontiersmen's \"can do\" attitude, infatuation with covert operations drove events they hardly understood.  The book reminds us that people everywhere operate on what they see as their own requirements and not our calendar.  After the Bay of Pigs led to a rethinking of this covert action program, a CIA officer told the assassins to postpone things while Washington was cogitating.  The assassins made it clear that they were not killing Trujillo for our reasons, but for their own. They wanted U.S. help, but would not allow it to make them into puppets.All of which leads me to speculate on alternate outcomes.  Had the assassins received the automatic weapons we had promised them, the assassination might have gone more \"cleanly\" and scores of lives might have been saved."}, {"review_sentiment": 5.0, "review_text": "Fascinating!!! Very well written. A must read for all."}, {"review_sentiment": 5.0, "review_text": "THis is a great read.  Popular history.  A great book about an extraordinary act of heroism in which a small band of men killed a brutal dictator."}, {"review_sentiment": 5.0, "review_text": "As one of the previous reviewers describe, read Crassweller's book about Trujillo to really get a good picture of how awful this Dominican dictator was to his people.  For those interested in the assasination of the dictator, Diederich's book describes in minute detail of how the murder took place.  Crassweller's book leaves much of this out.  Trujillo was as bad to his people as Saddam is to the Iraqi people.One good point of this book is the reader's knowledge that Diederich was there at the time in the country.  This is no author piecing something together from written sources, but a news correspondent covering the Dominican Republic during the time of the incident.  The book was very readable."}, {"review_sentiment": 5.0, "review_text": "As you'll know if you've been to Santo Domingo, Robert Crassweller's \"Trujillo\" has long been the best-known biography of the dead Dominican dictator, perhaps owing partly to its omnipresence in the island's hotel gift shops. But \"Death of the Goat\" by Bernard Diederich is in my opinion the best and most readable non-fiction work through which to explore Trujillo and his bloody regime.\"Death of the Goat\" has as its focal point the assasination of Rafael Trujillo, that is, the end of a 30-year-long story: the preparations, the backgrounds of the assasins, the frantic attempts to hide once the deed was done. But while focusing on the deed Diederich does an outstanding job of explaining how things got to that point, and does so less with the formality of a historian than with the incisiveness of an investigative reporter. This book is especially valuable for the light it sheds on the six months after Trujillo's assasination. Far from bringing about an immediate collapse to the regime, the assasination ushered in a six-month reign of terror during which Trujillo's family, led by the bloodthirsty Ramfis, exacted horrifyingly gruesome revenge on anyone they believed to have been involved in the plot. The torture visited on men such as father and son Miguel Angel Báez and Miguel Angel Báez Diaz is painful to read about even today and definitely not for those with weak stomachs. The curtain did not really fall on the \"Era of Trujillo\" until his sons executed their last captives at Trujillo's hacienda in November 1961 and then fled the country with their father's body and a hefty chunk of their nation's wealth.The insightful and shocking look Diederich provides at the period after the assasination is essential reading for anyone seeking knowledge of the modern Dominican Republic. Perhaps most unbelievable of all is the fact that Joaquín Balaguer, one of Trujillo's rubber-stamp \"Presidentes\", could through his silence collaborate with such atrocities and yet still be elected president time and time again, most recently in 1994. Also hard to comprehend is how one of Balaguer's political allies could be Donald Reid Cabral, whose brother Robert committed suicide after the plot rather than be taken alive by the remaining Trujilloites whom Balaguer was involved with. In Dominican politics, truth really IS stranger than fiction. Diederich shows us why."}, {"review_sentiment": 5.0, "review_text": "My parents are from the Dominican Republic and all during my childhood I heard my father tell stories about the infamous dictator known as Trujillo. While reading this book and asking my parents questions about certain details, I can say that the author truly did describe the horrors lived during those thirty years while Trujillo governed the country. I enjoyed the book very much and would recommend it highly."}]}, "authors": ["Bernard Diederich"], "isbn": "155876206X", "longitude": -69.942111, "periods": ["1900s"], "title": "Trujillo: The Death of the Dictator", "word_cloud": "good product very insightful document story assassination well do anyone interested thorough accurate description event surround assassination anyone want understand approach american diplomat year assassination meet several people intimately familiar event lead assassination afterwards involve plan civilian elected government shooter tell everything true everything true talk friends valuable far immediate fact implicit attitude infatuation covert operation drive event hardly understand reminds people everywhere operate see requirement calendar lead rethink covert action program officer tell assassin postpone thing cogitate assassin make clear kill reason want help lead alternate outcome have assassin receive automatic weapon promise assassination go cleanly score life fascinate very well write great history great extraordinary act heroism small band men kill brutal previous reviewer describe really good picture awful dominican people interested assassination describe minute detail murder take place leave much bad people good point knowledge time country author piece something together write source news correspondent cover time incident readable know long biography dead perhaps owe partly omnipresence island hotel gift shop opinion best readable work explore bloody regime focal point assassination end story preparation background assassin frantic attempt hide do focus deed outstanding job explain thing get point le formality historian incisiveness investigative reporter especially valuable light shed month assassination bring immediate collapse regime assassination usher reign terror family lead bloodthirsty exact horrifyingly gruesome revenge anyone believe involved plot torture visit men father son painful even today definitely weak stomach curtain really son execute last captive hacienda flee country father body hefty chunk nation insightful shock look provide period assassination essential read anyone seek knowledge modern perhaps unbelievable fact collaborate atrocity yet still elect president time time recently also hard comprehend political ally brother commit suicide plot rather take alive remain involve dominican politics truth really stranger fiction show parent childhood hear father tell story infamous know read ask parent question certain detail say author truly describe horror live thirty year govern country enjoy much highly", "genres": ["Biography", "History", "Politics"], "summary": "On May 30, 1961, a hail of bullets ended the life of Generalissimo Rafael Leonidas Trujillo, known to his countrymen as \"The Goat\" for his many revolting excesses, after thirty-one years of brutal rule over the Dominican Republic. \r\n\r\nThis book is a riveting, minute-by-minute account of the plot to kill Trujillo, who was then the Western Hemisphere's most ruthless dictator, and the ferocious wave of revenge that ensued before his regime collapsed. The book also reveals the vacillating role of the United States - and the CIA - in first propping up the dictator, and then supplying weapons to slay him.\r\n\r\n\"A fascinating enquiry in depth into the background of Trujillo's murder - a natural for the biographer of that other monster of the Caribbean. Papa Doc.\" Graham Greene", "asin": "155876206X", "rank": "453382", "city": "Santo Domingo", "image": "https://images-na.ssl-images-amazon.com/images/I/51JNpcyWbhL.jpg", "country": "D.R.", "story_arc": ["Tragedy", "Things only get worse"]}