{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 42, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "My daughter recommended this book as a good book about early San Francisco.  Not only was SF rough around the edges, in the early days, but was one of the most dangerous & corrupt in the US."}, {"review_sentiment": 5.0, "review_text": "Absolutely TERRIFIC !"}, {"review_sentiment": 5.0, "review_text": "Using book for research for a historical novel. Great resource."}, {"review_sentiment": 5.0, "review_text": "This is an important reference work. Next time you visit San Francisco's Embarcadero, read this first."}, {"review_sentiment": 5.0, "review_text": "A strange little book form almost a century ago.  Some of the tales sound apocryphal, but still interesting.  It was a pretty wild place and time ..."}, {"review_sentiment": 5.0, "review_text": "Great read about the early days of the City"}, {"review_sentiment": 4.0, "review_text": "There was a time when San Francisco was called \"the wickedest, most corrupt and godless city on the face of the Earth—even more wicked than Marseilles or Port Said.\"  This classic study shows you why.  Following up on The Gangs of New York: An Informal History of the Underworld, which Asbury had written five years earlier (still to come in his histories of city underworlds were French Quarter: An Informal History of the New Orleans Underworld (1936) and Gem of the Prairie: An Informal History of the Chicago Underworld (1940)), it traces the bawdier side of life in the City by the Bay from its roots when \"the world rushed in\" in 1849; around the early '50's a flood of ruffianly veterans of the frontier towns of Australia, joined by escaped convicts and ticket-of-leave men from New South Wales and Van Diemen’s Land, began to arrive, and the more enterprising spirits among them took over the flimsy frame and brick building of the old Chilean neighborhood and began opening lodging houses, dance halls, groggeries, and taverns there.  After describing the character (or lack thereof) and crimes of the \"Hounds\" and \"Sydney Ducks,\" whose activities led to the founding of the Committee of Vigilance in 1851, as well as the political corruption in which these groups flourished, and the \"Second Cleansing\" of 1856 as inspired by the shooting of James King of William, Asbury goes on to show how the Coast \"settled\" into its best-known and most modern incarnation, including the semi-legitimate businesses (auction houses, secondhand-clothing shops) that flourished there, the reluctance of the police to intervene in its affairs, and many of the most prominent criminal characters who called the district their home.  Some of the Coast's \"traps\" weren't too bad, especially by modern standards, and Asbury introduces us to the best of them, the famous concert saloon known as the Bella Union, which was one of the goals of the earliest \"slummers,\" and one of whose advertising sheets, dated 1862, ballyhooed \"a constantly varied entertainment...fun and frolic...song and dance...grace and beauty...eccentricity...laughter for millions...dramatic, terpsichorean and musical talent...\"  Then he explores the vices of Chinatown, where bordellos and cribs staffed by Chinese slave girls (which they literally were) and opium dens abounded, even though this wasn't strictly a part of the Coast, and provides a look at the how and why of the infamous practice of shanghaiing, the various types of (mostly non-Chinese) prostitution, the effect of the Fire of 1906, and the decline of the district as San Francisco grew up and tried to forget how it had begun.Some of what you'll find in these pages may shock you (though none of it is terribly graphic; the book was, after all, written in 1933), and judging by what I've been able to discover in most of a lifetime researching the social history of the 19th Century, San Francisco customs shouldn't be taken as being followed in the smaller towns and villages that dominated the country till well into the 20th.  The chief fault of the book is that it doesn't always clarify when certain things happened or certain people and resorts were a part of the picture; if you're reading it for factual background, as I was, you'll find you have to go online and do some backup searching to get a clear idea of chronology.  On the other hand, it shows as few other books do just how corrupt the city's government was for nearly 60 years, and why.  It's a superior example of what it is, and a necessary read for those who wonder just how bad the biggest cities of the US were in their early years."}, {"review_sentiment": 5.0, "review_text": "Given as a gift.  Receiver loved it."}, {"review_sentiment": 5.0, "review_text": "Killer read"}, {"review_sentiment": 5.0, "review_text": "I LOVED this book.  Fascinating from page one.  I actually read it aloud as long as my voice could hold up.  Brilliant old world writing, yet absolutely understandable.  What a riotous time and important piece of history is revealed in these pages complete with documentation and this book was first published in 1933!  This writer's style is worth the five stars."}]}, "authors": ["Herbert Asbury"], "isbn": "1560254084", "longitude": -122.4192363, "periods": ["1800s", "1900s"], "title": "The Barbary Coast: An Informal History of the San Francisco Underworld", "word_cloud": "daughter recommend good early not rough edge early day dangerous corrupt absolutely use research historical resource important reference work next time visit first strange little form almost century tale sound apocryphal still interest pretty wild place time early day time call wickedest corrupt godless city face wicked say classic study show follow write year earlier still history city underworld french trace bawdier side life root world rush early flood ruffianly veterans frontier town join escaped convict men begin arrive enterprising spirit take flimsy frame brick building old neighborhood begin open lodge house dance hall grocery tavern describe character lack thereof crime activity lead found well political corruption group flourish inspire shoot go settled modern incarnation include business auction house shop flourish reluctance police intervene affair many prominent criminal character call district home trap bad especially modern standard introduces best famous concert saloon know goal earliest slimmers advertising sheet date ballyhooed constantly vary entertainment fun frolic song dance grace beauty eccentricity laughter million dramatic terpsichorean musical talent then explore vice bordello crib staff chinese slave girl literally opium den abound even strictly part provide look infamous practice shanghai various type mostly prostitution effect decline district grow tried forget page none terribly graphic write judging able discover lifetime research social custom take follow smaller town village dominate country till well chief fault always certain thing happen certain people resort part picture read factual background find go online backup search get clear idea chronology hand show corrupt city government nearly year superior example necessary wonder bad biggest city early year give gift love love fascinate page actually aloud long voice old world writing yet absolutely understandable riotous time important piece reveal page complete documentation first publish writer style star", "genres": ["History"], "summary": "The history of the Barbary Coast properly begins with the gold rush to California in 1849. If the precious yellow metal hadn't been discovered ... the development of San Francisco's underworld in all likelihood would have been indistinguishable from that of any other large American city. \r\n\r\nInstead, owing almost entirely to the influx of gold-seekers and the horde of gamblers, thieves, harlots, politicians, and other felonious parasites who battened upon them, there arose a unique criminal district that for almost seventy years was the scene of more viciousness and depravity, but which at the same time possessed more glamour, than any other area of vice and iniquity on the American continent. \r\n\r\nThe Barbary Coast is Herbert Asbury's classic chronicle of the birth of San Francisco—a violent explosion from which the infant city emerged full-grown and raging wild. From all over the world practitioners of every vice stampeded for the blood and money of the gold fields. Gambling dens ran all day including Sundays. From noon to noon houses of prostitution offered girls of every age and race. \r\n\r\n(In the 1850s, San Francisco was home to only one woman for every thirty men. It was not until 1910 that the sexes achieved anything close to parity in their populations.) \r\n\r\nThis is the story of the banditry, opium bouts, tong wars, and corruption, from the eureka at Sutter's Mill until the last bagnio closed its doors seventy years later.", "asin": "1560254084", "rank": "129807", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51nQqQD755L.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}