{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 24.5895489, "ratings": {"num_ratings": 15, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "Both photography and writing I liked. Many facts that (personally) I never knew about Costa Rica was very informative. I would recommend this book everyone."}, {"review_sentiment": 3.0, "review_text": "This is a lovely hardcover book of Costa Rica.  Nice Photos and associated text.  While it is nice, it is not necessarily spectacular and didn't quite measure up to the retail price."}, {"review_sentiment": 5.0, "review_text": "I saw the review that says that this is not a travel book, and I agree. But it is really lovely & so well written. I got it for a gift and it was really appropriate and much appreciated.My husband & had been to Africa with my in-laws on a trip by Overseas Adventure Travel. OAT puts out some really beautiful literature, and first class trips and they listed this book in their Costa Rica reading list on their site. It sounded like a good recommendation, and worked out well. I gave it to my mother-in-law, who had traveled to Costa Rica. She is educated & discriminating appreciated that it was factually/historically thorough."}, {"review_sentiment": 5.0, "review_text": "This is a fantastic book.  In a very enjoyable way it covers just enough of each of the dimensions that make a country.  From the geological beginnings under water to the mountains and high fertile valleys, ancient people to modern day inhabitants, ants to orchids, and beautifully illustrated with excellent photos.  We bought a copy before we went, left it with our friends at Diquis Del Sur (diquiscostarica.com), and bought another copy when we got home.  Enjoy the book and this beautiful country.For a travel guide we were torn between the excitement presented in the National Geographic Traveler - Costa Rica book and the superior information for getting around in the Frommer's book.  For retirement and living there we preferred \"The New Golden Door to Retirement and Living in Costa Rica\".  The best map is International Travel Maps - Costa Rica, GPS generally works, and most cell phones don't."}, {"review_sentiment": 2.0, "review_text": "I bought this book based on the numerous adulations on this web site.  However, as an uptodate travel guide, I found it not -- not worth the money, not a travel guide, not about retirement, not current (copywrite 1993). It is a historial summary of the country, people, flora and fauna. The pages devoted to today's needed travel info \"Modern Times\" were outdated and numbered only from 129-146.  It's a nice coffee table book with some beautiful pictures.  Buy it for that reason, if you choose to buy it, but not as a travel guide as recommended by another reviewer."}, {"review_sentiment": 5.0, "review_text": "This book evokes the country of Costa Rica and it's influence on its peoples by describing the harsh, desolate, yet sublime landscape that embodies the contradictions of Costa Rican life within it's borders and in it's geo-political stature in Central America.As dry-wiited as it is information soaked, this book gives the traveler a place to begin in the land that never seems to be what the traveler expects.  \"The Last Country the Gods Made\"  is a contemplative book, a book of essays that creates a spiritual geography, explains the eccentricity of archeology and throws light on the urgency of visionary politics.This masterful synthesis is a refreshingly unconventional analysis informed by anthopology, migratory science, architecture, environmentalism, epistemology and political minutiae. There is wonderful mini-essay that the authors' call a \"sidebar\" entitled, \"Why No Empire.\" In it, Colesberry and McLean address the mystery of why the native people of Costa Rica, though amazingly organized, greatly populated and artistically skilled, never formed any urban centers like the Aztec and Mayan empires. Suffice to say, that they pose an utterly unique solution involving Egypt, mideval French wheat farmers, and Vasquez de Coronado's observations of buzzards!They end this delightful foray with, \"...perhaps the local Amerindians had no use for urban zones or concentrations of power that would have placed them in the ranks of advanced societies. If urbanity is the litmus test for civilizations, consider this: in the Diquis area, the leaders lived with not the warriors as one might imagine, but with the artists. How urbane can you get?\"I'd like to say one more thing. The Search Inside the Book pages that Amazon shows you in no way represent the book's text! The pages you can read are just the introduction written by the publisher! It's ridiculous that Amazon doesn't present the meat of this lovely text, since the writing is particularly accomplished."}, {"review_sentiment": 5.0, "review_text": "I was eating at Croce's Restaurant in Old-Towne San Diego, California, when I saw a book displayed called Costa Rica: The Last Country The Gods Made.Apparently, singer Jim Croce's widow, Ingrid, had spent a couple of years there working and recuperating after her husband's death, and the authors came into her restaurant one day and they ended up trading books with her (she wrote a cookbook, Thyme in a Bottle, in which she details her stay in Costa Rica).Well, I looked through The Last Country The Gods Made and ended up buying it on Amazon and the writing's particularly engaging for a nonfiction book- parts of it almost read like a novel. The photographs really grab ahold of you too. It's one of the best travel books I've ever read."}, {"review_sentiment": 5.0, "review_text": "I agree with the first reviewer, my favorite essay was also \"House Made of Rain.\"  I've just never read anything like it-a vertical description of the rainforest from the point of view of a bird!The rest of the book is packed with everything that's right about travel writing-insight, humor and surprise.  It's also a superior book that will interest and encourage ecotourists, conservationists and amateur naturalists wishing to learn more about the green soul of this irresistible country.By the way, I bought one autographed by the authors and they wrote a really cool thing: \"The heart is a country and the mind a passport. Bon Voyage!\""}, {"review_sentiment": 5.0, "review_text": "When you see the cover,  you know you're in for a MOST unusual book about a country about which 100 guide books have already been written.  One sees an angel statue in a graveyard at dawn, or  is it twilight?  Is this  Costa Rica or \"have goth, will travel\"? Well, maybe a little of both. The eccentricities of the two writers  are on the front burner here with subjects like bats, nitrogen-fixing organisms, Arab-oil embargoes, human diseases, hydroelectricity, the Pan-American highway, trash-burning and communism.  But maybe that's what makes these series of essays a good read, especially while one is traveling, because the 1-10 page segments stand on their own.And the photos are equally \"unique,\" shall we say-not what one would normally expect from a travel book. Once you get past the beautiful inappropriateness of the cover picture, the reader is further challenged by artsy, gorgeous photos that seem to stand alone from the text. Fruit still-lifes, rodeo-cowboys, father and son mechanics on a lunch break, cattle herders, city street musicians, a sunlit pathway through a rainforest; all these random images \"float\" through the text without a care for relevance!However, having said that, somehow it works. The book as a whole, pictures plus words, truly gives one a \"feeling\" for Costa Rican life as it is really lived. That's the best way I can describe this strange but exciting book. It makes you feel because it makes you understand. I can't recommend it highly enough."}, {"review_sentiment": 4.0, "review_text": "Being from Argentina, I often think American writers don't get it right when writing about South or Central America. But this book is really respectful while not shying away from Costa Rica's problems. Plus, it captures the Costa Rica I experienced when I vacationed there 3 years ago.I liked the pictures, too, especially the one taken through a window of an abandoned house, looking up the side of Volcan Irzazu.  I gave it 4/5 stars because I wish the photo captions had been on the pages of the photos, but instead they were on a separate page in the back, so I had to keep flipping back and forth. But I guess that's a small thing."}]}, "authors": ["Adrian Colesberry", "Brass McLean"], "isbn": "1560442514", "longitude": -107.3920441, "periods": ["1900s"], "title": "Costa Rica: The Last Country The Gods Made", "word_cloud": "photography write like many fact personally never know informative everyone lovely hardcover associate text nice necessarily spectacular quite measure retail price saw review say travel agree really lovely well write get gift really appropriate much husband trip put really beautiful literature first class trip list read list site sound good recommendation work well give travel educate discriminate appreciate fantastic enjoyable way cover enough dimension make geological beginning water mountain high fertile valley ancient people modern day inhabitant ant orchid beautifully illustrate excellent buy copy go left friend buy copy get home beautiful travel guide torn excitement present superior information get around retirement living prefer best map generally work cell phone buy base numerous adulation web site however update travel guide find worth money travel guide retirement current copywriter historical summary people flora page devote today need travel info outdated number nice coffee table beautiful picture reason choose travel guide recommend reviewer evoke influence people describe harsh desolate yet sublime landscape embodies contradiction rican life border stature information soak give traveler place begin land never seem traveler expect contemplative essay create spiritual geography explain eccentricity archaeology throw light urgency visionary masterful synthesis refreshingly unconventional analysis inform anthropology migratory science architecture environmentalism epistemology political minutia wonderful author call sidebar entitle empire address mystery native people amazingly organize greatly populate artistically skilled never form urban center empires say pose utterly unique solution involve medieval french wheat farmer observation buzzard end delightful foray perhaps local use urban zone concentration power rank advanced society urbanity litmus test civilization consider area leader live warrior artists urbane get say thing page show way represent page introduction write publisher ridiculous present meat lovely text write particularly accomplish eat saw display call singer widow spent couple year work recuperate husband death author come restaurant day end trading write cookbook detail stay look end buy write particularly engage nonfiction part almost photograph really grab best travel ever agree first reviewer favorite essay also never anything like vertical description rain forest point view rest pack everything right travel humor surprise also superior interest encourage ecotourists conservationist amateur naturalist wish learn green soul irresistible way buy autographed author write really cool thing heart passport voyage cover know most unusual already write see angel statue graveyard dawn twilight be travel maybe little eccentricity writer front burner subject bat organisms embargo human disease hydroelectricity highway communism maybe make series essay good especially travel page segment stand photo equally unique normally travel past beautiful inappropriateness cover picture challenge artsy gorgeous photo seem stand alone text father son mechanic lunch break cattle herder city street musician sunlit pathway rain forest random image float text care relevance however say somehow work whole picture word truly give feeling rican life really live best way describe strange excite make feel make understand highly enough be often think american writer get right write really respectful shy away problem capture experience vacation year like picture especially take window abandon house look side give star wish photo caption page photo instead separate page back keep flip back forth guess small thing", "genres": ["History", "Travel Writing"], "summary": "A collection of stirring essays from writers Adrian Colesberry and Brass McLean (both veteran travelers), \"Costa Rica: The Last Country The Gods Made,\" tells the history of the country from the inside out, starting with its geological formation and ending with its status as the \"Switzerland of Central America.\"\r\n\"The Last Country,\" highlighted by the stunning photos of international photographer Kimberly Parsons, showcases the strength of their collaborative and individual talents. Parson’s photos of sugar-processing plants, spider monkeys, oxen at work, cemetery angels, fishermen, school children, street musicians and volcanoes form a vivid rendering of life in Costa Rica. Colesberry and McLean match the more than 65 photos with passionate words, adding a human element to subjects ranging from coffee to indigenous peoples, from ants to women’s issues, from bananas to religion; their spirit is infectious. The essays are accompanied by sidebars, short, insightful thoughts on little-known facts about the country.\r\n\r\nWinner of the 1994 Publishers Marketing Association's \"Ben Franklin Award\" for \"Best Travel Narrative\" written in the United States.", "asin": "1560442514", "rank": "1849096", "city": "Costa Rica", "image": "https://images-na.ssl-images-amazon.com/images/I/51Y5ND1TEML.jpg", "country": "Mexico", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}