{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 35, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Just starting to read him."}, {"review_sentiment": 5.0, "review_text": "Great!"}, {"review_sentiment": 4.0, "review_text": "Good read!"}, {"review_sentiment": 5.0, "review_text": "\"If He Hollars, Let Him Go\" is a well-written book that covers four days in the life of an intelligent, Negro, working in a shipyard in WWII era California. For those who don't know, that was the period immediately preceding the so-called \"civil rights\"(1) movement.Himes, who grew up in Cleveland, has crafted a fascinating and attention-holding tale, which ought to generate empathy for the Black people who lived under Jim Crow conditions -- especially at a time when all Americans were engaged in (what they at least imagined was) a world-wide terrific struggle for our continued existence as a (more or less) free society.So, yeah, I can empathize with THOSE Black Americans. However, I can also understand that a really workable solution to the problems Himes writes about was just was not possible --at least not for many of them, if only because even if given the same rights and even respect possessed by \"US,\" they were and are not US, in that we and our nation stem from Northern European heritage, tradition, morals, and custom... and the fact is that African Americans, in most cases, don't care squat for any of that, nor should they be expected to, nor should they be disliked when they don't. But they should not be permitted to burn the place down and get away with it. (!)The only real way to solve the problem for *Them* would be to totally delete *Our* heritage, traditions, history, custom, and yes, morality... and in fact *Our* existence, which is something that certain interest groups are busy, busy, busy attempting to do as you read this.We will not allow that to happen, though; and that is, to a HUGE degree, what the Trump/America First movement is all about, despite vehement denials by many that \"we are not racists.\"It's a fact, though, we are not racists, because the problem is not \"racism\" (a made up weaponized word concocted by Marxists, as a tool against the majority culture).The \"problem\" is a lack of empathy; including the fact that the empathy lacked is not likely to EVER exist in strong enough doses to solve the problem. And it is NOT *us* who lack the empathy, in most cases, it is *them*. This has become more and more obvious in recent years, especially during the 2016 presidential campaign.Happily, perhaps, many Black Americans are willing to live with *US* in a civilized fashion with amenities such as automobiles, central heating, air-conditioning, markets with refrigeration, and all the rest, though it's not likely that most of them will ever become interested in the life of John Jay or the history of the Conquest of England. Ironically, though, many of *us* are pleased to spend long hourse reading about people such as the protagonists of Chester Himes books, or even the life of Gengis Khan, but I digress.However, those who are not willing to live with us in a civilized manner are simply out of luck; and for most of them there is little chance of that luck changing any time soon. Thank heaven.That said, I recommend Chester Himes books; his detective novels are also first rate. He also issued a two-part autobiography, of which I attempted to read volume two, only to discover that the words of  Hilton Als, who wrote the introduction to the 2002 edition of \"If He Hollers\" are true: Hines does write himself into his novels, and, since the life of the people in the novels is quite a bit more interesting than the life of Chester Himes himself, thus reading the constant kvetching without letup with which Chester Hines fills his autobiography is a \"downer.\" So I may not finish it.(1) The term \"civil rights\" is an oxymoron because rights are unalienable, not civil. \"Civil privileges\" is what it really is, with arbitrary everything, including in America's case, the arbitrary extinguishing or at least heavy infringement of certain rights, including the right of free association and the right of property. Negroes who don't care for my words would do well to seek out the work of (Black) Professor Tony Martin and  discover the identity of those who owned and operated the slave trade. Hint: it wasn't William the Conqueror or John Jay!"}, {"review_sentiment": 4.0, "review_text": "Great book by Himes. Honestly maybe the most troubling book to read though because you feel so involved and sorry for the racism present in the book, but obviously a great eye opener to life during WWII and even today."}, {"review_sentiment": 5.0, "review_text": "Really well written. I was assigned to read this for a class, and thoroughly enjoyed myself. Found that it wasn't so easy to put the book down!"}, {"review_sentiment": 5.0, "review_text": "everything was great!"}, {"review_sentiment": 5.0, "review_text": "Excellent.Mm"}, {"review_sentiment": 5.0, "review_text": "Came in good condition."}, {"review_sentiment": 3.0, "review_text": "Received on time and as advertised."}]}, "authors": ["Chester Himes"], "isbn": "1560254459", "longitude": 0.0, "periods": null, "title": "If He Hollers Let Him Go: A Novel", "word_cloud": "just start great good collar cover day life intelligent work shipyard era know period immediately precede civil right grow craft fascinate tale empathy people live condition especially time engage least imagined terrific struggle continue existence le free yeah empathize however also understand really workable solution problem write possible least many even give right even respect possess nation stem heritage tradition moral custom fact african case care squat expect disliked permit burn place away real way solve problem totally heritage tradition history custom morality fact something certain interest group busy busy busy attempt allow happen degree movement vehement denial many racist fact racist problem racism make weaponized word concoct marxist tool majority culture problem lack empathy include fact empathy lack likely exist strong enough dos solve problem empathy case become obvious recent year especially presidential perhaps many willing live civilize fashion amenity automobile central heat market refrigeration rest likely ever become interested life history many pleased spend long hour reading people protagonist even life willing live civilized manner simply luck little chance luck changing time soon say recommend detective novel also first rate also issue autobiography attempt volume discover word write introduction edition true write novel life people novel quite bite interesting life thus read constant kvetching letup fill autobiography downer term civil right oxymoron right unalienable civil privilege really arbitrary everything include case arbitrary extinguish least heavy infringement certain right include right free association right property care word well work discover identity own operate slave trade maybe trouble feel involve sorry racism present obviously great eye opener life even today really well write assign class thoroughly enjoy easy put everything great good condition receive time advertise", "genres": ["Fiction & Literature"], "summary": "This story of a man living every day in fear of his life for simply being black is as powerful today as it was when it was first published in 1947. The novel takes place in the space of four days in the life of Bob Jones, a black man who is constantly plagued by the effects of racism. \r\n\r\nLiving in a society that is drenched in race consciousness has no doubt taken a toll on the way Jones behaves, thinks, and feels, especially when, at the end of his story, he is accused of a brutal crime he did not commit. \r\n\r\nIf He Hollers is an austere and concentrated study of black experience, set in southern California in the early forties.", "asin": "1560254459", "rank": "115485", "city": "", "image": "https://images-na.ssl-images-amazon.com/images/I/41FSqumyQHL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}