{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 29, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Fantastic! I love the way it was written with so much candor. It made me wanted to hop on a plane and experience the tastes and aromas of their food. To see and smell their flowers. Truly love it and highly recommend it. Congratulations to the author."}, {"review_sentiment": 4.0, "review_text": "Excellent well written history"}, {"review_sentiment": 4.0, "review_text": "This novel treats the taking of Istanbul during the war after the Great War. It combines a Tolstoyian epic with elements of melodramatic domestic affairs. These focus on the tumult within a family as they watch their social status and political stability dwindle. Events incorporate the breakdown of the Ottoman Empire in 1920 as Allied troops back Greek Christian forces bent on dividing up Turkey after the war, in a civil war.As this topic is little-known abroad, Kenneth J. Dakan's fluid translation from a difficult language to render easily into our own, Turkish, provides a wider audience access to entering this transition. People whom for six centuries have grown accustomed to the Sultan's rule and bureaucratic intrigue find themselves forced to rely on the promises of the nationalists, and their ambition to create a secular state which somehow remains an Islamic one, a difficult task the past century surely proves. And as recent headlines remind us, tellingly.\"Farewell: A Mansion in Occupied Istanbul\" brings Ayse Kulin to an international readership, too. From what I can gather, her fiction aims at the bestseller list in her native country, blending history with love, as catastrophes loom. Dakan conveys the steady buildup of frayed nerves as bombings, imprisonment, torture, and espionage threaten the family of Ahmat Resat, finance minister for the Sultan. Caring for his ill nephew, rebellious Kamal who has gone into hiding back from a disastrous military loss suffered by the Turks, and dealing with the meddling British, the father of the household must cope with a bickering aunt, a weary wife, and a maid who hopes to marry Kamal once he heals. This set-up takes the first two-thirds of the novel.The last part draws Kamal out of his confines, as the Ankara-led nationalists fight back against the Greek, British, and French who try to subvert the remaining Caliphate Army as the Ottoman Empire collapses. This complexity moves the story along, although the domestic tensions dissipate somewhat as Kulin takes one key character into a different setting, only to leave that person somewhat adrift, eventually relegated off-stage. This pace falters a bit, compared to the brisk way Kulin moves the story along in the previous three-fourths.The other protagonist gives the meaning to the title, as the Sultan's machinations dwindle and the nation we know as Turkey since emerges. That'd make another great novel, if Kulin wants to continue this family saga. While less of Istanbul is seen and experienced than I'd have anticipated, the interior drama remains interesting throughout."}, {"review_sentiment": 5.0, "review_text": "Great history behind this book and the story is fantastic."}, {"review_sentiment": 4.0, "review_text": "love the back drop/ time period/ characters"}, {"review_sentiment": 5.0, "review_text": "This novel opens in 1920 Istanbul, during the last days of the Ottoman Empire.  A real page turner with a perfect blend of fiction and facts.  It is so well written - just pick it up and you can thank me later. :)"}, {"review_sentiment": 4.0, "review_text": "I didn't enjoy this as much as the author's \"Last Train to Istanbul\". However, I found the struggles of the family and their associates under the occupation quite absorbing. I fell I know a lot more about the last days of the Ottomans now."}, {"review_sentiment": 4.0, "review_text": "The author in simple images captures the era and the lifestyles of people caught up in the aftermath of WW1 as it affected Istanbul. The characters emerge along with their cultural heritages.and mores. The reader experiences their confusion and varied reactions as the Ottoman Empire implodes and the occupying powers carve up the territory. I hope  that more than the current two books by this author are translated into English. They are informative as well as good reading."}, {"review_sentiment": 5.0, "review_text": "Really captures the end of an empire and of a way of life...I didn't want it to end. A page turner and a great read."}, {"review_sentiment": 4.0, "review_text": "Loved this book, put into perspective a complex period in Turkish history. Characters were complex and compelling set at the end of the Ottoman Empire."}]}, "authors": ["Ayse Kulin"], "isbn": "1564787583", "longitude": 28.9651646, "periods": ["1900s"], "title": "Farewell: A Mansion in Occupied Istanbul", "word_cloud": "fantastic love way write much candor make want hop plane experience taste aroma food smell flower truly love highly recommend congratulation author well write history treat take war combine tolstoyian epic element melodramatic domestic affair focus tumult family watch social status political stability dwindle event incorporate breakdown troop back greek christian force bent divide war civil topic abroad fluid translation difficult language easily provide wider audience access enter transition people century grow accustomed rule bureaucratic intrigue find force rely promise nationalist ambition secular state somehow remain difficult task past century surely prove recent headline remind tellingly farewell bring international readership gather fiction aim bestseller list native country blend history love catastrophe loom conveys steady buildup fray nerve bombing imprisonment torture espionage threaten family finance minister ill nephew rebellious go hide back disastrous military loss suffer deal meddle british father household bicker aunt weary wife maid hope marry heals take first last part draw confines nationalist fight greek british french try subvert remain collapse complexity move story domestic tension dissipate somewhat take key character different set leave person somewhat adrift eventually relegate pace falter bit compare brisk way move story along previous protagonist give mean title machination dwindle nation know emerges make great want continue family saga le see experience anticipate interior drama remain interesting history story fantastic back time character open last day real page turner perfect blend fiction facts well write pick thank later enjoy much author last however find struggle family associate quite absorb fell know lot last day author simple image capture era lifestyle people catch aftermath affect character emerge along cultural more experience confusion vary reaction implode occupy power carve territory hope current author translate informative well good reading really capture end empire way life want page turner great love put perspective complex period history complex compelling set end", "genres": ["Fiction & Literature", "Historical Fiction", "WWI"], "summary": "A sweeping story of the final collapse of the Ottoman Empire over the course of the First World War, \"Farewell\" is a novel of one particular family living in one particular house during these historic events.", "asin": "1564787583", "rank": "1344525", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51EDh4RggFL.jpg", "country": "Turkey", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}