{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 44.8178131, "ratings": {"num_ratings": 3, "rating": 3.5, "reviews": [{"review_sentiment": 2.0, "review_text": "First off, I'd like to say that this novel is full of very good images, and, in a sense, is a decent piece of surrealism. I've enjoyed Zivkovic's work in the past, and while I didn't like this book at all, he pulls off all his usual tricks. If not for one very prominent problem, I would have enjoyed it immensely.The narrator is impossibly, obnoxiously neurotic, steeped in old world pretensions, and makes every page a chore. Rather than focusing on the imagery itself, Zivkovic chooses to immerse us in the narrator's petty attempts to \"maintain his gentlemanly pride\", all of which fail immensely.Though certainly the novel's structure recalls the asymptomatic structures of Kafka or Kobo Abe, and the supernatural edge of Bulgakov, rather than feeling sympathetic for the narrator, after the first ten pages, I read most of the book wanting to hit him in the face with a baseball bat. This story came off feeling like third-rate Murakami, and though Zivkovic's imagination still shows through, I could hardly bring myself to appreciate it. It also feels, at times, far too much like a cheap thriller.Zivkovic can do much, much better than this. I generally enjoy his work, but I was looking forward to reading an actual novel, as opposed to his usual mosaics. This is also by far the worst his prose has ever been. It was stilted, obnoxious, and never, ever beautiful. Even the strong images could have been handled much, much better.I usually don't bother writing negative reviews, but I can't remember the last time I felt so let down by an author I've enjoyed (to some extent, at least) in the past. This novel was, for the most part, nothing but a disappointment."}, {"review_sentiment": 4.0, "review_text": "In Zoran Zivkovic's recent novel, \"Hidden Camera,\" a neurotic undertaker returns home one evening to find that a movie ticket has been left anonymously for him at his front door. He goes to the theater at the Film Archive--now almost deserted because it is a Monday evening--as instructed and finds that the film will be shown only to him and a mysterious woman. The film turns out to be an amateur video in which the undertaker himself was secretly filmed while sitting on a park bench. After the brief showing, the lights come up, and the woman has disappeared, leaving only a ticket for another event that the undertaker is meant to attend later that evening at a used bookstore. So begins an eerie scavenger hunt tailored solely to the undertaker, who then races around his city at night to increasingly unlikely locations where he is presented with one bizarre spectacle after another.Zivkovic, a Serbian novelist, experiments with science fiction, existentialism, and metafiction and is often compared, appropriately, with Borges and Calvino. And \"Hidden Camera\" is a wonderful showcase for Zivkovic's talents. Nearly no twist or turn of this labyrinth can be foreseen, and the narrative provides a true edge-of-your-seat experience. Up till the very last page, I worried that Zivkovic wouldn't be able to pull off a real ending, and yet he did. Of course, that ending requires some work on the reader's part. It's fairly abstract, requires interpretation, and assumes that you've been paying close attention to the themes, symbols, and subtext. Even then, the book is a little like a riddle with a dozen possible answers, all of which (even cumulatively) fall just shy of a comprehensive solution. Still I found the climax tremendously rewarding. And Zivkovic gives you so much to remember and reflect on: harrowing suspense, indelible images, and scenes and settings that just keep getting more and more haunting and uncanny.Of course, this is not a book for everyone. But you're a good candidate for Zivkovic's existentialist scalpel if you've survived, with no serious side effects, Charlie Kaufman's films or any of Kafka's novels."}, {"review_sentiment": 5.0, "review_text": "What would it take to shake you out of your normal world? How about an envelope shoved in your door that you find on your way home from work that contains simply a movie ticket to a show that very night? And what would you think if when you arrived you were ushered to a seat in an otherwise empty movie theater right next to a beautiful mysterious stranger? As the lights go down and the movie begins you see yourself seated on a park bench reading a book like you often do, but completely unaware that you are being filmed and a mysterious beautiful stranger approaches you and sits at the other end of the bench and gazes at you, again unnoticed by you. Is this part of one of those Hidden Camera shows and are you to be the butt of the joke? And then the show ends and the lights go out and everything you ever thought was real and important will be questioned and things will never be the same.What follows is a hidden camera view into the mind of the unnamed narrator as he continues on through an event filled night. There are tons of meaning to be gleaned from the symbolism in this story and a romp through symbiotic parallel worlds or alternate reality or visions or dreams or who knows what for sure.But all along the ride this is just fine descriptive surreal fiction from Zoran Zivkovic that explodes and sets your mind off in new directions.Highly recommended!!"}]}, "authors": ["Zoran Zivkovic"], "isbn": "1564784126", "longitude": 20.4568974, "periods": ["2000s"], "title": "Hidden Camera", "word_cloud": "first like say full good image sense decent piece surrealism enjoy work past like pull usual trick prominent problem narrator impossibly obnoxiously neurotic steep old world pretension make page chore focus imagery choose immerse narrator petty attempt maintain gentlemanly pride fail certainly structure recall asymptomatic structure supernatural edge rather feel sympathetic narrator first ten page want hit face baseball bat story come feel imagination still show hardly appreciate also feel time far much cheap much much better generally enjoy work look forward read actual oppose usual mosaic also far worst prose ever stilted obnoxious never ever beautiful even strong image much much usually bother write negative review last time felt author enjoy extent least part nothing disappointment recent neurotic undertaker return home evening movie ticket leave anonymously front door go theater almost desert evening instructed find film show mysterious woman film turn amateur video undertaker secretly film sit park bench brief show light come woman disappear leave ticket event undertaker mean attend later even use bookstore begin eerie scavenger hunt tailor solely undertaker race city night increasingly unlikely location present bizarre spectacle serbian novelist experiment science fiction existentialism meta fiction often compare appropriately wonderful showcase talent twist turn labyrinth foreseen narrative provide true experience till last page worry able real end yet course end require work part fairly abstract require interpretation assume pay close attention theme symbols subtext even little riddle dozen possible answer even cumulatively shy comprehensive solution still find climax tremendously reward give much reflect harrow suspense indelible image scenes setting get haunt course everyone good candidate existentialist scalpel survive serious side effect film novel normal world envelope shove door find way home work contain simply movie ticket show night arrive ushered seat otherwise empty movie theater right next beautiful mysterious stranger light go movie begin see seat park bench read often completely unaware film mysterious beautiful stranger approach sits end bench gaze unnoticed part show joke end light everything ever think real important question thing never follow view mind unnamed narrator continue event fill night ton mean glean symbolism story romp symbiotic parallel world alternate reality vision dream know ride fine descriptive surreal fiction explode set mind new recommend", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "From one of Serbia’s greatest contemporary writers, Hidden Camera opens with the narrator finding a mysterious, blank envelope stuck in his apartment door inviting him to a private showing of a movie. Or so he initially thinks. Upon arrival at the theatre, he discovers that there’s only one other person in the audience, a very attractive woman whom he’s seated next to. Then things get a bit more mysterious. \r\n\r\nThe movie he’s been invited to see includes a scene showing him sitting in a park. Believing that he’s an unwitting participant in a complicated hidden camera show, he goes along with the variety of setups he’s faced with, which continue to get more involved and absurd. \r\n\r\nAs the show develops, he becomes more and more paranoid and distrustful, but he keeps up the ruse to its thrilling conclusion.", "asin": "1564784126", "rank": "1988366", "city": "Belgrade", "image": "https://images-na.ssl-images-amazon.com/images/I/51Ty3cY5vgL.jpg", "country": "Serbia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}