{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 8, "rating": 2.4, "reviews": [{"review_sentiment": 3.0, "review_text": "This book is a classic, in that it makes statement about capitalism, social class, and Mexican society. However, it's not a pleasurable read, this may be due to the translation of course."}, {"review_sentiment": 2.0, "review_text": "Wow, put it down in an airport and left it..."}, {"review_sentiment": 2.0, "review_text": "book was heavily marked, to the point that reading was impaired."}, {"review_sentiment": 1.0, "review_text": "I had high hopes for this book, as it was the first novel of Mexico's darling author, and as it promised to make Mexico City, my home for the past thirty years, come to life.  But the prose was dense, the characters caricatures, and the tone sordid.  I even tried the audiobook, which helped a bit, but never could really enter the world of the book."}, {"review_sentiment": 1.0, "review_text": "I have friends who assured me that if I were more diligent and kept reading that it would eventually make sense.  I tried, several times.  But there was no way I could make it through this.  There was not a single character I liked and not an action I understood.  This was the book that created Fuentes'fame and fortune.  I have a friend here in Mexico who told me that when she was in her  20's her Mexican friends were all reading this and loving it (in the mid-sixties, I think).  My hat's off to them."}, {"review_sentiment": 4.0, "review_text": "The book was sturdy, spine good shape but there were more markings than I thought there would be. Because I am reading it for a book club, this wasn't a problem but if I were doing this for a class, the markings might be a distraction. How can I complain at all since the price was great and delivery was quick. Now if only reading the book was a quick job!"}, {"review_sentiment": 4.0, "review_text": "Mexico is the major character in this first novel by Carlos Fuentes. It helps to be enamored of Mexico or interested in the history and politics of Central and Latin America. It's a hard read; I found it a rewarding, often entertaining and above all enlightening one. By the way, the original Spanish title is \"La Region Mas Transparente,\" quite different from the English translation."}, {"review_sentiment": 3.0, "review_text": "Considered by many to be Fuentes' all-time masterpiece, Where the Air is Clear (1958), his first novel, takes you on a roller-coaster tour of post-revolutionary Mexican urban history.  It's all there, from roughneck  taxi drivers and prostitues trying to make their daily bread, to bored  members of a fading aristocracy, of which only the double-barreled names  remain.  The novel's diverse characters meet and unmeet in a bizarre range  of social situations, ever-observed by the Spanish-Indigenous hybrid Ixca  Cienfuegos.  Cienfuegos, a type of Greek Chorus character who watches the  ups and downs of the novel's cast like a mad-scientist doing an experiment,  doesn't hesitate to drop in for a chat to the characters, provoking them to  pour out their hearts in sometimes tedious monologues.  If you have a basic  grasp of Mexico's history you'll understand this novel better, although if  you don't know the history, a stack of not too subtle symbols will help you  out. (A young member of a once aristocratic family looks at herself in a  mirror, while Vivaldi plays on a scratched record in the background. That  kind of thing.)  Don't take this novel to the beach, it ain't a beach  novel. Argentine writer Julio Cortazar, in a letter to Fuentes after  reading the book, summed it up: ``You've given in to the magnificent sin  committed by so many first-time novel writers..you've put a whole world  into 500 pages.''  A rare Latin American urban epic, this book is certainly  worth reading for anyone with an interest in the Mexican psyche. If you  want to see how the thinking behind Octavio Paz's Labyrinth of Solitude  would work, applied to a TV mini-series, and have a few days to spare, give  it a go."}]}, "authors": ["Carlos Fuentes"], "isbn": "1564783448", "longitude": -99.1333416, "periods": ["1900s"], "title": "Where the Air Is Clear", "word_cloud": "classic make statement capitalism social class society however pleasurable due translation course put leave heavily mark point reading impair high hope first darling author promise home thirty year come life prose dense character caricature tone sordid even try audio book help never really world friends assured diligent kept reading eventually sense try several time way single character like action understand create fortune friend tell friend read love think hat sturdy spine good shape marking think read club problem class marking complain price great delivery quick now read quick job major character first help enamor interested history politics hard find reward often entertain enlighten way original spanish title quite different translation consider many fuentes masterpiece first take tour mexican urban history roughneck taxi driver prostitute try make daily bread bore member fade aristocracy name remain diverse character meet unmet bizarre range social situation hybrid type character watch ups down cast experiment hesitate drop chat character provoke pour heart sometimes tedious monologue basic grasp history understand better know history stack subtle symbols help young member aristocratic family look mirror play scratch record background kind thing beach ai beach writer letter reading sum give magnificent sin commit many put whole world page rare latin american urban epic certainly worth read anyone interest psyche want see think applied tv day spare give go", "genres": ["Fiction & Literature"], "summary": "\"Where the Air Is Clear,\" Carlos Fuentes's first novel, is an unsparing portrayal of Mexico City's upper class. Departing from a traditional linear narrative, Fuentes overlays Mexican myths onto contemporary settings, showing that even the rich and powerful must succumb to the indomitable spirit of Mexico, which undermines all institutions and shapes all destinies. ", "asin": "1564783448", "rank": "716202", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/51E3zA9THbL.jpg", "country": "Mexico", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}