{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 3, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "The prose is nice.. Sarduy really know what poetry is. brilliant words and style."}, {"review_sentiment": 5.0, "review_text": "Cuban literature has a rich heritage which has inevitably been degnified and vilified alike by Cuba's political status in the global domain. Aside from the works of Reinaldo Arenas (Before Night Falls), Alejo Carpentier (The Lost Steps, Kingdom of this World), Cristina Garcia (Dreaming in Cuban) and Achy Obejas (Ruins), it has been read for the most part as a marker to the individual's struggle against oppression rather than appreciated for its elegance, wit and lyricism. The other writers who come to mind, who for the most part have been colonilized by political criticism are Dulce María Loynaz's poetry, José Lezama Lima (his masterpiece being \"Paradiso\") Virgilio Piñera Llera (Cold Tales), and Guillermo Cabrera Infante (Three trapped Tigers). Severo Sarduy remains understated: difficult to get a hold of in US bookstores, circulation of his books outside of Europe and South America has been shrouded by relative obscurity, whenas it is well deserving the highest credit and praise, not to mention the enthusiasm of a more substantial readership. Sarduy's writing style is insistently approaching verbal exstacy, lingering with incandescent beauty in a sensibility of dulcet timbres that it impregnates the most varied and marginalized of all human emotions. Baroque and carnivalesque are titles often accorded him, however these are not only pertaining to his very scandalizing narrative plots, and the Almovodar-like madness which the themes convey, but most importantly due to his poetic cadence, descriptive flair, its surplus of joy derivative of a genius tha manages somehow to always bring the excesses of emotions into the fold of the ordinary and therevy latently ascend the heights of language's delicate wonders of expressions. Sublime and visceral, bantering and humorous, mesmerizing. His works are compelling for the performative joy they by lush degrees isolate an existential futility brazenly stirring ennui into the most explosive diversions available to imaginative acrobatics. Roland Barthes in \"Pleasure of the Text\" offered a panegyric to the Cuban writer by describing how \"language reconstructs itself elsewhere under the teeming flux of every kind of linguistic pleasure. Where is this elsewhere? It is the paradise of words...A celebration where verbal excess chokes and reels into biss...\" If these words seem to be colored by a predilection for the text's way of becoming a narcisistic jubilation, I should note that the flavor of his words are always controlled by a sobering alchemy of style that never loses its passion, nor does it ever become wild with adulterated neologism or monstrous verbal blends. Severo Sarduy lets language dawdle within the twilight of reason and allows life to dazzlingly reach into the darkest arrest of the night in order to spark the heavens with fireworks whose shadowplay becomes the very thrust of his novels."}, {"review_sentiment": 3.0, "review_text": "\"Cobra and Maitreya\" contains two novels in one volume. These novels are the work of Severo Sarduy, the Cuban-born writer who left his homeland for France in 1960. This volume is an English edition, translated by Suzanne Jill Levine, with an introduction by James McCourt. Each novel is an elegantly ornate piece of prose; however, in each novel, the ebullient wordplay seems to overwhelm the basics of plot and characterization.The title character of \"Cobra\" is a performer in the \"Lyrical Theater of Dolls\"; Cobra undergoes a torturous physical transformation in the course of the story. The novel also takes us into the world of a gang whose members have names like Scorpion, Tiger, and Totem. The equally bizarre \"Maitreya\" is a story about Buddhism and sex, among other things.Sarduy's prose is, at times, witty, outrageous, grotesque, luxurious, hallucinatory, and/or sexually explicit. He occasionally throws in sarcastic messages to the reader in parodic footnotes.... The plots (or lack thereof) did not engage me, and I found the characters difficult to connect with. Nevertheless, adventurous readers may find these novels worthwhile; they are certainly remarkable works of 20th century fiction."}]}, "authors": ["Severo Sarduy"], "isbn": "1564780767", "longitude": -82.3658671, "periods": ["1900s"], "title": "Cobra: And, Maitreya", "word_cloud": "prose really know poetry brilliant word style cuban literature rich heritage inevitably dignify vilify political status global domain work part marker individual struggle oppression rather appreciate elegance wit lyricism writer come part colonize political criticism poetry trap remain understated difficult get bookstore circulation shroud relative obscurity whens well deserve highest credit praise mention enthusiasm substantial readership write style insistently approach verbal exstacy linger incandescent beauty sensibility dulcet timbres impregnates vary marginalized human emotion carnivalesque title often accord however pertain scandalize narrative plot madness theme convey importantly due poetic cadence descriptive flair surplus joy derivative genius they manage somehow always bring excess emotion fold ordinary thereby patently ascend height language delicate wonder expression visceral banter humorous mesmerize work compel performative joy lush degree isolate existential futility brazenly stir ennui explosive diversion available imaginative acrobatics offer panegyric writer describe language reconstructs elsewhere teem flux kind linguistic pleasure elsewhere word celebration verbal excess choke reel biz word seem color predilection text way become narcissistic jubilation note flavor word always control sobering alchemy style never lose passion ever become wild adulterated neologism monstrous verbal blend let language dawdle twilight reason allow life dazzlingly reach darkest arrest night order spark heavens firework shadow play become thrust novel contain novel volume novel work writer leave homeland volume edition translate introduction elegantly ornate piece prose however ebullient wordplay seem overwhelm basic plot title character performer undergo torturous physical transformation course story also take world gang member name equally bizarre story sex prose time witty outrageous grotesque luxurious hallucinatory sexually explicit occasionally throw sarcastic message parodist footnote plot lack thereof engage find character difficult connect adventurous reader novel certainly remarkable work century fiction", "genres": ["Fiction & Literature", "LGBT"], "summary": "The late Severo Sarduy was one of the most outrageous and baroque of the Latin American Boom writers of the sixties and seventies, and here bound back to back are his two finest creations. \r\n\r\nCobra (1972) recounts the tale of a transvestite named Cobra, star of the Lyrical Theater of the Dolls, whose obsession is to transform his/her body. She is assisted in her metamorphosis by the Madam and Pup, Cobra’s dwarfish double. They too change shape, through the violent ceremonies of a motorcycle gang, into a sect of Tibetan lamas seeking to revive Tantric Buddhism.\r\n\r\nMaitreya (1978) continues the theme of metamorphosis, this time in the person of Luis Leng, a humble Cuban-Chinese cook, who becomes a reincarnation of Buddha. Through Leng, Sarduy traces the metamorphosis of two hitherto incomparable societies, Tibet at the moment of the Chinese invasion, and Cuba at the moment of revolution. \r\n\r\nTransgressing genres and genders, reveling in literal and figurative transvestism, these two novels are among the most daring achievements of postmodern Latin American fiction.", "asin": "1564780767", "rank": "1356807", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/51MSte-EpCL.jpg", "country": "Cuba", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}