{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 11, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Perfect"}, {"review_sentiment": 2.0, "review_text": "a worthless  piece of s***!!!!!"}, {"review_sentiment": 4.0, "review_text": "This novel is constructed as a polyphonic delivery of hundreds of relatively short scenes. It is more like (endless?) story-telling than a novel. It has great insights into history and a tragicomical aspect that is brilliant and actually memorable.  I gather that prior to reading this book readers need to have some knowledge about the historical and political issues of the time and the place, otherwise the novel will be challenging to get through. Its length is a little bit much to handle. I loved the first few chapters but around page 300 I realized that this will continue pretty much at the same level of delivery for another 200 pages...But it is worth the effort because there is plenty brilliant moments and amazingly funny and insightful characters everywhere. I am looking forward to reading more of this author. He deserves more recognition in the US."}, {"review_sentiment": 4.0, "review_text": "This novel written before the Velvet Revolution that finally toppled the Communists from Czechoslovakia, swings back and forth in time from the days of Nazi occupation during World War II, to the early 1980s. We follow the life of Danny, a writer exiled to a sterile academic life in Canada, from his teenage days to his mid-fifties.The action moves around in time kaleidoscopically through letters from friends spread around the world, vignettes, scenes from the past and present and the musings of the protagonist who lives mostly in his memories. The book is often comic in a Mittel-Europa kind of way -- which means you're not sure whether you're supposed to laugh or cry.The novel's greatest strength is the way it captures the futile life of the exile. The Czech community in Toronto comprises exiles who fled fascism in the 1930s and early 1940s, those who escaped Communism in the 1940s and 1950s and the ones who got out after the Prague Spring of 1968. These different groups, with their petty, inbred concerns, their endless homesickness and longing, are a template for the dilemma of all political exiles.There are also heartbreaking scenes -- the death of Danny's first lover of tuberculosis, the suffering of his Jewish friend who survives Auschwitz and reaches Israel only to lose her son and grandchild in a terrorist attack.My main problem is the book is simply too long. I began to tire of it -- and thought the author was beginning to repeat himself quite a way before the end. He evidently threw his heart and soul into it and much of it is loosely autobiographic no doubt. It remains a valuable document from a lost time."}, {"review_sentiment": 2.0, "review_text": "I read one of the author's other works, \"The Miracle Game\" and enjoyed it. This book, however, is inferior to it in every way. The author is not able to handle length of this project. Characters enter and leave the narrative without much explanation, and it becomes almost impossible to keep track of them. Stylistically, this is not his best work. The writing is not as tight (this could be the fault of the translation, I'm not sure).He has an interesting idea: structure the narrative around famous American writers. Its not entirely original but could be very fun and revealing. He fails with this idea. He hardly works these writers into the narrative, and it becomes hardly more than a prop.If you want to read his work, I'd recommend \"The Miracle Game.\""}, {"review_sentiment": 5.0, "review_text": "I first read \"Engineer of Human Souls\" in 1984.  Every few years I start to miss Danny and Nadia, and then I know it's time to re-read it.  Sometimes I jump into the story again partway through.  Every time the characters seem a little different, as my own life experiences change my understanding of them.One of Skvorecky's universal themes in this novel is how one can live as an exile, a theme Shakespeare also used (The Tempest, The Winter's Tale).  Aren't we all exiles in some sense, from our parents' home, from our childhood playmates, from a hometown somewhere?  Another theme is how a person should resist against the wrongs of a government (Nazis, Communists).  There is plenty in this book to make the reader laugh, cry, and think."}, {"review_sentiment": 5.0, "review_text": "Better than Milan Kundera, this is a great novel. It may seem a little dated, as we are all tired of the alienated college professor rap(they write what they know). However the journey back to the war really are moving, and I do reccomend this book."}, {"review_sentiment": 5.0, "review_text": "As brief as can be:  this novel demonstrates how some live in history and some observe it.  The contrast between the North American portions, where history happens 'out there', and the remainder of the book are striking and  affecting. I shed tears while in this book, beware, it is real in the  poet's way."}, {"review_sentiment": 5.0, "review_text": "Quite an amazing book. I picked it up after seeing it on a book list of top influential books in Prague. I guess it is popular in its original Czech language. The main character being a Canadian from the then  communist, totalitarian regime - was quite an experience for myself, and  gave me some insight on how the other half lived ... the fact was like a  fairy tale, and the fiction was such truth."}, {"review_sentiment": 5.0, "review_text": "If you want to understand the complexities of Eastern-Mittle European reality post-WWII and if you want to understand the life of Comunist era refugees in Western countries, read this book! Better than the  anti-comunist livor of Solgenitsyin, funny, compassionate and true."}]}, "authors": ["Josef Skvorecky"], "isbn": "1564781992", "longitude": -79.387207, "periods": ["1900s"], "title": "Engineer of Human Souls", "word_cloud": "perfect worthless piece construct polyphonic delivery hundred relatively short scene endless great insight history tragicomic aspect brilliant actually memorable gather prior reading reader need historical political issue time place otherwise challenge length little bit much handle love first chapter page realize pretty much level delivery page worth effort plenty brilliant moment amazingly funny insightful character everywhere look forward read author deserve recognition write finally topple swing back forth time day occupation early follow life writer exile sterile academic life teenage day action move time kaleidoscopically letter friend spread world vignettes scene present musing protagonist live mostly memories often comic kind way mean sure suppose laugh greatest strength way capture futile life community comprise exile flee fascism early escape one get different group petty inbred concern endless homesickness long template dilemma political also heartbreaking scene death first lover tuberculosis suffer jewish friend survive reach lose son grandchild terrorist main problem simply long begin tire think author begin repeat quite way end evidently throw heart soul much loosely autobiographic doubt remain valuable document lose time author work enjoy however inferior way author able handle length project enter leave narrative much explanation become almost impossible keep track best work writing tight translation sure interest idea structure narrative around famous american writer entirely original reveal fail idea hardly work writer narrative becomes hardly want work recommend first year start miss know time jump story partway time character seem little different life experience change understand universal theme live exile theme also use exile sense parent home childhood playmate hometown somewhere theme person resist wrong government plenty make laugh cry think great little dated tire alienated college professor rap write know however journey back war really move recommend brief demonstrate live history observe contrast north american portion history happen remainder strike affect shed tear beware real poet way quite amazing pick see list top influential guess popular original language main character communist totalitarian regime quite experience give insight half live fact fairy tale fiction truth want understand complexity european reality want understand life era refugees western country liver funny compassionate true", "genres": ["Fiction & Literature"], "summary": "The Engineer of Human Souls is a labyrinthine comic novel that investigates the journey and plight of novelist Danny Smiricky, a Czech immigrant to Canada. \r\n\r\nAs the novel begins, he is a professor of American literature at a college in Toronto. Out of touch with his young students, and hounded by the Czech secret police, Danny is let loose to roam between past and present, adopting whatever identity that he chooses or has been imposed upon him by History.", "asin": "1564781992", "rank": "319971", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/41V2TX59uRL.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}