{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 44.8178131, "ratings": {"num_ratings": 1, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "If you think Existentialism is something better left to the 20th Century, take a lesson from Basara by reading The Chinese Letter.  He'll quickly teach you the joys of prowling Zeitgeist ridden hallways of the mind where the dust of imagination coats all reality. Our narrator calls himself Fritz and speculates his name could be something else. If it's the self pondering notions of the self then how does the self know the conception is correct?  So it is with his reality, events happen or he imagines they happen. He's forced to write and this in part is the result of his effort. It's a wonderful read, and it has probably one of my all time favorite lines of any novel. Like a Chinese box, the work is both beautiful and puzzling. You'll see."}]}, "authors": ["Svetislav Basara"], "isbn": "156478374X", "longitude": 20.4568974, "periods": ["1900s"], "title": "Chinese Letter", "word_cloud": "think something better left lesson read quickly joy prowl ridden hallway dust imagination coat reality narrator call speculates name something else self ponder notion know conception correct so reality event imago force part result effort wonderful probably time favorite line box work beautiful puzzling see", "genres": ["Fiction & Literature"], "summary": "Ordered by two mysterious men to write a statement of about 100 pages, the narrator of Chinese Letter--who's not sure of his name, but calls himself Fritz--faithfully records the bizarre occurrences of his daily life: his absurd conversations with his mother who is abducted by slave traders, his visits to his friend who works in the hospital's autopsy room, and his sister's tumultuous marriage to the butcher's son, to name a few. \r\n\r\nWidely respected in Serbia, the term \"Basarian\" has been coined to refer to his unique writing style, reminiscent of the best of Samuel Beckett for its directness, existential pondering, and odd sense of humor.", "asin": "156478374X", "rank": "2696983", "city": "Belgrade", "image": "https://images-na.ssl-images-amazon.com/images/I/41814BXFK7L.jpg", "country": "Serbia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}