{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 13, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Perfecto estado"}, {"review_sentiment": 4.0, "review_text": "Great read"}, {"review_sentiment": 1.0, "review_text": "I read it in Spanish and in English, and still don't know what the heck he's talking about."}, {"review_sentiment": 3.0, "review_text": "Spanish is my first language, and I'm a serious Lezama reader. I look at and compare the three most important editions of Paradiso each time to look for inconsistencies, richer versions, and so on. The task undertaken by the translator was in itself an epic one, there is no easy paragraph in the whole book, and the translation, even though spanish grammar and english grammar could not be more apart, is a satisfactory one as it keeps the sense intact. So, if you can't read it in the original spanish, go for this version, by all means. Why three stars review then? Because it simplifies the original in its intricacies, and some times plainly censors its original erotic language (meretriz/streetwalker, for instance), Lezama made it a point that the book should be difficult, in its vocabulary, in its syntax, because the experience of the revealing was what it aims for."}, {"review_sentiment": 5.0, "review_text": "I was expecting the book to be in spanish. But absolutely one of the best books ever written! Thank you. The price was great."}, {"review_sentiment": 5.0, "review_text": "What a wild, untamed creature have we here! It shifts through light and dark, wakefulness and sleep, mundane and hallucinatory in an unabashed orgy of oneiric poetic prose.  An example: \"The August dry spell made sleep feverish.  A terrible nightmare: palm leaves carried off by the high tide; at the edge of the water, we stretch out our hands to reach the leaves but a gust of wind carries them away on the waves.  We wake up, gasping with a shout. The cat scratches the leaves and shreds them in the dust of the doorways.\"; and this selection is very mild, actually, compared with a great deal of the prose, truly phantasmagoric in parts and undulating with rich sexual imagery.The reader being thus apprised, the plot, such as it is, is a fairly straightforward Bildungsroman of Jose Cemi.  This novel has been compared to many other works, and its author to many other writers.  But the writer to whom Lima bears the most resemblance is unquestionably Joyce; the style is comparable to that of Ulysses infused with animism, mysticism and mythomania.  But the work it won't fail to remind the well-read reader of the most is Joyce's A Portrait of The Artist as a Young Man.  The friendship between Cemi, Fronesis and Focion and their effusive, aporetic debates at law school - which comprise the bulk of the novel - remind one of nothing so much as Joyce's Stephen Daedalus and his exchanges on aesthetics with his friends at Trinity College - except that the disquieting erudition of Cemi and his friends make Stephen and chums appear as babbling lower form lads by comparison.  And, like Joyce's hero, Cemi recites his own creed of the artist-hero at the perihelion of his college days:\"Don't reject danger and always try what is most difficult.  There's a danger that confronts us in the form of substitution, there's also a danger that sick people seek out, a sterile danger, the danger without epiphany.  But when a man throughout his days has tested what is most difficult, he knows that he has lived in danger, and even though its existence has been silent, even though the succession of its waves has been peaceful, he knows that a day has been assigned to him in which he will be transfigured, and he will not see the fish inside the current but the fish in the starry basket of eternity.\"I have only touched the tip of the iceberg here.  I should have to delve into everything from Plotinus to Proust to do so - Lima, like Joyce, is not for everyone.  I should particularly warn those afraid of dark, poetic sexual imagery - \"the entrance of the dark grotto\" and such.  Thus, bowing to Lima, I shall leave what lies before the reader for him to relate in the words of Focion:\"Probably, my dear Cemi, you think my tale is taking on the aspect of a detective thriller, but this little story has everything, you have to follow it through numberless labyrinths until it finally reaches its best and most paradisiacal solution.\"Yes, you do."}, {"review_sentiment": 5.0, "review_text": "Lezama is not for everyone... to feel Paradiso there is a need to understand all his previous work: essays, poetry, short stories, critical and cultural studies.  For those who have seriously study World Literature, there is no doubt that Lezama is one of the most important, sensible and imaginative writers of the XX century.  You might not like him (and that is ok!) but to doubt his artistic greatness is nonsense.  Once you enter the poetic system of Lezama the rewards are endless!"}, {"review_sentiment": 2.0, "review_text": "Some novelists are known for a pared down, no-nonsense approach to narrative, firmly delineated, plainspoken characters, crackling, lively dialogue, and swiftly moving, engrossing plots.  Lezama-Lima is not one of those authors.  It's hard to recommend a book that I have so many reservations about.  Yes, the writing is occasionally beautiful, and as an historical document of a certain type of artistic and literary milieu in Pre-Castro Cuba, it's worth something.  But I'm afraid that I'm going to have disagree with all of the reviewers here and say that LL's endless aestheticism must be something of an acquired taste.  The problem is that he writes prose too much like a poet--all florid circumlocutions with no feel for the rhythms of everyday life and speech.  No doubt he would have felt the everyday to be beneath his austere heights.  Nobody talks the way his characters do--it's all lengthy, abstruse theorizing on frequently esoteric subjects.  His essentially elitist approach to writing fiction would test the patience of anyone who looks to literature for a more immediate kind of connection.  And, sorry, Mr. White, LL is not the Latin American Proust--Proust is far more readable and speaks to more basic human experiences.Sometimes some of the worst snobs are those (i.e., homosexuals) who have themselves suffered the most heinous abuse because of their dubious social stature--rather than reject the values of the mainstream, a writer like LL ends up embodying them and perpetuating them to an infuriating degree through his snobbish affectations.  Or else one could view his aesthetic vision as essentially escapist, understandable given the political situation in Cuba at the time.  Still, a more accurate view of what was actually happening might have been of more human interest--it would have been valuable to see how these characters strained to maintain their sensibility in view of what was actually occurring around them.  But, as it is, the book seems to exist in a vacuum with no real connection to the political situation in Cuba--its Eurocentric preoccupations offend."}, {"review_sentiment": 5.0, "review_text": "This and a handful of other literary creations rank among the best of the 20th century.  It is a dense, jungle of images, language, against an elegant background.  I can not think of another work to compare Paradiso to, as it stands alone.  Once upon a time, I attempted to read it in Spanish, but was overcome by a tidal wave of intricate vocabulary.It is unfortunate Lezama Lima has been largely forgotton in the US except for a few ardent readers.  It is impossible to find any of his poems in translation.  Maybe they are not so readily translatable.  In any event, the translation of Paradiso is in itself an amazing achievement, as Paradiso explodes in volcanic beauty."}, {"review_sentiment": 5.0, "review_text": "Jose Lezama Lima achieved one of the most complex and mesmerizing novels of the XXth century in Latin America. Paradiso is a Bildungsroman (a novel about an individual's growing process) as it is a Kunstroman (novel about the artist). The reader will find many references to Lezama's life, but his work goes beyond a self portrait. Jose Cemi is a little cuban boy who grows up having breathing problems, and grasping the lifes of those who were before him.His individuality mixes with the other's and the result is a complex narrator, an overwhelming amount of literary, cultural and mythological references, a refined use of the metaphor and a hightened sense of reality. Cemi's world is more than nature... it is supernatural. Cemi attends to the world of death, as he remembers the lifes of his ancestors, as they are told to him by his mother Rialta, and grandmother Augusta. The first half of Paradiso is all about the family... then uncle Alberto's death marks a point of change in the novel. From that moment on, it focuses in Cemi's friendship with two other students: Fronesis and Focion. The three of them constitute a triangle in which homosexuality, love, erotism, unity, mythology and androginy are the main topics. As well as incest.When this simbolic triangle breaks, Cemi is ready for the epiphany: he meets Oppiano Licario: a friend of his father who promised him, as he was dying, to look after his son (Cemi). Licario also witnessed Alberto's sexual iniciation. He is a poet, and he is the one who can bring Jose Cemi out of the time of desperation into a rythm of reflection and artistic contemplation.There is so much more to this novel... You can only know what it is all about by reading it. I can here only give you a few pieces. As Lezama believed: only what is hard is really rewarding, and this is particularly true for young people."}]}, "authors": ["Jose Lezama Lima", "Josoe Lezama Lima"], "isbn": "156478228X", "longitude": -82.3658671, "periods": ["2000s"], "title": "Paradiso", "word_cloud": "est ado great spanish english still know talk spanish first language serious look compare important edition time look inconsistency richer version task undertaken translator epic easy paragraph whole translation even spanish grammar english grammar satisfactory keep sense intact spanish version mean star review simplifies original intricacy time plainly censor original erotic language instance make point difficult vocabulary syntax experience revealing aim expect spanish absolutely best ever write price great wild untamed creature shift light dark wakefulness sleep mundane hallucinatory unabashed orgy oneiric poetic prose example dry spell make sleep terrible nightmare palm leave carry high tide edge water stretch hand reach leave gust wind carry away wave wake gasp cat scratch leave shred dust doorway selection mild actually compare great deal truly phantasmagoria part undulate rich sexual thus apprise plot fairly straightforward compare many work author many writer writer bear resemblance unquestionably style comparable ulysses infuse animism mysticism mythomania work remind friendship effusive aporetic debate law school comprise bulk remind nothing much exchange aesthetics friend disquiet erudition friend make chum appear babble lower form lads comparison hero recite creed perihelion college day do reject danger always difficult danger confronts form substitution also danger sick people seek sterile danger danger epiphany man day test difficult know live danger even existence silent even succession wave peaceful know day assign transfigured see fish current fish starry basket eternity touch tip iceberg delve everything everyone particularly warn afraid dark poetic sexual imagery entrance dark grotto bow lie relate word probably dear think tale take aspect detective thriller little story everything follow numberless labyrinth finally reach best paradisaical solution yes everyone feel need understand previous work essay poetry short story critical cultural study seriously study doubt important sensible imaginative writer xx century ok doubt artistic greatness nonsense once enter poetic system reward endless novelist know pared approach narrative firmly delineate plainspoken character crackle lively dialogue swiftly move engross plot author hard recommend many reservation yes write occasionally beautiful historical document certain type artistic literary milieu something afraid go disagree reviewer say endless aestheticism something acquire problem write prose much poet florid circumlocution feel rhythm everyday life speech doubt everyday beneath austere height nobody talk way character lengthy theorize frequently esoteric subject essentially elitist approach write fiction patience anyone look literature immediate kind connection sorry american far readable speaks basic human worst snob homosexual suffer heinous abuse dubious social stature rather reject value mainstream writer end embody perpetuate infuriate degree snobbish affectation else aesthetic vision essentially escapist understandable give political situation time still accurate view actually happen human interest see character strain maintain sensibility view actually occur seem exist vacuum real connection political situation preoccupation offend handful literary creation rank best century dense jungle image language elegant background think work compare stand alone time attempt spanish overcome tidal wave intricate unfortunate largely forget ardent reader impossible find poem translation readily translatable event translation amazing achievement explode volcanic beauty achieve complex mesmerizing novel century individual grow process artist find many reference life work go portrait little cuban boy grows breathe problem grasp file individuality mix result complex narrator overwhelm amount literary cultural mythological reference refine use metaphor heighten sense reality world nature supernatural attend world death remembers file ancestor tell mother grandmother first half family uncle death mark point change moment focus friendship student constitute triangle homosexuality love egotism unity mythology androgyny main topic well symbolic triangle break ready epiphany meet friend father promise die look son also witness sexual initiation poet bring time desperation rhythm reflection artistic much know read give piece believe hard really reward particularly true young people", "genres": ["Fiction & Literature"], "summary": "In the wake of his father's premature death, Jose Cemi comes of age in a turn of the century Cuba described in the Washington Post as \"an island paradise where magic and philosophy twist the lives of the old Cuban bourgeoisie into extravagant wonderful shapes\".\r\n\r\n\"[An] extraordinary novel... written by Cuba's leading poet.... There is scarcely a line in the entire narrative that could be mistaken for anyone else's writing.... Lezama's language is reckless, voluptuous, sly and unrelentingly sexual.... A masterpiece of the modern Spanish Baroque.... Lezama has the power not only to create absorbing and memorable images; he has also placed these images in into a vast network of philosophical and mythical significance.... For me, the proof of the greatness of Paradiso is that for the last two weeks I've been walking around New York seeing things through Lezama's eyes.\"  Edmund White, New York Times", "asin": "156478228X", "rank": "555418", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/619%2BXJnJIdL.jpg", "country": "Cuba", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}