{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 13, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 5.0, "review_text": "place a grenade, dictionary and list of creative people in a box. Pull the pin, (standing well back!). Gather the pieces - put the lot in a kaleidascope - before you, an insight to Infante's 'Three Trapped Tigers'. NOT a novel for those who demand correct use of language, NOR for those who cant appreciate a riotous game with words and ideas - A LONG LAUGH. At some point i wondered if it was possible to continue the whole book in the same vane - he doesn't. By interspersing a vicious murder with wit, he buries the act deep within the reader's mind.I read from some reviewers that they gave up on it. Laughing at the ingenuity till the end, i was not one of them."}, {"review_sentiment": 2.0, "review_text": "Why is it that the title of this book in English is Three TRAPPED Tigers? It should be Three SAD Tigers! Please, there is a long distance in any language between trapped and sad.If that is the title, I would hate to read the rest of the translation."}, {"review_sentiment": 1.0, "review_text": "I am reading Tres Tristes Tigres and Three Trapped Tigers simultaneously. The Spanish version is a literary gem. The English translation makes no sense and is easily the worst translation of anything I have ever read. Leaving aside the language games which of course are very difficult to translate, the translators add unnecessary embellishments to the text and leave out other really interesting stuff. Sometimes the translation is just simply inaccurate. The title page of the book says that Gardner & Levine translated it with the collaboration of the author; it's really hard to believe he had much input. The two texts are not very much alike."}, {"review_sentiment": 5.0, "review_text": "For my money, as underappreciated a novel as I have ever read. Imagine Joyce in Havana in the 1950's, hanging out with the two-bit glamor girls and the big-band underbelly of Cuban society, living an \"American Graffiti\"esque life with his two best friends, all of them chasing women and drink and privacy and kicks, and kicks, and kicks, and kicks.When people say a book is laugh-out-loud funny, they generally don't mean it, but lovers of wordplay and who have even a vague understanding of mid-20th Century North American popular culture will freak over this book.A punny, dense, eclectic, raunchy, filthy, swinging rhumba of a novel. I can't recommend it highly enough."}, {"review_sentiment": 1.0, "review_text": "It reminded me of what Lord Tennyson said about Ben Jonson: \"Reading him is like wading through glue.\" I have reached an age when I am not willing to make heroic efforts to get bored. Sorry."}, {"review_sentiment": 5.0, "review_text": "I recently read this book again this time in English. I forgot how phenomenal Cabrera Infante writes and he is my all time favorite exile novelist. The word play is great and translates well from the Spanish."}, {"review_sentiment": 5.0, "review_text": "To say it shortly, this is one of the best 10 books I have ever read (and I have read plenty of books). Please do not pass away without having read TTT."}, {"review_sentiment": 5.0, "review_text": "I discovered Cabrera Infante's Tres Tristes Tigres (in Spanish) about 15 years ago and was so blown away that I searched for a copy in English so I could share it with my non Spanish speaking friends.  I read the English version as well so I would know what I was recommending since I did not know how well it would translate, and found another book, equally funny--I believe he and a graduate assistant did the translation.  Infante has an incredible way with language.  It is certainly true that he should be read aloud.  He painted an intriguing picture of a Havana which was probably almost as much a dream to him by that time as it was to me. I am buying this book today to give to a friend who introduced me to Felipe Alfau's Locos.  I hope he will enjoy it as much as I have.  Tres Tristes Tigres remains one of my favorite books."}, {"review_sentiment": 5.0, "review_text": "Infante has written a masterpiece. This book covers ( and plays on ) the styles of so many popular writers that it boggles the mind. On top of that the TRANSLATED version plays with the english language in a way that would make James Joyce proud,and maybe a wee bit jealous (and in all possibility giving the translator a nervous break down). Easily one of the best books I have ever read."}]}, "authors": ["Guillermo Cabrera Infante"], "isbn": "1564783790", "longitude": -82.3658671, "periods": ["1900s"], "title": "Three Trapped Tigers", "word_cloud": "excellent place grenade dictionary list creative people box pin stand well back piece put lot kaleidoscope insight demand correct use language cant appreciate riotous game word ideas point wonder possible continue whole vane intersperse vicious murder wit buries act deep reviewer give ingenuity till title english long distance language title rest translation read re trieste tigris simultaneously spanish version literary gem english translation make sense easily worst translation anything ever leave aside language game course difficult translate translator add unnecessary embellishment text leave really interesting stuff translation simply title page say translate collaboration author really hard believe much text much money underappreciated ever hang glamour girl underbelly society live esque life best friend chase woman drink privacy kick kick kick people say funny generally mean lover wordplay even vague understanding popular culture freak pinny dense eclectic raunchy filthy swing rumba highly enough remind say wad glue reach age willing make heroic effort get bore recently time english forget phenomenal write time favorite exile novelist word play great translates well spanish shortly best ever plenty away discover year ago away search copy share non spanish speaking friend english version well recommend know well find equally funny believe graduate assistant translation incredible way language certainly true aloud paint intriguing picture probably almost much dream time buy today give friend introduce hope enjoy much res trieste remain favorite write masterpiece cover play style many popular writer boggles mind top version play english language way proud maybe wee bit jealous possibility give translator nervous break best ever", "genres": ["Fiction & Literature", "Humour"], "summary": "Cabrera Infante's masterpiece, Three Trapped Tigers is one of the most playful books to reach the U.S. from Cuba. \r\n\r\nFilled with puns, wordplay, lists upon lists, and Sternean typography--such as the section entitled \"Some Revelations,\" which consists of several blank pages--this novel has been praised as a more modern, sexier, funnier, Cuban Ulysses. \r\n\r\nCentering on the recollections of a man separated from both his country and his youth, Cabrera Infante creates an enchanting vision of life and the many colorful characters found in steamy Havana's pre-Castro cabaret society.\r\n\r\n\"With Three Trapped Tigers Cabrera Infante enters the front rank of Latin American novelists. The book belongs with Cortazar's Hopscotch, Garcia Marquez's One Hundred Years of Solitude, and Donoso's The Obscure Bird of Night.\" New York Review of Books", "asin": "1564783790", "rank": "238946", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/5147cs8dRyL.jpg", "country": "Cuba", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}