{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 9, "rating": 3.4, "reviews": [{"review_sentiment": 3.0, "review_text": "This book is certainly not like anything you have read before. It is funny, uncensored, and political all at the same time. Before reading, it is cleverly drawn out that the table of contents is divided into 9 chapters, each with at least 8 sub sections. The novel begins with an introduction of the world through the point of view of an unborn child, which is why I believe Fuentes chose to outline his book this way. I found it difficult to stick to the timeline and stay on track with everything Fuentes had to say. Also, I found myself reading with google.com at hand, because I had no idea what any of these political references were- example: PRI. Even though it maybe hard to follow, Fuentes brilliantly keeps the reader engaged by using grotesque language and scenery. This is in fact what keeps people reading and turning the page, to know what's going to happen next. I don't think I would recommend this book to another person, but if you had to read it, it's a good read and there are worse books out there. All in all, it is a very creative and interesting book. You just need to read it to understand what I mean."}, {"review_sentiment": 3.0, "review_text": "Very often in novels, authors might add some historical background so that the novel can depict real events. In Christopher Unborn by Carlos Fuentes, the reader indulges in what may be an overload of historical information. The book is extremely long, and part of the reason is because of all the references to Mexican history. If the reader is not careful, they are at risk of drowning in all the information before they figure out the plot of the story. The best advice to take while reading this novel is to avoid any other types of reading. You will need all your focus and concentration to tackle Fuentes' style of writing. Also be prepared to Google many references, in order for you to grasp the history the novel mentions in the book. Fuentes is extremely artistic and creative in the way he narrates his story. The novel is narrated by an unborn Christopher in his mother's womb. The reader is taken into an eventful journey where Christopher tries to describe his parent's relationship, as well as what is going on in Mexico around that time period.I appreciate Fuentes' very unique and clever style of writing, but reading this novel was a little overwhelming. There is so much history crammed into each chapter that it took away from the narrative of the story. If you have time to read this piece of literature, go ahead because I think it's a great challenge. If you just want something quick to read, this might not be the book for you."}, {"review_sentiment": 3.0, "review_text": "I title Christopher Unborn, an active read because unlike other books where you may just get away with reading the bare minimum, Chirstopher Unborn requires your full attention. Carlos Fuentes' prose forces you to not only pay attention at the contextual level to what is going on within the story but also to pay close attention to the physical aspect of what is going on in  the page since the words themselves are shifting off the page in a unconventional manner. The story itself, interestingly enough adopts a unborn narrator speaking from the womb of his mother, explicating on the political and social upheavals of Mexico. Fuentes' witticisms are fun and entertaining but once again are only noticeable with a determined reader and watchful eye. If you are not willing to take the challenge, it may seem confusing and convoluted, but to those that are, it will be rather enjoyable."}, {"review_sentiment": 4.0, "review_text": "Fuentes creatively uses a baby in his mother's womb to be the narrator of this novel. This child's life has already started in his mother's stomach, putting forth the idea that you are alive and knowledgeable before you are born. Baby Christopher is experiencing the world but he is not an actual member of it yet, which puts this child far enough away from society to make his witty comments and observations about the world just that much more entertaining. Fuentes' satire completely captures what you would picture the world and characters to be like. The whole novel, beginning with the idea of holding a contest to find a specific child named Christopher who is born on the anniversary of Columbus' arrival, offers a thought provoking view of politics from a child who will eventually be a primary leader in Mexico. That being said, be prepared for a LONG read with a novel that seems a little all over the place at times. If you are not familiar with the context of the novel, the references and name changes become parts of the novel that you either skim over or completely miss the joke/point. Rushing through the book (as I first did) will not pay off. Take your time and think about what is being said and in what way/form and this will be a better read."}, {"review_sentiment": 4.0, "review_text": "Carlos Fuentes is a brilliant writer. In this novel \"Christopher Unborn\" he creatively uses a embyro to point out the problem in Latin America(Mexico). Fuentes says that literature is ambigious because it searches for truth. And that's exactly what he does, but he also makes the readers ponder and question the world they are in. He mentions that writing is dangerous but he writes to search for the truth.  Fuentes leaves the readers speechless and pondering about the themes he writes about.Although his writing is great and he uses different way to be creative His novel is not for amusment. If the readers do not have background history about Mexico and the topics Fuentes covers, it will make readers very frustrated. it will take more than 3 reads to understand what he's talking about. I had to read it more college class and i didn't understand until the proffessor discuss some of the issues in class.  If you are not into politics and history,then too bad. Read it anyway because he does rises some great questions."}, {"review_sentiment": 4.0, "review_text": "Carlos Fuentes is a wonderful writer who is able to explore several different topics and themes within one book. He addresses many things in a complex and profound manner which leaves the reader speechless and pondering (i.e., significance of names, conception, identity, memories etc). He has a great talent for writing beautiful language that flows and sounds playful and fun. Not to mention, Fuentes also explores some obscure and unusual aspects of different cultures such as vagina dentata. However, despite all these amazing and great attributes of his multifarious perspective and mind, the lack of knowledge in Mexican history or in any of the topics Fuentes covers will hinder your reading. I found it most difficult to fully enjoy his work due to my insufficient understanding of the events. If you are not well versed in politics and history, then it will be a tough read but if you are, then enjoy!"}, {"review_sentiment": 2.0, "review_text": "Reading this novel is akin to wandering aimlessly in the woods with a blindfold on. You want to enjoy the experience for its novelty but every time you settle in and start to get in a rhythm some sharp, low-hanging branch pokes you in the eye. Or the plot falls off a cliff. Whats more, the person that is supposed to be guiding you around these obstacles stands off to the side laughing as you try to find your footing, and occasionally making witty entertaining comments. And it is, (the book) entertaining at times. It certainly has some interesting parts, and Fuentes can no doubt turn a phrase even after being translated into English, but on the whole I think I have the same complaint with this novel that I imagine most have. It's just too scatterbrained. Trying to follow the narrative is more trying than being a counselor to young children with ADHD. While this type of style often can work, as is the case with some Garcia Marquez, and all Mark Helprin, it just doesn't seem to work here. It's a decent enough read, but I don't think it will be earning an honored place on my bookshelf any time soon."}, {"review_sentiment": 5.0, "review_text": "Currently on a Fuentes kick, I picked up Christopher Unborn. Although written in the 1980's about 1992, Fuentes is completely on target in his subject matter, and his Makesicko of 1992 looks a lot like today.You will read this and recognize american liberals and conservatives, southern mexican secessionist sympathizers, leftist ideaologues, mall shoppers and reality tv \"celebrities\" all captured and satirized perfectly. I read this book with a sardonic smile not thinking of the past, but of today.The man's a genius, and any book of his is worth a good read, but underneath the narrative is a lot of fun. Of the 3 novels I have read, I get the greatest sense that Fuentes truly loved his characters, flawed and cracked as they are.Some of it is challenging, but Fuentes always is, and usually working through the challenges is highly rewarding."}, {"review_sentiment": 5.0, "review_text": "This book was written on the eve of the 500th year anniversary marking the fateful encounter between the Spanish Euoropeans and the various indigenous groups of the Americas. Not so coincidently, the prolific, briliant writer Carlos Fuentes sets the circumstances to this novel to coincide with the event. The premise for the book is a contest being held in Mexico with a great prize offered for the first born child on the 500th anniversary of Columbus's arrival. The child is Christopher, the narrator of the novel who makes shrewd observations about the world he will be born into,  all from the comfort of inside his mother. This allows Fuentes, the author, to rip into all of the ills of modern Mexico with his usually witty and sharp use of lanuage. A master at manipulation of common laguage, he changes the words to fit his vision. Several examples of how he changes words are Mexico City to Makesicko City, Kafkapulco, Quasimodo City, Samsaville, Huitzilopochtliburg or President Dangerous Dickson before the Watergate Waterloo, blockabulary for vocabulary,Califurnace, PornoCorno, Coca-Culo and Acapukelco(or did I make this last one up?). However this is nothing compared to the daggers Christopher throws at everything from the devastation of the earthquake and the aftermath, the PRI, Mexican history and all it's tragic consequences including the massacre at Tlateloco, the narco-polices ties to the narco traffickers themselves and in short, all is fair game for Fuentes via his narrator Christopher. His observations on popular culture include everything from Lennon to Lenin to Boy George. It is a scathing, passionate view of the world Chistopher will enter. Christopher contends his nine months inside his mother are when his life began and this comfort and fear of what is out there make the narration a brutal, wry, cynical commentary. The satirical view is enhanced by a cast of characters who all are part of the make up of a world Christopher will inherit. The action of the novel is a backdrop for a political campaign and all it's cast of characters both  for and against.Some of the names of these politicos and associates are Deng Chopin, Hipi Toltec, Fagoaga, Matamoros Moreno, Robles Chacon and D.C Buckley just to name a few. Coming in at over five hundered pages it is no easy read but totally enjoyable. The literature flows beautifully, creating images as only Carlos Fuentes can. As one of the  preeminent writers of our times, Fuentes unleashes a novel for the times that will be reflected upon years from now as a masterpiece marking the collision of worlds that occurred  five hundred years ago. This is an excellent book for educators at the AP level in high school or college to use for a literature class or to supplement a history course. Highly recommended for anyone interested in Mexico and it's contemporary literature."}]}, "authors": ["Carlos Fuentes"], "isbn": "1564783391", "longitude": -99.1333416, "periods": ["1900s"], "title": "Christopher Unborn", "word_cloud": "certainly anything funny uncensored political time read cleverly draw table content divide chapter least sub section begin introduction world point view child believe fuentes choose outline way find difficult stick timeline track everything fuentes say also find read hand idea political reference example even maybe hard follow fuentes brilliantly keep engage use grotesque language scenery fact keep people read turn page know go happen next think person good worse creative interesting need understand mean very often novel author historical background depict real event indulges historical information extremely long part reason reference history careful risk drown information figure plot story best advice reading avoid type read need concentration tackle style write also prepared many reference order grasp history mention fuentes extremely artistic creative way narrate story narrated mother womb take eventful journey try describe parent relationship well go time appreciate unique clever style write read little overwhelm much history cram chapter take away narrative story time piece literature go ahead think great challenge want something quick title active read bare minimum require full attention prose force pay attention contextual level go story also pay close attention physical aspect go page word shift page unconventional manner story interestingly enough adopts narrator speak womb mother explicate political social upheaval witticisms fun entertain noticeable determine watchful eye willing take challenge confuse convoluted rather enjoyable fuentes creatively use baby mother womb narrator child life already start mother stomach put forth idea alive knowledgeable bear experience world actual member yet put child far enough away society make witty comment observation world much entertaining satire completely capture world character whole beginning idea hold contest find specific child name born anniversary arrival offer think provoke view politics child eventually primary leader say prepared seem little place time familiar context reference name change become part skim completely miss rush first time think say better brilliant writer creatively use embryo point problem say literature ambiguous search truth exactly also make reader question world mention write dangerous writes search truth leave reader speechless ponder theme write write great us different way creative amusement reader background history topic fuentes cover make reader frustrate read talk college class understand professor discus issue class politics history bad anyway rise great question wonderful writer able explore several different topic theme address many thing complex profound manner leave speechless ponder significance name conception identity memory etc great talent write beautiful language flow sound playful fun not mention fuentes also explore obscure unusual aspect different culture vagina dental however amazing great attribute multifarious perspective mind lack knowledge history topic fuentes cover hinder read find difficult fully enjoy work due insufficient understanding event well versed politics history tough enjoy read akin wander aimlessly wood blindfold want enjoy experience novelty time start rhythm sharp branch poke eye plot fall cliff person suppose guide obstacle stand side laugh try footing occasionally make witty entertaining comment entertain time certainly interest part doubt turn phrase even translate english whole think complaint imagine scatterbrained try follow narrative try counselor young child type style often work case seem work decent enough think earn honor place bookshelf time soon currently kick pick write completely target subject matter look lot recognize american liberal conservative southern mexican secessionist sympathizer leftist ideologue mall shopper reality tv celebrity capture satirize perfectly sardonic smile thinking man genius worth good underneath narrative lot fun novel get greatest sense fuentes truly loved character flaw cracked challenging fuentes always usually work challenge highly reward write eve year anniversary marking fateful encounter spanish various indigenous group not coincidentally prolific brilliant writer set circumstance coincide event premise contest hold great prize offer first born child anniversary arrival child narrator make shrewd observation world bear comfort mother allow author rip ill modern usually witty sharp use language master manipulation common language change word fit vision example change word blockabulary vocabulary make last however nothing compare dagger throw everything devastation earthquake aftermath history tragic consequence include massacre tie narc trafficker short fair game narrator observation popular culture include everything scathing passionate view world enter contend month mother life begin comfort fear make narration brutal wry cynical commentary satirical view enhance cast character part make world inherit action political campaign cast character name politicos associate name hinder page easy totally enjoyable literature flow beautifully create image preeminent writer time unleashes time reflect year masterpiece mark collision world occur year ago excellent educator level high school college use literature class supplement history course recommend anyone interested contemporary literature", "genres": ["Fiction & Literature"], "summary": "Conceived exactly nine months before the five-hundredth anniversary of Columbus's discovery of the New World, the narrator of Christopher Unborn spends the novel waiting to be born. But what kind of world will he be delivered into? \r\n\r\n\"Makesicko City,\" as the punning narrator calls it, is not doing well in this alternate, worst-case-scenario 1992. Politicians are selling pieces of their country to the United States. A black, acid rain falls relentlessly, forewarning of the even worse ecological catastrophes to come. Gangs of children, confined to the slums, terrorize their wealthy neighbors. \r\n\r\nA great novel of ideas and a work of aesthetic boldness, Christopher Unborn is a unique, and quite funny, work from one of the twentieth century's most respected authors.", "asin": "1564783391", "rank": "2280938", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/41mEjN2Sf-L.jpg", "country": "Mexico", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}