{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 87, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Very interesting reading"}, {"review_sentiment": 4.0, "review_text": "I read it. It is funny. But maybe it is funny because I have degrees in English Lit with a focus on Irish Literature. The average intelligent reader may not love it. If Joyce's Ulysses makes you smile, give it a try."}, {"review_sentiment": 2.0, "review_text": "too literary for me! almost unreadable but I'm hoping the penny will drop before the end."}, {"review_sentiment": 2.0, "review_text": "Dull, difficult to follow and uninteresting."}, {"review_sentiment": 5.0, "review_text": "A love of language so intimate pushes O'Brien to guard his meaning in narrative puzzles. A Great deal of fun."}, {"review_sentiment": 5.0, "review_text": "Mind-bending, totally original. Some of the best lyrical prose I have ever read. In my opinion Flann O'Brien ranks up there with Joyce and Nabokov as the world's best writers. The poetic flow of this book is beyond amazing. And that's just the writing: the plot is a work of staggering originality. A story within a story and on and on until the reader doesn't care because he/she is so swept up in the fun and joy of what is going on at that exact moment on that very page. I could go on but I'm not the best reviewer on earth and can't write on O'Brien's level so I'll bow out with what I've written and stand by it until the end."}, {"review_sentiment": 5.0, "review_text": "Approach ASTB as you would approach a glass of Yellow Spot Irish whiskey: slowly, analytically. Resist the temptation to gulp it. This is complex stuff and no two sips (or pages) are the same. You will never forget your first experience of it."}, {"review_sentiment": 5.0, "review_text": "Love it!"}, {"review_sentiment": 3.0, "review_text": "\"That’ll do you, said the sergeant, keep that stuff for them that wants it. I don’t know what you’re saying, man.\"Nor do I. At Swim-Two-Birds is a strange piece - it is witty, ironic, even sadly poetic at times, and O'Brian has an undeniably impressive command of the English language, yet ultimately, the nonsensicality of it all is just too much. I pushed through the second half of the book out of pure stubbornness to give it up, rather than out of desire to find out what happens to Trellis and his characters."}, {"review_sentiment": 3.0, "review_text": "On reflection a satire of the time. When reading I found it confusing and bizarre"}]}, "authors": ["Flann O'Brien"], "isbn": "156478181X", "longitude": -6.2602732, "periods": ["1900s"], "title": "At Swim-Two-Birds", "word_cloud": "very interesting reading funny maybe funny degrees english focus average intelligent make smile give try literary almost unreadable hop penny drop end difficult follow uninteresting love language intimate push guard mean narrative puzzle deal fun totally original best lyrical prose ever opinion rank world best writer poetic flow amazing write plot work stagger story story care sweep fun joy go exact moment page best reviewer earth level bow write stand end glass whiskey slowly analytically resist temptation gulp complex stuff sip page never first experience say sergeant keep stuff want know say man strange piece witty ironic even sadly poetic time undeniably impressive command language yet ultimately nonsensicality much push second half pure stubbornness give rather desire happens character reflection satire time reading find confuse bizarre", "genres": ["Fiction & Literature", "Historical Fiction", "Satire"], "summary": "Flann O'Brien's first novel is a brilliant impressionistic jumble of ideas, mythology and nonsense. Operating on many levels it incorporates plots within plots, giving full rein to O'Brien's dancing intellect and Celtic wit. \r\n\r\nThe undergraduate narrator lives with his uncle in Dublin, drinks too much with his friends and invents stories peopled with hilarious and unlikely characters, one of whom, in a typical O'Brien conundrum, creates a means by which women can give birth to full-grown people. \r\n\r\nFlann O'Brien's blend of farce, satire and fantasy result in a remarkable, astonishingly innovative book.", "asin": "156478181X", "rank": "157205", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/51oo8lRzCDL.jpg", "country": "Ireland", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}