{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 18.4801972, "ratings": {"num_ratings": 538, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Julia Alvarez’s novel In the Time of the Butterflies is a historical journey through the reign of Dominican dictator Rafael Trujillo from 1930 to 1961. It follows the lives of the four Mirabal sisters as they come of age in Trujillo’s Dominican Republic up until their lives begin to intertwine with the dictator’s regime against their will. Their journey begins as young women at school, ignorant of Trujillo’s atrocities. As his actions become more obvious and abhorrent, in time with the sisters reaching adulthood, they feel compelled to join the underground rebellion that seeks to overthrow him. The repercussions are swift and brutal as they face retaliation from Trujillo and his military forces. The novel begins with the only surviving sister in the “present” day, Dede, as she recounts to the fictional author the details of her life and the historical sacrifice of her sisters: Minerva, Patria, and Maria Teresa. We witness the Dominican Republic as a microcosm, as the Mirabels and islanders live and suffer under the Trujillo regime. Their ideas of faith, family and communal identity are put under enormous pressure in a society simply trying to survive. Who can you trust when anyone, especially your neighbor, can be a SIM spy?Alvarez manages to weave fiction and history together into a tapestry of emotional nuance and authentic martyrdom. The novel is woven together by the separate points of view of the four sisters. Each voice feels remarkably unique and full of personality. Each sister’s writing reads very true-to-self and at no point did I feel that the voices ran together or overlapped. Alvarez nails down each sister’s unique personality, mannerisms, and thought processes so well that the novel genuinely feels as if it’s written by four different people. It gives the story and the history a sense of depth that I have not encountered before.If you find yourself looking for an engaging, emotionally profound historical novel from a time period you likely haven’t encountered much of before, then In the Time of the Butterflies is just for you."}, {"review_sentiment": 4.0, "review_text": "It’s an interesting book. A fictional account of the true story of the Mirabal sisters in the Dominican Republic."}, {"review_sentiment": 3.0, "review_text": "I rate this book PG 14 for sensual scenes, sexual innuendos, randy humor, and violence.  Raw and realistic, this book left me feeling unsettled and melancholy.  This fictionalized account is insightful and introspective.  Bright lives lost too soon.  Their lights flickered out leaving only darkness.  Told in a series of flashbacks, Alvarez gives the reader a thoughtful perspective and deeper understanding of a painful event in history.  “Her martyrdom is to be alive without them.”"}, {"review_sentiment": 5.0, "review_text": "great product , excellent shipping  no problems  seller is AAAAAA+++++++  would recommend to others"}, {"review_sentiment": 5.0, "review_text": "This is one of the best books.  I also saw the movie.  Love it!"}, {"review_sentiment": 1.0, "review_text": "The formatting of the book made it impossible to read, couldn't adjust the font to make it bigger.  It's a shame because I wanted to read the book."}, {"review_sentiment": 5.0, "review_text": "Everything arrived as expected."}, {"review_sentiment": 5.0, "review_text": "I really liked this book.  I listened to it and enjoyed that each of the sister characters was read by a different actor.  The story is very interesting and is still relevant today.  The book is well-written and though fiction, provides good insight into real events.  I highly recommend it."}, {"review_sentiment": 5.0, "review_text": "Beautifully written wonderful historic novel."}, {"review_sentiment": 5.0, "review_text": "I bought it for my daughter and she loves this."}]}, "authors": ["Julia Alvarez"], "isbn": "1565129768", "longitude": -69.942111, "periods": ["1900s"], "title": "In the Time of the Butterflies", "word_cloud": "historical journey reign dictator follow live sister come age live intertwine dictator regime journey begin young woman school ignorant atrocity action become obvious abhorrent sister reach adulthood feel compel join underground rebellion seek overthrow repercussion swift brutal face retaliation military force begin survive sister present day recount fictional author detail life historical sacrifice sister witness dominican microcosm islander live suffer regime idea faith family communal identity put enormous pressure society simply try survive trust anyone especially neighbor spy manage weave fiction history together tapestry emotional nuance authentic martyrdom weave together separate point view sister voice feel remarkably unique full personality sister write read point feel voice run together overlap nail sister unique personality mannerism think process well genuinely feel write different people give story history sense depth encounter look engage emotionally profound historical period likely encounter much interest fictional account true story sister rate sensual scene sexual innuendo randy humor violence realistic leave feeling unsettled melancholy fictionalized account insightful introspective live lose soon light flicker leave darkness series flashback give thoughtful perspective deeper understand painful event history martyrdom alive great product excellent shipping problem seller others best also saw movie formatting make impossible font bigger shame want everything arrive expect really like listen enjoy sister character different story interesting still relevant today though fiction provide good insight real event highly recommend beautifully write wonderful historic buy daughter love", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "It is November 25, 1960, and three beautiful sisters have been found near their wrecked Jeep at the bottom of a 150-foot cliff on the north coast of the Dominican Republic. The official state newspaper reports their deaths as accidental. It does not mention that a fourth sister lives. Nor does it explain that the sisters were among the leading opponents of Gen. Rafael Leonidas Trujillo’s dictatorship. It doesn’t have to. Everybody knows of Las Mariposas―“The Butterflies.”\r\n\r\nIn this extraordinary novel, the voices of all four sisters―Minerva, Patria, María Teresa, and the survivor, Dedé―speak across the decades to tell their own stories, from hair ribbons and secret crushes to gunrunning and prison torture, and to describe the everyday horrors of life under Trujillo’s rule. Through the art and magic of Julia Alvarez’s imagination, the martyred Butterflies live again in this novel of courage and love, and the human cost of political oppression.  ", "asin": "1565129768", "rank": "18631", "city": "Santo Domingo", "image": "https://images-na.ssl-images-amazon.com/images/I/51r%2BpvllaLL.jpg", "country": "D.R.", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}