{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 265, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "My daughter loved this book.  I will be reading it also."}, {"review_sentiment": 1.0, "review_text": "I was disappointed that this was not the actual book but just notes about it."}, {"review_sentiment": 4.0, "review_text": "Four sisters sharing a childhood-same parents, same extended family, same history of needing to flee their politically oppressive homeland for the safety and uncertainty of the United States. Yet each sister is her own person with her own unique story to tell. I really enjoyed getting to know each of the sisters, their fears and talents, their unique perspectives, and the dynamics of their relationships as sisters. The subjectivity of privilege is revealed through the family’s experience in two different cultures and issues of class, gender, and race are woven throughout the narrative."}, {"review_sentiment": 2.0, "review_text": "It talks about pedophilia and racism casually without dwelling into it much. The book also romantizes mental health care, which was disappointing and cringe worthy. The book is unrelenting unforgiving of all of its characters. I know part of if maybe when it was written but I could not bring myself to appreciate it."}, {"review_sentiment": 5.0, "review_text": "Everything arrived as expected."}, {"review_sentiment": 5.0, "review_text": "Enjoyed reading this book immensely."}, {"review_sentiment": 3.0, "review_text": "haven't read it yet, but it looks good."}, {"review_sentiment": 2.0, "review_text": "Sorry to have started it. Wasnt' worth it."}, {"review_sentiment": 5.0, "review_text": "I loved this story, so well told!"}, {"review_sentiment": 3.0, "review_text": "Lots of other peoples written notes in it.  Had to read for school."}]}, "authors": ["Julia Alvarez"], "isbn": "156512975X", "longitude": 0.0, "periods": ["1900s"], "title": "How the Garcia Girls Lost Their Accents", "word_cloud": "daughter love reading also disappoint actual note sister share parent extend family history need flee politically oppressive homeland safety uncertainty yet sister person unique story tell really enjoy get know sister fear talent unique perspective dynamic relationship sister subjectivity privilege reveal family experience different culture issue class gender race weave narrative talk pedophilia racism casually dwell much also romanticize mental health care disappointing cringe worthy unrelenting unforgiving character know part maybe write everything arrive expect reading immensely yet look good start worth love story well tell people write note have school", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Acclaimed writer Julia Alvarez’s brilliant and buoyant and beloved first novel gives voice to four sisters recounting their adventures growing up in two cultures. Selected as a Notable Book by both the New York Times and the American Library Association, it won the PEN Oakland/Josephine Miles Award for books with a multicultural perspective and was chosen by New York librarians as one of twenty-one classics for the twenty-first century. Ms. Alvarez was recently honored with the 2013 National Medal of Arts for her extraordinary storytelling. \r\n\r\nIn this debut novel, the García sisters—Carla, Sandra, Yolanda, and Sofía—and their family must flee their home in the Dominican Republic after their father’s role in an attempt to overthrow a tyrannical dictator is discovered. They arrive in New York City in 1960 to a life far removed from their existence in the Caribbean. In the wild and wondrous and not always welcoming U.S.A., their parents try to hold on to their old ways, but the girls try find new lives: by forgetting their Spanish, by straightening their hair and wearing fringed bell bottoms. For them, it is at once liberating and excruciating to be caught between the old world and the new. How the García Girls Lost Their Accents sets the sisters free to tell their most intimate stories about how they came to be at home—and not at home—in America.", "asin": "156512975X", "rank": "31744", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51FSQ1Sdu9L.jpg", "country": "Santo Domingo", "story_arc": ["Tragedy", "Things only get worse"]}