{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 26, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "Great collection of stories. Easy to read in short intervals.  I plan to add this to collection of books I keep in my guest room."}, {"review_sentiment": 3.0, "review_text": "Good enough writing, though it is very male-centered. I wouldn't say misogynistic, just full of unacknowledged male privilege. Most of it was written before Katrina and much is dated."}, {"review_sentiment": 4.0, "review_text": "humorous, tour de force that captures the spirit and soul of New Orleans though the writer's experience"}, {"review_sentiment": 5.0, "review_text": "This book is a must for anyone who loves New Orleans. Beautifully written."}, {"review_sentiment": 5.0, "review_text": "I have a love for New Orleans, so reading about his day to day life there was wonderful. Funny, thought provoking. I underlined so many passages and turned down so many corners to refer to later. My daughter read the book and I need to order her a copy now. It is the kind of book you want to keep, not read and get rid of."}, {"review_sentiment": 4.0, "review_text": "If you love New Orleans, you will feel like you are eating this book and bonding with a kindred spirit that you never met. The only reason for not giving it 5 stars is because it gets a bit wordy only in a couple of chapters. It's the next best thing to being there."}, {"review_sentiment": 5.0, "review_text": "A wonderful trip to the city that care forgot.  Andrei Codrescu has a great perspective on one of our great cities."}, {"review_sentiment": 4.0, "review_text": "Contains lots of humor and vivid sensuality of what it's like to live in modern bohemian New Orleans.If Codrescu wanted to include writing about Katrina and it's aftermath, why leave that for the final few pages? It leaves an otherwise pleasant book on a note of despair and political bitterness. Better to have left this out entirely as it didn't fit the tone of the rest of the book. But that shouldn't dissuade anyone interested in New Orleans and its people and history from reading the first 95%."}, {"review_sentiment": 3.0, "review_text": "Lots of celebratory crap here, of course, but his showpiece \"My City My Wilderness\" is worth the price of the ticket with its pungent mixture of observations. Plus the chilling pages on killers Antoinette Frank and Rogers Lacaze prove a welcome reality check to all the bead-tossing."}, {"review_sentiment": 4.0, "review_text": "product was as described. arrived on time. Sorry for the confusion"}]}, "authors": ["Andrei Codrescu"], "isbn": "1565125053", "longitude": -90.0701156, "periods": ["2000s", "Recent Releases"], "title": "New Orleans, Mon Amour: Twenty Years of Writings from the City", "word_cloud": "collection story short interval plan add collection keep guest room good enough write misogynistic full unacknowledged male privilege write much date humorous tour force capture spirit soul writer experience anyone love write love reading day day life wonderful think provoke underline many passage turn many corner refer later daughter need order copy kind want keep get rid love feel eat bond kindred spirit never meet reason give star get bit wordy couple chapter next best thing wonderful trip care forget great perspective great city contains lot humor vivid sensuality live modern bohemian want include write aftermath leave final page leave otherwise pleasant note despair political bitterness leave entirely fit tone rest dissuade anyone interested people history reading first celebratory crap course showpiece worth price ticket pungent mixture observation chill page killer prove welcome reality check product describe arrived time confusion", "genres": ["Memoir", "Essay"], "summary": "For two decades NPR commentator Andrei Codrescu has been living in and writing about his adopted city, where, as he puts it, the official language is dreams. How apt that a refugee born in Transylvania found his home in a place where vampires roam the streets and voodoo queens live around the corner; where cemeteries are the most popular picnic spots, the ghosts of poets, prostitutes, and pirates are palpable, and in the French Quarter, no one ever sleeps.\r\n\r\nCodrescu's essays have been called \"satirical gems,\" \"subversive,\" \"sardonic and stunning,\" \"funny,\" \"gonzo,\" \"wittily poignant,\" and \"perverse\"—here is a writer who perfectly mirrors the wild, voluptuous, bohemian character of New Orleans itself. This retrospective follows him from newcomer to near native: first seduced by the lush banana trees in his backyard and the sensual aroma of coffee at the café down the block, Codrescu soon becomes a Window Gang regular at the infamous bar Molly's on Decatur, does a stint as King of Krewe de Vieux Carré at Mardi Gras, befriends artists, musicians, and eccentrics, and exposes the city’s underbelly of corruption, warning presciently about the lack of planning for floods in a city high on its own insouciance. Alas, as we all now know, Paradise is lost.\r\n\r\nNew Orleans, Mon Amour is an epic love song, a clear-eyed elegy, a cultural celebration, and a thank-you note to New Orleans in its Golden Age.", "asin": "1565125053", "rank": "485362", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/41Tgg2uFzNL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}