{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 22.5677459, "ratings": {"num_ratings": 3, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "This is the best broad based large sweep overview of the cultural and \"people's\" history of the city of Calcutta (now known as Kolkata since the turn of the millenium). Krishna Dutta was born in North Calcutta and then settled in London. This important book gives you a glimpse of the city's past, its history, the people, the culture, the places to visit. The book is written for a Western audience in mind, particularly the ones who are based in the UK, for instance. Britain has a close link with the city, Calcutta was essentially a British city in its birth, the English made the city and then the Indians took over. Calcutta has a glorious past, at various times it was known as the city of palaces, the Second City of the British Empire (after London), and grand epithets. There are churches and buildings in the city which are closely similar to the building structures in London and the UK, the Park Street cemetry has headstones that tell you the tales of a bygone era. Yet today if you beat the streets of Kolkata, you will find a dirty, dilapidated city with poor infrastructure and overloaded. It was never this way and there was a systematic ruin of an otherwise amazing city that we have virtually destroyed well over eighty years. Yet Calcutta has a soft heart, and I encourage you to read this book if you want to discover that soft heart.If you are a diehard Calcuttan and you think you know all about the city, read it for the numerous surprises and pithy observations. If you are a newcomer to the city and want to understand the city's past, present, and possibly future, you must read this book. No matter who you are, this is a great book on the city. The style is fluid, and Dutta's rendering of the narrative is captivating. I had finished the book in one sitting. As a Calcutta newspaper, The Telegraph, used to advertise about themselves, this book is \"unputdownable\".There are a few errors in some of the facts, but Amazon is not the place to point them out, find out for yourself, or read my detailed review of the book!"}, {"review_sentiment": 5.0, "review_text": "Calcutta often gets Bad Press in the Western Media... But as Capitol of the British Raj & \"The Company\" before...Calcutta was a City of Palaces and High Fashion... And also the Intellectual Hub of Bengali India in the 19th Century...Many Indians adopted Western Education & Styles and became wealthy \"Babus\" whose Grand Houses are still seen in North of Historic Calcutta.  And from which India's Nobel Prize Winner in Literature came ~ Rabindranath TagoreCalcutta is a city of parks, and universities with a Cafe Culture that supports its many Book Districts & Book Fairs...Poverty, Yes...But India has a unique way of integrating its poor into mainstream culture... You'll never see Calcutta the same after reading this book..."}, {"review_sentiment": 5.0, "review_text": "Books on the history of Kolkata are not easy to come by, much to my surprise when I started to research on it. This one gives an unique perspective on the cultural aspect. It should not be regarded as a reliable source of accurate information, but more as a high-level introduction. It is a good read and should be picked up by anyone with an interest in this wonderful city."}]}, "authors": ["Krishna Dutta"], "isbn": "1566567211", "longitude": 88.3476023, "periods": null, "title": "Calcutta: A Cultural History", "word_cloud": "best broad base large sweep overview people city know turn millennium bear settle important give glimpse city past people culture place visit write western audience mind particularly one base instance close link city essentially british city birth make city take glorious past various time know city palace grand epithet church building city closely similar building structure cemetery headstone tell tale bygone era yet today beat street find dirty dilapidated city poor infrastructure overload never way systematic ruin otherwise amazing city virtually destroy well eighty year yet soft heart encourage want discover soft die hard think know city numerous surprise pithy observation newcomer city want understand city present possibly future no great city style fluid render narrative captivating finish sit newspaper use advertise unputdownable error fact place point find detailed review often get western also adopt western become wealthy still see come city park university support many unique way integrate poor mainstream culture never see reading easy much surprise start research give unique perspective aspect regard reliable source accurate information introduction good pick anyone interest wonderful city", "genres": ["History", "Social & Cultural Studies"], "summary": "In the popular imagination, Calcutta is a packed and pestilential sprawl, made notorious by the Black Hole and the works of Mother Teresa, Kipling called it a City of Dreadful Night, and a century later V.S. Naipaul, Gunter Grass, and Louis Malle revived its hellish image. This is the place where the West first truly encountered the East. \r\n\r\nFounded in the 1690s by East India Company merchants beside the Hugli River, Calcutta grew into India&#039;s capital and the second city of the British Empire during the Raj. Named the City of Palaces for its neoclassical mansions, Calcutta was also home to extraordinary Bengalis such as Rabindranath Tagore, the first Asian Nobel laureate, and Satyajit Ray, among the geniuses of world cinema. Above all, Calcutta (renamed Kolkata in 2001) is a city of extremes, where refinement rubs shoulders with commercialism and political violence. \r\n\r\nKrishna Dutta explores these multiple paradoxes, giving personal insight into Calcutta&#039;s unique history and modern identity as reflected in its architecture, literature, cinema, and music.", "asin": "1566567211", "rank": "1925597", "city": "Calcutta", "image": "https://images-na.ssl-images-amazon.com/images/I/41fvLbZlzdL.jpg", "country": "India", "story_arc": ["Tragedy", "Things only get worse"]}