{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 9, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Great read."}, {"review_sentiment": 5.0, "review_text": "I thought it was a wonderful magical book. It left me breathless. In many ways I was reminded of A Hundred Years of Solitude. I'm about to order more of Kei Miller's work."}, {"review_sentiment": 5.0, "review_text": "As a literature major I am forced to read difficult texts constantly. I read more hours of the day than I sleep. This novel was assigned to me this year, and I read it in one day. I'm reading it just for fun now! It is so beautiful, brilliant and evocative. Miller does an amazing job of showing the art of story telling and pulling the reader into the story while still holding up a critical lens. I've never read such an artful novel from a young writer."}, {"review_sentiment": 4.0, "review_text": "Beautiful descriptions, playful structure.  I bought this book to help me make the transition to life in Jamaica.  It's a fun read and will take you in unexpected directions!"}, {"review_sentiment": 3.0, "review_text": "I was hoping the book would have more information on Leprosy and how the patients are treated.  The story line was not easy to follow."}, {"review_sentiment": 4.0, "review_text": "I read this book because I lived in Jamaica in the early 1970s, and one day as I was standing on the main street in Falmouth, a woman came striding down the middle of the street and shouting in a commanding way.  I thought the woman had a mental illness.  My coworkers explained that she was \"warning\" but it was obvious that they disapproved of this and also thought she was a little crazy.  So the concept of a \"warner woman\" was familiar to me.  I think Kei Miller does a great job of putting us inside the woman's head, and she is actually sane and healthy in a somewhat crazy society.  When she goes to England, the author very skillfully shows how the woman's husband eventually sees that she is confined to a facility.  However, I thought that what happened to her there, while possibly symbolically important, moved the book in a completely different direction that did not interest me as much.  I preferred the Jamaican part of the book.  Verdict: Kei Miller gave me an entirely new way of understanding a \"warner woman\" and what her actions signify; definitely worth the read, particularly if you are interested in Jamaica."}, {"review_sentiment": 2.0, "review_text": "I read a review and then a random portion of the book. The story captured my interest. The interesting section may have been the first 100 pages. The story became very unusual and  reading was far from enjoyable.  I stopped reading and don't think I will try it again."}, {"review_sentiment": 4.0, "review_text": "Loved this novel about storytelling. Because this was a story about variations of a story,there were frequent flashbacks. One story is being told by the mysterious Mr. Writer Man and a variation of the story is being told by the main character,Pauline Portious, as she whispers it to the universe. Somewhere between the two or more variations we get to the truth. Some aspects of the story reminded me of the magical realism genre of Carlos Ruiz Zafon. I liked the elements of realism: the long lines at the Registrar's office, for example, and the employees chit chatting about the long running Jamaican soap opera. I have been in that line.  I used to listen to the local soap, Royal Palm Estates, probably more than 10 years ago. There really was a home for lepers in St. Catherine. Catholic nuns were stationed to serve there.  One nun,Sister Mary Augustine, wrote a book,\"Two Hearts, One Fire\", about her experiences. There really used to be Warner Women and Men preaching and prophesying gloom and doom.  I enjoyed the flow of the language, the quirky characters. I liked the ironic situations and I liked how the story took us in a full circle. The Original Pearline Portious gave birth in a home where lepers were isolated and the second Pearline Portious gave birth where the mentally disturbed were isolated.  Some readers will find the story repetitive but I enjoyed the repetition and the twists and turns of the story as it developed."}, {"review_sentiment": 5.0, "review_text": "Being in bed with a bad cold, I read this through ... then I read it through a second time the next day and enjoyed my second reading as much as my first. Many things about this novel appeal to me: its view of an aspect of Jamaican life and the life of Jamaicans who emigrated Britain; its device of two different narrators telling the same story and that of the story within a story; the use of parable; its use of Jamaican speech (but not so much that the reader struggles to understand it); the notion that truth and fact are not the same and that truth can be more than fact or exist independent of fact. It is the literary equivalent of an object or painting that one can see from different points of view, each different view yielding different insights. It also touched another memory. I used regularly to see a woman, probably Jamaican, passing by our house or in the centre of our town in the East Midlands, who I now realise was probably just such a Warner Woman. I never knew her well, but always felt a warmth towards her, standing on the street corner outside our house dressed in elaborate red-and-white with a red cap of her own design, with a staff and bell, shouting her biblical warnings to whomever would hear. I now feel I understand her a little better than I did then."}]}, "authors": ["Kei Miller"], "isbn": "1566892953", "longitude": 0.0, "periods": ["1900s", "2000s", "Recent Releases"], "title": "The Last Warner Woman", "word_cloud": "great think wonderful magical leave breathless many way remind order work literature major force difficult text constantly hour day sleep assigned year day read fun beautiful brilliant evocative amaze job show art story tell pull story still hold critical lens never artful young writer beautiful description playful structure buy help transition life fun unexpected direction hop information patient treat story line easy follow live early day stand main street come stride middle street shout commanding way think mental illness coworkers explain warn obvious disapprove also think little crazy concept familiar think great job put head actually sane healthy somewhat crazy society go author skillfully show husband eventually see confine facility however think happen possibly symbolically important move completely different direction interest much prefer part give entirely new way understanding action signify definitely worth particularly interested review random portion story capture interest interesting section page story become unusual reading far enjoyable stop read think try love storytelling story variation story frequent flashback story tell mysterious variation story tell main character whisper universe somewhere variation get truth aspect story remind magical realism genre like element realism long line office example employee chit chat long run soap opera line use local soap probably year ago really home leper nun station serve nun write experience really used preach prophesy gloom doom enjoy flow language quirky character like ironic situation like story take full circle give birth home leper isolate second give birth mentally disturb isolated reader find story repetitive enjoy repetition twist turn story develop be bed bad cold second time next day enjoy second reading much first many thing appeal view aspect life life emigrate device different narrator tell story story story use parable use speech much struggle understand notion truth fact fact exist independent fact literary equivalent object paint see different point view different view yield different insight also touch memory use regularly see probably pass house center town realist probably never know well always felt warmth towards stand street corner house dressed elaborate red cap design staff bell shout biblical warning feel understand little better", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "\"Miller is a name to watch.\" The Independent\r\n\r\n\"This is magical, lyrical, spellbinding writing.\" Granta\r\n\r\nAdamine Bustamante is born in one of Jamaica's last leper colonies. When Adamine grows up, she discovers she has the gift of \"warning\": the power to protect, inspire, and terrify. But when she is sent to live in England, her prophecies of impending disaster are met with a different kind of fear—people think she is insane and lock her away in a mental hospital.\r\n\r\nNow an older woman, the spirited Adamine wants to tell her story. But she must wrestle for the truth with the mysterious \"Mr. Writer Man,\" who has a tale of his own to share, one that will cast Adamine's life in an entirely new light. In a story about magic and migration, stories and storytelling, and the New and Old Worlds, we discover it is never one person who owns a story or has the right to tell it.\r\n\r\nBorn in Kingston, Jamaica, in 1978, Kei Miller is the author of The Same Earth, winner of the Una Marson Prize for Literature; and Fear of Stones, which was shortlisted for the Commonwealth Writers' Prize for Best First Book. His most recent poetry collection has been shortlisted for the Jonathan Llewellyn Rhys Prize, the Bocas Prize for Caribbean Literature, and the Scottish Book of the Year Award. In 2008 he was an International Writing Fellow at the University of Iowa. Miller currently divides his time between Jamaica and Scotland.", "asin": "1566892953", "rank": "728027", "city": "Jamaica", "image": "https://images-na.ssl-images-amazon.com/images/I/41gqqdcW1zL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}