{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 8, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "A superbly written story of one man trying to find a connection to himself, the world, and other people. And, all this with a touch of humor and humility."}, {"review_sentiment": 5.0, "review_text": "There is something about the way Paris looks at the mundane that is absolutely capitivating."}, {"review_sentiment": 5.0, "review_text": "Brilliant and very relatable. Looking forward to more of his books."}, {"review_sentiment": 5.0, "review_text": "Classic second person narrative, with a beautiful Latin (Mexican) brilliance."}, {"review_sentiment": 1.0, "review_text": "Meh. Bored me, another self involved boy."}, {"review_sentiment": 5.0, "review_text": "What an exceptional book!  Paris' ability to translate a surreal experience to others is a true gift."}, {"review_sentiment": 5.0, "review_text": "The best book in the last 10 years.Daniel Saldaña Paris reminds Gabriel García Márquez and Gustave Flaubert. He will win the Nobel prize next year for this book. Unfortunately, there will not be a second book, since here everything has been written, and nothing more can be added anymore."}, {"review_sentiment": 4.0, "review_text": "This novel came highly recommended by a friend, a Mexican professor of Spanish, who called Daniel Saldaña París one of the best writers of his generation. So I entered this novel with high expectations. One of the pleasures of Among Strange Victims is how it wrong-foots any such expectations. I could never quite figure out where this book was going, but at the same time, it doesn’t seem perverse or willful in its misdirections. It’s the outpouring of a highly unique and original comic mind, and it seems to have found its own strange and necessary shape.The novel opens with a series of diaristic entries from a low-level museum “knowledge administrator” Rodrigo, a young and aimless soul whose great projects are exploring the vacant lot next to his tiny apartment and building a collection of tea bags from a dingy café he calls the “café without coffee.” He is a sort of Sartrean existentialist with a sinecure—he likes to masturbate twice on Saturdays, he tells us, and carries a faded scrap of 1980s pornography in his wallet.When Rodrigo gets engaged early in the novel, it’s mostly the result of a misunderstanding he doesn’t bother to clear up. He seems content to let this office snafu dictate his fate. Soon Rodrigo is sharing his tiny, vacant-lot-adjoining apartment with his wife Cecilia, the museum secretary, in a less than ideal match. Rodrigo’s obsessions do not change until he endures an especially putrid form of home invasion, the discovery of which closes out the first section.At this point the novel switches gears, and begins to follow Marcelo Valente, a Spanish professor of aesthetics who heads to the Mexican town of Los Girasoles to research the life of Richard Foret, a modernist poet who spent his last hallucinatory days in the town before disappearing. (The move recalls Bolaño, both structurally and thematically, especially “The Part about the Critics” in 2666.)Saldaña París’s skewering of Valente’s pomposity and romanticism is a total delight. For a while, given the presence of narcos and military security around the bleak housing estate where Valente rents—someone fooled him with pictures on the Internet—you expect that a violent tabloid fate might be in store for him. But here again, Among Strange Victims defies expectations.It would be wrong to say more, but the plots end up intertwining beautifully, in a totally unexpected endgame that only this novel could produce, visionary and satirical at once. This is funny, lewd, irreverent work— Bolaño himself comes in for ribbing when Rodrigo encounters two young foreign exchange students who enthuse about The Savage Detectives in one of the novel’s several gloomy cantinas. It’s the kind of blow-off tribute B. might appreciate, were he still with us.“The only open cantina they came across had a more dubious air than the one they had left, although to an inexperienced eye, it might have been the very same cantina, which is exactly what Daga said when they looked inside: ‘It’s the same cantina.’”A very small sample of what makes Saldaña París special—his sentences. While I can’t speak to accuracy, Christina MacSweeney’s English translation is a thing of great wit, flow, and range. We’re lucky to have it."}]}, "authors": ["Daniel Saldaña París"], "isbn": "1566894301", "longitude": -99.1333416, "periods": ["2000s", "Recent Releases"], "title": "Among Strange Victims", "word_cloud": "superbly write story man try connection world people touch humor humility something way look absolutely captivate repeatable look forward classic second person narrative beautiful brilliance self involve boy exceptional ability translate surreal experience others true gift best last remind next year unfortunately second everything write nothing add anymore come highly recommended friend professor call best writer generation enter high expectation pleasures expectation never figure go time perverse willful misdirection outpouring highly unique original comic mind seem find necessary open series diarist entry museum knowledge administrator young aimless soul great project explore vacant lot tiny apartment build collection tea bag dingy cafe call cafe sort existentialist like masturbate twice tell carry fade scrap pornography get engage early mostly result misunderstand bother clear seem content office snafu dictate fate share tiny apartment wife museum secretary le ideal match obsession change endure especially putrid form home invasion discovery close first point switch gear begin follow professor aesthetic head town research life modernist poet spend last hallucinatory day town disappear move recall structurally thematically especially skewer pomposity romanticism total delight give presence narc military security bleak housing estate fool picture expect violent tabloid fate defies plot end intertwine beautifully totally unexpected endgame visionary satirical funny lewd irreverent come rib encounter young foreign exchange student enthuse detectives several gloomy cantinas kind tribute still open canting come dubious air leave inexperienced eye exactly say looked small sample make sentence speak accuracy translation thing great wit flow range lucky", "genres": ["Fiction & Literature", "Humour"], "summary": "Rodrigo likes his vacant lot, its resident chicken, and being left alone. But when passivity finds him accidentally married to Cecilia, he trades Mexico City for the sun-bleached desolation of his hometown and domestic life with Cecilia for the debauched company of a poet, a philosopher, and Micaela, whose allure includes the promise of time travel. Earthy, playful, and sly, Among Strange Victims is a psychedelic ode to the pleasures of not measuring up.\r\n\r\n“The novel takes some bizarre turns as Marcelo leads Rodrigo into experiments involving drugs, tequila, hypnosis and more, all in the name of transformation. If the young man’s notion of radical change is to take part in his life rather than observe it from afar, he’s off to a good start.” The New York Times\r\n\r\nDaniel Saldaña París (born Mexico City, 1984) is an essayist, poet, and novelist whose work has been translated into English, French, and Swedish and anthologized, most recently in Mexico20: New Voices, Old Traditions, published in the United Kingdom by Pushkin Press. Among Strange Victims is his first novel to appear in the United States. He lives in Montreal, Quebec.\r\n\r\n", "asin": "1566894301", "rank": "545287", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/61Tsd8ViMjL.jpg", "country": "Mexico", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}