{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 18.4801972, "ratings": {"num_ratings": 5, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "I was enjoying this book."}, {"review_sentiment": 5.0, "review_text": "The book was brand new and was the one I needed for class. I couldn't find it in our book store, but luckily enough, amazon had it! Thanks!"}, {"review_sentiment": 5.0, "review_text": "Up in Manhattan's Morningside Heights and its Dominican analogs all over the US, salsa is edged out by the magnificently manic beat of the merengue, whether stirred into Dominican rap and house (the most original as well as the least known versions of the genre) or in the tear-em-down accordion of Fefita La Grande. Austerlitz has all this and a lot more, all the way from the luckless Toma' back in the 1840s (read the book!)Austerlitz covers merengue from rural to hi-society in all its fierce joviality. Read this book and you'll know there's one good thing Trujillo did for the Dominican Republic!John Storm Roberts"}, {"review_sentiment": 4.0, "review_text": "If you are looking for a quick yet thorough coverage of this topic then this is the book for you.  It is a relatively short book, coming in at 167 pages (not including bibliography but including notes section), yet it covers the whole spectrum of the national music of the Dominican  Republic.Mr Austerlitz covers the beginnings of this music all the way  through to its current state.  It also spends time on Merengue's  development during the Trujillo era (a particularly interesting topic to  anyone who studies the Dominican Republic).Mr Austerlitz also does a  good job of addressing the sociological issues that arise from music and  manages to blend well the merengue of the campo with that of the salon.A  good read and it even comes with a CD with some very good campo (country)  merengue.  If you are looking for merengue at its roots then this CD should  please you.TABLE OF CONTENTS:1.IntroductionPART 1: THE HISTORY OF  MERENGUE 1854-1961.  2. Nineteenth-Century Caribbean Merengue. 3. Merengue  Cibaeno, Cultural Nationalism, and Resistance.  4. Music and the State:  Merengue during the Era of Trujillo, 1930-1961.PART 2: The Contemporary  Era, 1961-1995.  5. Merengue in the Transnational Community.  6. Innovation  and Social Issues in Pop Merengue.  7. Merengue on the Global Stage.  8.  Enduring Localism.  9. ConclusionLet me know if you found this useful."}, {"review_sentiment": 5.0, "review_text": "Enjoyed the insight into the history of Merengue and its cultural context. This book has a place on my bookshelf along with \"The Latin Tinge\" and \"The Brazilian Sound.\""}]}, "authors": ["Paul Austerlitz"], "isbn": "1566394848", "longitude": -69.942111, "periods": ["1900s"], "title": "Merengue : Dominican Music and Dominican Identity", "word_cloud": "enjoy brand new need class store luckily enough amazon thanks analog salsa edge magnificently manic beat stirred rap house original well least known version genre accordion lot way luckless back cover rural fierce joviality know good thing look quick yet thorough coverage topic relatively short come page include bibliography include note section yet cover whole spectrum national cover beginning way current state also spend time development era particularly interesting topic anyone study also good job address sociological issue manages blend well camp good even come good camp country look root please know find useful enjoy insight history cultural context place bookshelf brazilian sound", "genres": ["History", "Social & Cultural Studies", "Music"], "summary": "Merengue is a quintessential Dominican dance music. This work aims to unravel the African and Iberian roots of merengue. It examines the historical and contemporary contexts in which merengue is performed and danced, its symbolic significance, its social functions, and its musical and choreographic structures.", "asin": "1566394848", "rank": "1342849", "city": "Santo Domingo", "image": "https://images-na.ssl-images-amazon.com/images/I/51NQNP3PGGL.jpg", "country": "D.R.", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}