{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 40, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "One of thee BEST BOOKS EVER!"}, {"review_sentiment": 5.0, "review_text": "Just starting to read this book and enjoying it!  I've become a Chris McKinney fan and have bought several titles for future reads.  Started with my friend lending me \"Bolohead Row\"!  I can relate to the characters as well, as have either experienced similar situations or know people that are almost like the characters that he depicts!  A fast and easy read!"}, {"review_sentiment": 5.0, "review_text": "Very good"}, {"review_sentiment": 5.0, "review_text": "I've read this book over 20 times. We use it in a classroom to teach students how choices you make can have a serious impact on your life. Recommended only for high school and up, some graphic details, and lots of swearing. Captures the everyday language used by locals, so may be hard for those not familiar with local slang to catch on."}, {"review_sentiment": 5.0, "review_text": "Chris McKinney shows you the side of Hawaii that is never really talked about.  Yes there is palms trees, blue water, and sand.  But, that's jut on the surface.  This book delves into many unknowns and the journey will surprise many."}, {"review_sentiment": 5.0, "review_text": "Loved the characters, the seediness, the rawness of this book, especially narrated in Hawaiian pidgin English.  Locals should read this book in no time!"}, {"review_sentiment": 5.0, "review_text": "I've been wanting to know why people murder in paradise. This story offers a critical and analytical look into local Hawaiian society and culture. The writing is good and the storytelling par excellence. I hope I get to meet the author someday and thank him in person."}, {"review_sentiment": 5.0, "review_text": "This was recommended to me by someone who lives in Hawaii. I was looking for another point of view as to what it meant to be from \"paradise\". This tense and gripping book did not disappoint"}, {"review_sentiment": 5.0, "review_text": "Extremely gripping read. Painted a painfully honest and disturbing picture of the other side of paradise. Incredibly authentic and \"local,\" its themes as to the importance of friendship, loyalty and love resonate far beyond its island setting. Juxtaposing the natural beauty of Oahu with the harsh reality of life on the fringe, it is a Hawaiian \"Once Were Warriors\" and begs to be turned into a movie."}, {"review_sentiment": 5.0, "review_text": "Cool book. Fast shipping too!"}]}, "authors": ["Chris McKinney"], "isbn": "1566473195", "longitude": -157.8556764, "periods": ["2000s", "Recent Releases"], "title": "The Tattoo", "word_cloud": "thee just start enjoy become fan buy several title future read start friend lending relate character well either experience similar situation know people almost character depict fast easy very good time use classroom teach student choice make serious impact life recommend high school graphic detail lot swear capture everyday language use local familiar local slang catch show side never really talked palm tree blue water sand jut surface delve many unknown journey surprise many love character seediness rawness especially narrated pidgin time want know people murder paradise story offer critical analytical look local society culture writing good storytelling par excellence hope get meet author someday thank person recommend someone live look point view mean paradise tense grip disappoint extremely grip painfully honest disturb picture side paradise authentic local theme importance friendship loyalty love resonate far island set natural beauty harsh reality life fringe hawaiian begs turn movie shipping", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Ken Hideyoshi is the new guy in Halawa Correctional Institute. He’s tough looking, a hard case, observes his cellmate Cal—the mute tattoo artist of the prison, a wife murderer. SYN, a gang symbol, is tattooed on his hand, and he has a Japanese emblem inscribed on his left shoulder. He asks Cal for a tattoo on his back, in kanji script, of Musashi’s Book of the Void. \r\n\r\n\"Rough-and-tumble, rife with fully drawn badass characters and plenty of action, McKinney's novel is powerful and strong.\" Time Out Chicago\r\n\r\n\r\nWhile he is being worked on, he tells Cal his life story, a tale of hardship and abuse. Motherless, he was raised by a distant father, a Vietnam War veteran, in the impoverished hinterlands. In his teen years he hung out with the native Hawaiian gangs and was drawn into the Hawaiian-Korean underworld of strip bars and massage parlors. His ambition and proud samurai spirit seem, inevitably, to lead to his downfall. \r\n\r\nChris McKinney is of Korean, Japanese, and Scottish descent. He was born in Honolulu and grew up in Kahaluu. He portrays the native Hawaiian experience from the inside, where children of mixed ethnicity grow up far from the clear water and pristine beaches of the rich visitors’ resorts.", "asin": "1566473195", "rank": "481436", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/51tKBAoxCvL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}