{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 10, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "Fascinating and little known aspect of WWII. A very worthwhile read."}, {"review_sentiment": 4.0, "review_text": "This book was meticulously researched and gives an interesting picture of Portugal's mostly neutral role in World War II. The chapters dealt with various aspects of life in Lisbon including spying, propaganda, and refugees. I found THE LISBON ROUTE to be a slow read; it was challenging for me to keep track of the many people mentioned in the book."}, {"review_sentiment": 4.0, "review_text": "A useful guide to Portugal in WWII and the spy-vs.-spy atmosphere in Lisbon.  My British Mom passed thru Lisbon isWWII, so I wanted some info."}, {"review_sentiment": 4.0, "review_text": "This book provided good information about Lisbon's escape route during World War II. Interesting and informative. The text helped make the travails of the escapees real."}, {"review_sentiment": 4.0, "review_text": "This is a collection of individual stories about the non-Portuguese who passed through Lisbon between (roughly) 1938 and 1946. It says comparatively little about the people of Portugal who surrounded them. The range of characters--refugees, refugee aid workers, businessmen, diplomats, journalists, spies--included in the book, many of them already famous or soon to become famous, makes it a worthwhile read."}, {"review_sentiment": 4.0, "review_text": "This is an engaging read and a useful source of information for anyone interested in World War II. The book is filled with well-referenced and vivid detail on refugees from various walks of life, all having in common the need to escape from Nazi Germany and occupied Europe. For the exiles there was often hardship but also opportunities. You will come across military figures and citizens who helped those in need, as well as spies, smugglers and other colourful characters. Beyond the fascinating stories of many individuals, there is the background historical moment of a country managing a precarious balance between the Axis and the Allies. The diplomatic manoeuvring over access to bases in the Azores and Portuguese wolfram is particularly interesting."}, {"review_sentiment": 5.0, "review_text": "Since I am very interested in World War II history in Europe I found this book fascinating ... a great little niche of the history of the War.  The author obviously did a great deal of research.  I have already borrowed from the library one of the books the author cites as a source, and am reading it (WE ESCAPED), and plan to go through his list of sources carefully to find other possible good reads.  Especially heart-rending was the story of the fate of the plane Leslie Howard was on."}, {"review_sentiment": 4.0, "review_text": "Advice to writers often emphasizes the importance of seizing the reader's interest in the first chapter.  This book is a classic example of how not to do that.  Much of the first chapter consists of summaries of newspaper and magazine articles and some fiction.  Only in the second chapter does the author get to the stories of individuals that make the book fascinating reading.The stories range from the tragic to the laughable.  Some escapees suffered severe hardships in getting to Lisbon; Arthur Koestler's survival story is particularly harrowing.  Other migrants of more privileged classes escaped in comfort. Some private citizens like Varian Fry acted heroically in helping desperate people.  At the other extreme, some of the actions by foreign governments in Lisbon were insensitive, naive and amateurish.Portugal skillfully managed its Allied-leaning neutrality to emerge unscathed, and richer, from the war.  We may condemn Salazar as a dictator, but he successfully guided his country through a dark age when other nations envied Portugal's sunny allure."}, {"review_sentiment": 4.0, "review_text": "\"The Lisbon Route\" is a quick read on what amounts to a sidebar to World War II.This book paints a vivid picture of the streams of humanity flowing into Lisbon and then on to safer destinations. These stitched together personal stories and anecdotes round out a seldom told story.As one would expect from one of the only neutral ports in the war, Lisbon was awash in spies and their schemes. The spy details are a particularly fetching part of the story. The incompetence and indifference of the Germans in the spy game is surprising.The descriptions of the diplomatic/geopolitical dance over use of Portugal's  Azores and key minerals are fascinating. Portugal deftly played the Brits, Americans and Germans off each other to keep out of the war, yet at the same time making it a crucial ally to all. Fascinating read."}, {"review_sentiment": 4.0, "review_text": "This is not just the story of Lisbon but of `neutral' Portugal. It is also many other stories.This is the story of many refugees and of officials and ordinary  men and women who defied orders to issue transit visas. It is also the story of the ships that traveled to neutral Portugal and the Pan Am Clippers. It was one of the goals for servicemen trying to avoid capture, including Chuck Yeager's journey across the Pyrenees. The Duke and Duchess of Windsor and Noel Coward are not forgotten.The book is filled with names and facts and narratives of those who helped and those who need that help. You do not get close to them because there are just so many - page after page of the part Lisbon played in the  machinations and intrigues of WWII.The details of Portugal's neutrality and its' effects on the escape route that it became during the war are well detailed. All aspects of the propaganda war are described, as well as the political pressure from the Allies for the use of bases in the Azores. There are some fascinating, little known details in here. The tale of wolfram, a mineral from which tungsten is derived  which is used to harden steel needed for war materials. It was mined in Portugal and needed by Germany. The Safehaven Program is detailed - an effort to keep German hidden money from being used after the war.This is a book filled with so much information those interested in the history of the intelligence communities, the political maneuverings and intricate aspects of WWII would find it of interest."}]}, "authors": ["Ronald Weber"], "isbn": "1566638763", "longitude": -9.1365061, "periods": ["1900s"], "title": "The Lisbon Route: Entry and Escape in Nazi Europe", "word_cloud": "fascinate little known aspect worthwhile meticulously research give interesting picture mostly neutral role chapter deal various aspect life include spy propaganda refugee find challenge track many people mention useful guide atmosphere british pass thru is wwii want info provide good information route informative text help travail escapee real collection individual story pass roughly say comparatively little people surround range character refugees refugee aid worker businessmen diplomat journalist spy include many already famous soon become famous make worthwhile engage useful source information anyone interested fill vivid detail refugee various walk life common need occupy exile often hardship also opportunities come military figure citizen help well spy smuggler colorful character fascinate story many individual background historical moment country manage precarious balance ally diplomatic maneuvering access base azores portuguese wolfram particularly interest interested history find fascinate great little niche history author obviously great deal research already borrow library author cite source reading plan go list source carefully find possible good read especially story fate plane advice writer often emphasize importance seize interest first chapter classic example first chapter consist summary newspaper magazine article fiction only second chapter author story individual make fascinate story range tragic laughable escapee suffer severe hardship get survival story particularly harrow other migrant privilege class escape private citizen marian act heroically help desperate people extreme action foreign government insensitive naive skillfully manage neutrality emerge unscathed richer war dictator successfully guide country dark age nation envy sunny allure quick amount sidebar paint vivid picture stream humanity flow safer destination stitch together personal story anecdotes round seldom tell neutral port war awash spy scheme spy detail particularly fetch part story incompetence indifference spy game description dance use key mineral fascinate deftly play keep war yet time make crucial ally fascinate story also many story many refugee official ordinary men woman defy order transit also story ship travel neutral be goal servicemen try avoid capture include journey fill name fact narrative help help get close many page page part play machination intrigue detail neutrality effect route become war well detail aspect propaganda war describe well political pressure ally use base azores fascinate little know detail tale wolfram mineral tungsten derive use harden steel need war material mine need detailed effort keep german hidden money use fill much information interested history intelligence community political maneuverings intricate aspect interest", "genres": ["History", "WWII"], "summary": "The Lisbon Route tells of the extraordinary World War II transformation of Portugal's tranquil port city into the great escape hatch of Nazi Europe. Royalty, celebrities, diplomats, fleeing troops, and ordinary citizens desperately slogged their way across France and Spain to reach the neutral nation. \r\n\r\nHere the exiles found peace and plenty, though they often faced excruciating delays and uncertainties before they could book passage on ships or planes to their final destinations. As well as offering freedom from war, Lisbon provided spies, smugglers, relief workers, military figures, and adventurers with an avenue into the conflict and its opportunities. \r\n\r\nRonald Weber traces the engaging stories of many of these colorful transients as they took pleasure in the city's charm and benign climate, its ample food and drink, its gambling casino and Atlantic beaches. Yet an ever-present shadow behind the gaiety was the fragile nature of Portuguese neutrality, which at any moment the Axis or Allies might choose to end.", "asin": "1566638763", "rank": "1027521", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/51iLHqHqpDL.jpg", "country": "Portugal", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}