{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 1, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Madrid was founded by the Moors and only rose to prominence in the 16th century when King Philip II chose to make it Spain's first permanent court and the center from which he would manage his newly emancipated empire. But it was not until two centuries later that Madrid would become the grandly aristocratic city that it is today. Historian Hugh Thomas has researched five centuries of Madrid's history as recorded in diaries, letters, memoirs, and even novels. The result is an outstanding anthology which vividly evokes the drama and personalities of the past with eyewitness accounts and commentaries from both visitors and inhabitants of Spain's premier city. Enthusiastically recommended reading for anyone planning a vacation trip or a business visit to Madrid, A Traveller's Companion To Madrid is informed and informative -- and would well serve as a template for how other historians might create histories of their cities both in Europe and in the United States."}]}, "authors": null, "isbn": "156656591X", "longitude": -3.7035825, "periods": ["1600s", "1700s", "1800s", "1900s"], "title": "A Traveller's Companion To Madrid", "word_cloud": "found moor rise prominence century choose first permanent court center newly emancipate empire century later grandly aristocratic city today research century history record diary letter memoir even novels result outstanding anthology vividly evoke drama personality eyewitness account commentaries visitor inhabitant premier city enthusiastically recommend read anyone plan vacation trip business visit informed informative well template historian history city", "genres": ["History"], "summary": "Hugh Thomas, best known for his authoritative analysis of the Spanish Civil War, has chosen from diaries, letters, memoirs and novels ranging across five centuries of Madrid's history. The anthology brilliantly evokes the drama and personalities of the past by drawing on eyewitness accounts and commentaries from both visitors and inhabitants including Beaumarchais, Beckford, Luis Bu§uel, Alexandre Dumas, Goya, Victor Hugo, Hemingway, Napoleon and scores of others.\r\n\r\nIncludes: the Duke of Wellington walking in the shady Paseo del Prado; the Earl of Clarendon on 17th-century bullfights; Salvador Dal° playing a surrealist joke on a snooty barman at the Ritz; Rubens in the AlcÝzar; Manet at the Prado, generals and anarchists in the Puerta del Sol; Casanova and Trotsky in prison.", "asin": "156656591X", "rank": "2556517", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/51CBENDS5ML.jpg", "country": "Spain", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}