{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 7, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "My favorite book about Venice's astonishing history -- a compilation of source documents that are edited into short and fascinating sections."}, {"review_sentiment": 5.0, "review_text": "What a travel guide"}, {"review_sentiment": 5.0, "review_text": "just fine"}, {"review_sentiment": 5.0, "review_text": "This is Norwich, and the sort of detail and complexity you'd expect from him. If you're looking to go in-depth on Venice, this is the book for you."}, {"review_sentiment": 5.0, "review_text": "I read this book cover-to-cover before, during, and after a recent trip to Venice.  I have to say that more than any of the other books about Venice that I looked at, this one had the most profound and positive impact on my trip and understanding of the city.  No, it certainly won't tell you where to stay or eat, and you probably won't find yourself looking up churches and museums in it like you might in the Blue Guide or some other book.  But the centuries of travelers' observations compiled in its pages will bring color and life to the city and its monuments and public spaces in a way that no single guide or history could.  The passages in this book are not merely informative; they are also highly engaging and range from touchingly serious to laugh-out-loud funny.  If you are going to Venice, or if you merely want to travel there from your armchair, get this book before you even consider getting any other!"}, {"review_sentiment": 5.0, "review_text": "I bought this anthology in the months prior to a trip to Venice, after reading editor John Julius Norwich's excellent \"A History of Venice\", to which it makes a terrific companion volume. These first-hand historical accounts present a colorful review of divergent viewpoints on \"La Serinissima\", from its distant origins in the Dark Ages up through the 20th century.Though billed as a \"traveller's companion\", this is not a guide book in any sense of the phrase; rather, it serves to give one a sense of the history and character of the city and its most prominent features through letters, journals, and essays spanning the nearly 1400 years of its existence. Amongst the commentators are humorists like Mark Twain, great eccentrics like Thomas Coryat, litterateurs such as Henry James and aesthetes like John Ruskin -- and their contrasting views create a multifaceted portrait of this unique city, full of surprises and compulsively readable.For those who want a sense of the hidden history and culture under the dazzling surface of Venice, who want to more deeply appreciate the city and its sights while experiencing them, this collection is highly recommended."}, {"review_sentiment": 5.0, "review_text": "Lord Norwich is a consumate storyteller with an incredible ability to weave various sources of information into a compelling narrative--or in this case, a series of anecdotes.  I can hardly recommend this highly enough.  His choices of material are brilliant, his narration masterful, and the overall sense of place perfectly fitted to the Most Serene Republic.Also not to miss is his A History of Venice and Paradise of Cities: Venice In the 19th Century.  The letters written by Euphemia Ruskin inspired several characters in my second novel!Venice for Pleasure is useful for the traveler or writer, as well, as is Jan Morris' The World of Venice."}]}, "authors": ["John Julius Norwich"], "isbn": "1566564654", "longitude": 12.3345898, "periods": ["1700s", "1800s", "1900s"], "title": "A Traveller's Companion to Venice", "word_cloud": "favorite astonish history compilation source document edit short fascinating section travel guide fine sort detail complexity expect look go recent trip say look profound positive impact trip understand city certainly eat probably look church museum centuries traveler observation compile page bring color life city monument public space way single guide history passage merely informative also highly engage range touchingly serious funny go merely want travel armchair even get buy anthology month prior trip reading editor excellent make terrific volume historical account present colorful review divergent viewpoint distant origin bill traveler guide sense phrase rather serve sense history character city prominent feature letter journal essay span nearly year existence commentator humorist great eccentric litterateurs aesthetes contrast view create multifaceted portrait unique city full surprise compulsively want sense hidden history culture dazzle surface want deeply appreciate city sight experience collection highly recommend consummate storyteller incredible ability weave various source information compel narrative case series anecdotes hardly recommend highly enough choice material brilliant narration masterful overall sense place perfectly fit most miss letter write inspire several character second useful traveler writer well", "genres": ["History", "Travel Writing"], "summary": "Bringing to life Florence's glorious history in first-hand accounts.\r\n\r\nReactions to Venice have been, throughout the ages, astonishingly different. Henry James wrote passionately: \"You desire to embrace it, to caress it, to possess it...\" whereas Mark Twain found St. Mark's \"so ugly...Propped on its long row of thick-legged columns, its back knobbed with domes, it seem like a vast, warty bug taking a medieval walk.\" \r\n\r\nIn this dazzling anthology, James and Twain along with the writings of Byron, Goethe, Wagner, Casanova, Jan Morris, Robert Browning, and Horace Walpole, among many others, are all featured. Ranging from the days of the sixth century, when the early lagoon-dwellers lived \"like sea-birds, in huts built on heaps of osiers\" to the exquisite city of eighteenth-century revelers and nineteenth-century art lovers-the city's many different guises are revealed as its inhabitants and visitors saw them.\r\n\r\nThis favorite volume from the Traveller's Companion series also contains maps, engravings, and notes on history, art and architecture, and everyday city life. Highly entertaining and informative.", "asin": "1566564654", "rank": "1251526", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51aOfI7NOvL.jpg", "country": "Italy", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}