{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 40.4167047, "ratings": {}, "authors": ["Ben Lerner"], "isbn": "1566892740", "longitude": -3.7035825, "periods": ["2000s", "Recent Releases"], "title": "Leaving the Atocha Station", "word_cloud": "", "genres": ["Fiction & Literature", "Poetry", "Humour"], "summary": "Adam Gordon is a brilliant, if highly unreliable, young American poet on a prestigious fellowship in Madrid, struggling to establish his sense of self and his relationship to art. What is actual when our experiences are mediated by language, technology, medication, and the arts? Is poetry an essential art form, or merely a screen for the reader's projections? Instead of following the dictates of his fellowship, Adam’s “research” becomes a meditation on the possibility of the genuine in the arts and beyond: are his relationships with the people he meets in Spain as fraudulent as he fears his poems are? A witness to the 2004 Madrid train bombings and their aftermath, does he participate in historic events or merely watch them pass him by?\r\n\r\nIn prose that veers between the comic and tragic, the self-contemptuous and the inspired, Leaving the Atocha Station is a portrait of the artist as a young man in an age of Google searches, pharmaceuticals, and spectacle.\r\n\r\nBorn in Topeka, Kansas, in 1979, Ben Lerner is the author of three books of poetry The Lichtenberg Figures, Angle of Yaw, and Mean Free Path. He has been a finalist for the National Book Award and the Northern California Book Award, a Fulbright Scholar in Spain, and the recipient of a 2010-2011 Howard Foundation Fellowship. In 2011 he became the first American to win the Preis der Stadt Münster für Internationale Poesie. Leaving the Atocha Station is his first novel.", "asin": "1566892740", "rank": "101174", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/51IEtehSyqL.jpg", "country": "Spain", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}