{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 20, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "Excellent book.  The prose is as good as it gets.  I wish it were footnoted."}, {"review_sentiment": 5.0, "review_text": "Excellent, very interesting."}, {"review_sentiment": 5.0, "review_text": "It was a present for my husband and he loved it."}, {"review_sentiment": 2.0, "review_text": "This book is just plain bizarre. I understand Mr. Ross's reputation as a beatnik and unique outsider living as an ex-patriate. I wanted an interesting perspective on that giant, Mexico City having visited recently. What I received was interesting stories, jumbled history, and confusion. By the end of the book, I was just skimming just lost in many names. Ugh."}, {"review_sentiment": 5.0, "review_text": "John Ross wrote an excellent book that reads extremely fast and keeps you attracted to what he has to say through the entire book. Not a technical historical study of Mexico City nor a scholarly research book, Ross has in mind the common reader as well as the avid history reader. However, he avoids footnotes and bibliography, instead at the very end of the book he has a brief explanation of the sources he used for this book in a short essay. Readers will find his memoirs and his anecdotes specially and particularly interesting given that Ross has personally collaborated with leading civil rights leaders in Mexico City, scholars and intellectuals, and participated in many political events."}, {"review_sentiment": 5.0, "review_text": "Great book! The book provides a unique and detailed history of Mexico City. The author describes the dark side of Mexican politics and the continued exploitation of the poor who reside in that monster city. I really enjoyed how in selected chapters the author inserted personal interviews with various Mexico City characters who shared their perspective relating to interesting events."}, {"review_sentiment": 5.0, "review_text": "I loved this book.  Maybe it's not for everybody, but it is if you know something about Mexico and Mexico City and want to know more.  Ross, granted, was an eccentric of sorts, who saw the world on his own terms, but he's certainly not boring.  An itinerant journalist ('stringer'  is the word), he arrived in Mexico City in 1985 to report on the earthquake that year.  He remained in the city for the rest of his life - some 25 years.  He appears to have spent those years living in a run-down, downtown Mexico City hotel, observing life around him, interviewing anybody who would talk, and researching pertinent books, newspapers, magazines, etc.  Consequently, this book is a treasure of history, facts and statistics.  Ross eventually spoke pretty good Spanish and he often feels more comfortable using a Spanish word or obscenity  - which he usually immediately translates for the reader (thank you, John!).  Ross was very hard on many aspects of life in Mexico - on the Aztecs, on Spain and the Conquistadores, on the Catholic Church, on Mexican Revolutionaries, on politicians, on drug dealers and criminals, and more.  I think there is a reason why the book was not printed until Ross was about to die;  all those he slandered in this book probably realized that suing or assassinating him would be wasted effort on a terminally ill man. William H. Prescott did a great job in his book  (The Conquest of Mexico)(please, Ron Howard, do make this book into a movie!) and now, John Ross has done an equally wonderful job of bringing the conquest up to date.  Thank you, John Ross. Rolland Amos, Severn, MD."}, {"review_sentiment": 5.0, "review_text": "This is a definitive book on Mexico City history and politics that has needed to be written.Thorough and complete, it takes you on a joyride through it all.  I have shared this withothers, and highly recommend it to anyone."}, {"review_sentiment": 4.0, "review_text": "I don't share John Ross's opinion of the recent past, but I have to admit he's written a wonderful book. Here's the thing I like the most about El Monstruo: the author is very much a part of the story he writes, he's `embedded' in it, and he can't help but feel the ups and downs of the city as if they were his own, and love the Monster on a clear blue morning, and feel a sense of outrage when the bad guys win (almost always), and cry under the rain, and feel the love and eat the food, and everything else you would expect from a writer who is wide awake in Mexico City. Indifference is not a word in John Ross's vocabulary. Ross takes on a subject of biblical proportions and gallantly does battle with the Monster/Mexico City. He writes with a sense of urgency because he knows that the Monster will eventually swallow him up (the Mexican Goliath crushes every David on its path), but his voice, like the voices of others before him is now a part of the city which he chooses to call home. Gracias Ross."}, {"review_sentiment": 5.0, "review_text": "John Ross has written a brilliant book.  It reflects Mexico with several key threads; poetry, political commentary and history each spun with Mr. Ross's hands, his life, and love for Mexico.He deeply and sincerely loved Mexico and his words reflect his unique and colorful spirit as an artist and writer.I was fortunate to meet him just once and had a wonderful and long lunch with him.His deep understanding of Mexico's DNA is evident and full of substance.  To those, who criticize the perceived historical errors I will offer this thought to you.Mexico City and Mexico is a living canvas, from Pre:Columbian times to this day. It is both mythical and real. His words embody a poetry of movement; movement to history and then back to myth.  Sometimes it is simultaneously both myth and history.  It is alive and yes it has become monstrous.  This is Mexico today.Mr. Ross's ability to describe this fluid reality was honed by his passion for our culture and his ability to fuse himself into its body.  It must be read through his voice and his life.The book reflects his courage to see Mexico in its extremes and its origins.I have lived and worked in Mexico City for much of my life.  My ability to understand it with traditional written descriptions often would cause just greater confusion or frustration.Mr. Ross and this work taught me to blend my perception of myth, poetry and art with traditional historical writing in order to digest the Monster; even if by small pieces over time.His book and his method offer us a prism through which to absorb the Monster with its daily exploits and rage, thus augmenting our ability to feel and know.It is one of the best books, if not the best on our culture of Mexico City/ Mexico that has been written by a unique and free human spirit in the last 25 years.  It is a wonderful gift to us!Thank you,Ricardo Blazquez"}]}, "authors": ["John Ross"], "isbn": "1568584245", "longitude": -99.1333416, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s", "Recent Releases", "1500s"], "title": "El Monstruo: Dread and Redemption in Mexico City", "word_cloud": "excellent prose good get wish footnote excellent interesting present husband love plain bizarre understand reputation beatnik unique outsider living want interest perspective giant visit recently receive interest story jumble history confusion end skim lose many name ugh write excellent read extremely fast keep attract say entire not technical historical study scholarly research mind common well avid history however avoid footnote instead brief explanation source use short essay find memoir anecdote specially particularly interesting give personally collaborate lead civil right leader scholars intellectual participate many political event provide unique detailed history author describe dark side politics continue exploitation poor reside monster really enjoy select chapter author insert personal interview various character share perspective relate interesting event love maybe everybody know something want know grant eccentric sort saw world term certainly bore itinerant journalist word arrive report earthquake year remain rest life year appear spent year live downtown hotel observe life interview anybody research pertinent newspaper magazine etc consequently treasure history fact statistic eventually speak pretty good spanish often feel comfortable use spanish word obscenity usually immediately translate thank hard many aspect life politician drug dealer criminals think reason print die slander probably realize suing assassinate effort terminally ill man great job make movie do equally wonderful job bring conquest date definitive history politics need complete take joyride share with others highly recommend anyone share opinion recent past admit write wonderful here thing like author much part story write ups down love clear blue morning feel sense outrage bad guy win almost always cry rain feel eat food everything else writer wide awake word vocabulary take subject biblical proportion gallantly battle write sense urgency know eventually swallow crush path voice voice others part choose call home write brilliant reflect several key thread political commentary history spun hand life deeply sincerely love word reflect unique colorful spirit artist fortunate meet wonderful long lunch deep understand evident full substance perceived historical error offer thought live canvas time day mythical real word embody poetry movement movement history back myth simultaneously myth history alive become monstrous ability describe fluid reality hone passion culture ability fuse body reflect courage extreme live worked much life ability understand traditional write description often greater confusion work teach blend perception myth poetry art traditional historical writing order digest even small piece method offer prism absorb daily exploit rage thus augment ability best best culture write unique free human spirit last year wonderful gift", "genres": ["Memoir", "History", "Social & Cultural Studies"], "summary": "John Ross has been living in the old colonial quarter of Mexico City for the last three decades, a rebel journalist covering Mexico and the region from the bottom up. He is filled with a gnawing sense that his beloved Mexico City’s days as the most gargantuan, chaotic, crime-ridden, toxically contaminated urban stain in the western world are doomed, and the monster he has grown to know and love through a quarter century of reporting on its foibles and tragedies and blight will be globalized into one more McCity.\r\n\r\nEl Monstruo is a defense of place and the history of that place. No one has told the gritty, vibrant histories of this city of 23 million faceless souls from the ground up, listened to the stories of those who have not been crushed, deconstructed the Monstruo’s very monstrousness, and lived to tell its secrets. In El Monstruo, Ross now does.", "asin": "1568584245", "rank": "1433234", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/51aatEH13HL.jpg", "country": "Mexico", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}