{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 422, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "IT'S GREAT READING THIS BOOK IT RELATES TO THE PROBLEMS OF YESTERYEAR. WELL I LIKE IT SO FAR,"}, {"review_sentiment": 5.0, "review_text": "I read the History of Puerto Rico in college. The War Against Puerto Ricans is a very good book. There were many things in this book  that happen in the Puerto Rico Island and to the Puerto Ricans that the book I read in  College left out. It's a very interesting book and a page turner. Each chapter give me different feelings such as sad, angry and watery eyes almost to the point of crying  to read the horrible way Puerto Ricans were treated from the beginning when the US mainland first set foot on our island. We may have a large debt to pay but its not Puerto Ricans fault. We may be part of USA (commonwealth) but we pay double if not triple for mostly everything that is done in Puerto Rico. What we pay for a gallon of milk in NY $3. to $4 in PR its somewhere $5.to $7 and that's the way it is with everything else in Puerto Rico.  I highly recommend this book especially for our young Puerto Rican generations."}, {"review_sentiment": 5.0, "review_text": "Friends said its a good read. Real world facts"}, {"review_sentiment": 4.0, "review_text": "Important reading - most Americans (who are not Puerto Ricans) know nothing about the history of PR"}, {"review_sentiment": 5.0, "review_text": "Well researched and informative, and a good read; let's us see what American's have done, a necessary perspective when our leaders preach to the world about human rights."}, {"review_sentiment": 5.0, "review_text": "'War Against all Puerto Ricans is a must read for all who want to know the real history of the island of Puerto Rico."}, {"review_sentiment": 5.0, "review_text": "Great reading! Great book! I couldn't put this book down. Married into a Puerto Rican family for over 40 years and having visit the Island several times it really interested me to know more about Puerto Rico. I agree with the many other reviews. Just so much \"good stuff\" to say but most importantly is the authors excellent and intriguing writing."}, {"review_sentiment": 5.0, "review_text": "A must read for anyone who wants to understand Latin America and the ubiquitous distrust of the United States. Or, for that matter, for any American who blindly endorses the position of our government."}, {"review_sentiment": 5.0, "review_text": "I read this book in 4 days, literally ripped through it, with vigor and urgency. I couldn't read it fast enough. Not only was it thrilling to read, it was truly enraging because of the actual information it provides. I am half Puerto Rican, a Nuyorican born and bred, I had heard casual versions of some of the history of Puerto Rico from my grandmother, but she was forced to drop out of school in the 6th grade and otherwise we virtually ignored Puerto Rican history altogether in school. I cannot stress enough what an important read, this book is. I know many other Puerto Rican families in New York are disconnected form the history and it can be easy to lose sight of the long-term disenfranchisement the US has been employing towards Puerto Ricans and the diaspora. This book could and should be made into a film for wide release, because although it is a very easy and interesting read, people are lazy and I have only heard people with personal stake in the island talk about this book."}, {"review_sentiment": 5.0, "review_text": "Brilliantly written - an excellent and unrelenting account of our history that all Americans need to know about."}]}, "authors": ["Nelson A Denis"], "isbn": "1568585616", "longitude": 0.0, "periods": ["1900s"], "title": "War Against All Puerto Ricans: Revolution and Terror in America's Colony", "word_cloud": "like history college good many thing happen college leave interesting page turner chapter give different feeling sad angry watery eye almost cry horrible way treat begin mainland first set foot island large debt pay fault part commonwealth pay double triple mostly everything do gallon milk somewhere way everything else highly recommend especially young rican generation friend say good world fact important reading know nothing history well research informative good american do necessary perspective leader preach world human right know real history island great read family year visit several time really interested know agree many review just much good stuff say importantly author excellent intrigue writing anyone want understand ubiquitous distrust matter american blindly endorse position government day literally rip vigor urgency fast enough not thrill truly enrage actual information provide half rican born breed hear casual version history grandmother force drop school grade otherwise virtually ignore rican history altogether school stress enough important know many family disconnect form history easy lose sight disenfranchisement employ towards diaspora film wide release easy interesting people lazy hear people personal stake island talk brilliantly write excellent unrelenting account history need", "genres": ["History"], "summary": "In 1950, after over fifty years of military occupation and colonial rule, the Nationalist Party of Puerto Rico staged an unsuccessful armed insurrection against the United States. Violence swept through the island: assassins were sent to kill President Harry Truman, gunfights roared in eight towns, police stations and post offices were burned down. In order to suppress this uprising, the US Army deployed thousands of troops and bombarded two towns, marking the first time in history that the US government bombed its own citizens.\r\n\r\nNelson A. Denis tells this powerful story through the controversial life of Pedro Albizu Campos, who served as the president of the Nationalist Party. A lawyer, chemical engineer, and the first Puerto Rican to graduate from Harvard Law School, Albizu Campos was imprisoned for twenty-five years and died under mysterious circumstances. By tracing his life and death, Denis shows how the journey of Albizu Campos is part of a larger story of Puerto Rico and US colonialism.\r\n\r\nThrough oral histories, personal interviews, eyewitness accounts, congressional testimony, and recently declassified FBI files, War Against All Puerto Ricans tells the story of a forgotten revolution and its context in Puerto Rico’s history, from the US invasion in 1898 to the modern-day struggle for self-determination. Denis provides an unflinching account of the gunfights, prison riots, political intrigue, FBI and CIA covert activity, and mass hysteria that accompanied this tumultuous period in Puerto Rican history.", "asin": "1568585616", "rank": "24058", "city": "Puerto Rico", "image": "https://images-na.ssl-images-amazon.com/images/I/51234Z7-K3L.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}