{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 6, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "What a wonderful way to visit this city. Take this book everywhere w u and you have a thoughtful informed gentleman leading the way thru history. Read while walking the neighborhoods or relaxing at a cafe table."}, {"review_sentiment": 5.0, "review_text": "This is a fascinating book about some of the major locations in the Nation's Capital.  As a resident of 40-plus years, I lerned a lot and now take it with me whenever my wife and I play tourist.  It's dated but what it has is marvelous."}, {"review_sentiment": 4.0, "review_text": "After finding the original volume at a local library, I knew that I needed the updated version for my own.  After it arrived I became inspired to write another update."}, {"review_sentiment": 5.0, "review_text": "The title is misleading: This is not a guide to Washington, but a personal and very subjective guide to the architecture of Washington.  It is really best suited for Washington residents who have lived with these buildings for years, but never taken the time to appreciate their delights or to learn of the fascinating stories behind them.  Applewhite spent his professional life as a bureaucrat at the CIA, across the Potomac from Washington.  But it is clear from the book that his real love was architecture and history.  It is a privilege to be able to share the author's insights about these buildings that he loved -- as well as some that he despised.  The prose is a sheer delight."}, {"review_sentiment": 4.0, "review_text": "Where can you hear the first two notes of 'Swing Low, Sweet Chariot' in Washington? On the Metro, that's where.That's just one of the little tidbits in this gem of a book, which I bought in 1983 just before I came to Washington for a three-month internship. I didn't return until 1999, but I kept the book as a good guide for my visits.Applewhite pulls no punches, disparaging some of the more modern office buildings in the federal part of the city (he's brutal on the Rayburn House Office Building), but giving a wonderfully rich guide to Embassy Row and other areas that not everyone visits.If you want something more than your average travelogue travelguide, get this. It'll help you fall in love with our Nation's Capital. I know it did that for me."}, {"review_sentiment": 4.0, "review_text": "This book was an excellent counterpoint to the usual 2 sentence blurbs in most guidebooks.  Each entry gave a brief historical overview of each building or monument.  I really enjoyed getting background information on  buildings that I see every day.  I thought for a new Washingtonian it is an  excellent way to familiarize oneself with the landscape and for the tourist  it is a more in depth way to get to know the whos and whys of Washington  architecture.  I have found myself refering to the book periodically  whenever I find some new circle or park with an oddball statue or name.  The book is organized by geography so it can also be helpful for any  walking tour of the city.  An excellent reference tool."}]}, "authors": ["E. J. Applewhite"], "isbn": "1568330081", "longitude": -77.0366456, "periods": ["1900s"], "title": "Washington Itself: An Informal Guide to the Capital of the United States", "word_cloud": "wonderful way visit city everywhere w u thoughtful inform gentleman lead way thru history walk neighborhood relax cafe table fascinating major location resident year learn lot wife play date marvelous find original volume local library know need updated version arrive become inspired write update title mislead personal subjective really best suit resident live building year never take time appreciate delight learn fascinate story spend professional life bureaucrat clear real love architecture history privilege able share author insight building love well despise prose sheer delight hear first note low little tidbits gem buy come internship return keep good pull punch disparage modern office building federal part city brutal give wonderfully rich area everyone want something average travelogue travel guide know excellent counterpoint usual sentence blurb guidebooks entry give brief historical overview building monument really enjoy get background information building see day think new washingtonian excellent way landscape tourist depth way get know show architecture find refer periodically find new circle park oddball statue name organize geography also helpful walk tour city excellent reference tool", "genres": ["Guide Books"], "summary": "A witty and delightful tour of D.C.'s notable buildings and neighborhoods circa 1981 by a retired CIA spook. A dry martini of a guide book, brimming with surprising facts and acerbic observations, all suffused with the author's evident affection for the capital city.", "asin": "1568330081", "rank": "1532210", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51otKx8%2BhSL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}