{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 13, "rating": 3.8, "reviews": [{"review_sentiment": 4.0, "review_text": "Another great story from this author."}, {"review_sentiment": 4.0, "review_text": "Rebecca Pawel returns to the war torn 1940's Spain. As in the first novel her forte is the magnificent sense of atmosphere. Fascists against the \"Red\" supporters ( that is basically everybody who isn't fascist). War is slowly spreading in the rest of Europe and in the midst of this nightmare, people trapped without any hope. Ms. Pawel, of course wrote a mystery novel, and she manages to effortlessly solve this convoluted puzzle, without compromising any of the high standards. Talented writer, powerful story."}, {"review_sentiment": 5.0, "review_text": "The Law of Return is a historical mystery based in the Spanish university town of Salamanga. The plot is challenging and Ms. Pawel is able to gain out sympathies for an unlikely hero who happens to work for the Franco government's police force. This is a well written mystery."}, {"review_sentiment": 4.0, "review_text": "as our hero evisits the old homestead in Spain, he complains about his parent's treatment of his wife...who cares anymore?  He is intent on solving a murder of a relative...whose death was...wait////possibly political?  Rebecca P  is a great writer but the characters are not well drawn.  Does the reader have to dislike the family completely?  A small token of affection by the father is granted at the end.  The murder..well  you'll have to wonder? Was it the Communists?  Do they really matter?"}, {"review_sentiment": 2.0, "review_text": "The copy I received is a paperback publisher's advance copy.  The description specified that it was a hardcover copy.  Very bad."}, {"review_sentiment": 5.0, "review_text": "I read and greatly admired Rebecca Pawel's first book, The Death of a Nationalist.  It introduced a world (post-Civil War Spain) and characters (Guardia Tejada and Elena) that were deeply realized and set forth interesting struggles between political and personal views, framed in the context of a crime novel.  The Law of the Return does a great job of reviving this world and these wonderful characters.  At a literary level, it is still well written and deals with the continuing struggles between ideology, personal beliefs and relationships.  In one key way, however, I liked this book more than irs predecessor.  I came to like the two lead characters and care what happened to them, so it was gratifying to see them advance in their love, despite the political barriers that threaten to set them apart.  Call me old-fashioned....It looks like Ms. Pawel has set down her pen for a few years.  I hope she picks it up again.  If she comes back to this storyline that would be great, but even if she doesn't I trust she will find another world to explore."}, {"review_sentiment": 2.0, "review_text": "It really annoys me when authors don't do their research properly. For example, in this book there is Banco Bilbao Vizcaya. BBV was the fusion of Banco Bilbao with Banco de Vizcaya... and that happened in the 80's. The name Batista, Spanish version, is always spelled with one T, not two. And the list goes on. It might be very petty, but I find that these errors detract from an otherwise well researched story, with an interesting plot, and interesting characters."}, {"review_sentiment": 5.0, "review_text": "Pawel's second novel about post-civil war Spain is, in my view, as good as the first, which was excellent.  It's a good story with appealing characters and a fresh setting.  One of the things I like best, though, is that her hero isn't really heroic, nor is he simply a charming rogue.  He's a decent man who isn't always decent, and that's a kind of complexity that many mystery writers seem to avoid.  Pawel handles it well, though, and gives us a better novel than the average we're offered."}, {"review_sentiment": 4.0, "review_text": "This is a period of history about which I know very little.  Pawel is an excellent writer and has created an interesting, intelligent and complex character in Tejada.  On one hand, he will use force if he feels it is \"necessary,\" and yet he is a good man caught in a time of political loyalties.  They story is not as gripping as \"Death of a Nationalist,\" which I highly recommend and would read first, but is more of a mystery and suspense set during a time of political turmoil.  I was completely caught up by the story and found it a straight-through, four-hour read.  Highly recommended."}, {"review_sentiment": 5.0, "review_text": "Carlos Tejada Alonso y Léon, who was introduced to readers in Rebecca Pawel's Edgar Award-winning novel \"Death of A Nationalist,\" has recently been promoted to the rank of lieutenant in the Guardia Civil and transferred from Madrid to Salamanca, a city famous for its university. Tejada studied law here before joining the Guardia during the Civil War. He is just past thirty years-old - certainly very young to be a lieutenant. However, Tejada's entire profile is unusual for a National Guardsman. He is the second son of a wealthy landowner, a conservative, and a staunch Nationalist. A Falangist, he backed Franco from the beginning. Now he enforces the laws and policies of the Generalissimo's authoritarian government, and searches for \"enemies of the state,\" usually Republicans, who are jailed, sometimes tortured, and frequently killed. Tejada is basically a decent man, a hero of the siege of Toledo - and while I am certainly not an apologist for Fascism, (on the contrary), there must have been some good people who fought and believed in the Nationalist cause, even if they were on the wrong side of history.I wrote in my review of \"Death of a Nationalist,\" that author Rebecca C. Pawel presents the reader with a very interesting dilemma. How does one empathize with a protagonist who is a member of the Fascist cause, one of the victors in Spain's bitter, bloody Civil War? How does one embrace, in a literary fashion, someone who works to enforce Fascist policies? This continues to be an issue in \"Law of Return,\" although personally, I resolved my problems with Tejada in the last book. I find too many admirable qualities in him to pass over because of his politics - which I am definitely not in agreement with. I accept him for the man he is, and for the man he has the potential to become.It is 1940, and although the Civil War has been over for a year, fear, paranoia, hunger and shortages are everywhere. One of Tejada's new responsibilities in Salamanca is overseeing local parolees who must report to him weekly. There are approximately seventy-five, and many are considered troublemakers because of their Socialist leanings and/or former affiliations. Of particular interest are a group of four, all former university professors called \"the petitioners.\"These men are labeled \"petitioners\" because of a historical incident which occurred on October 12, 1936, at a public ceremony at the University of Salamanca commemorating Dia de la Raza. Keynote speaker, Falangist General Millan de Astray finished his address with the slogan, \"Viva la Muerte!\" (\"Long Live Death!\"). Miguel de Unamuno, a great Spanish author, educator, humanist and philosopher, was standing next to the general on the platform. He said, \"Vencera pero no convencera.\"). (\"You will win but you will not convince\"). Enraged, Millan had to be physically restrained from striking Unamuno, who was  immediately removed from his position at the university and placed under house arrest. He died two months later. Ironically, Unamuno was a devout Catholic and accepted by the Falangists. He had misinterpreted Franco's cause, however, thinking it represented nationalism. Manuel Arroyo, Guillermo Fernandez , Tomas Rivera, and Arturo Velasquez are fictional characters who, as professors, circulated and signed a petition protesting the treatment of their colleague.There are times when I so dislike our protagonist, even though I understand his reasoning. This is due to the author's extraordinary talent in developing complex, true-to-life characters. She is also on-target when portraying the political conflict of the period. Tejada, when interviewing Dr. Rivera, thinks, \"You were a damn fool to meddle in what didn't concern you.\" (Because Rivera signed the petition knowing there would probably be retribution). Yet one knows, from reading about him, that Tejada would never just obey orders or keep silent when faced with what he believed to be injustice. Carlos Tejado is  an anti-hero, struggling with his personal political beliefs, his firmly entrenched dedication to justice and the law, and the grim post-war situation he finds himself in. He begins to understand that in the tonal scale of life, the differences between right and wrong are more subtle and variegated than black and white.When one of the petitioners disappears, Tejado's investigation takes him to the seaside resort of San Sebastian, and then on to Nazi occupied France. On this trip he comes into contact, once again, with the lovely schoolteacher he met in Madrid, Elena Fernandez. She had been dismissed from her job because of her leftist politics, and returned home to Salamanca to be with her parents. However, this is not Tejada's first post-Madrid encounter with Elena. Her father is Guillermo Fernandez, a distinguished Classics professor. He is also one of the \"petitioners\" and a parolee. When Elena accompanied him to one of the weekly meetings, she and Tejada saw each other. The growing relationship between these two greatly enriches the narrative. Their mutual attraction, affection and respect, along with their opposing political viewpoints, makes for a good match and an interesting read. Both Elena and Carlos are extremely bright and literate people which provides a strong base of commonality. It helps that she is clever at figuring out mysteries too.There is an important and moving side story here. Professor Joseph Meyer, a German-Jewish friend and colleague of Professor Fernandez, writes begging for help to cross into Spain from France before he is forcibly repatriated to Germany and sent to a concentration camp. The Fernandez family's humanity, as individuals and as a unit, is emphasized here considering the risk they are willing to take for an outsider.\"Law of Return\" is just plain fascinating. Its originality is refreshing and the taut, well written prose is far different from what is found in many formulaic crime novels on today's market. This is much more than a mystery, however. It is historical fiction at its best. Ms. Pawel paints a vivid portrait of post-war Spain, whose people are trying to come to grips with past horrors and return to some semblance of normalcy. The author's descriptions of the humiliation, defeat and isolation of those who did not support Franco's cause is palpable.I highly recommend \"Law of Return,\" and suggest reading \"Death of a Nationalist\" first for maximum enjoyment. Both books stand on their own, however, without any prequel. I am about to begin the third novel in the series, \"The Watcher In The Pine,\" and can't wait to get started.JANA"}]}, "authors": ["Rebecca Pawel"], "isbn": "1569473439", "longitude": 0.0, "periods": ["1900s"], "title": "Law of Return", "word_cloud": "great story author return war torn first forte magnificent sense atmosphere fascist supporter basically everybody fascist slowly spread rest midst nightmare people trap hope course write mystery manages effortlessly solve convolute puzzle compromise high standard talented writer powerful story historical mystery base spanish university town plot challenge able gain sympathy unlikely hero happen work government police force well write mystery hero visit old homestead complain parent treatment wife care anymore intent solve murder relative death political great writer character well drawn family completely small token affection father grant wonder really copy receive paperback publisher advance copy description specify hardcover copy very bad greatly admire first introduce world character deeply realize set interesting struggle political personal view frame context crime great job revive world wonderful character literary level still well write deal continue struggle ideology personal belief relationship key way however like irs predecessor come lead character care happen gratify see advance political barrier threaten set apart look set pen year hope pick come back story line great even trust world explore really annoy author research properly example fusion happen name version always spell list go find error detract otherwise well researched story interest plot interesting character second war view good first excellent good story appeal character fresh set thing like best hero really heroic simply charm rogue decent man always decent kind complexity many mystery writer seem avoid handle well give better average offer period history know little excellent writer create interesting intelligent complex character hand use force feel necessary yet good man catch time political loyalty story grip highly mystery suspense set time political turmoil completely catch story find recommend introduce reader recently promote rank lieutenant transfer city famous university study join past thirty certainly young lieutenant however entire profile unusual second son wealthy landowner conservative staunch back begin now enforce law policy authoritarian government search enemy state usually jailed sometimes torture frequently kill basically decent man hero siege certainly apologist contrary good people fight believe cause even wrong side write review author present interesting empathize protagonist member cause victor bitter bloody embrace literary fashion someone work enforce policy continue issue personally resolve problem last find many admirable quality pass politics definitely agreement accept man man potential year fear hunger shortage everywhere new responsibility oversee local parolee approximately many consider troublemaker leaning former affiliation particular interest group former university professor call petitioner men label petitioner historical incident occur public ceremony commemorate speaker finish address slogan la great spanish author educator humanist stand next general platform say pore win physically restrain strike immediately remove position university place house arrest die month later accept falangist misinterpret cause however think represent nationalism fictional character professor circulate signed petition protesting treatment time dislike protagonist even understand reason due author extraordinary talent develop complex character also portray political conflict period interview think damn fool meddle concern sign petition know probably yet know read never order silent face believe injustice struggle personal political belief firmly entrench dedication justice grim situation find begin understand tonal scale life difference right wrong subtle variegated black petitioner disappear investigation take seaside resort occupy trip come contact lovely schoolteacher meet dismiss job leftist politics return home parent however first encounter father distinguish professor also petitioner parolee accompany weekly meeting saw grow relationship greatly enriches narrative mutual attraction affection respect oppose political viewpoint make good match interest extremely bright literate people provide strong base commonality help clever figure mystery important move side story friend colleague write beg forcibly repatriate send concentration camp family humanity individual unit emphasize consider risk willing outsider plain fascinate originality refreshing taut well write prose far different find many formulaic crime novel today market much mystery however historical fiction best patel paint vivid portrait people try come grip horror semblance author description humiliation defeat isolation support cause highly recommend suggest read first maximum enjoyment stand however prequel begin third series", "genres": ["Fiction & Literature", "Historical Fiction", "WWII", "Spanish Civil War"], "summary": "Spain, 1940: Lieutenant Carlos Tejada has been transferred to Salamanca, where he studied law before the Civil War. His new duties include monitoring parolees—former professors who were fired for protesting a Franco decree. \r\n\r\nElena Fernandez, having lost her job because of her political leanings, has returned home to Salamanca from Madrid, where she and Tejada were first romantically involved. Her father, one of the parolees, was a distinguished professor of Classics. He has just received a letter from a Jewish friend, Professor Joseph Meyer, begging for help to cross into Spain from France before he is forcibly repatriated to Germany. \r\n\r\nProfessor Fernandez cannot violate his parole by traveling to the border town of San Sebastian, so Elena goes in his stead. Tejada, tracing a missing parolee, also finds himself there, and their paths fatefully cross again.", "asin": "1569473439", "rank": "2085703", "city": "Salamanca", "image": "https://images-na.ssl-images-amazon.com/images/I/41mhffxN89L.jpg", "country": "San Sebastian", "story_arc": ["Tragedy", "Things only get worse"]}