{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 29, "rating": 3.8, "reviews": [{"review_sentiment": 4.0, "review_text": "What I LikedThe history. I have read my fare share of fiction and nonfiction set during or around World War II, but all of it thus far has been focused on Germany, France, England, the U.S., Japan and Poland. This was my first foray into a circa World War II novel that was set in Francoist Spain immediately following the Spanish Civil War. It was so interesting to learn more about the nature of the Spanish Civil War conflict by getting to know characters who were regular citizens and essentially pawns within this larger historical shift. It’s obvious, given the near-fascist nature of Franco’s supporters, that the reader is more drawn to feel for the anti-Francoist secondary characters Gonzalo, Carmen, Aleja and Elena, suffering with them through hunger, fear and despair. The author does a really skillful job, however, at also humanizing the pro-Franco characters in the book, like sergeant Tejada and the other members of the Guardia Civil, who show moments of reflection on their beliefs that demonstrate they’re in some ways just as trapped within the currents of history as their counterparts.The flawed primary character. The main character in this crime mystery is a member of the Guardia Civil, which still exists in Spain and is the oldest law enforcement agency in the country. After the Spanish Civil War, the Guardia Civil came under the control of Franco’s government, and therefore its members were all picked from loyalists to the his regime. Our ‘hero’, Carlos Tejada Alonso y Leon, is a sergeant in the Guardia Civil and fought on Franco’s side during the civil war. Often, in detective novels like these, the investigator at the center of the novel is depicted as having rigid morals and superhuman sleuthing skills, which in my opinion caricatures and dehumanizes them. Tejada, on the other hand, is not only starting off his relationship with the reader on the moral low ground (being a Francoist), but also makes one mistake after the other in his investigation. I loved that he was a fully developed and humanly flawed person who the reader can see morph during the narrative, with the promise that his character progression may continue in the next 3 installments of the series.The writing. Another drawback that often makes me avoid classic detective novels like this one is that often the quality of the writing takes a back seat to the action or suspense of the plot. It was actually the reverse in this novel. The plot, to be honest, is far from elaborate, and for the most part the reader will not be hugely surprised by plot twists. The writing, on the other hand, is at the level of really good literary fiction. Pawel knows how to construct a beautiful descriptive sentence, whether what she’s describing is a plaza in Madrid, the feelings of a character experiencing a trauma (see the quote included in the cover image for this post), or a spectacle of brutal violence. The fact that the writing was excellent, that there was plenty of character development in the novel, and that I was experiencing a part of history through a fictional lens that I never had before, made me more than satisfied with the somewhat simplistic plot.What I Didn’t LikeI wanted even more history. As I mentioned above, Pawel has her readers experience the history in which this novel is set through the eyes and actions of her characters. Because all her characters are regular people, caught within this historical maelstrom, Pawel barely touches on the broader ideologies and historical events that surround the narrative. While the reader learns about the famine experienced by regular people in Spain during this time, the curfews, the casual violence and the discrimination, there could have been more about the Civil War as a whole to set the scene for the characters’ lives. I think other authors I’ve read have done a better job of not only covering the mundane and personal to their characters but also delving into that broader backdrop throughout their novels to give their readers a stronger footing from which to experience the narrative.Final VerdictThoroughly enjoyable crime mystery through which you’ll learn about the Spanish Civil War and Francoist Spain, that will keep you wondering about what sergeant Tejada will get up to in the next novel."}, {"review_sentiment": 4.0, "review_text": "I enjoyed the way this story was written and the way the characters individual stories intertwined."}, {"review_sentiment": 4.0, "review_text": "Being of Spanish extraction, I recall the husband of my mother's sister who was an old style Guardia officer and I find parts of him in the description of the various Guardias populating the novel. Contrary to the latter day Guardia corps which stand in rather high regard, the old guard was often reviled the general population especially in the region of Spain where I come from and an novel centralizing on one of them is a daring idea."}, {"review_sentiment": 5.0, "review_text": "This was an introduction to a time period I knew nothing about, and a friend recommended it before I went on a trip to Spain.  I looked at Spain in a whole new light after reading of the way life was during their civil war in the 1930s.  This book id the first of a series, and against the backdrop of mysteries, gives a good portrayal of the fear and dissension of the time.  The other ones are all set in different Spanish cities and they are all very good at painting a picture of a very different Spain than today's Spain--but only a generation or two ago it was very different."}, {"review_sentiment": 3.0, "review_text": "Rebecca Pawel did her homework thoroughly for her first crime novel set in Spain at the end of the Civil War.  The detail she provides of Madrid at that time and the experiences of the defeated Republicans is fascinating.  This to my mind made more interesting reading than the story of the crime which is quite heavy going.  As a first effort \"Death of a Nationalist\" is perfectly acceptable and I look forward to the rest of the series."}, {"review_sentiment": 4.0, "review_text": "Setting her novel in 1939, in the immediate aftermath of the Spanish Civil War, author Rebecca C. Pawel carefully recreates many of the elements which led to that civil war and which continued during the partisan turmoil after that.  Sometimes described by Republicans as \"a war between tyranny and democracy,\" and by Nationalists as \"a war between Communists, anarchists, and `Red Hordes' against civilization,\" the Spanish Civil War (1936 - 1939) attracted extremists on both sides, and both sides committed atrocities against their fellow citizens.  After the war, Gen. Francico Franco sets up the Guardia Civil, not the army, to police the cities.The novel opens unobtrusively in Madrid with Maria Alejandra \"Aleja\" Palomino, age seven, hurrying home from school through her Republican neighborhood.  She sees a guardia acting anxious, and soon afterward she hears shots.  Hiding in terror, she later hears another guardia passing her hiding place, and when she eventually races for home, she discovers the first guardia lying dead. Terrified she drops one of her school notebooks.  Since Aleja's Republican neighbors would not be likely to report a dead guardia immediately, her aunt, Tia Viviana, hurries out to retrieve the Aleja's missing book - paper is valuable and hard to get.  She is caught picking it up, however, by two guardia, and when questioned, she denies any involvement, insisting she came only for a child's notebook.  The guardia kill her anyway, thereby setting the scene for the action to follow.Because the action, the motivations, and the shifting allegiances are complex here, the author wisely keeps her narrative style simple, moving the action along on the strength of her characters, who are memorable despite the fact that they are somewhat superficial. Sgt. Carlos Tejada Alonso y Leon, a mid-level gardia, is widely honored by his fellow officers, but he often behaves in ways which will be repugnant to readers. The murdered guardia was his best friend, Francisco Lopez Perez, a man with whom he had lost touch during the war and whose body he had to identify on the street. He is determined to catch the murderer.  The novel alternates between Tejada's point of view and that of Gonzalo Llorente, the lover of Viviana and brother of Carmen, the child Alexa's mother.  Gonzalo, a Republican, was one of the few to have survived a series of Nationalist executions which killed most of his fellow soldiers, and he is bent on revenge, not only for the loss of Viviana but for those earlier killings, too.All the elements come together in a satisfying conclusion, though it is a different kind of satisfaction since one does not really relate to the main characters.  A surprise twist provides a sense that not everyone may be as cruel at heart as it appears from the action, though this is also a way for the author to create some much-needed empathy in a book that is otherwise almost devoid of it. Realistic and filled with the kind of details that only someone who has studied all aspects of this war would know, the novel is both a good mystery and an especially readable depiction of an otherwise confusing time of history, a nonstop story in which no one is a real hero."}, {"review_sentiment": 3.0, "review_text": "interesting book - strangely not as good as the 2nd in the series which I read first!  Will look for the other now."}, {"review_sentiment": 5.0, "review_text": "This book is a great read.  Very well written and set during Franco's Spain.  It is hard to believe that this was not that long ago.  I am looking forward to reading more books by Rebecca Pawel."}, {"review_sentiment": 2.0, "review_text": "The Spanish Civil War has always been an interest of mine, and I looked forward to reading this novel. But I found it a major disappointment, with a disjointed narrative and poorly-drawn characters whose motives are inexplicable. Sergeant Tejada is one of the silliest characters ever put on paper. One moment he's a hard-core Guardia Civile who shoots an unarmed woman in the head, no questions asked, the next he's in love with a Communist teacher and protective of her student. Implausible, incomprehensible, and unsatisfying."}, {"review_sentiment": 4.0, "review_text": "Pawel paints a vivid picture of 1940 Madrid, just after the Spanish Civil War.  She gets inside all her characters, republicans and her Fascist main character, who is basically a good man, although he thinks nothing of beating up suspects.  I know. Sounds strange, but Pawel is truly able to place herself in the time and understand what made those Spaniards do what they did."}]}, "authors": ["Rebecca Pawel"], "isbn": "1569473447", "longitude": -3.7035825, "periods": ["1900s"], "title": "Death of a Nationalist", "word_cloud": "liked the history fare share fiction nonfiction set thus far focused first foray circa set immediately follow spanish interest learn nature spanish conflict get know character regular citizen essentially pawn larger historical shift obvious give nature supporter draw secondary character suffer hunger fear despair author really skillful job however also humanize character sergeant member show moment reflection belief demonstrate way trap current history flaw primary character main character crime mystery member still exist oldest law enforcement agency country spanish come control government therefore member pick loyalist regime hero sergeant fight side civil war detective novel investigator center depict rigid moral superhuman sleuth skill opinion caricature dehumanize hand start relationship moral low ground also make mistake investigation love fully develop humanly flaw person see morph narrative promise character progression next installment write drawback often make avoid classic detective novel often quality write take back seat action suspense plot actually reverse plot honest far elaborate part hugely surprise plot twist write hand level really good literary fiction know construct beautiful descriptive sentence describe plaza feeling character experience trauma see quote include cover image post spectacle brutal violence fact write excellent plenty character development experience part history fictional lens never make satisfied somewhat simplistic dido want even history mention reader experience history set eye action character character regular people catch historical maelstrom barely touch broader ideology historical event surround narrative learns famine experienced regular people time curfew casual violence discrimination whole set scene character live think author do better job cover mundane personal character also delve broader backdrop novel give reader stronger foot experience enjoyable crime mystery learn spanish wonder sergeant get next enjoy way story write way character individual story intertwine be spanish extraction recall husband mother sister old style officer find part description various populate contrary latter day corp stand rather high regard old guard often revile general population especially region come centralize daring idea introduction time period know nothing friend recommend go trip look whole new light read way life civil war id first series backdrop mystery give good portrayal fear dissension time one set different spanish city good painting picture different today generation different homework thoroughly first crime set end detail provide madrid time experience defeat fascinate mind make interesting reading story crime quite heavy go first effort perfectly acceptable look forward rest series set immediate aftermath author carefully recreate many element lead civil war continue partisan turmoil sometimes described war tyranny democracy war anarchists civilization attract extremist side side committed atrocity fellow citizen war set army police open unobtrusively madrid age hurrying home school neighborhood see guardian act anxious soon afterward hear shot hide terror later hear guardian pass hide place eventually race home discovers first guardian lie dead drop school notebook neighbor likely dead guardian immediately aunt hurry retrieve miss paper valuable hard get catch pick however guardian question denies involvement insist come child guardian anyway thereby set scene action action motivation shift allegiance complex author wisely keep narrative style simple move action strength character memorable fact somewhat superficial gardenia widely honor fellow officer often behave way repugnant reader murdered guardian best friend man lose touch war body identify street determine murderer alternate point view lover brother child mother survive series execution kill fellow soldier bent revenge loss earlier killing element come together satisfying conclusion different kind satisfaction really main character surprise twist provide sense everyone heart appear action also way author create empathy otherwise almost devoid fill kind detail someone study aspect war good mystery especially readable depiction otherwise confusing time history nonstop story real hero interest strangely good series first great very well write set hard believe long ago look forward read spanish always interest mine look forward read find major disappointment disjoint narrative character motif inexplicable silliest character ever put paper moment shoot unarm woman head question ask next love teacher protective student incomprehensible unsatisfying paint vivid picture get inside character republicans fascist main character basically good man think nothing beating suspect know sound strange truly able place time understand make spaniard", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "WWII", "Spanish Civil War"], "summary": "Madrid 1939. Carlos Tejada Alonso y León is a Sergeant in the Guardia Civil, a rank rare for a man not yet thirty, but Tejada is an unusual recruit. The bitter civil war between the Nationalists and the Republicans has interrupted his legal studies in Salamanca. Second son of a conservative Southern family of landowners, he is an enthusiast for the Catholic Franquista cause, a dedicated, and now triumphant, Nationalist.\r\n\r\nThis war has drawn international attention. In a dress rehearsal for World War II, fascists support the Nationalists, while communists have come to the aid of the Republicans. Atrocities have devastated both sides. It is at this moment, when the Republicans have surrendered, and the Guardia Civil has begun to impose order in the ruins of Madrid, that Tejada finds the body of his best friend, a hero of the siege of Toledo, shot to death on a street named Amor de Dios. Naturally, a Red is suspected. And it is easy for Tejada to assume that the woman caught kneeling over the body is the killer. But when his doubts are aroused, he cannot help seeking justice.", "asin": "1569473447", "rank": "1082259", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/51bFNj0EEtL.jpg", "country": "Spain", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}