{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 6, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "I love this kind of story."}, {"review_sentiment": 3.0, "review_text": "I thought I would love this book, but I remained somewhat disappointed after I finished it. If you're thirsty for Guadeloupean literature, Windward Heights is a novel that will quench it. I wanted to read a book rich in French Caribbean culture, and, in that sense, Windward Heights was a satisfying read.Windward Heights is a Caribbean retelling of Wuthering Heights. However, while the novel is rich in Guadeloupean culture and history, the main plot offers no surprises if you're familiar with Emily Brönte's novel.I think an issue with this novel is that it is too ambitious. Not only is the story of Razyé and Cathy, but also the story of Guadeloupe. It is definitely interesting to learn about all those facts, but I wish the only focus had been the story of Razyé and Cathy. There are too many characters in the book, whose only purpose is to give context to the novel, and, by the middle of the book, this becomes a bit tiresome, regardless of the interesting facts they have to tell. Simone Schwarz-Bart's novel \"The Bridge of Beyond\" is more effective in telling a story through the history of Guadeloupe.Finally, dialogues are scarce, which makes the novel almost 350 pages of narration. Don't get me wrong, Maryse Condé uses beautiful language and it never feels like reading a history book, but I am not fond of so much narration.Again, Windward Heights is a novel worth reading, but I prefer \"Crossing the Mangrove\", also by Maryse Condé, which keeps you guessing and in suspense from beginning to end, and it's also set in Guadeloupe."}, {"review_sentiment": 5.0, "review_text": "Wuthering heights is like a black version of Wuthering Heights. The love story is between Cathy and Rayze. Rayze is a guy Cathy's father brought off the street to work for him. The two fall in love, but it can never work because Cathy is white, and Rayze is black. When Rayze leaves, and then return Cathy is married to another guy which runs Rayze crazy. This novel is told through the eyes of the people Cathy and Rayze comes in contact with, each chapter is written like a short story. I wasen't expecting Cathy's tradegy to take place so early in the book, I ithrought her and Rayze would have more time together once he returned.  Rayze considered Cathy his soul, he was always trying to find a voodoo doctor to bring her back alive. I felt so bad for him, he love Cathy her so much. Rayze never get's over her death, and end up treating everybody in his life bad, his wife, kids.  The book was good, and sad."}, {"review_sentiment": 5.0, "review_text": "I love Conde's books, and if you like the lazy, almost nostalgic style of so many of the South American and Caribbean writers you will no doubt find this book a great read.The characters are at once powerful and vulnerable - the women are especially fascinating in that they breathe sexuality yet appear within the rigid confines of the society of the day.The book is a 'remake' of Wuthering Heights, but don't let that put you off - it manages to deftly weave the original with Conde's own unique blend of interests and concerns - race, social injustice and hypocrisy. As modern as it is classic."}, {"review_sentiment": 5.0, "review_text": "The passionate tragedy created by different social classes in WUTHERING HEIGHTS is hard to comprehend in contemporary USA.  In WINDWARD HEIGHTS Conde renews the emotional reaction by changing classes to skin color in a  19th century Caribbean setting.Conde following the Bronte storyline  closely which means a plethora of characters with confusing relationships,  the only weakness in the novel.The sickness of spirit that results  when a child is not loved or accepted by the society in which he or she  lives is dangerous to all of society.  In Conde's version the Heathcliff  character wreaks havoc on the region, not just family members.WUTHERING HEIGHTS was never the romance portrayed by Merle Oberson &  Laurence Olivier, it is a story of obsession and revenge.  Conde's version  is beautifully written and seems more up-to-date.Bronte fans will enjoy  comparing the original to WINDWARD HEIGHTS & Alice Hoffman's version in  HERE ON EARTH."}, {"review_sentiment": 5.0, "review_text": "With or without having read Wuthering Heights, I would have enjoyed this book.  Vivid details, compelling situations and themes.  She recreated the souls of Heathcliff and Cathy (and others), yet they belonged entirely to  Guadaloupe.  The ways Windward Heights was like and unlike WH were  welcome.  Conde never compromised her storytelling for the sake of the  idea--a retold WH.  As good as Crossing the Mangrove.  The cultural  portrait is a gift.  Must reading for anyone who loves WH--or good novels."}]}, "authors": ["Maryse Conde"], "isbn": "1569472165", "longitude": 0.0, "periods": ["1800s"], "title": "Windward Heights", "word_cloud": "love kind story think remain somewhat disappointed finish thirsty literature quench want rich french culture sense satisfy retell however rich guadeloupe an culture history main plot offer surprise familiar emily think issue ambitious not story also story definitely interest learn fact wish focus story many character purpose give context middle become bit tiresome regardless interesting fact tell effective tell story history dialogue scarce make almost page narration wrong use beautiful language never feel read history fond much read prefer cross also keep guess suspense begin end also set wither black version love story guy father bring street work fall love never work white black leave return marry guy run crazy tell eye people come contact chapter write short story wase expect tragedy take place early ithrought time together return consider soul always try voodoo doctor bring back alive felt bad much never get death end treat everybody life bad wife kid good sad love lazy almost nostalgic style many american writer doubt great character powerful vulnerable woman especially fascinate breathe sexuality yet appear rigid confines society let put manages deftly weave original unique blend interest concern race social injustice hypocrisy modern classic passionate tragedy create different social class hard comprehend contemporary renew emotional reaction change class skin color century follow story line closely mean plethora character confuse relationship weakness sickness spirit result child love accepted society live dangerous society version character wreaks havoc region family never romance portray story obsession revenge version beautifully write seem fan compare original version wither detail compel situation theme recreate soul others yet belong entirely way welcome never compromise storytelling sake idea retold good cultural portrait gift read anyone love good novel", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Prizewinning writer Maryse Condé reimagines Emily Brontë's passionate novel as a tale of obsessive love between the \"African\" Razyé and Cathy, the mulatto daughter of the man who takes Razyé in and raises him, but whose treatment goads him into rebellious flight. Retaining the emotional power of the original, Condé shows the Caribbean society in the wake of emancipation.", "asin": "1569472165", "rank": "955972", "city": "Guadeloupe", "image": "https://images-na.ssl-images-amazon.com/images/I/51p6ucNE3gL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}