{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 684, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Very readable, funny but also an in-depth look at relationships :)  I really enjoyed the book AND the movie!!"}, {"review_sentiment": 5.0, "review_text": "good price"}, {"review_sentiment": 5.0, "review_text": "Still a great book, and not a bit dated, after all these years, although Rob's record story undoubtedly would have closed by now anyway. Not sure how he makes these characters sympathetic, but he does."}, {"review_sentiment": 5.0, "review_text": "Great novel and so nice to read it like you are traveling"}, {"review_sentiment": 2.0, "review_text": "Unfortunately, for me, this boom did not pass the litmus test of time: there were a handful of genuinely funny bits, but the unceasing self-absorption & stream of consciousness musings of a neurotic (if self aware) white male read stale to a 21st century reader. Maybe it's that others have greatly improved upon the trope Hornby plays off, maybe it was boredom after all the whininess of the main character, but this book was one I was glad to be finished with."}, {"review_sentiment": 5.0, "review_text": "Easy summer read, entertaining"}, {"review_sentiment": 5.0, "review_text": "Witty writing. Prose that pops. Quirky characters. Mr. Hornsby is a talented storyteller and wordsmith. Rob Fleming is the most annoying, and yet endearing, main character I have ever encountered."}, {"review_sentiment": 4.0, "review_text": "High Fidelity is a funny book, though at times not enjoyable.  In a nutshell, this is the story of a man-child who is lazy, romantic and pathetic - not only in his love life but also his larger life.  The romance is entirely self-directed, which is why Rob is such a pathetic character.  It works because it is funny and the author makes you believe that this guy and his sad excuse for a life could actually exist.Rob is thirty-five going on twenty.  His is a character that one feels flashes of sympathy for, but not as often as one wants to kick him in the rear and tell him to grow up and get a life that exists at least some of the time out of his head.  (I read this long after seeing the movie and I must say that John Cusack does a brilliant job of bringing Rob to life on the big screen).Rob's existential crisis revolves around women and his inability to sustain a good relationship.  They always leave him (for the most part) and he has no clue that this is just how some relationships end or that he is usually the author of his own rejection.  The book revolves around Rob's listing of his five most searing break-ups and his attempt to reconnect with his former flings to answer the question \"why?\"  The larger story is Rob himself and the departure of Laura, the most significant love of his life who has just moved out after sharing a flat (this takes place in London) with him for years.  Rob's day job, a fantasy small business where he indulges his preoccupation with pop music and a snobbish world view driven by other's appreciation of the \"right\" or \"wrong\" songs, is as much of a disaster as his love life.Nick Hornby mines both lives for a lot of laughs.  His writing is funny and descriptive and one gets to know Rob well (though one does not like Rob at all).  This book had a lot of laugh out loud moments.  I suspect there might be a little bit of Rob in a lot of guys - though I think maturity and living help stamp out the narcissism and utter self-absorption in those of us who go on to enjoy at least a modest success in our romantic and other lives.  There is a lot to be said for growing up and learning - one is unsure if Rob will really embrace those concepts while reading this enjoyable book."}, {"review_sentiment": 2.0, "review_text": "Rob’s life is almost as erratic as his failed relationships - from the one with his mother, to his long list of girlfriends, to his high tolerance of his downright rude employees/friends at his vinyl record shop. The incident where one of them chases a customer out of the shop simply for asking for a record he considers in bad taste would be funny if it weren’t so intolerant.Rob falls in and out of love at equal speed and his conquests usually desert him rather than the other way around, leaving him constantly pitying himself. He is one mixed up person.The author’s ‘stream of consciousness’ writing style made it difficult to follow the threads of the plot, but as a movie was based on the book, I can’t help feeling I must have missed something important.I rate it 2,5 stars."}, {"review_sentiment": 4.0, "review_text": "For most people I think that the beginning of the book would probably bounce around to much for them. I think it is a great book, but one you would only read once."}]}, "authors": ["Nick Hornby"], "isbn": "1573225517", "longitude": -0.12574, "periods": ["1900s"], "title": "High Fidelity", "word_cloud": "very readable funny also look relationship really enjoy movie good price still great bit dated year record story undoubtedly close anyway not sure make character sympathetic nice travel unfortunately boom pas litmus test time handful genuinely funny bit unceasing stream consciousness musing neurotic self aware white male stale century others greatly improve trope play maybe boredom shininess main character glad finish easy summer entertain write pop character talented storyteller wordsmith annoy yet endear main character ever encounter funny time enjoyable nutshell story lazy romantic pathetic love life also larger life romance entirely pathetic character work funny author make believe guy sad excuse life actually go character feel flash sympathy often want kick rear tell life exists least time head long see movie brilliant job bring life big screen existential crisis revolves woman inability sustain good relationship always leave part clue relationship end usually author rejection revolves list sear attempt former fling answer question larger story departure significant love life move share flat take place year day job fantasy small business indulges preoccupation pop music snobbish world view drive appreciation right wrong song much disaster love mine life lot laugh write funny descriptive get know well lot loud moment suspect little bit lot guy think maturity living help narcissism utter go enjoy least modest success romantic live lot say grow learn unsure really embrace concept read enjoyable life almost erratic fail relationship mother long list girlfriend tolerance downright rude vinyl record shop incident chase customer shop simply ask record considers bad taste fall equal speed conquest usually desert rather way leave constantly pity mixed author stream consciousness write style make difficult follow thread plot movie base help feel miss something rate star people think begin probably around much think great", "genres": ["Fiction & Literature"], "summary": "Rob is a pop music junkie who runs his own semi-failing record store. His girlfriend, Laura, has just left him for the guy upstairs, and Rob is both miserable and relieved. After all, could he have spent his life with someone who has a bad record collection? Rob seeks refuge in the company of the offbeat clerks at his store, who endlessly review their top five films; top five Elvis Costello songs; top five episodes of Cheers. \r\n\r\nRob tries dating a singer, but maybe it’s just that he’s always wanted to sleep with someone who has a record contract. Then he sees Laura again. And Rob begins to think that life with kids, marriage, barbecues, and soft rock CDs might not be so bad. ", "asin": "1573225517", "rank": "26670", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51NblYzurWL.jpg", "country": "England", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}