{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 201, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "Nice book"}, {"review_sentiment": 5.0, "review_text": "Kerouac is a brilliant and energetic writer as we all know.  Any pedestrian description of which I am capable is inadequate against the force and quaking tumult of his life in literature.  The brilliance of Jack’s writing is that it is so alive, so thrilling, never dull, never trite, never slows down, just boils on and on using all the resources of the English language especially the vernacular.  It’s painful, but it’s life.  He’s a genius—a Mozart of the typewriter.But anyway….  I appreciate this tour into the San Francisco beatnik scene that I so much wished I could have been a part of when I was a teenager growing up in New England.  I never quite made it, but I at least get to participate vicariously as an old man through Jack’s books.There is an essay (mostly incoherent) by Allen Ginsberg about Kerouac titled “The Great Rememberer.”  What I don’t understand is if Jack was so drunk all the time how does he remember all of this in such detail and to write about it with all the life, intensity, livingness he gives it?  He can’t be making it all up (can he?).  When I get tipsy, I don’t remember much.  And any thought of documenting my drinking (such as it is—puny compared to Kerouac’s) would makes me feel like retching.  Anyway, it’s not about me.  Kerouac is so real, so alive, so animated, so intimate in his books—On the Road, The Subterraneans, The Dhrama Bums, and Big Sur—that the identification with him becomes strong, almost overpowering, and of course painful.  But this is great literature IMO, and I don’t say that lightly.  I think Big Sur is second only to the monumental On the Road.I read Big Sur in the Library of America edition which is beautifully and dignifiedly produced with many helpful appendixes—a chronology of Jack’s life, a guide to the characters, etc."}, {"review_sentiment": 5.0, "review_text": "This book was definitely not like the other Kerouac books that I've read by him. It was quite dark. It was more \"real\", and I think that is why I enjoyed it probably more than any of his other works. An interesting look into his Psyche after people were expecting him to be something he was not. I've always been curious about how a person's Psychological state is changed by fame- that great, mysterious illusion. A book by a man burned out on life. A harrowing account of Kerouac's decent into disillusionment and alcoholism. It kind of makes you wonder where the hell his friend were that just let him slide into oblivion. Clearly he was surrounded by too much hype and too many Yes people that enabled him."}, {"review_sentiment": 2.0, "review_text": "I guess you had to have been there.  I don't live far from Big Sur now, and I remember liking Kerouac.This book really didn't do it for me though.  You can see the author is in love with his own voice as he tries on different writing styles.His drinking problems seem less interesting to me now that I've seen a few people with them.I think his interest in Buddhism was new and interesting once.  It is nothing new in California now"}, {"review_sentiment": 5.0, "review_text": "its a classic, read it"}, {"review_sentiment": 4.0, "review_text": "I love the edition which looks like a handmade book.  I heard so much about Kerouac.  The author's writing style is just that - sentences run together in what might be considered run-on sentences.  Of course, now days for a classic author (?), it is a matter of writing style.  But I digress, I love handmade quality of the book that matches the writing style of the author.  There, I said it."}, {"review_sentiment": 3.0, "review_text": "My least favorite.  But, if you are a Kerouac fan, which I am, you still have to read it.  Still better writing than most books and has moments, for sure."}, {"review_sentiment": 5.0, "review_text": "A harrowing tale very unlike books like \"The Dharma Bums\" and \"Desolation Angels\" as the path of alcoholism leads Jack to a breakdown; very much worth reading..."}, {"review_sentiment": 5.0, "review_text": "I bought this for summer reading.  Kerouac is always great to read for a nostalgic adventure during an era which I enjoy reading about."}, {"review_sentiment": 4.0, "review_text": "Great book, but not quite as inspiring as Dharma Bums or On The Road. Instead of encountering a young and brilliant author, we are faced with a middle-aged man who is suffering from the fame he has acquired, and has been using alcohol and sex as a means to deal for years. In parts of the book we get the familiar energetic, almost jazzlike, writing that we find in On the Road and other parts the Buddhist infused writting of Dharma Bums, but in other parts we are faced with a much darker side of Kerouac. Parts of the book leaves the reader almost feeling like they too are breifly going insane as Kerouac describes withdrawing from alcohol. The ending then, leaves us wondering what is really to become of Billy and her young son, and the rest of the gang so loyal to Kerouac."}]}, "authors": ["Jack Kerouac"], "isbn": "1573225053", "longitude": 0.0, "periods": ["1900s"], "title": "Desolation Angels", "word_cloud": "nice brilliant energetic writer know pedestrian description capable inadequate force quake tumult life literature brilliance write alive thrilling never dull never trite never slow boil use resource english language especially vernacular painful life appreciate tour scene much wish part teenager grow never quite make least participate vicariously old man essay mostly incoherent title understand drunk time detail write life intensity livingness give make get tipsy remember much think document drinking compare make retch real alive animate intimate identification become strong almost overpower course painful great literature say lightly think big second monumental edition beautifully dignified produce many helpful chronology life guide character etc definitely quite dark real think enjoy probably work interesting look people expect something always curious person state change great mysterious illusion man burn life harrowing account decent disillusionment alcoholism kind make wonder hell let oblivion surround much hype many people enable guess live far big remember like really see author voice try different write drinking problem seem le interesting see people think interest new interest nothing new classic love edition look handmade hear much author write style sentence run together sentence course day classic author matter write style digress love handmade quality match write style author say least favorite fan still still better write moment sure harrowing tale path alcoholism lead breakdown much read buy summer reading always great nostalgic adventure era enjoy read quite inspire instead encounter young brilliant author face man suffer fame acquire use alcohol sex mean deal year part get familiar energetic almost write find part infuse write part face much darker side leave almost feeling briefly go insane describe withdraw end leaf wonder really become young son rest gang loyal", "genres": ["Fiction & Literature"], "summary": "With the publication of On the Road in 1957, Jack Kerouac became at once the spokesman and hero of the Beat Generation. Along with such visionaries as William S. Burroughs, Neal Cassady, and Allen Ginsberg, Kerouac changed the face of American literature, igniting a counterculture revolution that even now, decades later, burns brighter than ever in Desolation Angels.", "asin": "1573225053", "rank": "117237", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41CI9QDY8aL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}