{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 130, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Short story: I laughed out loud, and couldn't stop. Original. Funny. Smart."}, {"review_sentiment": 2.0, "review_text": "Gary Steyngart is an obviously talented writer, as this debut novel proves. He is gifted with words and imagery and phrasing, but it does nothing to save the plot or characters. The pace is jumpy and at times very slow. The book didn't feel like it was following any type of plot much less focus.But at 470+ pages, too long it could have been shorten to about 200 and the same point would have gotten across. Honestly I read through it all the way but could I tell you anything about the book? No other than a mom, some ex girlfriend that said mom thought was fat (as she thought all his women were in some sort of way). A weak wrist ed father, jumping all over the place and conversations that didn't seem to have any sort of order or rhythm to them.I wouldn't honestly jump out and say it is a must read."}, {"review_sentiment": 2.0, "review_text": "meh..... just barely kept me interested...."}, {"review_sentiment": 5.0, "review_text": "Sweeping and hilarious, an unexpected pleasure to read."}, {"review_sentiment": 3.0, "review_text": "couldn't get involved in the plot."}, {"review_sentiment": 4.0, "review_text": "A good story. Funny, occasionally laugh-out-loud. The escapades of the second half are somewhat repetitive. The story slows down and becomes mildly tedious, partially saved by the climax of last chapters."}, {"review_sentiment": 5.0, "review_text": "More of the great Gary Shteyngart! His capacity for hilarity is endless. What an eye for the absurd! Thank you for your delightful characters and plot twists."}, {"review_sentiment": 5.0, "review_text": "Entertaining and enchanting - a modern literary masterpiece"}, {"review_sentiment": 3.0, "review_text": "i read absurdistan first then super sad love story, i loved those books, this book is entertaining but its unable to  keep my attention, i feel its a weak plot"}, {"review_sentiment": 4.0, "review_text": "Interesting book. May have been over my head."}]}, "authors": ["Gary Shteyngart"], "isbn": "1573229881", "longitude": 0.0, "periods": ["1900s"], "title": "The Russian Debutante's Handbook", "word_cloud": "short story laugh loud obviously talented writer debut prove gift word imagery phrase nothing save plot character pace jumpy time slow feel follow type plot much le page long point way anything mom ex girlfriend say mom think fat thought woman way weak wrist father jump place conversation seem sort order rhythm honestly say meh barely keep interested sweep hilarious unexpected pleasure involve plot good story occasionally escapade second half somewhat repetitive story slow becomes mildly tedious partially save climax last chapter more great capacity hilarity endless eye absurd delightful character plot twist entertain enchant modern literary masterpiece absurdist an first super sad love story love entertain unable keep attention weak plot interest head", "genres": ["Fiction & Literature", "Humour"], "summary": "A visionary novel from the author of Super Sad True Love Story and Little Failure.\r\n\r\nThe Russian Debutante's Handbook introduces Vladimir Girshkin, one of the most original and unlikely heroes of recent times. The twenty-five-year-old unhappy lover to a fat dungeon mistress, affectionately nicknamed \"Little Failure\" by his high-achieving mother, Vladimir toils his days away as a lowly clerk at the bureaucratic Emma Lazarus Immigrant Absorption Society. \r\n\r\nWhen a wealthy but psychotic old Russian war hero appears, Vladimir embarks on an adventure of unrelenting lunacy that takes us from New York's Lower East Side to the hip frontier wilderness of Prava (a pseudonym for Prague) and called the Eastern European Paris of the nineties. With the help of a murderous but fun-loving Russian mafioso, Vladimir infiltrates the Prava expat community and launches a scheme as ridiculous as it is brilliant.\r\n\r\nBursting with wit, humor, and rare insight, The Russian Debutante's Handbook is both a highly imaginative romp and a serious exploration of what it means to be an immigrant in America.", "asin": "1573229881", "rank": "261156", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51jPJAYNcLL.jpg", "country": "Prague", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}