{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 137, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "I thought this was a heartbreaking novel that not only gave flashes of the Vietnam/American War from the perspective of the North Vietnamese, but it gave insight into PTSD as well.  It's not just American soldiers who return home and struggle with this terrible disorder."}, {"review_sentiment": 5.0, "review_text": "There are no winners in war according to recent statements by the author. This book explains why he feels that way."}, {"review_sentiment": 4.0, "review_text": "An on the ground tale of death and life. I found this book very difficult to read as on every page there is a deep loss. A very moving book."}, {"review_sentiment": 5.0, "review_text": "It said on the back of the second page “ this is a work of fiction” Now remember it was written by a NVA war Vet.This Book help me years later,  read the book in 2015. So as I tell stories of the war,I say it is 10% truth and 90% FictionOr is it the other way 90% Truth ! You  decide !  Very good book for all War Vets"}, {"review_sentiment": 5.0, "review_text": "Moving view into lasting damage of war"}, {"review_sentiment": 5.0, "review_text": "After seeing the Vietnam War on PBS, there is interest as to what happened on the other side."}, {"review_sentiment": 4.0, "review_text": "Bought it as a group discussion book.  Though the Vietnam war is generally known, it is always good to see from the other side's view.  It caught me to keep reading and I  finished it in about two days.  The book is understandably in a sad tone and the war hurts all.  It is in a personal style which tells me more about the life of Vietnamese.  But for the discussion, I need to get more \"fact\".  It will be better if this book can also describes more from the Vietnam point of view."}, {"review_sentiment": 5.0, "review_text": "One of the most powerful books I have eveer read.  I have bought it for and shared it withseveral friends.  Not for the faint hearted but after reading this book I underswtand why we lost the war in Vietham..."}, {"review_sentiment": 5.0, "review_text": "Great read for a Vietnam veteran..."}, {"review_sentiment": 5.0, "review_text": "Interesting to know that North Vietnamese soldiers faced the same rottenness of war that the US did with the same profound psychological effects on Veterans, the same questions of what it was all for."}]}, "authors": ["Bao Ninh"], "isbn": "1573225436", "longitude": 0.0, "periods": ["1900s"], "title": "The Sorrow of War: A Novel of North Vietnam", "word_cloud": "think heartbreaking give flash perspective give insight well american soldier return home struggle terrible disorder winner war accord recent statement author explain feel way ground tale death life find difficult page deep loss moving say second page work fiction now write war help year later so tell story war say truth way decide very good vet move view lasting damage war see interest happen side group discussion war generally know always good see side view catch reading finish day understandably sad tone war hurt personal style tell life vietnamese discussion need fact better also describe point view powerful ever buy share with several friend not faint heated reading understand lose war veteran interest know vietnamese soldier face rottenness war psychological effect question", "genres": ["Memoir", "Fiction & Literature", "Historical Fiction"], "summary": "Kien’s job is to search the Jungle of Screaming Souls for corpses. He knows the area well – this was where, in the dry season of 1969, his battalion was obliterated by American napalm and helicopter gunfire. Kien was one of only ten survivors. This book is his attempt to understand the eleven years of his life he gave to a senseless war.\r\n\r\nBased on true experiences of Bao Ninh and banned by the communist party, this novel is revered as the ‘All Quiet on the Western Front for our era’.", "asin": "1573225436", "rank": "19048", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/51HF2yoGOhL.jpg", "country": "Hanoi", "story_arc": ["Tragedy", "Things only get worse"]}