{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 273, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "I loved all the stories in this collection."}, {"review_sentiment": 5.0, "review_text": "I appreciate Mr. Diaz's style of writing and even more so, deliberating upon which stories were connected. I feel more  were connected  then not.Some reviews have made this a concern, mentioning sloppy transitions and unknown correlations, but I think this the beauty of the novel....you decide which stories are related.It's clear several short stories are intertwined, I will leave with you with the pleasure of discovering which ones for yourself. As displayed in his other works, a story is often left without resolution or conclusion, which is part of the beauty of his writing."}, {"review_sentiment": 5.0, "review_text": "I recommend it."}, {"review_sentiment": 5.0, "review_text": "Love the realism of the story. Puts you right in there.The cultural lingo made me laugh constantly. A must read."}, {"review_sentiment": 5.0, "review_text": "I like Junot's short stories just as much as his novels.  I read his short story collections out of frustration waiting for his next novel, but I'm glad I read them, of course."}, {"review_sentiment": 5.0, "review_text": "Brilliant novel.  I can't wait to read more by this amazing writer."}, {"review_sentiment": 4.0, "review_text": "This is a classic tale of a journey of self-discovery, which is ever more classic in that Powell makes it distinct and unique with his own style.In this one, the narrator is a budding chemist with a safety net of a wealthy but cold family he could fall back on. Rather, he would prefer to unravel the molecular structure of life itself, and as a result joins up with the titular character on a journey to meet other strange and interesting characters. This is a classic travel book, not of landscapes butt of the oddities and permutations of the human animal. Powell's sense of expression and style are always pricking to the ear to keep almost every moment chugging forward. The final chapters slog a bit in trying to wrap everything up a little too neatly, but overall a worthy read."}, {"review_sentiment": 4.0, "review_text": "great book, well written, shows the reality of Latinos living in the US without romanticizing their lives, and without criticizing them"}, {"review_sentiment": 5.0, "review_text": "Diaz is a Dominican treasure. Such relatable stories that speak to me."}, {"review_sentiment": 5.0, "review_text": "This is an extraordinary collection by an extraordinary writer, about young Dominican men drowning in an over masculinized society. My four favorites are \"Ysrael,\" \"Drown,\" \"Edison, New Jersey,\" and \"Negocios.\" They are woven together with Joycean delight in the language: \"Pato\" is the Dominican slang for \"gay man\" and means (literally) \"duck.\" Watch the mother duck swim by in the first page of \"Edison . . .\" and defuse the term for that tale by providing a model for a mother feeding and leading her ducklings. The writing is beautiful and vigorous.  Díaz has won the 2007 Pulitzer Prize for his novel *The Brief Wondrous Life of Oscar Wao.*"}]}, "authors": ["Junot Díaz"], "isbn": "1573226068", "longitude": 0.0, "periods": ["1900s"], "title": "Drown", "word_cloud": "love story collection appreciate style write even deliberate story connect feel connected review make concern mention sloppy transition unknown correlation think beauty decide story clear several short story intertwine leave pleasure discover one displayed work story often leave resolution conclusion part beauty write recommend realism story right cultural lingo make laugh constantly like short story much novel short story collection frustration wait next glad course brilliant amazing writer classic tale journey ever classic make distinct unique narrator bud chemist safety net wealthy cold family unravel molecular structure life result join titular character journey meet strange interest character classic travel landscape oddity permutation human animal sense expression style always prick ear keep almost moment chug forward final chapter slog bit try everything little neatly overall worthy great well write show reality living romanticize life criticize treasure such repeatable story speak extraordinary collection extraordinary writer young men drown masculinize society favorite weave together delight language slang gay man mean literally duck mother duck swim first page term tale provide model mother feed leading duckling write beautiful vigorous wondrous", "genres": ["Fiction & Literature"], "summary": "\"This stunning collection of stories offers an unsentimental glimpse of life among the immigrants from the Dominican Republic--and other front-line reports on the ambivalent promise of the American dream--by an eloquent and original writer who describes more than physical dislocation in conveying the price that is paid for leaving culture and homeland behind.\" --San Francisco Chronicle.\r\nJunot Diaz's stories are as vibrant, tough, unexotic, and beautiful as their settings - Santa Domingo, Dominican Neuva York, the immigrant neighborhoods of industrial New Jersey with their gorgeously polluted skyscapes. Places and voices new to our literature yet classically American: coming-of-age stories full of wild humor, intelligence, rage, and piercing tenderness. And this is just the beginning. Diaz is going to be a giant of American prose. --Francisco Goldman\r\n\r\nEver since Diaz began publishing short stories in venues as prestigious as The New Yorker, he has been touted as a major new talent, and his debut collection affirms this claim. Born and raised in Santo Domingo, Diaz uses the contrast between his island homeland and life in New York City and New Jersey as a fulcrum for his trenchant tales. His young male narrators are teetering into precarious adolescence. For these sons of harsh or absent fathers and bone-weary, stoic mothers, life is an unrelenting hustle. In Santo Domingo, they are sent to stay with relatives when the food runs out at home; in the States, shoplifting and drugdealing supply material necessities and a bit of a thrill in an otherwise exhausting and frustrating existence. There is little affection, sex is destructive, conversation strained, and even the brilliant beauty of a sunset is tainted, its colors the product of pollutants. Keep your eye on Diaz; his first novel is on the way.", "asin": "1573226068", "rank": "19807", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41GN%2Bi49PLL.jpg", "country": "Santo Domingo", "story_arc": ["Tragedy", "Things only get worse"]}