{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 91, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "gift for my daughter"}, {"review_sentiment": 1.0, "review_text": "Missing whole sentences on first two pages of the book.  I'm now unsure as to what else is missing.  Is this a common fault of that edition?  I would have appreciated a warning."}, {"review_sentiment": 5.0, "review_text": "Good condition"}, {"review_sentiment": 3.0, "review_text": "Faulkner is hard to understand.  His writing is in long, complicated sentences. The stories too are also long and complicated. I recommend a website to help you keep track of the characters. I made myself a genealogical chart in order to keep them straight."}, {"review_sentiment": 5.0, "review_text": "Faulkner is one of the greatest, and this book is one of his greatest."}, {"review_sentiment": 5.0, "review_text": "Very informative"}, {"review_sentiment": 3.0, "review_text": "I have a love hate with Faulkner. If he would have adjusted his prose to include shorter paragraphs, I would be happier. That said, the descriptions are poetic."}, {"review_sentiment": 5.0, "review_text": "There are several stories, and I enjoyed them all.  I had heard The Bear was the most well known, and I certainly enjoyed it and its exploration of man and nature.  But the others are very good, memorable, and stand on their own.  I have read more than half of Faulkner's works, and I was not disappointed.  I heard people complain that the characters and their genealogy could interfere, but I did really care that I didn't have an exact picture of who was related to whom, who begat who. (There are detailed genealogical breakdowns on-line, and you could keep one handy if you really need to.)  The writing of woods, the many hunts, weather, as well as the characters is just brilliant!"}, {"review_sentiment": 4.0, "review_text": "It's Faulkner."}, {"review_sentiment": 4.0, "review_text": "Brings back old memories of the men in my past who showed me the way of the world and how deer hunting builds character."}]}, "authors": ["William Faulkner"], "isbn": "1578064716", "longitude": -90.0701156, "periods": ["1900s"], "title": "New Orleans Sketches", "word_cloud": "gift daughter miss whole sentence first page unsure else miss common fault edition appreciate warn good condition hard write long complicate sentence story also long complicate recommend website help track character make genealogical chart order straight greatest greatest very informative love hate adjust include shorter paragraph say description poetic several story enjoy hear well know certainly enjoy exploration man nature others good memorable stand half work disappoint hear people complain character genealogy really exact picture relate detailed genealogical breakdown handy really need write wood many hunt weather well character brilliant brings back old memory men show way world deer hunt build character", "genres": ["Fiction & Literature"], "summary": "In 1925 William Faulkner began his professional writing career in earnest while living in the French Quarter of New Orleans. He had published a volume of poetry (The Marble Faun), had written a few book reviews, and had contributed sketches to the University of Mississippi student newspaper. He had served a stint in the Royal Canadian Air Corps and while working in a New Haven bookstore had become acquainted with the wife of the writer Sherwood Anderson.\r\n\r\nIn his first six months in New Orleans, where the Andersons were living, Faulkner made his initial foray into serious fiction writing. Here in one volume are the pieces he wrote while in the French Quarter. These were published locally in the Times-Picayune and in the Double Dealer.\r\n\r\nThe pieces in New Orleans Sketches broadcast seeds that would take root in later works. In their themes and motifs these sketches and stories foreshadow the intense personal vision and style that would characterize Faulkner's mature fiction. As his sketches take on parallels with Christian liturgy and as they portray such characters as an idiot boy similar to Benjy Compson, they reveal evidence of his early literary sophistication.\r\n\r\nIn praise of New Orleans Sketches, Alfred Kazin wrote in the New York Times Book Review that “the interesting thing for us now, who can see in this book the outline of the writer Faulkner was to become, is that before he had published his first novel he had already determined certain main themes in his work.”\r\n\r\nIn his trailblazing introduction, Carvel Collins often called “Faulkner’s best-informed critic,” illuminates the period when the sketches were written as the time that Faulkner was making the transition from poet to novelist.\r\n\r\n“For the reader of Faulkner,” Paul Engle wrote in the Chicago Tribune, “the book is indispensable. Its brilliant introduction . . . is full both of helpful information . . . and of fine insights.” ", "asin": "1578064716", "rank": "2389727", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51bnavsgSJL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}