{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 72, "rating": 4.1, "reviews": [{"review_sentiment": 2.0, "review_text": "full of unnecessary anecdotes. was bored most of the book"}, {"review_sentiment": 5.0, "review_text": "I  am forever grateful. Ms. Cooke's curiosity, sensibility, humility and style make her the perfect guide. Her exploration and the discoveries she makes as she tries to understand this fascinating planet that orbits so close to our own, is a pleasure to read. It is a book that attempts to understand a people and their country.  On Planet Cuba Ms. Clarke is a trustworthy guide. Read it before you go or after. You will understand so much more."}, {"review_sentiment": 5.0, "review_text": "This book was recommended ahead of a trip to Cuba. Arrived in perfect condition. Can't wait to read it!"}, {"review_sentiment": 4.0, "review_text": "I really liked the stories and characters in this book.  It works to convey the psycho-social-political mindsets of young Cubans from different walks of life.  However, I thought the writing was unnecessarily verbose and sometimes cumbersome. Nevertheless,  this was a great read in anticipation of my upcoming trip to Cuba."}, {"review_sentiment": 5.0, "review_text": "Having just visited Havana I have found myself intrigued. The more questions I have answered about Cuba the more and more questions I have. I decided to pick up this book and read more about this country which Cooke referred to as a \"Dollhouse of prestige and poverty.\" Filled with Cubans whose \"lives still seemed like snow globes shaken by someone else.\" This is a fabulous read that follows a variety of Cubans as they navigate all that Cuba is and all they wished it would be. The places mentioned are places I just came back from, the food eaten I can almost still taste, and the observations depicted are memories I will never forget. My own travel accounts were verified on one page only to turn he page and find myself completely shocked. For all who have been to Cuba or those who would choose flip the pages to experience a beautiful country that finds itself both untouched and micromanaged- this is he book for you."}, {"review_sentiment": 1.0, "review_text": "Poorly written.  A struggle to reach half way.  Was it just me?  I looked up other reviews.  Quite a few readers were equally bored.  So I gave up and did not return for the second half."}, {"review_sentiment": 5.0, "review_text": "Inspiring and exceptionally wellWritten. I am preparing for a trip to cuba and found it highly informative and cant wait to see how the book compares to what i see."}, {"review_sentiment": 3.0, "review_text": "Personal accounts and history explain what I heard from Cubans while visiting Cuba....it's run down, teams with poverty but the people seem to be happy with their lives....might be good for us to appreciate the simple things life offers a little more....."}, {"review_sentiment": 5.0, "review_text": "This is a very engaging and interesting book. I read it on my recent trip to Havana, and it was great to have Julia Cooke's insight into the lives of the people of Cuba. It made my trip so much richer."}, {"review_sentiment": 4.0, "review_text": "The writer gets into the minds of regular Cuban folk.  Well written, I recommend you read this before your trip to Cuba.  Don't put off planning for that trip too long. Cuba is changing rapidly."}]}, "authors": ["Julia Cooke"], "isbn": "1580055311", "longitude": -82.3658671, "periods": ["2000s", "Recent Releases"], "title": "The Other Side of Paradise: Life in the New Cuba", "word_cloud": "full unnecessary anecdote bore forever grateful curiosity sensibility humility style make perfect exploration discovery make try fascinate planet orbit close pleasure attempt understand people country trustworthy guide go understand much recommend ahead trip perfect condition wait really like story character work convey mindset young different walk however think write unnecessarily verbose sometimes cumbersome great anticipation upcoming trip have visit find intrigue question answer question decide pick country refer poverty fill life still seem snow globe shake someone else fabulous follow variety navigate place mention place come back food eaten almost still taste observation depict memory never travel account verify page turn page find completely shock flip page experience beautiful country find untouched poorly write struggle reach way look review reader equally bore give return second half inspire exceptionally well written prepare trip find highly informative cant wait see compare personal account history explain hear visit team poverty people seem happy life good appreciate simple thing offer little engage interesting recent trip great insight life people make trip much richer writer get mind regular folk write recommend trip put plan trip long change rapidly", "genres": ["Social & Cultural Studies", "Politics"], "summary": "Change looms in Havana, Cuba's capital, a city electric with uncertainty yet cloaked in cliché, 90 miles from U.S. shores and off-limits to most Americans. Journalist Julia Cooke, who lived there at intervals over a period of five years, discovered a dynamic scene: baby-faced anarchists with Mohawks gelled with laundry soap, whiskey-drinking children of the elite, Santería trainees, pregnant prostitutes, university graduates planning to leave for the first country that will give them a visa.\r\n\r\nThis last generation of Cubans raised under Fidel Castro animate life in a waning era of political stagnation as the rest of the world beckons: waiting out storms at rummy hurricane parties and attending raucous drag cabarets, planning ascendant music careers and black-market business ventures, trying to reconcile the undefined future with the urgent today.\r\n\r\nEye-opening and politically prescient, The Other Side of Paradise offers a deep new understanding of a place that has so confounded and intrigued us.", "asin": "1580055311", "rank": "203959", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/51cozd-5zEL.jpg", "country": "Cuba", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}