{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 48, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Good but not too good but still I finished reading this. Good job!"}, {"review_sentiment": 1.0, "review_text": "No"}, {"review_sentiment": 3.0, "review_text": "I couldn't read it in one session. The stream of consciousness style is not easy on the reader nor is the life of Michelle Tea in that time of her life. I became interested in Tea's work after reading an interview by Ariel Gore in her book. She talked about her then new book Valencia. I ended up reading her newer book- How to grow up. It was great. So, I bought Valencia. The book is revealing about Tea's life in San Francisco. She drinks, and is obsessed about her girlfriend Iris. The book is about that. But, luckily for the reader, the book shows Tea's soul, which despite alcohol and love addiction is a good one. My daughter is a lesbian and I wanted to know more about the lifestyle of a young woman finding herself and looking for love. I like Michelle Tea. Her writing is better now, but stay with this book as it shows a woman who will do always anything in her quest to be loved. And that need has no gender"}, {"review_sentiment": 4.0, "review_text": "I dream of the day I can turn a phrase like Tea, but I still won't have had the wealth of experiences she has."}, {"review_sentiment": 5.0, "review_text": "GREAT READ"}, {"review_sentiment": 5.0, "review_text": "loved this author"}, {"review_sentiment": 3.0, "review_text": "I have purchased this book last year, I have been trying to borrow it from a public library for a few years now so this is why I had decided to buy it.I have read \"Rose of No Man's Land\" by Michelle Tea several years ago, and I enjoyed it.Now with \"Valencia\", I say it is more of a fictional like memoir if this makes sense. It is very fantastic in its story, which can be so absurd that it comes off as hilarious. I was cracking up laughing out loud at parts that were meant to be funny as well as not.Author Michelle Tea is entertaining as a fictional writer but for a memoir, no. Even if the things written in \"Valencia\" are all facts, it still comes off as a wild and in your face, \"I did this, you did not\" prove it antics; actually a little similar to former television show with Johnny Knoxville called Jackass. My opinion: this is fun for the first hour but as it continues it becomes highly ridiculous and losses my attention quickly so I had to put the book down, then read it the next day or two.This book definitely provides the reader an escape from their daily routine and go into a \"world\" unknown (unless you have had similar experiences as Michelle Tea) however after this, you go right back to your day to day life. While I had finished reading the book, I would say I was slightly inspired to give myself time to write my own experiences for the pleasure of it then I gave up that idea; the ending of this book is confusion which may be why I did not care to write my story. My opinion: I feel life is much more than 15 minutes of fun and exaggeration, it involves all things from boredom to sadness to excitement. Anyways I enjoy writing short stories for fun for myself so I will stick with that. Oh, I do love the front cover especially the photograph of the woman!My overall rating for book \"Valencia\" is out of ten stars, I give five. For an escape (and/or while traveling) I suggest reading this book, it does have exaggerated stories and characters and a few quirky moments here and there to make you laugh."}, {"review_sentiment": 5.0, "review_text": "I loved this book.  Michelle is a poet by nature and writes like one, and the language is eloquent when it needs to be and tough and gritty when it needs to be.  She shies away from nothing and has no problem with exposing her darkest moments and desires, while remaining childlike and optimistic and maintaining that sense of wonder and adventure that just makes you want to know her and hang out with her and have a shot of tequila with her.  The chapter about the Southern Baptist wedding that she attended with her girlfriend, in which she had to pretend to be simply a visiting friend, was written with both angst and sensitivity, and I loved it.  She could have been pissed at the girlfriend for bringing her there, pissed at the homophobe sister, pissed at the culture.  But she wasn't.  She was just real and cool and a people-watcher and treated it as an adventure. My only criticism of the book has to do with is nature of being a memoir.  I wish it hadn't ended so abruptly.  I felt like the end was sudden and maybe not in the exact right place.  It had built to a frenzy and then just dropped off and left me hanging, which isn't necessarily a bad thing...but still...I wanted more of the poetry!Awesome book.  Read it."}, {"review_sentiment": 4.0, "review_text": "Reminds me a bit of my own misspent youth. Nothing like crushes on unavailable people, or getting into impossible relationships when you are young."}, {"review_sentiment": 5.0, "review_text": "Oh my!  This is on fire... In the name of love and many couches, I solomnly swear this is contolled chaos to gawk at with a facination that is genuine. She nailed it!"}]}, "authors": ["Michelle Tea"], "isbn": "158005238X", "longitude": -122.4192363, "periods": ["1900s"], "title": "Valencia", "word_cloud": "good good still finish read good job session stream consciousness style easy life time life become interested work read interview talk new end read newer great buy revealing life drink obsessed girlfriend luckily show soul alcohol love addiction good daughter lesbian want know lifestyle young woman find look love like writing better stay show woman always anything quest love dream day turn phrase still experience great love author purchase last year try borrow public library year decide buy several year ago enjoy say fictional memoir make sense fantastic story absurd come hilarious crack laugh loud part mean funny well entertain fictional writer memoir even thing write fact still come wild face prove antic actually little similar former television show call opinion fun first hour continue become highly ridiculous loss attention quickly put next day definitely provide escape daily routine go world unknown similar experience however go right back day day life finish read slightly inspire give time write experience pleasure give idea end confusion write story opinion feel life much minute fun exaggeration involve thing boredom sadness excitement enjoy write short story fun stick love front cover especially photograph woman overall rating star give escape travel suggest read exaggerated story character quirky moment make laugh love poet nature write language eloquent need tough gritty need shy away nothing problem expose darkest moment desire remain childlike optimistic maintaining sense wonder adventure make want know hang shot tequila chapter wedding attend girlfriend pretend simply visit friend write angst sensitivity love piss bring pissed homophone sister pissed culture real cool treat adventure criticism nature memoir wish end abruptly felt like end sudden maybe exact right place build frenzy drop leave hang necessarily bad thing still want poetry reminds bite misspent youth nothing crush unavailable people get impossible relationship young fire name love many couch solemnly swear controlled chaos gawk fascination genuine nail", "genres": ["Fiction & Literature", "LGBT"], "summary": "Valencia is the fast-paced account of one girl's search for love and high times in the drama-filled dyke world of San Francisco's Mission District. Michelle Tea records a year lived in a world of girls: there's knife-wielding Marta, who introduces Michelle to a new world of radical sex; Willa, Michelle's tormented poet-girlfriend; Iris, the beautiful boy-dyke who ran away from the South in a dust cloud of drama; and Iris's ex, Magdalena Squalor, to whom Michelle turns when Iris breaks her heart.", "asin": "158005238X", "rank": "392673", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/514m4KOxv0L.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}