{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 43, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "classic"}, {"review_sentiment": 5.0, "review_text": "I came to find myself jealous of the main characters life in a tropical paradise. Anthony Bourdain did not disappoint with the book."}, {"review_sentiment": 3.0, "review_text": "Aside from the big brotherish fact that I was asked to review this book within days of finishing it on my kindle even though I actually had ordered it a few years ago, I enjoyed the book well enough--enough to read another fiction book of his.  I've read other nonfiction books by Bourdain (Typhoid Mary and Kitchen Confidential, which were much better), but this was the first fiction novel.  He writes well.  He's a little too stereotypical in his characterizations of the mafia types, but maybe that's true to fact."}, {"review_sentiment": 5.0, "review_text": "In my opinion I think this is the best of Bourdain's novels. I read this in a few days on a beach and it was perfect. I liked the characters and it was a page turner. Great writing. I highly recommend especially if your going to a warm beach on vacation."}, {"review_sentiment": 4.0, "review_text": "It astounds me what a great writer Bourdain is.  I wish he had more time (or was more inclined) to write"}, {"review_sentiment": 5.0, "review_text": "An excellent, fun book. Tony wrote another great tale!"}, {"review_sentiment": 3.0, "review_text": "Unbelievable ending."}, {"review_sentiment": 4.0, "review_text": "I think the wife was very good. really liked her part."}, {"review_sentiment": 3.0, "review_text": "Not as good as Bone In The Throat.  Disappointing as a sequel."}, {"review_sentiment": 5.0, "review_text": "loved reading the fast pace.  Humor was insithtful.  Characters wonderful. Setting was OUTSTANDING.  I could feel the sun and hear the ocean in every chapter.  GREAT beach read.  It read quickly, I was sorry when the story was closed. A.B. write MORE, MORE and MORE!  Thank you, Melany Eckles"}]}, "authors": ["Anthony Bourdain"], "isbn": "1582341036", "longitude": 0.0, "periods": ["1900s"], "title": "Gone Bamboo", "word_cloud": "classic come find jealous main character life tropical paradise disappoint aside big brotherish fact ask review day finish kindle even actually order year enjoy well enough enough fiction nonfiction much better first fiction write well little stereotypical characterization mafia type maybe true fact opinion think best bourdain novel day beach perfect like character page turner write highly recommend especially go warm beach vacation astound great writer wish time incline write excellent fun write great tale unbelievable end think wife good really liked part not good bone sequel love reading fast pace insightful character wonderful set outstanding sun hear ocean chapter beach quickly sorry story close write more", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Gone Bamboo pits Henry, a CIA-trained assassin, and Frances, his hard-nosed, hard-bodied wife against two governments and a cross-dressing mafioso. Henry and Frances have gone bamboo-living an idyllic, retired life in the Caribbean-but when Donnie, a powerful capo relocated by the Federal Witness Protection Program, inadvertently jeopardizes their plan, all hell breaks loose. Despite the fact that Henry once tried to kill Donnie, the two join forces against the transvestite mob boss looking to ace Donnie. But things aren't going to be so easy. . . .\r\n\r\nWritten in Anthony Bourdain's signature style-raucous, funny, a bit vicious, and always fun-Gone Bamboo is a feast of murder, hitmen, and the hitwomen they love. Reminiscent of Dashiell Hammet's Nick and Nora, Bourdain's Henry and Frances are a tough-talking, unlikely couple that will win you over-if they don't kill you first.\r\n\r\nAnthony Bourdain is the executive chef at Brasserie Les Halles in New York City. He is the author of Kitchen Confidential: Adventures in the Culinary Underbelly (non-fiction) and Bone in the Throat.\r\n\r\n'Bourdain establishes himself as a new master of the wiseass crime comedy.' Publishers Weekly\r\n", "asin": "1582341036", "rank": "236755", "city": "Saint Martin", "image": "https://images-na.ssl-images-amazon.com/images/I/51kLGIAHAOL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}