{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 10, "rating": 4.6, "reviews": [{"review_sentiment": 4.0, "review_text": "A look into the life and background of a girl born in downtown L.A., the choices that both her family and she make that allow her to reach her goals. I felt that a good friend was telling me her story...."}, {"review_sentiment": 5.0, "review_text": "The author uses references to songs/music in her dialog that I grew up on.  She articulates the experiences of many black girls, now women, who grew up in the first wave of neighborhood and school integration in the 1970's."}, {"review_sentiment": 5.0, "review_text": "Ms. Johnson did a fantastic job revealing the life of a child growing up among confusing times, as most teens do, without insulting our intelligence and doing the interpretation for us. It was both \"in your face\" at times with racism and poverty and subtle in it's recognition of details and nuance. I loved being able to picture the home of the main character and remember the 80's! It was really nicely written and appealing to a wide audience."}, {"review_sentiment": 4.0, "review_text": "Great story line. Flowed very well, some parts was a little confusing to keep flow with going between past and present. Very relateable."}, {"review_sentiment": 5.0, "review_text": "Voice and dialogue, got to have voice and dialogue, otherwise it's just a descriptive narrative and somewhere around the hundredth fluffy description and transcribed imagery I get bored. I mean I've read books that were all that, but they didn't grip me and keep me interested. I'll read a slightly less well written novel with a great voice and tight dialogue over flowery chit-chat any day. Thankfully this compromise is not the case with Dana Johnson's Elsewhere, California. Her protagonist, a young woman named Avery, screams dialogue and the narrative voice is incredibly strong. Johnson brings us into Avery's world hard, and doesn't let up. We're allowed into a young woman's thoughts and fears, in juxtaposition to her now, today, grown up, still dealing with the sameness of it all. Only her past won't let her move on, or maybe she's too afraid to just let it go. Either way her inner turmoil of making the change from her family's ideals to who she wants to be, or at least sees herself as, is the underlining current. Then throw in never quite fitting in, a sense of self-hatred, a bit of guilt, the constant of racism, and strangely enough: baseball, and you've a small notion of the complexity of Elsewhere, California. Not to sound horribly clichéd, but Johnson knocks this one out of the ballpark - well written, hella tight dialogue, a strong-as-hell voice that you'd have to be deaf not to hear. Read it!"}, {"review_sentiment": 5.0, "review_text": "Whether you're black or white, rich or poor, this book will speak to you. The duality of being an African-America girl coming of age in white suburbia was a fascinating concept that created a deep personal conflict within the character while always ringing true.Pretty much everything about this book spoke to me. It effectively used a dual narrative device (half the book takes place the day of Avery's art show when she is 40, the other half takes place throughout her childhood). The device was made very clear from the beginning and never pulled me out of the story. The writing was poetic and smart while at the same time stayed grounded to the vernacular of its characters. In the childhood scenes the dialogue is written without quotation marks. While this sort of style usually drives me nuts (in Cormac McCarthy's novels especially) , Johnson always makes it flow with Avery's writing so I never found myself stopping to look back and see if a line was prose or dialogue.Avery is original and engaging through both timelines of her narrative. Yet she can also be deeply weak and vulnerable. These flaws made her human, and I connected with her on a deeper emotional level than I usually do with fictional characters.Johnson has an incredible ability to paint a picture of a scene with only words (a necessary skill since her protagonist is a painter). At one point in the novel she describes Avery seeing a picture of a minutiae sculpture by artist Robert Rauschenberg. After reading the chapter I looked up the art on Google. The image Johnson implanted in my mind through words looked very similar to actually photos. Rarely does this happen to me in reading.Another reviewer commented that she wished more focus could be placed on Avery's post-college life. Being on the brink of graduating myself, I too am interested in seeing Avery navigate what many promise to be the most confusing years of one's life. This is not a criticism to the novel however, as I feel it wouldn't be essential to the story. The idea is actually a testament to how good the book is, that readers would be willing to sit down and see the next twenty years of Avery's life.I will definitely check up on this author in the future. Elsewhere, California felt like the start of what I hope will be a very promising career as a novelist for Dana Johnson."}, {"review_sentiment": 5.0, "review_text": "Dana Johnson explores race, identity and the complex ways in which we try fit in in this amazing book. I love the collage of language here, Avery's deeply honest voice, and the insights she makes into all of the cultures of Los Angeles. A great read and a book that could provoke terrific discussions in a literature or creative writing course. I highly recommend it!"}, {"review_sentiment": 5.0, "review_text": "We all know what it's like to try to escape that which we believe is not good for us, only to run into new problems are the same challenges elsewhere. In Dana Johnson's book ELSEWHERE, CALIFORNIA we are able to take a journey with Avery Arlington as she tries to make sense not only of her own life and purpose but that of those around her as well.The story is told in such a way that we are able to not only reflect back on Avery's upbringing but the woman she has become and is continuing to become. That is one of the greatest aspects of the book: that we can see the growth in her, the acceptance of what she brings to the world but also the place in which she finds herself as an adult.There are times you will be frustrated with her. I know I was, but I also see that she is not only living the life that so many say they want for themselves but has overcome some of the very things that stifle so many. In the face of her triumphs there are also the trials, and that is what makes the story so easy to relate to as you go from chapter to chapter.In the end I took from it that no matter where you live or where you are inside of yourself, there will be those who will try to define you by a location or a thing. You have to have enough courage in yourself to know that you were born for a reason and that reason is not contingent on where you live or what you look like. Avery finally gets it and you can as well.Drawing you in with every chapter, ELSEWHERE, CALIFORNIA reminds you that no matter where in the world you live there are things that unite us and will continue to challenge us to be the truest form of ourselves. Definitely a book worth your consideration."}, {"review_sentiment": 5.0, "review_text": "The story of Avery's struggles with race, identity, class, marriage, friendship and family, and her life as a well-off artist in contemporary L.A.Told in chapters that alternate between Avery's childhood past and adult present.The present-day chapters are terrific. The writing is luminous. Especially vivid is Avery's relentlessly charming husband, Massimo. I wish the present-day chapters had been longer (and the childhood chapters shorter).Initially the colloquial writing style of the childhood chapters was a bit jarring and, after a few paragraphs, somewhat tedious. I sometimes resisted the urge to skip ahead to the next present-day chapter. It grew on me eventually (due in part to Avery's vividly portrayed mother and father), but as mentioned previously, would have preferred shorter and/or fewer childhood flashbacks.Still, Avery's story is well-told and well worth reading. Enjoyed the novel's diversity, and that Avery is an individual and not a stereotype.I am not a baseball fan, but baseball enthusiasts should enjoy Avery's passion for the sport.A story focusing on Avery's post-college life --  work, dating, friendships, adult identity, crappy apartments, struggling artist, etc. -- and her relationship with Massimo from dating to their present-day marriage would have been (or would be) outstanding."}, {"review_sentiment": 4.0, "review_text": "This is obviously a book about identity boundaries and over stepping them.Avery, a black child growing up in the suburbs of Los Angeles, CA doesn't exactly have the tastes that one would expect of a black child of the 70's, 80's. Avery is the main character of this novel, and her story is told throughout the book alternately by both her adult and child-to-adult voice. I think the objective of the writer is to examine and expose the boundaries of blackness and feminine identity. I mean, how often do we examine the ideas we hold about what is the \"ideal\" black persona?Avery listens to music that isn't typical \"black\" music. She dresses in a way that is deemed different and finds certain boys in the teen magazines of her day beautiful and yet none of them are black like her. Her father even asks her once, about some of the posters on her wall, \"Who in the hell are all these white boys?\" Avery seems to be haunted by the expression of \"she ain't really black.\" The child-to-adult voice seems to be constantly struggling against the \"ideal\" black identity.So my question is whence came this push out of common definitions of blackness and femininity? The style of writing is luxurious, and the growing child/grown-up narrative mostly works and doesn't distract from the story. I think a little more background is needed on Avery, to help us understand how she came to struggle with her identity. That is never really explored, or hey... that may be the point of the novel. Do all teenagers struggle with how they fit in? How they should act and move through each day?Ultimately, this is a well written coming of age story, with Avery trying to figure it all out and navigate stereotypes of blackness and woman ness along the way. A journey worth taking. I wanted to give 3.5 stars, but you have to choose, so I settled on 4."}]}, "authors": ["Dana Johnson"], "isbn": "158243784X", "longitude": -118.244476, "periods": ["2000s", "Recent Releases"], "title": "Elsewhere, California: A Novel", "word_cloud": "look life girl bear downtown choice family make allow reach goal felt good friend tell story author use reference dialog grow articulate experience many black girl woman grow first wave neighborhood school integration fantastic job reveal life child grow confuse time teen insult intelligence interpretation face time racism poverty subtle recognition detail nuance love able picture home main character really nicely write appeal wide audience story line well part little confuse flow go past present relate able dialogue get voice dialogue otherwise descriptive narrative somewhere hundredth fluffy description transcribe imagery get bore mean grip keep interested slightly le well write great voice tight dialogue flowery day compromise case protagonist young woman name scream dialogue narrative voice incredibly strong bring world hard let allow young woman thought fear juxtaposition today grow still deal sameness only past maybe afraid let way inner turmoil make change family ideal want least see underline current then throw never quite fitting sense bit guilt constant racism strangely enough baseball small notion complexity not sound horribly cliched knock ballpark well write hell tight dialogue voice deaf hear read black white rich poor duality girl come age white suburbia fascinate concept create deep personal conflict character always ring much everything speak effectively use dual narrative device half take place day art show half take place childhood device make clear begin never pull story write poetic smart time stay ground vernacular character childhood scene dialogue write quotation mark sort style usually drive nut novel especially always make flow writing never find stop look back line prose original engage timeline narrative also deeply weak vulnerable flaw make human connect deeper emotional level usually fictional incredible ability paint picture scene word necessary skill protagonist painter point describe see picture minutia sculpture artist read chapter look art image implant mind word look similar actually photo rarely happen reviewer comment wished focus life graduate interested see navigate many promise confuse year life criticism however feel essential story idea actually testament good reader willing see next year definitely author future felt start hope promise career novelist explore race identity complex way fit amazing love collage language deeply honest voice insight make culture great terrific discussion literature creative write course highly recommend know try escape believe good run new problem challenge elsewhere able journey try make sense life purpose story tell way able reflect back upbringing woman continue become greatest aspect see growth acceptance bring world also place find time frustrated know also see live life many say want overcome thing stifle many face triumph also trial make story easy relate go chapter end take matter live try define location thing enough courage know bear reason reason contingent live look finally get chapter remind matter world live thing unite continue truest form definitely worth consideration story struggle race identity class marriage friendship family life artist contemporary chapter alternate childhood adult chapter terrific write luminous vivid relentlessly charm husband wish chapter longer childhood chapter shorter colloquial writing style childhood chapter bite jarring paragraph somewhat tedious sometimes resist urge skip ahead next chapter grow eventually due part vividly portray mother father mention previously shorter fewer childhood story well worth read diversity individual baseball fan baseball enthusiasts enjoy passion story focus life work date friendship adult identity crappy apartment struggle artist etc relationship dating marriage outstanding obviously identity boundary step black child grow suburb exactly taste black child main character story tell alternately adult voice think objective writer examine expose boundary blackness feminine identity mean often examine idea hold ideal black persona listen music typical black music dress way deem different find certain boy teen magazine day beautiful yet none black father even ask poster wall hell white boy seem haunt expression ai really black voice seem constantly struggle ideal black question whence come push common definition blackness femininity style write luxurious grow narrative mostly work distract story think little background need come struggle identity never really explored hey teenager fit act move day ultimately well write come age story try figure navigate stereotype woman sen way journey worth take want give star choose settle", "genres": ["Fiction & Literature"], "summary": "We first met Avery in two of the stories featured in Dana Johnson’s award–winning collection Break Any Woman Down. As a young girl, she and her family escape the violent streets of Los Angeles to a more gentrified existence in suburban West Covina. This average life, filled with school, trips to 7–Eleven to gawk at Tiger Beat magazine, and family outings to Dodger Stadium, is soon interrupted by a past she cannot escape, personified in the guise of her violent cousin Keith.\r\n\r\nWhen Keith moves in with her family, he triggers a series of events that will follow Avery throughout her life: to her studies at USC, to her burgeoning career as a painter and artist, and into her relationship with a wealthy Italian who sequesters her in his glass–walled house in the Hollywood Hills. The past will intrude upon Avery’s first gallery show, proving her mother’s adage: Every goodbye aint gone. The dual–narrative of Elsewhere, California illustrates the complicated history of African Americans across the rolling basin of Los Angeles.", "asin": "158243784X", "rank": "1128422", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/51uBWOLH56L.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}