{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 49.262428, "ratings": {"num_ratings": 44, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Well, once again, another book I really liked.  Beginning to wonder if my reviews have any merit, or if I just have had great luck with recommendations from friends.I'm sure you can get a great synopsis of this book from Amazon or Goodreads, so I'm not going to go there. I just want to say that this is one if those rare books that you don't want to put down. The author created wonderful empathetic characters and tells a wonderfully well woven story that takes you high and low and really makes you think and feel.So read the synopsis from your favorite book seller, read my words, and decide if this book is for you. I'm recommending it."}, {"review_sentiment": 3.0, "review_text": "This was the first Coupland novel I read, and while I did enjoy his writing style, I was a bit bored during the latter part of the first part of the book. I couldn't tell where it was going and if I remember correctly, it kind of stopped abruptly. What happens is later told by the narrator in the second part of the novel, which was a little better because it offered a resolution and a happy one at that, and there was a humorous scene in an airport. Well, in hindsight it was humorous. The whole situation is humorous, except for the tragic ending of the first part. And even that was not dwelled on too much by the narrator. What I'm trying to say is the overall plot did not endear this particular novel to me, although I am willing to read other books by this author. I do still recommend it though because it will most likely leave you with satisfaction at the end, even though you may be bored during the actual reading of it."}, {"review_sentiment": 3.0, "review_text": "A decent effort that could have used another revision.  A lot of the big ideas are good and well though out but the small details often seem rushed and often don't make sense.Often the characters will have the same oddball thought at the same time like Coupland forgot which character was which."}, {"review_sentiment": 4.0, "review_text": "You either love Douglas Coupland or just do not get him.  As always he is a cultural watchdog capturing the events of the moment.  And if you are a Vancouverite, it is always worth a giggle."}, {"review_sentiment": 5.0, "review_text": "Written very well! I love the cadence of the book. I could put myself in her shoes the entire time. I absolutely had no idea what it was about. Found the farmer stories a bit boring (skipped through them about halfway through), but the rest was amazing!"}, {"review_sentiment": 5.0, "review_text": "This book is a great book because how it is not slow and boring. I would recommend this book to anyone."}, {"review_sentiment": 4.0, "review_text": "I went through a real phase of reading nearly everything Douglas Coupland wrote a few years back and this is one of his better books. The story centres around the life of a lonely woman who hasn't met mr right or even mr you'll do yet. Her days are spent at work and she returns home to her lonely apartment for evenings with the television and her cat. Needless to say things change for her and life becomes more complex but i don't want to spoil it for you. What i like about Douglas Coupland's books is that he sees the ugliness of modern life but allows for the possibility of hope, redemption and a sort of happy ending. He is almost spiritual in a way although not in a bible bashing sense. If you enjoy stories about lives changed and hope for meaning in life then i strongly recommend Douglas Coupland, this book is a good start."}, {"review_sentiment": 4.0, "review_text": "Douglas Coupland's writing has a nature about it that is refreshing to find in literature. It's inviting, in that the characters make you feel interested in their stories. I first read this novel when I was in high school and was reading between classes. I recently have read it again and its still a great read. In an age where most authors lack that spark that draws the reader in, Coupland makes it seem effortless."}, {"review_sentiment": 3.0, "review_text": "The novel focuses on the pedestrian life of Liz Dunn and how the presence of her long-lost son back into her life changes things. Trouble is, any changes she makes are slight or barely perceptible. Liz, her son Jeremy and the rest of her family are kind of one-dimensional characters and the novel itself is too boring/pedestrian to be something you'd call a truly good read. An easy read, yes. A seminal novel, no."}, {"review_sentiment": 4.0, "review_text": "I think this is my second Coupland book and it was a good read. Unique story-line and good follow-through despite a hokey plot twist at the end. It was another easy read which is perfectly fine with me since my brain is too tired nowadays too follow anything more complicated. Still, I want to be entertained, not bored and this book fit the bill perfectly. As far as a mini-description? I guess it's a story about a woman's journey and self-discovery. It's not truly woman-centric though so don't let that scare you. Pick it up if you like to read modern-day fiction novels."}]}, "authors": ["Douglas Coupland"], "isbn": "1582346437", "longitude": -123.11554, "periods": null, "title": "Eleanor Rigby", "word_cloud": "well really like begin wonder review merit great luck recommendation sure get great synopsis go go want say rare want put author create wonderful empathetic character tell wonderfully well woven story take high low really make think synopsis favorite seller word decide recommend first enjoy write style bite bored latter part first part go remember correctly kind stop abruptly happen later tell narrator second part little better offer resolution happy humorous scene airport hindsight humorous whole situation humorous tragic end first part even swell much try say overall plot particular willing author still recommend likely leave satisfaction end even actual reading decent effort use revision lot big idea good well small detail often seem rush often make character thought time forget character always cultural watchdog capture event moment always worth giggle well love cadence shoe entire time absolutely idea farmer story bite boring skip halfway rest amazing great slow boring anyone go real phase read nearly everything write year back better story center life lonely woman meet rm right even yet day spend work return home lonely apartment evening television cat say thing change life becomes complex want spoil see ugliness modern life allow possibility hope redemption sort happy end almost spiritual way bible bash sense enjoy story live change hope mean life strongly good start write nature refresh find literature invite character make feel interested story first high school reading class recently still great age author lack spark draw make seem effortless focus pedestrian life presence son back life change thing trouble change make slight barely perceptible son rest family kind character something call truly good easy seminal think second good good hokey plot twist end easy perfectly fine brain tire nowadays anything complicate still want entertain bored fit bill perfectly far guess story woman journey truly let scare fiction novel", "genres": ["Fiction & Literature"], "summary": "Hot on the heels of the hugely acclaimed bestseller \"Hey Nostradamus!\" comes a major new novel from Douglas Coupland: the wonderfully warm, funny, life-affirming story of Liz Dunn, a woman who has spent her whole life alone and lonely, until now. 'My name is Liz Dunn. \r\n\r\nThe Liz Dunns of this world take classes in croissant baking, and would rather chew on soccer balls than deny their children muesli. They own one sex toy, plus one cowboy fantasy that accompanies its use. Look at me: I am a traitor to my name: I'm not cheerful; I'm drab. I'm crabby, friendless, and lonely. 'Liz Dunn is 42 years old, and lonely. Her house is like 'a spinster's cell block', and she may or may not snore - there's never been anybody to tell her. \r\n\r\nThen one day in 1997, with the comet Hale Bopp burning bright in the blue-black sky, Liz receives an urgent phone call asking her to visit a young man in hospital. All at once, the loneliness that has come to define her is ripped away by this funny, smart, handsome young stranger, Jeremy, her son. \r\n\r\n\"Eleanor Rigby\" is a tale of loneliness and hope that introduces Douglas Coupland's finest character yet, illuminated by a wonderfully gentle searching wisdom.", "asin": "1582346437", "rank": "2272765", "city": "Vancouver", "image": "https://images-na.ssl-images-amazon.com/images/I/51IyvHhvQ1L.jpg", "country": "Canada", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}