{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 56, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "I would recommend many other books by White before this one."}, {"review_sentiment": 5.0, "review_text": "Absolutely love this book. I sort of bought it on accident, searching for another book with the similar title Le Flaneur. Ended up choosing this one. White discusses a walk through Paris with historical intricacies woven into it all. I don't know how to describe it. I've read it through and through multiple times and find myself catching something I didn't catch prior."}, {"review_sentiment": 5.0, "review_text": "White explores the history, sociology, and psychology of Paris through the fearless lense of his own life. Erudite, funny, sanguine and honest, he restores the art of creative, free wandering to an age convulsed by consumption. For those who want their heart/mind to explore as deftly as their eye."}, {"review_sentiment": 5.0, "review_text": "Edmund White has been around the block a few times but his observations remain priceless and are presented with such effortless panache that sort even a jaded veteran of15 years in a gay book club comes away from this experience speechless and wanting more and more.  Standing ovation to a literary giant."}, {"review_sentiment": 3.0, "review_text": "Nice walking/historic tour of select arrondissements in Paris. Would have really liked to have had some of the [more]outlyer areas included"}, {"review_sentiment": 4.0, "review_text": "Insightful, strange and prefect prep for the preadventure. A bit dated."}, {"review_sentiment": 3.0, "review_text": "The Flâneur is subtitled “A Stroll through the Paradoxes of Paris,” thus signaling that despite the title, there is very little actual walking in this book. The stroll is more of a symbolic one, as White wanders in and out of the varied histories of the City of Light. White writes about Baudelaire, Colette, the present “heirs” of the French throne and the marginalized minority groups such as the Blacks, Jews, Arabs and even gays.  At first I was disappointed that there wasn’t more physical wandering described; however, I grew to appreciate White’s perspective and insights about topics not usually covered in other books about Paris.“…Paris, land of novelty and distraction, is the great city of the flâneur – that aimless stroller who loses himself in the crowd, who has no destination and goes wherever caprice or curiosity directs his or her steps.”"}, {"review_sentiment": 5.0, "review_text": "There aren't enough words in the English language to describe how much I love reading Edmund White. I have been reading his books for the last two decades and there isn't a novelist out there who can write so eloquently through the prism of what it is to be gay in America. I just got done reading The Flaneur: A stroll through the paradoxes of Paris. This is a must read for anyone who has been to Paris or wants to go someday like me. His perspective is almost that of a cultural anthropologist who is able to weave together his vast knowledge of history with his own experience revealing key moments in the evolution of Paris as a center for humanitarian causes and the progenitor of a very specific national identity that can only be called French. It is jaw dropping how much he knows about art, classical music, literature, religion and history (ideal for anyone who has a degree in Liberal Arts). I felt like I got to know on a very personal level writers that I don't know much about such as Collette, Baudelaire and Balzac. But what I like most about White's writing is that he is not afraid to reveal his own flaws especially in terms of his lifelong battle with his sexuality and the desire to be recognized as a great writer. Although this is not what drives The Flaneur, for it is a great read of anyone gay or straight, it just leaves an indelible mark on me that I can be who I am, warts and all, and still find meaning and enrichment in the landscape of human living. And that no matter how degraded, burdened by social status or marginalized one can be, the ability to create intelligibility out of ones suffering and to communicate that to others can never be taken away or disregarded."}, {"review_sentiment": 1.0, "review_text": "I love this French word and was really looking forward to reading this book. Unfortunately, it has little to do with aimlessly strolling around Paris and more to do with the author's political/social rhetoric. So poorly written I couldn't finish it"}, {"review_sentiment": 2.0, "review_text": "Another Edmund White exercise in self-aggrandizement."}]}, "authors": ["Edmund White"], "isbn": "1582342121", "longitude": 2.3514992, "periods": ["1900s"], "title": "The Flaneur: A Stroll through the Paradoxes of Paris", "word_cloud": "many absolutely love sort buy accident search similar title end choose discuss walk historical intricacy weave know describe multiple time find catch something catch prior explore history sociology psychology fearless lens life funny sanguine honest restore art creative free wander age convulse consumption want explore deftly eye block time observation remain priceless present effortless panache sort even jade year gay club come away experience speechless want stand ovation literary giant tour select arrondissements really like outlier area include insightful strange prefect prep peradventure bit dated subtitle thus signal title little actual walk symbolic wanders vary history write present heir french throne marginalize minority group even gays first disappointed physical wandering describe however grow appreciate perspective insight topic usually cover land novelty distraction great city flâneur aimless stroller lose crowd destination go wherever caprice curiosity direct step enough word english language describe much love read read last decade novelist write eloquently prism gay get do read anyone want someday perspective almost cultural anthropologist able weave together vast knowledge history experience reveal key moment evolution center humanitarian cause progenitor specific national identity call french jaw drop much know art classical music literature religion history ideal anyone degree felt get know personal level writer know much like write afraid reveal flaw especially term lifelong battle sexuality desire recognize great writer drive great anyone gay straight leaf indelible mark warts still meaning enrichment landscape human living matter degrade burden social status marginalize ability create intelligibility one suffer communicate others never take disregarded love french word really look forward read unfortunately little aimlessly stroll author rhetoric poorly write exercise", "genres": ["Memoir", "Essay", "Art & Architecture", "History", "Travel Writing"], "summary": " A flâneur is a stroller, a loiterer, someone who ambles through city streets in search of adventure and fulfillment. Edmund White, who lived in Paris for sixteen years, wanders through the streets and avenues and along the quays, into parts of Paris virtually unknown to visitors and indeed to many Parisians. \r\n\r\nIn the hands of the learned White, a walk through Paris is both a tour of its lush, sometimes prurient history and an evocation of the city's spirit. Edmund White's The Flâneur is opinionated, personal, subjective.\r\n\r\n As he conducts us through the bookshops and boutiques, past the monuments and palaces, filling us in on the gossip and background of each site, he allows us to see through the blank walls and past the proud edifices and to glimpse the inner human drama.\r\n", "asin": "1582342121", "rank": "917461", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51J7w6ivvJL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}