{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 49.262428, "ratings": {"num_ratings": 74, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Awesome book! My 17 year old son and I are reading it. He thinks it's fantastic."}, {"review_sentiment": 4.0, "review_text": "This is the second book by Douglas Coupland that I have read. The other was Eleanor Rigby.  I read this book in two days. Could not put it down. It brought me into the story and even affected my mood. I think the ending was left to interpretation. I choose to take the happier path. You can get a synopsis of the book from the bookseller that would be better than I could do. I'm here to tell you it's worth the read."}, {"review_sentiment": 5.0, "review_text": "Starting with a high school shooting in 1988, this story is told in four parts from four people affected by it, directly or indirectly, and how it changed the course of their lives forever.An interesting look into the lives of ordinary people who survive extraordinary things and then have to go about surviving the mythos built up around the event by those who weren't there.This was the kind of book that when I finished it had me wishing someone else had read it so I could discuss it with them. There was just so much there."}, {"review_sentiment": 2.0, "review_text": "Disappointing read. Author retells several concepts covered in his other books down to the same phrases and words used to describe them."}, {"review_sentiment": 5.0, "review_text": "One of the best books I've read. A total roller coaster. Each character you get so attached to and you have such a connection to by the end. A must read for book clubs, for individuals."}, {"review_sentiment": 1.0, "review_text": "Douglas Coupland has always been one of my favorite authors, but Hey Nostradamus! is so preachy, it turned me off of his work for years (All Families are Psychotic is also subtly self-righteous, but at least it's humorous).  His characterization of Christians is uncharacteristically tone-deaf, but since the book is full of religious undertones, the echoes of that reverberate on every page."}, {"review_sentiment": 3.0, "review_text": "This is my first foray into the world of Coupland’s writing.  I quite enjoyed the story that he developed.  The dark humour combined with the stark look at life and humanity to make an interesting and captivating read.  There were times when I was utterly captivated with the story and others when I found the pace of the story lagged a bit.  The large passage of time in the novel was quite well done.  It was quite interesting to see how a single event affected 4 different individuals over the span of decades.I ‘read’ the audio version of this one and loved the narrators.  The 4 different narrators, one for each section, was brilliant.  They really brought the characters to life in a real and vivid way.  I did have an issue with the audio version I had.  It was only 4 tracks.  Any time I had to pause it for too long and the player reset I had to fast forward through 150+minutes of the track to find my spot.  It made it rather difficult to stay immersed in the story at times (and was beyond frustrating when I hit the wrong button).As a whole this was an enjoyable and unique tale that definitely made me think."}, {"review_sentiment": 5.0, "review_text": "Still one of the best books I've ever read"}, {"review_sentiment": 2.0, "review_text": "What an excellent premise, but the characters are insufferable. I ultimately found Reg to be the least ridiculous and eventually most likeable of the four that the book focuses on. Don't waste your time."}, {"review_sentiment": 5.0, "review_text": "This is one of Couplands most sophiticated works to date and an all time favorite of mine. The actors voices are spot on for the characters as I imagined them."}]}, "authors": ["Douglas Coupland"], "isbn": "1582344159", "longitude": -123.11554, "periods": ["2000s"], "title": "Hey Nostradamus!", "word_cloud": "year old son read think fantastic second day bring story even affect mood think end leave interpretation choose happier path get synopsis bookseller start high school shoot story tell part people affect directly indirectly change course live interesting look live ordinary people survive extraordinary thing go survive myth build event kind finish wish someone else much disappoint retell several concept cover phrase word use describe best a total roller coaster character get attach connection end individual always favorite author preachy turn work year also subtly least humorous characterization uncharacteristically full religious undertone echo page first foray world write quite enjoy story develop dark humor combine stark look life humanity make interesting captivating time utterly captivate story others find pace story lag large passage time quite well do quite interest single event affect different individual span audio version love narrator different narrator section brilliant really bring character life real vivid way issue audio version track any time pause long player reset fast forward track find spot make rather difficult immersed story time frustrate hit wrong button whole enjoyable unique tale definitely make think still best ever excellent premise character insufferable ultimately find least ridiculous eventually likable focus do waste time sophisticate work date time favorite mine actor voice spot character imagine", "genres": ["Fiction & Literature"], "summary": "Pregnant and secretly married, Cheryl Anway scribbles what becomes her last will and testament on a school binder shortly before a rampaging trio of misfit classmates gun her down in a high school cafeteria. \r\n\r\nOverrun with paranoia, teenage angst, and religious zeal in the massacre's wake, this sleepy suburban neighborhood declares its saints, brands its demons, and moves on. But for a handful of people still reeling from that horrific day, life remains permanently derailed. \r\n\r\nFour dramatically different characters tell their stories: Cheryl, who calmly narrates her own death; Jason, the boy no one knew was her husband, still marooned ten years later by his loss; Heather, the woman trying to love the shattered Jason; and Jason's father, Reg, whose rigid religiosity has separated him from nearly everyone he loves. \r\n\r\nHey Nostradamus! is an unforgettable portrait of people wrestling with spirituality and with sorrow and its acceptance.", "asin": "1582344159", "rank": "899240", "city": "Vancouver", "image": "https://images-na.ssl-images-amazon.com/images/I/412fvVlXCvL.jpg", "country": "Canada", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}