{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 49.262428, "ratings": {"num_ratings": 89, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "This is a fantastic book. It reads like a detective thriller. Wait until you get to the bottom of the orphan tsunami."}, {"review_sentiment": 5.0, "review_text": "The author's work was both a compilation of other books I've read on this topic and new information. The combination of both first person accounts, scientific data & projections that the Cascadia fault will probably be the next megaquake to hit Northern California, Oregon, Washington & have major ompact across the Pacific. Be prepared & head to the high ground as fast as you can when it happens. Don't be sucked in by that negative pressure wave to explore that newly exposed ocean bottom when it first hits and die!"}, {"review_sentiment": 3.0, "review_text": "I took a chance buying and reading this 'earthquake & tsunami' book.  Most of the information in it I was already aware of.  But it is OK for someone just now looking into the subject.  The author puts forward the case for the certainty that the Pacific Juan de Fuca plate pushing under the coastal area of Vancouver, Washington state and Oregon (North America plate subduction zone) will (again) result in an earthquake and tsunami  on a par with the Sumatra quake and tsunami of Dec 2004.  The event affected not only that immediate area of Indonesia, but also the entire North Indian Ocean basin.  Deaths were in the hundred thousands.A considerable part of the book tells of evidence that points towards much earlier (pre-historic) quakes/tsunamis at 'Cascadia.'<Cascadia's Fault> is written in a sort of 'chatty', personal style.  The author is not a scientist.  He is a Canadian writer who was once a network newsreader."}, {"review_sentiment": 5.0, "review_text": "Quick delivery, great price, good info thanks. Daniel"}, {"review_sentiment": 5.0, "review_text": "A very good read, both scientifically founded and with a good grounding in the impact these events have on people."}, {"review_sentiment": 5.0, "review_text": "A fascinating look at the history of severe earthquakes along the little known Cascadia fault. This book will leave you thinking seriously about how prepared you and your family are. Also look for the companion documenary Shockwave: Surviving America's Biggest Disaster,  which includes footage of the computer models and real disasters covered in this book."}, {"review_sentiment": 5.0, "review_text": "This was a  mesmerizing book. I couldn't put it down. Living as I do only a few miles from the San Andreas fault,  I read with interest how scientist look for information that show how earthquake are invested and tracked. Thanks to Jerry Thompson for the research and analysis of this story."}, {"review_sentiment": 5.0, "review_text": "There are several books out on this subject and the impending danger, which no on on the West Coast seems to take seriously. Read it and learn!  Now!"}, {"review_sentiment": 4.0, "review_text": "Good book.  It covers a wide and complex subject while remaining interesting to read."}, {"review_sentiment": 5.0, "review_text": "I found this one of the most amazing and sobering non-fiction books I have ever read.  And I live smack in the danger zone.  I recommend this book to anyone who lives within 250 miles of the West Coast of North America.  The book is well-written, well-researched and very readable.  Read it today."}]}, "authors": ["Jerry Thompson"], "isbn": "1582438242", "longitude": -123.11554, "periods": ["2000s", "Recent Releases"], "title": "Cascadia's Fault: The Coming Earthquake and Tsunami that Could Devastate North America", "word_cloud": "fantastic read detective thriller bottom orphan author work compilation topic new information combination first person account scientific data projection fault probably next mega quake hit major impact prepare head high ground fast happen suck negative pressure wave explore newly expose ocean bottom first hit die take chance buying read most information already aware someone look subject author put forward case certainty plate push coastal area state plate abduction zone result par quake event affect immediate area also entire indian basin hundred considerable part tell evidence point towards much earlier write sort personal style author scientist canadian writer network newsreader quick delivery great price good info thanks good scientifically found good ground impact event people fascinating look history severe earthquake along little known fault leave think seriously prepare family also look companion documentary include footage computer model real disaster cover mesmerizing live mile fault interest scientist look information show invest tracked research analysis story several subject impend danger seem take seriously learn now good cover wide complex subject remain interesting find amaze sobering ever live smack danger zone recommend anyone life mile readable today", "genres": ["Science & Nature"], "summary": "Includes a new Afterword by the author on the 2011 Japan Earthquake, the lessons learned, and the parallel threat to North America. A new study just published by the US Geological Survey confirms and underlines many of the issued raised in the first edition of Cascadia's Fault.\r\n\r\nThere is a crack in the earth's crust that runs roughly 31 miles offshore, approximately 683 miles from Northern California up through Vancouver Island off the coast of British Columbia. The Cascadia Subduction Zone has generated massive earthquakes over and over again throughout geologic time--at least thirty-six major events in the last 10,000 years. This fault generates a monster earthquake about every 500 years. And the monster is due to return at any time. It could happen 200 years from now, or it could be tonight.\r\n\r\nThe Cascadia Subduction Zone is virtually identical to the offshore fault that wrecked Sumatra in 2004. It will generate the same earthquake we saw in Sumatra, at magnitude nine or higher, sending crippling shockwaves across a far wider area than any California quake. Slamming into Sacramento, Portland, Seattle, Victoria, and Vancouver, it will send tidal waves to the shores of Australia, New Zealand, and Japan, damaging the economies of the Pacific Rim countries and their trading partners for years to come.\r\n\r\nIn light of recent massive quakes in Haiti, Chile, Mexico -- and Japan -- Cascadia's Fault not only tells the story of this potentially devastating earthquake and the tsunamis it will spawn, it also warns us about an impending crisis almost unprecedented in modern history.", "asin": "1582438242", "rank": "250717", "city": "Vancouver", "image": "https://images-na.ssl-images-amazon.com/images/I/51Ap8XXgEQL.jpg", "country": "Canada", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}