{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 4, "rating": 4.6, "reviews": [{"review_sentiment": 4.0, "review_text": "I felt like I was there with the students of '68. Biased? No doubt, but that's not the point. The vivid view from the left of the barricades is what counts."}, {"review_sentiment": 5.0, "review_text": "This was the first non-fiction that I've read from Sr. Taibo. He brought the same attention to detail and sense of  place to '68 that he brought to his detective novels."}, {"review_sentiment": 5.0, "review_text": "This is what primary-source, first-person history is supposed to be like, and it's written with regret -- regret, specifically, that Taibo II finds himself alone as the memorialist of the rebellion and massacres of 1968. History has made Mexico City into the empty center of the events of that year, and the place where so much of what was to follow, from the Dirty War in Argentina to, ultimately, the Zapatista rebellion in Chiapas, found its beginning. This is essential history; a book that every school library should have."}, {"review_sentiment": 5.0, "review_text": "Paco Ignacio Taibo II, considered by many to be Mexico's greatest modern writer, dives into his memories of 40 years past to recollect a time when the world was turning upside down, when political movements were more than just slogans, and when revolution was something the young deeply aspired to. \"68\" is a powerful, fascinating look at 1960s Mexico, while America was celebrating flower power, Latin America's own youth was inspired and captivated by the possibility of socialist revolution inspired by events in Cuba and figures like Che Guevara. The mass student movement culminated in a notorious chapter of Mexican history: The October massacre in Tlatelolco Square where hundreds, possibly thousands of people were shot down by government troops in an even still shrouded in mystery and official denial. Taibo is the perfect choice to write on the subject considering he lived through it, he was one of the students marching in the streets of Mexico City that year and still a Leftist, having written the definitive Che bio, \"Guevara, Also Known As Che.\" His chronicle here is a nostalgic, interesting, never boring slice of memory. He meticulously captures the culture of the time, not just politically but socially, showing us a conservative country rattled by the emergence of hippies and miniskirts, with students studying Marx and traveling to Havana to drink in the idea of utopian revolution. He also captures the dark side of the times, the brutal government repression, troops invading campuses in ways that make the 60s campus battles in the U.S. seem like child's play. There are comic side stories that dip into the more light-hearted side of youth and discovery, but always full of intrigue, consider Taibo lamenting his girlfriend leaving him for a \"student\" that turned out to be a government informant. \"68\" races along with the urgency of memory, of a writer trying to get it all down before memory and official history begin to fail. 40 years later the bloody events of 1968 will no doubt be revisited in Mexico, and in times just as interesting with the new rise of the Left in the region impulsed by Venezuela. But the beauty of \"68\" is how it is just such a well-written, fascinating moment in time, a universal story of being young and having ideals, fighting authority and hoping for something better. The hope and terror are all here, \"68\" is not confined to it's era and finds itself at home in our own decisive moment in history."}]}, "authors": ["Paco Ignacio Taibo II"], "isbn": "1583226087", "longitude": -99.1333416, "periods": ["1900s"], "title": "68", "word_cloud": "felt student bias doubt vivid view leave barricade count first taboo bring attention detail sense place bring detective novel history suppose write regret regret specifically find alone memorialize rebellion massacre make empty center event year place much follow ultimately rebellion find begin essential history school library consider many greatest modern writer dive memory year recollect time world turn upside political movement slogan revolution something young deeply aspired powerful fascinate look celebrate flower power youth inspire captivated possibility socialist revolution inspire event figure mass student movement culminate notorious chapter history massacre hundreds possibly thousand people shot government troop even still shroud mystery official denial perfect choice write subject consider live student march street year still write definitive bio also chronicle interest never boring slice memory meticulously capture culture time politically socially show conservative country rattle emergence hippy miniskirts student study travel drink idea utopian revolution also capture dark side time brutal government repression invade campus way make campus battle seem child play comic side story dip side youth discovery always full intrigue consider lament girlfriend leave student turn government informant race urgency memory writer try memory official history begin year later bloody event doubt revisit time interest new rise region impulsed beauty fascinating moment time universal story young ideal fight authority hop something better hope terror confine era find home decisive moment history", "genres": ["History", "Politics"], "summary": "On the night of October 2, 1968, there occurred a bloody showdown between student demonstrators and the Mexican government in Tlatelolco Square. At least two hundred students were shot dead and many more were detained. Then the bodies were trucked out, the cobblestones were washed clean. Detainees were held without recourse until 1971. \r\n\r\nOfficial denial of the killing continues even today: In the first week of February 2003, Mexico's Education Secretary Reyes Tamiz ordered a new history textbook that mentions the massacre-Claudia Sierra's History of Mexico: An Analytical Approach-removed from shelves and classrooms. (Public outcry led Tamiz to reverse his decision days later.) No one has yet been held accountable for the official acts of savagery. \r\n\r\nWith provocative, anecdotal, and analytical prose, Taibo claims for history \"one more of the many unredeemed and sleepless ghosts that live in our lands.\"", "asin": "1583226087", "rank": "787210", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/51rHYpFvugL.jpg", "country": "Mexico", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}