{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 55, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent. Good images, well organized."}, {"review_sentiment": 5.0, "review_text": "Very useful."}, {"review_sentiment": 5.0, "review_text": "Practical format and easy to use"}, {"review_sentiment": 5.0, "review_text": "This was perfect for our trip to Galapagos w our kids. I brought a sharpie w me and they could check off all the animals they saw."}, {"review_sentiment": 5.0, "review_text": "great pocket guide to take with you to the galapagos...was really helpful when i was there...."}, {"review_sentiment": 5.0, "review_text": "Highly overpriced"}, {"review_sentiment": 5.0, "review_text": "taking it with us for our 2 month stay on the Galapagos"}, {"review_sentiment": 5.0, "review_text": "This is an excellent guide that I wished I had known about and purchased before visiting the Galapagos.  Highly recommended to take when going to the enchanting and fascinating Galapagos Islands!"}, {"review_sentiment": 5.0, "review_text": "Quick and easy reference and very easy to pack!"}, {"review_sentiment": 4.0, "review_text": "Good, practical and handy field reference that is highly portable and resilient to the elements...so easy to use and very comprehensive."}]}, "authors": ["James Kavanagh", "Waterford Press"], "isbn": "158355081X", "longitude": 0.0, "periods": ["2000s"], "title": "Galapagos Wildlife", "word_cloud": "excellent good image well organize very useful practical format easy use perfect trip w kid bring sharpie w animal saw great pocket guide really helpful highly overprice take month stay excellent guide wish know purchased visit recommend go enchant fascinate island easy reference easy pack good practical handy field reference highly portable resilient element easy use comprehensive", "genres": ["Science & Nature", "Guide Books"], "summary": "A Folding Pocket Guide to Familiar Animals \r\n\r\nOne of the most unique ecosystems in the world, the Galapagos Islands feature a bizarre diversity of wildlife, with many species endemic to the islands. \r\n\r\nThis beautifully illustrated guide highlights over 140 familiar and unique species of mammals, birds, reptiles, fishes, seashore creatures and butterflies/insects. Also features a unique map that shows the location of the top 10 most sought-after species including the Galapagos tortoise and the flightless cormorant. \r\n\r\nLaminated for durability, this lightweight, pocket-sized folding guide is an excellent source of portable information and ideal for field use by eco-tourists visiting the islands. ", "asin": "158355081X", "rank": "40206", "city": "Galápagos Islands", "image": "https://images-na.ssl-images-amazon.com/images/I/51RbWgP-NFL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}