{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 102, "rating": 4.3, "reviews": [{"review_sentiment": 1.0, "review_text": "Not my cup of tea....."}, {"review_sentiment": 4.0, "review_text": "Good read, captivating text."}, {"review_sentiment": 5.0, "review_text": "All these years later, I am just getting to the Paul Christopher series. Two down so far, ten stars given. I look forward to the next one and find myself pleased that I have these novels to read now."}, {"review_sentiment": 5.0, "review_text": "This guy is a great writer of the old school. Well worth reading anything he's written. Great vacation reading. You're learning about other places and people while escaping your own humdrum life."}, {"review_sentiment": 5.0, "review_text": "Thank you to the great Otto Penzler, for singling out McCarry in a recent NYT Books interview as the best international espionage/thriller writer.  New to this reader, McCarry fully lives up to Penzler's ultimate compliment, in this spellbinding, gripping riff on the JFK assassination.  When, at the end, the White House forces the protagonist to connect the incredible dots that are his findings, and you, the reader, find yourself three feet ahead of the pols, the feeling of reading satisfaction is immense."}, {"review_sentiment": 5.0, "review_text": "I've never read McCarry before. It was just by happenstance that I read an article about some of the best spy writers that have gone unnoticed. His exploration of the Kennedy assassination is both compelling and somewhat frightful. His previous life in intelligence gives the narrative an undeniable authenticity that so many thriller writer lack."}, {"review_sentiment": 5.0, "review_text": "Charles McCarry is perhaps the finest writer in this field and Tears of Autumn is his masterpiece. As intelligent as it is worrying, this book weaves a fascinating and complex tapestry around the assasination of JFK. Mr McCarry speaks with the authority of one who has worked in the field about which he writes and develops a sense of  momentum that drives relentlessly towards a stunning conclusion. His characters - and the world they inhabit-  will live in the memory long after the last page is read. All the Paul Christopher books are excellent, but this one joins the pantheon reserved for the very best.."}, {"review_sentiment": 5.0, "review_text": "Excellent book by a writer who knows his subject matter first hand. Loved this book and was fascinated by the premise upon which the author based his story."}, {"review_sentiment": 5.0, "review_text": "One of the greatest modern story tellers."}, {"review_sentiment": 4.0, "review_text": "What I liked about this spy novel was that it was intelligent.  Well written.  Lots of inner dimensions and observations.  However, The Last Supper, a subsequent book was excellent!  I will read more of this author."}]}, "authors": ["Charles McCarry"], "isbn": "1585678902", "longitude": 2.3514992, "periods": ["1900s"], "title": "Tears of Autumn: A Paul Christopher Novel", "word_cloud": "not cup tea good captivating text year later get series far ten star give look forward next find pleased novel guy great writer old school read anything write vacation read learning place people escape humdrum life great singling recent interview best international writer fully live ultimate compliment spellbind grip riff assassination end force protagonist connect incredible dot finding find foot ahead pols feel read satisfaction immense never mccarty happenstance article best spy writer go unnoticed exploration assassination compel somewhat frightful previous life intelligence give narrative undeniable authenticity many thriller writer lack perhaps finest writer field masterpiece intelligent worry weave fascinate complex tapestry assassination speak authority work field writes develop sense momentum drive relentlessly towards stun conclusion character world live memory long last page excellent join pantheon reserve excellent writer know subject matter first hand fascinate premise author base story greatest modern story teller like spy intelligent write inner dimension observation however last subsequent excellent author", "genres": ["Fiction & Literature", "Mystery & Suspense", "Politics"], "summary": "Book 2/7 in the Paul Christopher Series\r\n\r\nThreatened by Kennedy's assassins and by his own government, secret agent Christopher follows the scent of his suspicion―one breath behind the truth, one step ahead of discovery and death.\r\n\r\n\"As soon as he began publishing fiction more than three decades ago, Charles McCarry was recognized as a spy novelist of uncommon gifts\" wrote Charles Trueheart in The Washington Post. Tears of Autumn, McCarry’s riveting novel of espionage and foreign affairs, was a major bestseller upon its first publication in 1975. Spun with unsettling plausibility from the events surrounding the assassination of John F. Kennedy, and featuring Paul Christopher, it’s a tour de force of action and enigma. Christopher, at the height of his powers, believes he knows who arranged the assassination, and why. His theory is so destructive of the legend of the dead president, though, and so dangerous to the survival of foreign policy that he is ordered to desist from investigating. But he is a man who lives by, and for, the truth―and his internal compunctions force him to the heart of the matter. Christopher resigns from the Agency and embarks on a tour of investigation that takes him from Paris to Rome, Zurich, the Congo, and Saigon.", "asin": "1585678902", "rank": "128377", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51B7hAAO0mL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}