{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 93, "rating": 3.7, "reviews": [{"review_sentiment": 4.0, "review_text": "Most interesting topic. Some areas could have moved along faster, but worth the read."}, {"review_sentiment": 5.0, "review_text": "It's a complicated murder mystery. I don't often read murder mysteries, but it was recommended for its evocation of the Kabbalist movement during the Inquisition. It is well written, pleasant, easily flowing and, assuming that it is accurate (the probability is that it is--the geography is accurate) an interesting education."}, {"review_sentiment": 4.0, "review_text": "But sometimes the plot loses speed.  The author knows his Jewish tradition very well and in great detail.I caught only two errors that were not typosTallis - in Sephardi transliteration should be tallit.  The author gives the Ashkenazi pronunciation instead.Tu Bisvat - should be Tu Bishvat."}, {"review_sentiment": 5.0, "review_text": "Historical novel, pretty graphic at time. Recommended."}, {"review_sentiment": 5.0, "review_text": "A very lively rapport. I was swooped back to the time of the story, felt and smelt what the hero of this story. Appreciated the efforts of the author to be true to those days and places whilst updating the writing to our times for our benefit. Well done."}, {"review_sentiment": 5.0, "review_text": "Richard Zimler based the novel on the Lisbon Massacre, in early the 1506.  The Inquisition, which began in Spain in 1478, instituted by King Ferdinand and Queen Isabella, spread to Portugal.  Zarco describes the reign of terror in Lisbon during the Lisbon Pogrom of 1506, which claimed the lives of 2000 Jews, many burned at the stake.Berekiah Zarco ‘s uncle, Abraham Zarco, a Torah scholar and a Kabbalist, (one emerged in the mystical realms of Judaism), teaches Torah study in his home.  On the eve of Passover, Berekiah discovers his uncle, murdered.  He also learns his brother is missing.  Berekiah sets out to track the murderer and find his brother.“The Last Kabbalist”, leads one on an amazing journey in Jewish history, religion and mysticism.  Richard Zimler resides in Portugal.  The author has received multiple literary awards."}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 2.0, "review_text": "Poor and none well researched."}, {"review_sentiment": 5.0, "review_text": "This is a topic which is near and dear to my heart. It's not for everyone, but it is historically correct and gives an insider's look to the pain and suffering of Iberian Jews during the riots, pogroms, and expulsion. The book is filled with the horrific details of slaughter , burning at the stake, burning in hot oil, torture of every imaginable way a person could create to hurt another human being.Some people gave in and converted to save their families, others chose death. Persecution, love, family, Judaism, history..this book has it all. Well written and researched,  a true story come to life through the pen of Richard Zimler."}, {"review_sentiment": 5.0, "review_text": "This is the first in the author's Sephardic Cycle book series. I read it years ago but just re-read it and it was like reading it for the first time. Highly recommended!!!"}]}, "authors": ["Richard Zimler"], "isbn": "1585670227", "longitude": -9.1365061, "periods": ["1500s"], "title": "The Last Kabbalist of Lisbon", "word_cloud": "most interesting topic area along faster worth complicate murder mystery often murder mystery recommend evocation movement inquisition well write pleasant easily flow assume accurate probability geography accurate interesting education sometimes plot loses speed author know jewish tradition well great catch error typostallis transliteration tall it author give pronunciation historical pretty graphic time recommend lively rapport swoop back time story felt smelt hero story effort author true day place whilst update write time benefit do base early begin institute spread describe reign terror claim life many burn uncle scholar emerge mystical realm teach study home eve discovers uncle murder also learn brother miss set track murderer find lead amazing journey jewish history religion mysticism reside author receive multiple literary award excellent none well research topic dear heart everyone historically correct give insider look pain suffer iberian riot pogrom expulsion fill horrific detail slaughter burn stake burn hot oil torture imaginable way person human people give convert save family others choose death love family write research true story come life pen first author series year ago read first time recommend", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "The Last Kabbalist of Lisbon, an international bestseller, is an extraordinary novel that transports listeners into the universe of Jewish Kabbalah during the Lisbon massacre of April 1506.\r\n\r\nJust a few years earlier, Jews living in Portugal were dragged to the baptismal font and forced to convert to Christianity. Many of these New Christians persevered in their Jewish prayers and rituals in secret and at great risk; the hidden, arcane practices of the kabbalists, a mystical sect of Jews, continued as well. One such secret Jew was Berekiah Zarco, an intelligent young manuscript illuminator. Inflamed by love and revenge, he searches, in the crucible of the raging pogrom, for the killer of his beloved uncle Abraham, a renowned kabbalist and manuscript illuminator, discovered murdered in a hidden synagogue along with a young girl in dishabille. Risking his life in streets seething with mayhem, Berekiah tracks down answers among Christians, New Christians, Jews, and the fellow kabbalists of his uncle, whose secret language and codes by turns light and obscure the way to the truth he seeks. \r\n\r\nA marvelous story, a challenging mystery, and a telling tale of the evils of intolerance, The Last Kabbalist of Lisbon both compels and entertains.", "asin": "1585670227", "rank": "351170", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/61ouAs31MDL.jpg", "country": "Portugal", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}