{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 59.9132694, "ratings": {"num_ratings": 12, "rating": 3.7, "reviews": [{"review_sentiment": 4.0, "review_text": "This is not a mystery; that is implied in the liner notes. It is far more: the exploration of a personal and national journey. The study of a northern nation on the edge of Europe. The study of an intense man blessed with intelligence, good looks and charisma. It is an intensely sexual novel, and some readers may object to his unfaithfulness. It is never at the heart of the novel.I liked the stories about Norway and its history. Perhaps it's because my wife's family emigrated to the US from Norway. Because the country fascinates with his lately-discovered oil wealth and efforts to control the impact on the nature of their society. All are reflected here.I didn't give it five stars only because I was at times tired of the length, but have been traveling, and that may have contributed to it.Today, I am flying to Oslo, and will meet some of those relatives and talk of the book. Perhaps I will be able to round out this review with their thoughts.For today, I highly recommend it"}, {"review_sentiment": 4.0, "review_text": "Others have taken the time to describe the content.  I enjoyed the book immensely, but then I like the 1001 Arabian Nights too.  And like 1001, despite being entranced by the vivid nature of the stories and charmed by the *amazing* sentence structures, I find it hard to keep the reading going.  It took me a couple of months to finish the thing!Since it is so very episodic, each small chapter of the book is a mini-story selected from any of the various parts of Wergeland's life, it becomes somewhat taxing to read 60 pages in a row.  Perhaps others are inclined to read a collection of short stories that way, say 5 stories at a time, but I am not.Kjaerstad's descriptions are amazing, many of the mini-stories are truly delightful.  And if you are particularly interested in Norwegian/Scandinavian mindsets, culture, attitudes, etc. the book does provide significant aid, in that this is a central hub of what the book is about: The nature of Norwegian self-perception.I'd love to read the next two volumes, but taking two months off my schedule to read the first, really makes it a bit commitment for me.  I am about 50/50 over whether I can do it.  I would love to read a little less episodic fiction by this truly gifted writer, though."}, {"review_sentiment": 3.0, "review_text": "Intriguing and well written but at times it could have done with more focus for my liking."}, {"review_sentiment": 4.0, "review_text": "Meandering, episodic, tragic, but beautiful tale of fateful intertwined lives."}, {"review_sentiment": 5.0, "review_text": "Another reviewer wrote, \" I loved reading this book, beginning it as a 'have to read it for book club' task and then finding I couldn't get enough.\"  I echo this conclusion; I couldn't get enough of this book.  It's filled with ideas and information and it reminds me of novels of my youth, now long gone."}, {"review_sentiment": 5.0, "review_text": "Other reviews have told the opening - Jonas returns from a business trip to find his wife's body in the living room floor. You expect a murder mystery, and it's in there. But there is so much more: shades of James Joyce as stream of consciousness flows from the mind of Jonas as he tries to understand (or deny) what he is seeing. Then begins the true journey, a journey into memory, into fantasy, into angst, into life, and the author takes the reader on a sometimes leisurely, but often fast-paced ride into the world of Jonas' past. A brilliant work and sincere kudos to the translator, who has surely managed the near impossible, bringing the story from the Norwegian language into marvelous English prose. This should not be a fast read; relax and enjoy the pace as you travel the world with a master storyteller as your guide. Hints of Michener, Hemingway, Rutherford, and many, many others. Savor."}, {"review_sentiment": 5.0, "review_text": "\"Is this the most crucial story in Jonas Wergeland's life?\"  Like Karosawa's 'Rashomon,' the novel tells stories, one after the other, in the form of short chapters that fit together (the whole mosaic makes sense) and don't fit together (each glows on its own). The stories are spiced with a luscious sexuality (\"The one thing the women who made love to Jonas had in common was that they all instinctively sat astride him.\"). Good sex seems to flow to him, like the prom king you hated in high school, without much effort. And each sexual event permeates his being with a new sense of who he is.The sustenance of book, though, is the story of Norway, what it is now, a nation of comfortable (indeed VERY comfortable) risk-averse, xenophobic social democrats watching TV, smug at times, breaking into a sweat not very often (perhaps only during Nordic races). \"When do we see who we are?\", asks the narrator.The author brilliantly, and often comically, keeps the reader engaged in cliff-hanger moments that rivet attention: Jonas as a child is trapped inside a snow fort and left for dead by his cousin, and the next chapter begins with Jonas as a teenager talking about Dostoyevsky's description of sable eyebrows and the Russian ideal of beauty. Disconnected?  Yes. Totally effective in creating acan't-put-it-down novel? Definitely!The erudition of the author is impressive, his cliff-hanger style engaging, and his comments on present day Norway hilarious and thought-provoking. He is so in love with details his protagonist vomits when he sees his hometown at altitude and can't make out the beloved familiar texture of it. I loved reading this book, beginning it as a 'have to read it for book club' task and then finding I couldn't get enough."}, {"review_sentiment": 5.0, "review_text": "Andrew Linkner has, I think, largely missed the point of the \"sex scenes\"'s predictability or episodic nature. Yes, they proceed in similar fashion; yes, the women featured in them appear and then disappear from the narrative. But Kjærstad is very clear in why this should be so: the short chapters comprising the novel are intended to evoke the structure of One Thousand and One Arabian Nights as well as the epic poem; the sexual episodes echo a more compact narrative related to the protagonist (Jonas) as a youth by his eccentric aunt; they provide a contrast to the two females/women whom the protagonist truly loves, who stay with us throughout the entire novel; and they are some of the \"parts\" into which Jonas's life is split by his prism, which guides him from his childhood love to his adult love, from his childhood aimlessness to his fame-making television series (23 episodes, mirroring his 23 sexual experiences).It is ironic that Andrew's criticism makes so much of the episodes' depicting sexuality in a juvenile fashion, considering that they occur primarily during Jonas's teenage and early adult years. The criticism is ironic, too, in that it suggests a moralistic discomfort with sexuality lampooned by Kjærstad in the form of Jonas's cousin Veronika. Veronika struggles to reduce a complex, incomprehensibly beautiful world into simplistic, flat dichotomies that only nauseate Jonas. That anyone reading this novel could come away from it thinking it to be sex-obsessed nauseates me, a bit.It is true that Jonas's appeal -- to his sexual partners, to the nation that adores him, to the narrator -- is mysterious and his motivations unexplained. But again these are part of the point in a novel that makes no firm commitment to causality or temporality. And, indeed, we are constantly asked, How do the pieces of a life fit together? How can we describe our lives as anything other than a series of disconnected stories (which is how the novel is structured)? One of Jonas's mentors reveals the infinite possibility of being human -- how do you bring that all to a point? And to be frustrated by the omniscient narrator's unresolved identity! Kjærstad is toying with us here -- the narrator tells us directly that there are things being related to us the narrator would have no way of knowing. Let it be!This is an exquisitely structured novel, full of beautiful moments, philosophical moments, moments that crack your head open and make you look at the world a different way. The chapters are very short, which makes the prose, which can be long-winded at times, much more bearable -- though by the end I scarcely noticed the long sentences any more. Take your time with this novel, let it seep into your brain, and the world around you will take on a deeper texture. It will make you a more patient person."}, {"review_sentiment": 2.0, "review_text": "606-page purported psychohistory of a Norwegian pop intellectual, a producer of entertainment documentaries for NRK, extolled as a big fish in a small pond, but impliedly deserving of global adulation.  One is incessantly reminded that our hero is destined from an early age to seduce not only this small, wealthy, complacent nation but certain predictably remarkable and singular (and needless to say beautiful and libidinous) Norwegian women, and that he does so effortlessly, often inadvertently, as though gifted by an obscure Norse goddess.  Indeed, Kjaerstad's claims for his brilliance notwithstanding, the seductive producer seems to drift through life, as one reviewer said, Tom Jones-style, continually baffled and awed by his next wacky experience, rife in this ponderous tome, which is not PoMo simply because constructed almost entirely of flashbacks, many or most of which entail the cheap titillation of teen and even pre-teen sex.  Furthermore, a female reader might well wonder what is supposed to be so interesting and attractive about this guy?  The author isn't sure himself so imbues his subject with magic.  Which represents, some women might say (you'll have to ask them), male fantasy, and adolescent besides.At the opening, and at the conclusion, the seducer's spouse, a socialized-medicine physician, the love of his life, is shot to death in the living room in Olso's version of a villa, but a police procedural this is not, nor a treatment of violence a tenth as compelling as what Steig Larsson later conjured.  There's no ending, though, to \"give away\" in this review.Finally, it should be noted the story is related by an anonymous narrator in an old-fashioned \"dear reader\" style that may not be to everyone's taste, unless one has plowed through such things as Tristram Shandy, and the identity of the omniscient psychohistorian is also not satisfactorily resolved.Overall, the novel is far too expansive, and pretentious, and long, effectively to convey the tight angst of even the semi-intellectuals of those chilly environs."}, {"review_sentiment": 5.0, "review_text": "I just want to set the record straight :: This book is NOT only about sex. Was the negative reviewer expecting a steamy romance novel? This book is about philosophy, and memory, and socialism, and our individual and collective unconsciousness(es). The writer's got style to spare so that EVERY page is a joy to read and can be savored again and again. Yes, it IS postmodern. To paraphrase Madonna: We are living in the postmodern world, and I'm a postmodern girl. This is definitely a desert island book...and the the trilogy would be a luxury and a blessing."}]}, "authors": ["Jan Kjaerstad"], "isbn": "1585678686", "longitude": 10.7391112, "periods": ["2000s", "Recent Releases"], "title": "The Seducer: A Novel", "word_cloud": "mystery imply liner note far exploration personal national journey study northern nation study intense man bless intelligence good look charisma intensely sexual reader unfaithfulness never heart like story history perhaps wife family emigrate country fascinate oil wealth effort control impact nature society reflect give star time tire length traveling fly meet relative talk perhaps able round review today highly recommend others take time describe content enjoy immensely like arabian entranced vivid nature story charm sentence structure find hard keep reading go take couple month finish thing episodic small chapter select various part life become somewhat taxing page row perhaps others incline collection short story way say story time descriptions amaze many truly delightful particularly interested mindset culture attitude etc significant aid central hub nature norwegian love next volume take month schedule first really make bit commitment little le episodic fiction truly gifted writer intrigue well write time do like meander episodic tragic beautiful tale fateful intertwine life reviewer write love read begin club task find enough echo conclusion enough fill idea information remind novel youth long go other review tell open return business trip find wife body living room floor expect murder mystery much shade stream consciousness flow mind try understand see then begin true journey journey memory fantasy angst life author take sometimes leisurely often ride world brilliant work sincere kudos translator surely manage impossible bring story norwegian language marvelous prose fast relax enjoy pace travel world master storyteller guide many many others savor be crucial story life tell story form short chapter fit together whole mosaic make sense fit together glow story spice luscious sexuality thing woman make love common instinctively sat astride good sex seem flow prom king hat high school much effort sexual event permeate new sense sustenance story nation comfortable indeed comfortable social watch tv smug time break sweat often perhaps race see ask brilliantly often comically keep engaged moment rivet attention child trap inside snow fort leave dead cousin next chapter begin teenager talk description sable eyebrow russian ideal beauty effective create definitely erudition author impressive style engage comment present day hilarious detail protagonist vomit see hometown altitude beloved familiar texture love read begin club task find enough think largely miss point sex scene predictability episodic nature proceed similar fashion yes woman feature appear disappear narrative clear short chapter comprise intended evoke structure well epic poem sexual episode echo compact narrative relate protagonist eccentric aunt provide contrast protagonist truly love stay entire part life split prism guide childhood adult childhood aimlessness television series episodes mirror sexual experience ironic criticism make much episode depict sexuality juvenile fashion consider occur primarily early adult year criticism ironic suggest moralistic discomfort sexuality lampoon form cousin struggle complex incomprehensibly beautiful world simplistic flat dichotomy nauseate jonas anyone reading think nauseates true appeal sexual partner nation adore narrator mysterious motivation unexplained part point make firm commitment causality temporarily indeed constantly ask piece life fit together describe live anything series disconnect story structure mentor reveal infinite possibility human bring point frustrated omniscient narrator unresolved identity toy narrator tell directly thing relate narrator way know exquisitely structure full beautiful moment philosophical moment moment crack head open make look world different way chapter short make prose time much bearable end scarcely notice long sentence take time seep brain world take deeper texture make patient person purport psycho history norwegian pop intellectual producer entertainment documentary extol big fish small pond impliedly deserve global adulation incessantly remind hero destine early age small wealthy complacent nation certain predictably remarkable singular needle say beautiful libidinous norwegian woman effortlessly often inadvertently gifted obscure goddess indeed claim brilliance notwithstanding seductive producer seem drift life reviewer say continually baffle awed next wacky experience rife ponderous tome simply construct almost entirely flashbacks many entail cheap titillation teen even sex female well suppose interesting attractive guy author sure imbues subject magic represent woman male fantasy adolescent open conclusion seducer spouse physician love life shot death living room version villa police procedural treatment violence tenth compel later conjure end give away note story relate anonymous narrator dear style everyone taste plowed thing identity omniscient psycho historian also satisfactorily far expansive pretentious long effectively convey tight angst even chilly environs want set record straight sex negative reviewer expect steamy romance philosophy memory socialism individual collective unconsciousness es writer get style spare page joy savor postmodern live postmodern world postmodern definitely desert island trilogy bless", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Interludes of memory and fancy are mixed with a murder investigation in this panoramic vision of contemporary Norway.\r\n\r\nJonas Wergeland, a successful TV producer and well-recognized ladies man, returns home to find his wife murdered and his life suddenly splayed open for all to see. As Jonas becomes a detective into his wife's death, the reader also begins to investigate Jonas himself, and the road his life has taken to reach this point, asking How do the pieces of a life fit together? Do they fit together at all? \r\n\r\nThe life Jonas has built begins to peel away like the layers of an onion, slowly growing smaller. His quest for the killer becomes a quest into himself, his past, and everything that has made him the man he seems to be. ", "asin": "1585678686", "rank": "1455882", "city": "Oslo", "image": "https://images-na.ssl-images-amazon.com/images/I/41qgKzsY0ML.jpg", "country": "Norway", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}