{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 8, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "I adore this book. I'm somewhat obsessed with the Spanish Civil War, but even if you're not, it's a moving story, beautifully told."}, {"review_sentiment": 1.0, "review_text": "The book is boring. Often confusing in that its difficult to make out who's doing the story telling. It's not as is claimed in the description \"a beautiful love story\" and is a long way behind dozens of books in providing an account of the horrors of the Spanish Civil war. Try Guernica or Winter in Madrid if that's what you want to read about"}, {"review_sentiment": 5.0, "review_text": "Read this on a trip to A Coruna, Spain. Had the pleasure of visiting the setting of the book as I was reading it, which I've never done before.  Moving and beautifully written."}, {"review_sentiment": 4.0, "review_text": "The Carpenter's Pencil does many things in its brief, but powerful tale of the Spanish Civil War.  For one thing, it reminds us that people who survive war always bear the scars, be they of the physical or psychological wounds of war, and often it is those on the \"winning side\" who are the most broken.  This is not an easy book to read - Manuel Rivas spares the reader nothing of the brutalities and suffering of the time.  He also demands that his reader pay close attention to his small cast of characters as he allows them their own memories and ways of reflecting on their shared past.  But once you have assembled the pieces it is worth the effort.  For you uncover unexpected moments of great humanity.  Small gestures of courage and kindness may not change the tide of history, but they are powerful reminders of how good people living through bad times can make a difference."}, {"review_sentiment": 5.0, "review_text": "From the opening sentence I guessed this book would take me on a roller-coaster ride. I know little about the Spanish Civil War but feel that in its sparse and spartan phrasing I have learned a lot from this book. The contradictory nature of the main speaker, Herbal, his mix of brutality and sharp observation is elegantly handled. His conscience is haunted by the ghost of the painter he has killed and whose carpenter's pencil he keeps, leads him to rescue the mythical figure of Daniel de Barca despite the fact he seems to be in love with his beautiful wife, Marisa. The medical terms are beautifully developed into metaphor for the sickness of the civil war and for mortality and the blackbirds of the first line sing intermittently throughout the book.  I especially enjoyed the pared-back style, switches in time and voice and this left me with many questions - so I turned the book back to the beginning and re-read it, catching things I had at first missed."}, {"review_sentiment": 5.0, "review_text": "REimagining human generosity and love in times of war. A novel, already a classic in Spanish Literature."}, {"review_sentiment": 4.0, "review_text": "\"The Carpenter's Pencil\", is a wonderful short novel. There are times it becomes a bit confusing to track who or what is relating the story. However the small amount of time invested to sort out the voices is more than well rewarded. The book also contained something I had not seen before. There were two poems referenced in the book, and they were included in their entirety in appendices. One is from the 19th and the other the 13th Century. It was a pleasant change to be able to read the entire poems rather than be limited to excerpts in the main text.There are about 8-10 different players that appear. The number arrived at depends on how much you feel a character must contribute, and how they make that contribution. Must a person be present in the flesh, or can they continue to influence events after death? The book begins in a contemporary setting and then quickly returns to the story of the man a reporter has come to interview. This is when the book really shines with a love story and an unlikely cast that make the union of the two lovers possible.The primary tale of memory takes place just before, through, and finally after Franco's rule over Spain has ended. This end allows for some who were forced to flee to return home, a home that they fought for and were punished by. The brief work is really very good, for while it is brief it conveys a story that feels almost epic in its tightly written and intricate prose.A bit of effort to be sure you have the voices sorted out, and you will enjoy a wonderful novella."}, {"review_sentiment": 5.0, "review_text": "There are as many Galicians abroad as in Spain. So now that we see one of our writers translated directly from our language into English, our pride gets a special boost.  With Rivas, our literature has found its own boom. He gives a new insight to our culture, our language, and our traditions. Thanks, Jonathan Dunne, for a job well done! Graciñas, Manuel, for helping us in learning about ourselves!"}]}, "authors": ["Manuel Rivas"], "isbn": "1585671452", "longitude": 2.1774322, "periods": ["1900s"], "title": "The Carpenter's Pencil", "word_cloud": "adore somewhat obsess spanish even move story beautifully tell boring confuse difficult make story tell claim description beautiful story long way dozen provide account horror spanish war want read trip pleasure visit set read never do beautifully write many thing brief powerful tale spanish thing remind people survive war always bear scar physical psychological wound war often win side break easy spar nothing brutality suffer time also demand pay close attention small cast character allow memory way reflect share assemble piece worth effort uncover unexpected moment great humanity gesture courage kindness tide history powerful reminder good people live bad time make difference open sentence guess ride know little spanish sparse spartan phrasing learn lot contradictory nature main speaker mix brutality sharp observation elegantly handle conscience haunt ghost painter kill carpenter keep lead rescue mythical figure fact seem love beautiful wife medical term beautifully develop metaphor sickness civil war mortality blackbird first line sing intermittently especially enjoy style switch time voice leave many question turn begin catch thing first miss re imagining human generosity love time war already classic spanish literature wonderful short time become bit confusing relate story however small amount time invest sort voice well reward also contain something see poem reference included entirety appendix pleasant change able entire poem rather limit excerpt main different player appear number arrive depends much feel character contribution person present flesh continue influence event death begin contemporary set quickly return story man reporter come interview really shine love story unlikely cast make union lover primary tale memory take place finally rule end end allow force flee return home home fought punish brief work really good brief conveys story feel almost epic tightly write intricate bit effort sure voice sort enjoy wonderful novella many galician abroad writer translate directly language english pride get special boost literature find boom give new insight culture language tradition job well do help learn", "genres": ["History", "Spanish Civil War"], "summary": "Manuel Rivas has been heralded as one of the brightest in a new wave of Spanish writers influenced by Spanish and European traditions, as well as by the history of Spain over the past seventy years.\r\n\r\nA bestseller in Spain, The Carpenter's Pencil has been published in nine countries.\r\n\r\nSet in the dark days of the Spanish Civil War, The Carpenter's Pencil charts the linked destinies of a remarkable cast of unique characters. All are bound by the events of the Civil War-the artists and the peasants alike-and all are brought to life, in Rivas's skillful hand, with the power of the carpenter's pencil, a pencil that draws both the measured line and the artist's dazzling vision.", "asin": "1585671452", "rank": "2646688", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/41BRBZHW4ZL.jpg", "country": "Spain", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}