{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 53, "rating": 3.9, "reviews": [{"review_sentiment": 2.0, "review_text": "I'll preface by saying that I haven't finished this book and most likely won't. The description and introduction to this book describe a collection of stories of politics, spies and subterfuge in Lisbon during World War II, the ensuing chapters all seem to be about \"The Most Beautiful Dictator,\" Salazar, and how he brilliantly kept Portugal out of the war.While the fawning language about a tyrant is off-putting, I'm mostly annoyed that this is just not how the book was marketed. Perhaps patience leads to the promised stories, but based on the writing so far, I don't think I'll make it that far."}, {"review_sentiment": 5.0, "review_text": "Exceptional research and writing. WWII history often reads as an intriguing novel."}, {"review_sentiment": 2.0, "review_text": "I bought this to read while visiting Lisbon, and the information it provided was a great accompaniment to a walk around the city. It's not great writing, though. The book is very repetitive, and the narrative follows a seemingly random order. Some sentences are so vague they require multiple passes to be understood."}, {"review_sentiment": 3.0, "review_text": "This is basically a history of the Salazar regime. I expected more on who moved through there during the war and maybe a bit of \"cloak and dagger\"."}, {"review_sentiment": 5.0, "review_text": "A friend in Argentina wanted to read this book and I ordered two copies - one was \"used\" and the other was \"new\".  They arrived at different times and a mutual friend was able to take the used copy to her in Argentina.  The \"new\" copy arrived too late and therefore is being saved in another NYC apartment for my friend to read and share when she returns to NY.  She is delighted to have nearly finished reading the book and reports the story is well-written and reminds her of the stories about difficulties her family and so many others had leading up to WW II."}, {"review_sentiment": 4.0, "review_text": "This was a fascinating look into a lesser known (at least for me) episode in WWII. Dictator Salazar's attempt to walk the tightrope between Allied and Axis forces made for very interesting reading."}, {"review_sentiment": 4.0, "review_text": "Lochery's account of Portugal during world war ll was fascinating. However, I think he was quite kind to Salazar, who made sure Portugal profited handsomely from trade of wolfram to Germany while throwing crumbs to the allies.  Still, it is a good read."}, {"review_sentiment": 3.0, "review_text": "Interesting but not as good as other books covering that period.."}, {"review_sentiment": 5.0, "review_text": "Fascinating history to read before a visit to Lisbon."}, {"review_sentiment": 4.0, "review_text": "Xlent detail"}]}, "authors": ["Neill Lochery"], "isbn": "1586488791", "longitude": -9.1365061, "periods": ["1900s", "Recent Releases"], "title": "Lisbon: War in the Shadows of the City of Light, 1939-45", "word_cloud": "preface say finish likely description introduction describe collection story politics spy subterfuge ensue chapter seem most beautiful brilliantly keep fawn language tyrant mostly annoy market perhaps lead promise story base write far think make far exceptional research write history often read intrigue buy visit information provide great accompaniment walk great write repetitive narrative follow seemingly random order sentence vague require multiple pass understood basically history regime expect move maybe bit cloak dagger friend want order copy use new arrive different time mutual friend able take use copy new copy arrive late therefore save apartment friend share return delight nearly finish reading report story remind story difficulty family many others lead fascinating look lesser know least episode attempt walk tightrope force make interest reading account world fascinate however think quite kind make sure profit handsomely trade wolfram throw crumb ally still good interest good covering fascinate history visit lent detail", "genres": ["History", "WWII"], "summary": "Lisbon had a pivotal role in the history of World War II, though not a gun was fired there. The only European city in which both the Allies and the Axis power operated openly, it was temporary home to much of Europe’s exiled royalty, over one million refugees seeking passage to the U.S., and a host of spies, secret police, captains of industry, bankers, prominent Jews, writers and artists, escaped POWs, and black marketeers. An operations officer writing in 1944 described the daily scene at Lisbon’s airport as being like the movie “Casablanca,” times twenty.\r\n\r\nIn this riveting narrative, renowned historian Neill Lochery draws on his relationships with high-level Portuguese contacts, access to records recently uncovered from Portuguese secret police and banking archives, and other unpublished documents to offer a revelatory portrait of the War’s back stage. \r\n\r\nAnd he tells the story of how Portugal, a relatively poor European country trying frantically to remain neutral amidst extraordinary pressures, survived the war not only physically intact but significantly wealthier. The country’s emergence as a prosperous European Union nation would be financed in part, it turns out, by a cache of Nazi gold.", "asin": "1586488791", "rank": "492259", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/51Cx89jX9%2BL.jpg", "country": "Portugal", "story_arc": ["Tragedy", "Things only get worse"]}