{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 48, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "An amazingly written, but difficult book to read."}, {"review_sentiment": 4.0, "review_text": "A difficult but necessary read."}, {"review_sentiment": 4.0, "review_text": "This book starts off slowly and then inexorably extends its grip on you. You will feel the reality of life for ordinary people in WWII, but it also goes beyond. Morante's tender portrayals of children and animals not only reveal her acute observation, but a deeper humanity. Useppe surely stands out as a feat of characterization, almost an archetype. Her illustrations of the minor things of daily life are dealt with such sympathy yet tinted with an element of dry humour underlying the whole. The author evokes well the inner process of grief, the paths of the mind after loss.The book embraces the life of the common person, the woman in the street, the uneducated, the underprivileged. It celebrates the wonder to be found in everyday moments, yet underlying all, a doom-laden strength, the motif of death. It is painstakingly researched, based on actual events, lending an engaging authenticity... as the author is to a large extent, describing herself, and the real people of Rome. I found the translation very natural. Its a fairly easy read and I got through most of it before I even noticed what a thick volume it is.Structurally it is flawed, however. The final 80 pages or so drag and could have been cut without any harm to the whole. It is as though the author tacked on a long, unnecessary postscript in order to elaborate on her underlying philosophical themes."}, {"review_sentiment": 4.0, "review_text": "There is a mix of real history at the beginning of sections of the book, and then the fictional story.  As it is about a horrible time during World War II the tone is dark.  Not an uplifting book but important."}, {"review_sentiment": 5.0, "review_text": "Love it..."}, {"review_sentiment": 5.0, "review_text": "A BIT DARK BUT VERY INFORMATIVE"}, {"review_sentiment": 5.0, "review_text": "Better than advertised"}, {"review_sentiment": 5.0, "review_text": "The book is a durge, dedicated to the supressed, to the poor, to the uneducated, to the half witted, to the victims of war, to the victims of rape, to loving animals and the city of Rome, ravaged and raped and over run in war and populated by humans trying to survive.  Long and relentless in style, with dense whirling passages of interior monologues and sharp observations as Elsa Morante jumps from one character to another (all linked) or from human to animal.  Each chapter is lead off with an actual account of what happened in world history that year. This sets the tone for events contained within but by the end its proves to be a constantly changing onslaught of human suffering. This is a book that takes on all of our societal institutions and shreds them in exposing what there are at the core, subject sadly to the worst of what we are as human beings.One can apply these same observations to our world today.The most redeeming and joyous passages make this tragic story bearable, such as when the author gives voice and consideration to pets and animals. Not light reading and needs a real commitment as it grabs you and does not want to let you go. Morante weaves a dense fabric that is a history of one, one women and those to come in and out of her life; this is the other history, the one \"we don't study\" in school."}, {"review_sentiment": 5.0, "review_text": "Morante focusses on the story of a mother during WWII in Rome and the years following it. Ida struggles to survive and provide for her two sons in a world where politics and war influence and impact the lives of the \"regular\" people. She tries her best, despite being a fearful insecure woman alone, as do the other characters who are victims of those in power. Very very sad and thought provoking."}, {"review_sentiment": 5.0, "review_text": "This is a deeply touching story based on historical events and their consequences on the lives of the characters.  Keep a box of tissues handy."}]}, "authors": ["Elsa Morante"], "isbn": "1586420046", "longitude": 12.4829321, "periods": ["1900s"], "title": "History: A Novel", "word_cloud": "amazingly write difficult difficult necessary start slowly inexorably extend grip feel reality life ordinary people also go tender portrayal child animal reveal acute observation humanity surely stand feat characterization almost illustration minor thing daily life deal sympathy yet tint element dry humor underlie whole author evoke well inner process grief path mind embrace life common person woman street uneducated underprivileged celebrate wonder find everyday moment yet underlie strength death painstakingly research base actual event lend engage authenticity author large extent describe real people find translation natural fairly easy get even notice thick volume flaw however final page drag harm whole author tack long unnecessary postscript order elaborate underlie philosophical theme mix real history begin section fictional story horrible time tone dark not uplifting important better advertise surge dedicate suppressed poor uneducated half witted victim war victim rape love animal city ravage rap war populated human try survive relentless style dense whirl passage interior monologue sharp observation jump character link human animal chapter lead actual account happen world history year set tone event contain end prove constantly change onslaught human suffer take societal institution shred expose core subject sadly worst human apply observation world redeem joyous passage make tragic story bearable author give voice consideration pet animals not light read need real commitment grab want let weave dense fabric history woman come life history study school focus story mother year follow struggle survive provide son world politics war influence impact live regular people try best fearful insecure woman alone character victim power sad think provoke deeply touch story base historical event consequence live character box tissue handy", "genres": ["Fiction & Literature", "WWII"], "summary": "History was written nearly thirty years after Elsa Morante and Alberto Moravia spent a year in hiding among remote farming villages in the mountains south of Rome. There she witnessed the full impact of the war and first formed the ambition to write an account of what history - the great political events driven by men of power, wealth, and ambition - does when it reaches the realm of ordinary people struggling for life and bread.\r\n\r\nThe central character in this powerful and unforgiving novel is Ida Mancuso, a schoolteacher whose husband has died and whose feckless teenage son treats the war as his playground. A German soldier on his way to North Africa rapes her, falls in love with her, and leaves her pregnant with a boy whose survival becomes Ida's passion. \r\n\r\nAround these two other characters come and go, each caught up by the war which is like a river in flood. We catch glimpses of bombing raids, street crimes, a cattle car from which human cries emerge, an Italian soldier succumbing to frostbite on the Russian front, the dumb endurance of peasants who have lived their whole lives with nothing and now must get by with less than nothing.", "asin": "1586420046", "rank": "351197", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/517U%2BAbwj%2BL.jpg", "country": "Italy", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}