{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 25.7742658, "ratings": {"num_ratings": 13, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Purchased for my daughter. Required reading for an Intro to Literature class at Univ of Florida. Collection of short stories. She wasn't required to read every story, but the ones she read she enjoyed. Plans to read the remaining stories."}, {"review_sentiment": 3.0, "review_text": "Most of the stories in the book are fun and interesting, but there were others that I did not find so engaging for me to warrant giving it higher than three stars."}, {"review_sentiment": 2.0, "review_text": "\"If you don't have anything good to say, don't say anything at all.\" I guess Curcet's mother didn't pass that along. How to Leave Hialeah's central themes focus on things that are not good to say. Primary topics include physical appearance and bodily functions, both presented with raw vulgarity. The writing style can make the stories difficult to follow as the narrator clumsily becomes an active character's voice and back again, without regard for grammar. These aspects fuse to create a unique genre that roughly equates to reality television for literature. This bold move will no doubt win several fans."}, {"review_sentiment": 4.0, "review_text": "No thank you.  I am reading, writing and not rating,  But thank you for asking.  On the other things I bought, I gave them as gifts.  I don't know how they were appreciated."}, {"review_sentiment": 5.0, "review_text": "This author is gifted at portraying the Cuban American community in Miami. I first read her novel, Make Your Home Among Strangers, which I also highly recommend. These short stories predate the semi- autobiographical novel. While there are laugh-out-loud moments, all of the stories are ultimately sad. I look forward to more books by this author."}, {"review_sentiment": 5.0, "review_text": "Each story pulled me in immediately. Memorable characters. Makes for a fast read. Whether or not you normally read short fiction, give this collection a shot!"}, {"review_sentiment": 5.0, "review_text": "Want to get a glimpse into a very stereotypical, but very quotidienne experience of Miami Latinos? Read this. Funny, sad, awkward, and very....human. All the stories were extremely well-written and interesting."}, {"review_sentiment": 2.0, "review_text": "The Cubanita from Hialeah shtick gets tiresome by the second story, but unfortunately there are nine more to go. It's a collection of somewhat-related stories, as you often get from recent MFAs, but at least the depiction of Miami is more interesting than Tom Wolfe's."}, {"review_sentiment": 4.0, "review_text": "This was a very enjoyable book. It was several different stories that helped you to learn about Hialeah and the Cuban culture. How to Leave Hialeah (Iowa Short Fiction Award)"}, {"review_sentiment": 5.0, "review_text": "Up until now, of all the fiction I have read by Cuban American writers about Cuban Americans, my favorite was Tomorrow They Will Kiss by Eduardo Santiago--and I give it five stars as do my students who read it in my writing classes at Miami Dade College. But ow to Leave Hialeah may be even a little better. The book consists of several stories, many told in first person. One of my favorites is about a funeral. Hilarious! But maybe the favorite is told by the narrator of \"The Next Move.\" Let me give you just one paragraph. He is talking with his married daughter after having dropped his wife, Nilda, off at MIA to fly back to Cuba to visit her sisters: \"I was on the kitchen phone since it had the long cord, and I'd taken off my socks to clip my toenails while we talked. It needed to be done. I've always liked clipping off the nail in one whole piece, so that I can make a pile of these thick yellow half-moons on the table, which made it easier for Nilda to clean up. she always complained about it, but she never realized I was trying to make it easier for her.\"And know this too: he is dedicated to his new Tai Chi class!This is just too wonderful a read. And I will be using a couple of stories in my next semester classes."}]}, "authors": ["Jennine Capó Crucet"], "isbn": "1587298163", "longitude": -80.1936589, "periods": ["2000s", "Recent Releases"], "title": "How to Leave Hialeah", "word_cloud": "purchase daughter reading class short story require story one enjoy remain story most story fun interest others find engage warrant give higher star anything good say say anything guess mother pas central theme focus thing good say primary topic include physical appearance bodily function present raw vulgarity writing style make story difficult follow narrator clumsily become active character voice back regard grammar aspect fuse create unique genre roughly equate reality television literature bold move doubt several fan thank read write rating thank ask thing buy give gift know appreciated author gift portray cuban community first also highly short story predate autobiographical moment story ultimately sad look forward author story pull immediately memorable character fast normally short fiction collection shot get glimpse stereotypical quotidienne experience sad awkward story extremely interest shtick get tiresome second story unfortunately go collection story often get recent least depiction interest enjoyable several different story help culture fiction cuban american writer favorite give star student write class ow even better consists several story many tell first person favorites funeral maybe favorite tell narrator next paragraph talk married daughter drop wife fly back visit sister kitchen phone long cord take sock clip toenail talk need do always like clip nail whole piece make pile thick yellow table make easier nelda clean always complain never realize try easier dedicate new class wonderful use couple story semester class", "genres": ["Fiction & Literature"], "summary": "United in their fierce sense of place and infused with the fading echoes of a lost homeland, the stories in Jennine Capó Crucet’s striking debut collection do for Miami what Edward P. Jones does for Washington, D.C., and what James Joyce did for Dublin: they expand our ideas and our expectations of the city by exposing its tough but vulnerable underbelly.\r\n\r\nCrucet’s writing has been shaped by the people and landscapes of South Florida and by the stories of Cuba told by her parents and abuelos. Her own stories are informed by her experiences as a Cuban American woman living within and without her community, ready to leave and ready to return, “ready to mourn everything.”\r\n\r\nComing to us from the predominantly Hispanic working-class neighborhoods of Hialeah, the voices of this steamy section of Miami shout out to us from rowdy all-night funerals and kitchens full of plátanos and croquetas and lechón ribs, from domino tables and cigar factories, glitter-purple Buicks and handed-down Mom Rides, private homes of santeras and fights on front lawns. \r\n\r\nCalling to us from crowded expressways and canals underneath abandoned overpasses shading a city’s secrets, these voices are the heart of Miami, and in this award-winning collection Jennine Capó Crucet makes them sing.", "asin": "1587298163", "rank": "562619", "city": "Miami", "image": "https://images-na.ssl-images-amazon.com/images/I/41kfwD-pGzL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}