{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 32, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "An excellent examination of the Sicilian Psyche considered one of Sciascia's greatest works."}, {"review_sentiment": 4.0, "review_text": "It appeals to the tourist to Sicily, with it's pleasing references to prickly pears and Palermo. So it doesn't seem dated because Sicily itself is enticingly dated. It feeds in well to stereotypes of Sicily, which a tourist doesn't see but because of these very stereotypes one almost hopes that there is this undercurrent going on.One wonders, are these languishing unfinished buildings and highways to nowhere something to do with corruption?This novel is really a novella, and although the author gives an amusing explanation of it's brevity ( that he spent a year shortening it), I felt that I was short changed. Reading it as an e book meant that I had not foreseen it's skimpiness.The ending was well done and managed to be satisfyingly unsatisfactory."}, {"review_sentiment": 5.0, "review_text": "The condition of this book was exactly as described"}, {"review_sentiment": 5.0, "review_text": "Nice book"}, {"review_sentiment": 4.0, "review_text": "If you want an insight into how corruption can exist in society, this is a great short classic story that describes it.  Its just a snippet of life in Sicily and Italy in 1961, but its rich in imagery and ideas."}, {"review_sentiment": 5.0, "review_text": "Leonardo Sciascia allocates immaculate language to lay out a crowning anecdote to interpret and characterize the bizarrely tainted island of Sicily.  After thousands of years of invaders the people and creatures there have maintained an everlasting culture.  A civilization that is captivating, stunning, mysterious, and horrific - truthfully.  Yet a life that most who walk the earth will only imagine.  My feelings may concur with Leonardo's Captain Bellodi's after he served the region.  After shouting to fellow northerners, \"To hell with Sicily! To Hell with it all!\"  Even if I too run into an honorable man such as Don Mariano, cross a scoundrel like Diego Marchica, or get made a fool of by those who have always been in Sicily; I may return... Even if it is the end of me.  Because I lucidly and obscurely love the island of Turiddu, Mimmu, and Ciccio.  Many of you would know these three as Salvatore, Dominic, and Francesco, and the island in the sun as part of Italy.  However, you too should read, \"The Day of the Owl,\" and see if you can resist going to Sicania and meeting \"Jasper.\"-Jimmy"}, {"review_sentiment": 5.0, "review_text": "whole different world back then"}, {"review_sentiment": 3.0, "review_text": "I takes some time for the suspense to get at you. Careful description of the workings of the mafia in everyday life"}, {"review_sentiment": 4.0, "review_text": "Arguably the first mafia novel \"The Day of the Owl\" examines silence, complicity and the impossible task of freeing people who won't speak out.The story starts with a murder, a man is gunned down in front of a bus full of passengers in the town square with dozens of witnesses....and no-one saw a thing. Then follows the investigation where a northern police officer attempts to break through the silence with mixed results.The author was a Sicilian himself and his insights into the mentality of the local people are what make this book a classic. He talks about the local peasants who remember the fascist era with fondness because Mussolini was the only man to break the mafia at least for a while. He portrays a fascinating conversation between elderly mafia gentlemen who philosophise that \"the whole world are cuckolds\" and consider themselves superior to their peasant neighbours. These little snapshots really made this book for me.This novel works both as a crime thriller, as anthropology and as high literature.Highly recommended."}, {"review_sentiment": 3.0, "review_text": "Loved the premise of this novel. A man is gunned down on the streets of a small town in Sicily and inexplicably all of the witnesses fall silent. It is up to the newly appointed Bellodi to delve into the murder but he finds himself up against the shadowy and sinister Mafia.I found this to be a clunky read in parts but that may have been due to the translation. Being a shorter length novel there wasn't a lot of room for characterisation and I also had difficulty at times distinguishing which character was speaking.On a positive note the ending surprised me. I was sure the novel would end a certain way and appreciated that another was offered."}]}, "authors": ["Leonardo Sciascia"], "isbn": "159017061X", "longitude": 0.0, "periods": ["1900s"], "title": "The Day of the Owl", "word_cloud": "excellent examination consider greatest work appeal tourist sicily please reference prickly pear seem date enticingly date feed well stereotype tourist see stereotype almost hop undercurrent go wonder languish unfinished building highway nowhere something corruption really novella author give amuse explanation brevity spend year shorten felt short change e mean foresee end well do manage satisfyingly unsatisfactory condition exactly describe nice want insight corruption exist society great short classic story describe snippet life rich imagery idea allocate immaculate language lay crown anecdote interpret characterize bizarrely taint island thousand year invader people creature maintain everlasting culture civilization captivate stun mysterious horrific truthfully life walk earth feeling serve region shout fellow northerner sicily even run honorable man cross scoundrel make fool always even lucidly obscurely island island sun part however see resist go meeting whole different world back take time suspense careful description working mafia everyday life arguably first examine silence complicity impossible task free people story start murder man gun front bus full passenger town square dozens witness saw thing then follow investigation northern police officer attempt break silence mixed author sicilian insight mentality local people make classic talk local peasant fascist era fondness man break mafia portray fascinate conversation elderly mafia gentleman philosophies whole world cuckold consider superior peasant little snapshot really make work crime thriller anthropology high recommend love premise man gun street small town inexplicably witness fall silent newly appoint murder find shadowy sinister find clunky part translation shorter length lot room characterization also difficulty time distinguish character positive note end surprise sure certain way appreciate offer", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "A man is shot dead as he runs to catch the bus in the piazza of a small Sicilian town. Captain Bellodi, the detective on the case, is new to his job and determined to prove himself. Bellodi suspects the Mafia, and his suspicions grow when he finds himself up against an apparently unbreachable wall of silence. A surprise turn puts him on the track of a series of nasty crimes. But all the while Bellodi's investigation is being carefully monitored by a host of observers, near and far. They share a single concern: to keep the truth from coming out.\r\n\r\nThis short, beautifully paced novel is a mesmerizing description of the Mafia at work.", "asin": "159017061X", "rank": "159716", "city": "Sicily", "image": "https://images-na.ssl-images-amazon.com/images/I/41HDP7axZ%2BL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}