{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 13, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "Brilliant. This is how you should write a long nouvelle or short novel.Napoleon is not Napoleon who is therefore Napoleon."}, {"review_sentiment": 5.0, "review_text": "Wonderful little book.Entertaining and very well written.Made me wonder a lot about what ifs...Real life heroes are the result of great people being there, at the right time, under the right circumstances."}, {"review_sentiment": 5.0, "review_text": "Great book."}, {"review_sentiment": 5.0, "review_text": "Such lyrical, precise language, a cross between extended prose poem and novelistic meditation on the nature of identity, glory and history, both whimsically light and philosophically deep. Such graceful fiction from scholar/essayist/sinologist/quirky renaissance man Simon Leys (pen name of Pierre Ryckmans), a work I read and reread and then narrated into my digital recorder so I could listen and thus take an even deeper plunge into the pool of this inventive fable.What a pleasure to read a real writer. . . ‘The Death of Napoleon’ is utterly satisfying sentence by sentence and scene by scene, but it is also compulsively readable. These are the words of renowned literary critic Gabriel Josipovici, words with which I wholeheartedly agree. And to underscore my agreement, I’ll serve up a few slices of Leys poetic, that is, three quotes from scenes in Chapter One that chronicle Napoleon’s voyage on board a ship carrying the world-famous emperor from St. Helena back to his beloved France. And, yes, of course, this is imaginative alternate history.A snippet of the author’s description of the ship’s cook: “He was tall, but a good half century spend over stoves in low-ceilinged galleys had broken him up into several angular segments, like a half-folded pocket rule. Without really being fat, his body swelled out arbitrarily in places, giving him the shape of a semi-deflated balloon. His face was split by a huge gaping mouth; in this grotto, as black and dirty as the maw of his stove, there emerged one or two teeth, like slimy rocks protruding at low tide. The ruined state of his teeth made his speech, already bizarre, all the harder to understand, endowing his rare utterances with a kind of oracular force – as befits a black cook on a sailing ship who, to be true to type, must naturally have a smattering of occult sciences.” Wow! I mean, Super-Wow! -- exquisite visual images; expressive vivid metaphors.“Every evening, crushed by the fatigue of the day’s work, Napoleon would escape for a moment from the stuffy atmosphere of the forecastle and lean against the bulwark in the bows to watch the first stars come out. The softness of the tropical azure giving way slowly to the velvet of night, and the glittering of the lonely stars which seem so close to us when they begin to shine in the dusk, left him perfectly cold.” If you have never had an opportunity to stand on the deck of a ship at sea and watch tropical azure give way slowly to the velvet of night, here is your opportunity to not only experience via your imagination but to join Napoleon in doing so.Napoleon assumes the identity of a cabin boy by the name of Eugène in order to escape from St. Helena. At one point we read of Napoleon’s self-reflection: “During this time in limbo, and until the day when Napoleon’s sun would rise again, he had to survive by relying upon wretched Eugène's purely physical existence. Only the slenderest thread was leading him back toward the hypothetical dawn of his future. So far, at every stage of his journey, a new, unknown messenger had emerged from the shadows to show him the route to follow.” Again, on one level Simon Leys’ slim novel is a meditation on the nature of identity and time. And what an identity! After all, he is Napoleon.Thank you, New York Review Books (NYRB) for reprinting this slim classic. And thanks to Patricia Clancy for joining Mr. Leys in translating from the French into English. 130 pages of large font – this novella can be read in less than 3 hours. Treat yourself to a day of literary ecstasy. I have three times over and counting, but then again, when it comes to ecstasy I admit that I have never observed moderation."}, {"review_sentiment": 1.0, "review_text": "Really disappointed with this book!Not sure what I expected but I felt there was no story,poorly written etc,etc."}, {"review_sentiment": 3.0, "review_text": "Nicely written."}, {"review_sentiment": 4.0, "review_text": "Novella length treatment of Napoleon escapes exile ends up in Belgium travels to Paris via Waterloo and we see how \"the great\" fall and quickly pass on, the scene at Waterloo and the insane asylum are wonderful.  Very thought provoking great read. It does remind me a bit of Hugo. I bought in conjunction with Hitler story Look Who's Back. Also aa good read."}, {"review_sentiment": 4.0, "review_text": "Reminds me a lot of Dumas."}, {"review_sentiment": 5.0, "review_text": "Leys' writing is rich, delicate and involving. This story touched my heart; surely it was a nod to the D H Lawrence story, The Man Who Died, and an honorable nod at that."}, {"review_sentiment": 5.0, "review_text": "An excellent plot as an exercise of \"what if\". What if Napoleon could escape from Santa Helena and returned to France to claim back his throne  while a double has taken his place?But, after 5 years in prison, France has changed as well as his soldiers and, worst of all, himself.And so many are so sure they are Bonaparte, that their delusion has brought them not to power but to a sanitarium.What if the supplanter dies in 1821? What is left to the emperor?"}]}, "authors": ["Simon Leys"], "isbn": "1590178424", "longitude": 2.3514992, "periods": ["1800s"], "title": "The Death of Napoleon", "word_cloud": "write long nouvelle short therefore wonderful little well lot ifs life hero result great people right time right circumstance great such lyrical precise language cross extend prose poem novelist meditation nature identity glory history whimsically light philosophically deep such graceful fiction renaissance man name work reread narrated digital recorder thus even deeper plunge pool inventive pleasure real writer utterly satisfy sentence sentence scene scene also compulsively readable word renowned literary critic word wholeheartedly agree underscore agreement serve slice poetic quote scenes chronicle voyage board ship carry emperor back beloved yes course imaginative alternate snippet author description ship cook tall good half century spend stove galley broken several angular segment pocket rule really fat body swell arbitrarily place give shape balloon face split huge gap mouth grotto black dirty maw stave emerge teeth slimy rock protrude low ruined state teeth make speech already bizarre harder understand endow rare utterance kind oracular force befits black cook sail ship true type naturally smatter occult mean exquisite visual image expressive vivid evening crush fatigue day work moment stuffy atmosphere forecastle lean bulwark bow watch first star softness tropical azure give way slowly velvet night glitter lonely star seem close begin shine dusk leave perfectly never opportunity stand ship sea watch tropical azure way slowly velvet night opportunity experience imagination join assume identity cabin boy name order escape point time limbo day sun survive rely wretched purely physical existence only slenderest thread lead back hypothetical dawn future far stage journey new unknown messenger emerge shadow show route level slim meditation nature identity time identity reprint slim classic thanks join translate french page large font novella le hour day literary ecstasy time count come ecstasy admit never observe moderation really disappointed not sure expect felt story poorly write nicely write length treatment escape exile end travel see great fall quickly pass scene insane asylum wonderful very thought provoke great remind bit buy conjunction story also aa good reminds lot write rich delicate involve story touch heart surely nod story man die honorable nod excellent plot exercise return claim back throne double take place year prison change well soldier worst many sure delusion bring power supplanted die leave emperor", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "\"As he bore a vague resemblance to the Emperor, the sailors on board the Hermann-Augustus Stoeffer had nicknamed him Napoleon. And so, for convenience, that is what we shall call him.\r\n\r\nBesides, he was Napoleon. . . .\"\r\n\r\nNapoleon has escaped from St. Helena, leaving a double behind him. Now disguised as the cabin hand Eugène Lenormand and enduring the mockery of the crew (Na­po­leon, they laughingly nickname the pudgy, hopelessly clumsy little man), he is on his way back to Europe, ready to make contact with the huge secret organization that will return him to power. But then the ship on which he sails is rerouted from Bordeaux to Antwerp. When Napoleon disembarks, he is on his own.\r\n\r\nHe revisits the battlefield of Waterloo, now a tourist destination. He makes his way to Paris. Mistakes, misunderstandings, and mishaps conduct our puzzled hero deeper and deeper into the mystery of Napoleon.\r\n\r\n“Alternative history...is enjoyable and at the same time, like all daydreaming, brings a sensation of guilt. But The Death of Napoleon is also a fable, and Simon Leys is an expert fabulist.” The New York Times", "asin": "1590178424", "rank": "715091", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/41VefY%2BKE5L.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}