{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 213, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "An author worth getting to know"}, {"review_sentiment": 5.0, "review_text": "I love all of Patrick Leigh Fermor's books - they are,for me, a delight even when reading them again and again."}, {"review_sentiment": 5.0, "review_text": "Wonderful trip through Western Europe before the destruction of WWII. Language so rich you want to read it aloud savoring the words and the vision they create. Great book but a shock when you reach the end \"to be continued\".  I knew there are two more volumes but was so caught up in his entrance into Hungary... didn't want it to end. Highly recommended."}, {"review_sentiment": 5.0, "review_text": "The outcome is unexpected. The film is too good to be true. I watched this video by myself. The plot is tortuous. The actor's performance was animated and devoted. At that time, the special effects of the film were good."}, {"review_sentiment": 2.0, "review_text": "I bought this because it was on a recommended reading list by a tour company that I will be using.  It is an old book and written in a style that is hard to read.  Hardly a page went by that did not contain a word that I didn't have to look up on my Kindle and half the time they had no definition or the word was archaic. There were many quotations in German and Latin, that unless you are a classical scholar, you would not recognize.  I do not see how this will add to my enjoyment of the trip, and will let the tour company know.  I have warned my traveling companions and fellow readers not to waste their money on this."}, {"review_sentiment": 5.0, "review_text": "Not for everyone, but if it is for you, it REALLY is for you. Brilliant, unique, peripatetic.Yeah, I just wanted to use that word."}, {"review_sentiment": 4.0, "review_text": "This book is exceptionally well researched and written in graphic manner. The range and variety of events and people he experienced is evidence of what must have been the attractiveness of his own personality. This is backed up by his own wide reading and scholarship. While he is describing what happened in 1933 the book is unusual in that it was written many years later based on diaries and his recollections but I think also coloured by his later life experiences. Lastly I would like to add that his style free flowing and carries the reader along."}, {"review_sentiment": 2.0, "review_text": "I really wanted to like this book, I really did. I'd read another book largely about Leigh Fermor, as well as the New Yorker's fantastic profile of him. I'd even read and recited poems from his funeral program. But about half way through \"A Time of Gifts,\" I had to stop. He's clearly a very gifted writer, but the book is extremely thick. If you do read it, make sure to have an English dictionary at hand. And a German one. And a French one."}, {"review_sentiment": 3.0, "review_text": "A hard read because of the flowery language. It just didn't seem to move forward. Some of the descriptions of scenery and architecture were beautiful."}, {"review_sentiment": 2.0, "review_text": "Way too precious.  A tedious read on what should have been a very interesting subject.  Read Twain's \"Innocents Abroad\"  to see how it should be done."}]}, "authors": ["Patrick Leigh Fermor", "Jan Morris"], "isbn": "1590171659", "longitude": 14.4212535, "periods": ["1900s"], "title": "A Time of Gifts", "word_cloud": "author get know love delight even read wonderful trip destruction rich want aloud savoring word vision create shock reach end continue know volume catch entrance want end recommend outcome unexpected film good true watch video plot tortuous actor performance animate devote special effect film good buy recommended reading list tour company use old write style hard go contain word look half definition word many quotation german classical scholar see add enjoyment trip tour company know warn travel companion fellow reader waste money not everyone unique want use word exceptionally well research write graphic manner range variety event people experience evidence personality back wide reading scholarship describe happen unusual write many year later base diary recollection think also color later life experience lastly style free flow carry really want really largely leigh well fantastic profile even recite poem funeral program way stop clearly gift writer extremely thick make sure dictionary hand german french one hard flowery language seem forward description scenery architecture beautiful precious tedious interest subject see do", "genres": ["Memoir", "Travel Writing"], "summary": "On Foot to Constantinople: From the Hook of Holland to the Middle Danube \r\n\r\nAt the age of eighteen, Patrick Leigh Fermor set off from the heart of London on an epic journey—to walk to Constantinople. A Time of Gifts is the rich account of his adventures as far as Hungary, after which Between the Woods and the Water continues the story to the Iron Gates that divide the Carpathian and Balkan mountains. Acclaimed for its sweep and intelligence, Leigh Fermor’s book explores a remarkable moment in time. Hitler has just come to power but war is still ahead, as he walks through a Europe soon to be forever changed—through the Lowlands to Mitteleuropa, to Teutonic and Slav heartlands, through the baroque remains of the Holy Roman Empire; up the Rhine, and down to the Danube.\r\n\r\nAt once a memoir of coming-of-age, an account of a journey, and a dazzling exposition of the English language, A Time of Gifts is also a portrait of a continent already showing ominous signs of the holocaust to come.", "asin": "1590171659", "rank": "20361", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/51STbWksZdL.jpg", "country": "Czechia", "story_arc": ["Tragedy", "Things only get worse"]}