{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 37, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Very good"}, {"review_sentiment": 5.0, "review_text": "With a level of detail that is astounding, Margaret Leech wrote a unique Civil War history that focuses on the city of Washington during the war years. There is so much here that fascinated me despite having read many histories of the period. Her command of detail truly makes this work standout. The events of the war transformed the city of Washington in ways that reflected the concentrated Federal power that was an outgrowth of the conflict.  This is a fine history that tells the story of the War from a different perspective and I found it incredibly engaging and interesting. Once again, the research and detail down to the description of clothing, weather, and other elements makes the reader feel that you are there in the streets of the Capitol witnessing these events yourself.This is well worth the effort for anyone who has an interest in the era."}, {"review_sentiment": 4.0, "review_text": "The city of Washington becomes the main character during a perilous time.  Through the Civil War period a bizarre group of people inhabited the city and also saints of our nation's history gave their very lives to preserve the noblest ideals.  Margaret Leech's writing will enhance the literacy of the most learned by the most discerning use of language.  While not a fast read, it is a very memorable one.Gary Putnam"}, {"review_sentiment": 5.0, "review_text": "Totally amazing read!!!  What a revealing story of D.C. during the Civil War days.  Stuff you don't read or hear aboutin your classroom history books.  The every goings on in the very fabric of everyday life at every level: socially, politically, economically, spiritually.It made real what it was like to live during that uncertain time. A must read for any person who is a student of history."}, {"review_sentiment": 4.0, "review_text": "Each day since the surrender in Appomattox on April 9, 1865 has supposedly seen the publication of a book about the American Civil War. After a century and a half of titles, it's easy to get lost in the catalog. However, Reveille in Washington by Margaret Leech is a classic that should be on every Civil War aficionado's short list. It's a fascinating historical account of Washington DC during the conflict. It's tight writing with elegant turns of phrase. It's very well-researched. It's stood the test of time. Recommended."}, {"review_sentiment": 5.0, "review_text": "This is a history book that reads like a novel. We'll researched. Informative and entertaining"}, {"review_sentiment": 5.0, "review_text": "Fantastic storytelling puts you in the middle of the turmoil of Washington at war."}, {"review_sentiment": 5.0, "review_text": "Over 300 references. Excellent book."}, {"review_sentiment": 5.0, "review_text": "can't believe I didn't know about this book before now. Thank you David McClullough"}, {"review_sentiment": 4.0, "review_text": "A very detailed look into the daily workings of Washington during the Civil War years. Complex chronology of events and actions gives one the feeling that you are there witnessing events as they unfold. Fascinating reading for history buffs."}]}, "authors": ["Margaret Leech"], "isbn": "1590174461", "longitude": -77.0366456, "periods": ["1800s"], "title": "Reveille in Washington: 1860-1865", "word_cloud": "very good level detail astound write unique history focus city war year much fascinate many history period command detail truly make work event war transform city way reflect concentrated power outgrowth conflict fine history tell story different perspective find incredibly engage interest research detail description clothing weather element make feel street witness event well worth effort anyone interest era city become main character perilous time period bizarre group people inhabit city also saint nation history give life noblest ideal write enhance literacy learn discern use language fast memorable totally amaze reveal story day hear about in classroom history going fabric everyday life level socially politically economically make real live uncertain time person student history day surrender supposedly see publication century half title easy get lose catalog however classic aficionado short list fascinate historical account conflict tight write elegant turn phrase stand test time recommend history read research entertain fantastic storytelling put middle war reference excellent know detailed look daily working year chronology event action give feeling witness event unfold fascinate read history buff", "genres": ["History", "Politics"], "summary": "1860: The American capital is sprawling, fractured, squalid, colored by patriotism and treason, and deeply divided along the political lines that will soon embroil the nation in bloody conflict. \r\n\r\nChaotic and corrupt, the young city is populated by bellicose congressmen, Confederate conspirators, and enterprising prostitutes. Soldiers of a volunteer army swing from the dome of the Capitol, assassins stalk the avenues, and Abraham Lincoln struggles to justify his presidency as the Union heads to war. \r\n \r\nReveille in Washington focuses on the everyday politics and preoccupations of Washington during the Civil War. From the stench of corpse-littered streets to the plunging lace on Mary Lincoln’s evening gowns, Margaret Leech illuminates the city and its familiar figures—among them Abraham Lincoln, Jefferson Davis, Robert E. Lee, William Seward, and Mary Surratt—in intimate and fascinating detail. \r\n   \r\nLeech’s book remains widely recognized as both an impressive feat of scholarship and an uncommonly engrossing work of history.\r\n\r\n“In 1860, Washington was a raw country town, a symbol trying to be a city. By 1865 it had become the nation’s capital. Reveille in Washington is packed and running over with the anecdotes, scandals, personalities, and tragi-comedies of the day. Here you will meet young Andy Carnegie organizing military transport; a Patent Office clerk named Clara Barton suddenly discovering she has a real vocation; Matthew Brady, obsessed with the idea that he could make a photographic record of a war; Louisa M. Alcott and Walt Whitman finding their great moments in hospitals. It’s a wonderful story.” The New Yorker", "asin": "1590174461", "rank": "762742", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/513ENPTn9hL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}