{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 33.9550905, "ratings": {"num_ratings": 73, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "A good read that is well researched."}, {"review_sentiment": 4.0, "review_text": "For those of us who read PLF's  books about his walk across Europe under the gathering shadow of WWII, this biography is a helpful chronology and answers many questions raised in his narratives.  The book shows us how a 4-year moratorium with a Romanian woman 16 years his senior, served as his University and how his travels set him up for the wartime service to which he was assigned.Cooper also  does not shy away from the less charming parts of PLF's character, and one is left wondering what would have become of him if so many aristocrats had not come to his aid, and had the war not given him a purpose, and made him a hero."}, {"review_sentiment": 5.0, "review_text": "What an adventurer Leigh Fermor was, a modern day Byron who fought the Germans as a commando in Crete and a noted scholar of arcane cultures and languages. And what a little s*** who largely lived off rich society ladies before he settled into celebrity status in Greece where he wrote his best books, Mani and Roumeli.Artemis Cooper captures all the facets."}, {"review_sentiment": 5.0, "review_text": "I loved it, but I am fascinated by the man, and have read all of his books, seen the movie Ill Met by Moonlight (not easy to obtain). I wish there was more about this modern day adventurer."}, {"review_sentiment": 4.0, "review_text": "Everything you need and want to know about this wonderful man's life and writing, but PLF himself, on his own life and adventures, is peerless."}, {"review_sentiment": 4.0, "review_text": "An amazing life - easier to read than his own writing - all very complicated but a fascinating read!"}, {"review_sentiment": 4.0, "review_text": "This is a well written work about Patrick Fermor's life. It is best read after you have read some of Fermor's work. Such as A Time of Gifts. Fermor's works provide a look at parts of Europe just before Hitler took over and the destruction that took place during WWII."}, {"review_sentiment": 5.0, "review_text": "A beautiful book about a beautiful human being."}, {"review_sentiment": 5.0, "review_text": "As a young American, I stumbled across \"A Time for Gifts\" in a bookstore.  I felt as though Patrick Leigh Fermor had given me the gift of knowledge about the people, places and events that historians miss.  This book was a gift as well, as I became a member of his circle of friends, who sought to live life and immersed themselves in it.  In the end, Artemis captured Paddy as he remained unchanged, a restless traveler whose gifts and intellectual curiosity enrich history."}, {"review_sentiment": 4.0, "review_text": "Fascinating insight into this exceptional character"}]}, "authors": ["Artemis Cooper"], "isbn": "159017674X", "longitude": -83.3881868, "periods": ["1900s"], "title": "Patrick Leigh Fermor: An Adventure", "word_cloud": "good well research walk gather shadow biography helpful chronology answer many question raise show moratorium romanian woman year senior serve travel set wartime service also shy away le charming part character leave wondering many aristocrat come aid war give purpose make hero adventurer modern day fought commando note scholar arcane culture language little largely live rich society lady settle celebrity status write best capture facet love fascinate man see movie easy wish modern day adventurer everything need want wonderful man life write life adventure peerless amazing life easier write complicate fascinate well write work life best work work look part take destruction take place beautiful beautiful human young american stumble bookstore felt give gift knowledge people place event historian miss gift well become member circle friend seek live life immerse end capture remain unchanged restless traveler gift intellectual curiosity enrich history fascinate insight exceptional character", "genres": ["Biography", "History", "Travel Writing", "WWII"], "summary": "Patrick Leigh Fermor’s enviably colorful life took off when in 1934, at the age of eighteen, he decided to walk across Europe. In just over a year he had trekked through nine countries and taught himself three languages, and his enthusiasm and curiosity for every kind of experience made him equally happy in caves or country houses, among shepherds or countesses.\r\n \r\nAt the outbreak of war he left his lover, Princess Balasha Cantacuzene, in Romania and returned to England to enlist. Commissioned into the Intelligence Corps, he became one of the handful of Allied officers supporting the Cretan resistance to the German occupation. In 1944 he commanded the Anglo-Cretan team that abducted General Heinrich Kreipe and spirited him away to Egypt.\r\n \r\nA journey to the Caribbean, stays in monasteries, and explorations all over Greece provided the subjects for his first books. It was not until he and his wife had moved to southern Greece that he returned to his earliest walk. In these books, which took many years to write, he created a vision of a prewar Europe, which in its beauty and abundance has never been equaled.\r\n \r\nArtemis Cooper has drawn on years of interviews and conversations with Leigh Fermor and his closest friends, and has had complete access to his archive. Her beautifully crafted biography portrays a man of extraordinary gifts—no one wore their learning so playfully nor inspired such passionate friendship.\r\n\r\n\"Surprise is the keynote of the best travel writing. The travel writer should be knowledgeable but not an expert, open in mind and body to the unforeseen twists of serendipity. But what we most require from travel writing... is that elusive quality Nick Carraway defined as 'romantic readiness.' Few 20th- century figures combined these traits in a more appealing package than the English writer Patrick Leigh Fermor ... Now Artemis Cooper has written an affectionately intimate, informative and forgiving biography...\" The New York Times", "asin": "159017674X", "rank": "652489", "city": "Athens", "image": "https://images-na.ssl-images-amazon.com/images/I/51m72JBkLEL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}