{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 39.9215219, "ratings": {"num_ratings": 3, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "It was amazing fast delivery.thank you"}, {"review_sentiment": 5.0, "review_text": "A profound and remarkable book about human emotions, hopes and limitations in a lush landscape, lushly described, but an unforgiving social world."}, {"review_sentiment": 2.0, "review_text": "Kemal self-consciously aims to create a modern myth, but They Burn the Thistles falls short.  The plot is relatively simple and ought to have been more interesting - the protagonist, Memed, arrives amidst a terrible land war in which the peasants are getting the very short end of the stick from the newly empowered ruling class.  Memed's previous heroics, known to the characters in the book but not to the reader (unless one has read prior volumes written by Kemal), apparently inspire an uprising of sorts by the peasants.  Events escalate until they are finally terrible enough for Memed to save the day, sort of.  All of this is drawn out interminably.  The book's virtues are in the strangeness of place and culture, but they are greatly outweighed by the oddly uneven prose, which mixes occasional power and insightful descriptions of characters' conscious thoughts with overly long descriptions of landscape and highly purple dialogue.  Much as I wanted to appreciate the book more, I hesitate to recommend it."}]}, "authors": ["Yashar Kemal"], "isbn": "1590171853", "longitude": 32.8537929, "periods": ["1900s"], "title": "They Burn the Thistles", "word_cloud": "amaze fast profound remarkable human emotion hop limitation lush landscape lushly describe unforgiving social world aim create modern myth fall short plot relatively simple interest protagonist arrive midst terrible land war peasant get short end stick newly empower ruling class previous heroic know character prior volume write apparently inspire uprising sort peasant event escalate finally terrible enough save day drawn interminably virtue strangeness place culture greatly outweigh oddly uneven prose mix occasional power insightful description character conscious thought overly long description landscape highly purple dialogue much want appreciate hesitate", "genres": ["Fiction & Literature"], "summary": "Turkey’s greatest novelist, Yashar Kemal is an unsurpassed storyteller who brings to life a world of staggering violence and hallucinatory beauty. Kemal’s books delve deeply into the entrenched social and historical conflicts that scar the Middle East. At the same time scents and sounds, vistas of mountain and stream and field, rise up from the pages of his books with primitive force.\r\n\r\nMemed—introduced in Kemal’s legendary first novel, Memed, My Hawk, and a recurrent character in many of his books—is one of the few truly mythic ﬁgures of modern fiction, a desperado and sometime defender of the oppressed who is condemned to wander in the blood-soaked gray zone between justice and the law. In They Burn the Thistles, one of the finest of Kemal’s novels, Memed is on the run. Hunted by his enemies, wounded, at wit’s end, he has lost faith in himself and has retreated to ponder the vanity of human wishes. Only a chance encounter with an extraordinarily beautiful and powerful stallion, itself a hunted creature, serves to restore his determination and rouse him to action.", "asin": "1590171853", "rank": "1628553", "city": "Ankara", "image": "https://images-na.ssl-images-amazon.com/images/I/51s%2ByNwPK2L.jpg", "country": "Turkey", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}