{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 60.1674086, "ratings": {"num_ratings": 37, "rating": 2.9, "reviews": [{"review_sentiment": 1.0, "review_text": "one of the worst books I've ever read... wanted to stop but kept thinking something interesting was going to happen to wrap everything up, but no, it was awful all the way through.  And when I finally slogged through to the ending, I get a \"continued in book 2\".  NO WAY am I suffering through another book of this....."}, {"review_sentiment": 5.0, "review_text": "For the first 100 pages the book was nearly impossible to read. But after that it became one of the few best books I've read for the last few years. The emotional variety is unbelievable. It also displays incredibly well how deeply people can burrow into conjectures and illusions and how tragic the consequences of silence can be."}, {"review_sentiment": 2.0, "review_text": "This book is very difficult to get \"into\"...I am halfway through it and find it to be quite boring.  I read a lot of books and this is the worst one in a very long time."}, {"review_sentiment": 3.0, "review_text": "The American Girl is an ambitious novel that does not quite execute what it set out to accomplish.  This is a gothic novel with an eerie setting--a young woman, the titular American girl, is found dead in the swamps of Finland.  Her story takes on a life of its own with two Finnish teenage girls.  The author's prose style, as well as the gothic mood and setting, is very reminiscent of Joyce Carol Oates.  Oates, however, is a master--Fagerholm, or perhaps her translator, just is not.  There were many instances in this novel where the translation is both obvious and awkward.  Other commenters have noted that the words to pop songs, pop songs originally in English, are translated incorrectly, which is frustrating to read.  The prose picks up half way through the novel and is not as disjointed as it is in the first half of the novel, but The American Girl unfortunately does not accomplish what the author has set out to do."}, {"review_sentiment": 2.0, "review_text": "\"The American Girl\" was translated from Swedish, which I knew from the beginning (after all, \"Lolita\" was translated from Russian)and didn't deter me. But something just doesn't work in the English version. Not sure if it's a language problem or a cultural one. Or perhaps the \"subtle\" writing is too subtle for my taste. Regardless, I can't comment on the story because I didn't read past the first chapter or two, perhaps someone will make it into a movie someday."}, {"review_sentiment": 1.0, "review_text": "This book is a mess.  One reviewer wrote that \"it's not for everyone.\" My take: this book is not for anyone.  Ms. Fagerholm, I'll assume (or is it the translator's fault? probably not), believes that her writing style is, what? new? cutting edge? I just consider it cutesy and of no value to the reader whatsoever. I like seeing traditional subject/verb agreement and am put off when someone writes otherwise.  If an author wants to make an impact with his/her writing, let it be through the story they're telling, not their grammar or syntax.After trying to follow the book's characters through flash-backs and flash-forwards and interminable streams-of-consciousness, I returned the e-book version of this book to my local public library after 90 pages or so, not really caring what happened to the American girl or how she ended up at the bottom of a marsh. Or was it an empty swimming pool? Or was she really lost in the Alps?Upon reflection, I'm amazed I made it that far into the book."}, {"review_sentiment": 5.0, "review_text": "normally a short story writer, Monica has distilled the essence of her skill into a longer work which is so pleasing to read I have difficulty putting it down.  Let someone else relate the plot. the essence of storytelling is here."}, {"review_sentiment": 3.0, "review_text": "The premise of The American Girl sounded incredibly interesting to me - the murder of an American girl that may or may not have occurred, and the two Finnish teenagers who are obsessed with her. In practice, however, the book was a bit difficult to read.The narrative is very convoluted; this is, in no way, a straightforward book. The author will tell the same story over and over again, but reveal new shards of information each time. In this way, readers can piece the truth together, but it can be incredibly trying. It works well if you're in the mood for a book you have to work hard to understand and if you really want a puzzle, but not as well if you want to enjoy what you're reading. Reading it became a bit of a chore, and I found that I was more eager to put it down than I was to pick it back up.Fagerholm is a talented writer, and despite the fact that I didn't love the structure of her novel, I could really appreciate the quality of her writing. She has a very unique style, and though I didn't love this book, I'll definitely consider picking up other novels by this author."}, {"review_sentiment": 3.0, "review_text": "I really wanted to enjoy this book. The premise, the way the book was 'sold' to me, was excellent. And the promise of brilliantly used language drew me to it. So, maybe it was an artifact of the translation that the language wasn't always on target. I traditionally enjoy a challenging read and this book is dense with a sort of stylized writing and a narrative that is not always intuitive. Is this due to something deliberate in the text, designed by the author? Or is it due to translation issues? I'm not sure. Before you choose this book, just understand that it isn't easy reading or passive entertainment."}, {"review_sentiment": 1.0, "review_text": "This was my book club's most recent pick and I looked forward to reading it as the storyline sounded interesting.  Unfortunately, I couldn't even finish it for lack of interest.  The translation from Swedish to English is not well-done therefore leaving it confusing and difficult to follow.  I need a book to capture my attention within the first chapter and this book definitely does not deliver.  Those who finished it in my book club, only 2 of the 9 members, said they felt it got easier to follow after page 150.  They said the storyline kept their attention however they did still struggle to follow at times.  The author jumps from past to present and uses different names for the same character without explanation.  I look forward to winding down at the end of the night to read and unfortnately, this book became a chore."}]}, "authors": ["Monika Fagerholm"], "isbn": "1590513045", "longitude": 24.9425683, "periods": ["1900s", "Recent Releases"], "title": "The American Girl", "word_cloud": "worst ever want stop keep think something interest go happen wrap everything awful way finally slog end get continue suffer first page nearly impossible become best last year emotional variety unbelievable also display incredibly well deeply people burrow conjecture illusion tragic consequence silence difficult get halfway quite boring lot worst long time ambitious quite execute set gothic eerie set young woman titular find dead swamp story take life finnish teenage girls author prose style well gothic mood set reminiscent however master perhaps many instance translation obvious other comm enters note word pop song pop song originally translate incorrectly frustrate prose pick way disjoint first unfortunately accomplish author set translate swedish know begin translated russian deter something work version not sure language problem cultural perhaps subtle write subtle taste story past first chapter perhaps someone make movie someday mess reviewer write everyone anyone assume translator fault probably believe write style new cut edge consider cutesy value see traditional agreement put someone writes otherwise author want impact write let story tell grammar try follow character interminable return version local public library page really care happen end bottom marsh empty swim pool really lose reflection amaze make far normally short story writer distil essence skill longer work please difficulty put someone else relate plot essence storytelling premise sound incredibly interest murder finnish teenager obsess practice however bit difficult narrative convolute way author tell story reveal new shard information time way reader piece truth together incredibly try work well mood hard understand really want puzzle well want enjoy read become bit chore find eager put pick back talented writer fact love structure really quality write unique style love definitely consider pick novel author really want premise way excellent brilliantly use language draw so maybe artifact translation language always traditionally enjoy challenge dense sort stylize write narrative always intuitive is due something deliberate text design author due translation issue sure choose understand easy reading passive entertainment club recent pick look forward read story line sound interesting unfortunately even lack interest translation therefore leave confuse difficult follow need capture attention first chapter definitely finish club member say felt get easier follow page say story line keep attention however still struggle follow time author jump past present us different name character explanation look forward wind end night unfortunately become chore", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "In 1969, a young girl makes a trip from Coney Island to the swampy coastland on the rural outskirts of Helsinki, Finland. There, her death will immediately become part of local mythology, furnishing boys and girls with fodder for endless romantic imaginings. Everyone who lives near the swamp dreams about Eddie de Wire, the lost American girl. . . . For both Sandra and Doris, two lonely, dreaming girls abandoned in different ways by their parents, this myth will propel them into their coming-of-age through mischievous role-playing games of love and death, in search of hidden secrets, the mysteries of the swamp, and the truth behind Eddie’s death. The girls construct their own world, their own language, and their own rules. But playing adult games has adult consequences, and what begins as two girls just striking matches leads to an inferno that threatens to consume them and tear their friendship apart. \r\n\r\nCrime mystery and gothic saga, social study and chronicle of the late sixties and early seventies, a portrait of the psyche of young girls on the cusp of sexual awakening, The American Girl is a bewitching glimpse of the human capacity for survival and for self-inflicted wounds. Fagerholm is a modern-day heir to the William Faulkner heritage of family tragedy, with a highly musical and literary prose style that is rich with wit and literary allusions. The American Girl will teach you the meaning of trust as you give yourself entirely to the original storytelling style of Monika Fagerholm.", "asin": "1590513045", "rank": "2871302", "city": "Helsinki", "image": "https://images-na.ssl-images-amazon.com/images/I/411mbMXMXyL.jpg", "country": "Finland", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}