{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 9, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "An amazing book written in 1931 for adults by the famous children author. This book was the reason why Kästner's books were burned and outlawed during the Nazi era."}, {"review_sentiment": 2.0, "review_text": "This was a textbook,Weird book, I might have liked it more if it wasn't for class."}, {"review_sentiment": 5.0, "review_text": "It is a lot more than a tale of  the decadence of the time.  The story of Fabian is fascinating with his internal contradictions, provoked by the mores of the time, but a moralist at heart. Engrossing story.  You get to live it with him.Only one piece of advice, do not read the Introduction by Rodney Livingstone before reading the novel, it spoils the drama.  After all he wrote it after reading the novel, so we should also read it afterwards.  Ir will even be more illustrative, as you can contrast your impressions with his."}, {"review_sentiment": 4.0, "review_text": "A unique voice calls back to us from the pages of this work.  The novel is rather short, which is a good thing here.  The flavor of the time being brought forth with vinegar.  Many would say that the work was 'a downer', but this is to a great extent the general aura of much of Central Europe in the period between the World Wars.  The situation of Vienna may have been more somber, as reflected by such works as Stephen Zweig's Postal Girl.  Berlin had a bit more rebellious spirit, with futile attempts at exultation.  Such attempts make the situation ultimately that much more gloomy as seen in works of Doblin and Kastner here and are seen from without in Christopher Isherwood's Berlin Stories.Not everybody wants to take the trip through such lugubrious environs.For those who do, this work will be rewarding."}, {"review_sentiment": 4.0, "review_text": "This novel by Erich Kaestner follows the adventures of Jacob Fabian in Berlin in the late 1920s.  The reader encounters brawls between Communists and Nazis, the increasingly dire economic situation, and bizarre sexicapes.  The story is both ribald and depressing.  It really captures the mood of febrile Berlin in the Weimar Republic's last years.Unfortunately, this reissue by NYRB Classics has some real flaws.1) NYRB Classics did not commission a new translation.  This is an old, British translation, and to an American reader it will sound like it is old and British.  I would have expected more from the NEW YORK Review of Books.2) The editors at NYRB Classics changed the title of the book.  This book was originally published in German as _Fabian: The Story of a Moralist_ (Fabian. Die Geschichte eines Moralisten).  The first English edition was entitled _Fabian: The Story of a Moralist_.  Every edition since then has been entitled _Fabian_.  That's the name the book is known by.  But NYRB Classics decided to give it a new title based on the fact that in 1950 Kaestner wrote an essay in which he claimed he had wanted to entitle the book _Going to the Dogs_.  That may well be, but the book has never been issued before in any language with that title.  No one knows it by that title.  And calling it by that title will only confuse readers.3) The book is cluttered with various essays, commentaries, and sundry introductions and epilogues.It's a great novel.  I wholly recommend it, but this edition leaves something to be desired."}, {"review_sentiment": 4.0, "review_text": "For anyone who might want to catch an understanding of the free-fall culture within the educated elite in Berlin during the waning years of the Weimar Republic, this book is a feast.Fundamentally, the book consists of a series of episodes experienced by its protagonist, Fabian. As such, it speaks to his and to his cultures emptiness, restlessness and meaninglessness.Life, in that period, the author sees to say, was no more or no less than a series of off-beat experiences, mostly sexual, that lead nowhere.In the book, at least as I read it, there was no growth, no coherence, no learning, no climactic event...but rather just one lost and relatively joyless experience after another.And, yet, at some level the book satisfies...for Fabian, who is the 'string' that connects all these dead-end experiences, is a sympathetic creature, lost to be sure, but likable just the same."}, {"review_sentiment": 5.0, "review_text": "Erich Kastner (1899-1974) is perhaps best known for his children's books, especially the much translated, `Emil and The Detectives'; and through film adaptations of `Lottie and Lisa', the source of Walt Disney's, `The Parent Trap'.However in `Going to the Dogs' (published as `Fabian', in 1931), Kastner probes the hopelessness, intrigue, and degeneration of Weimar Germany.Most vivid here is that particular Weimar sense of purposelessness and restlessness which generated (in many) an intense, desperate, seeking.  The German concept `sehnsucht' (lit. yearning-addiction), comes to mind.  One clearly feels the frustrated longing for what isn't, and perhaps what can not be.After defeat in 1918, Germany plunged into turmoil which didn't end until Hitler.  People were adrift: authority, institutions, and cultural norms lost their force.  Dire economic circumstances contributed to a breakdown of structures, engendering vast social and cultural disintegration.Setting aside its disastrous ending, some very fine art, music, and literature arose (Kurt Weil comes to mind), of which Kastner's work is an important part.  Although this novel is little known, it is very much worth reading, especially with (and for) an historical awareness.One could argue `Going to the Dogs' is not truly a novel, but a series of set pieces, episodes tied together by its protagonist, Jacob Fabian, (likely, in part, Kastner himself), and the city of Berlin.  Its best read not for plot, or even character, but for the vital sense of time, place, and milieu it conveys - along with its timeless depictions of flawed human nature.We meet hypocritical newspaper editors, prostitutes (male and female), naive activists, opportunists, politically enraged drunks shooting pistols, a detached father and absent mother, a depraved husband, a malignantly jealous academic - all in an atmosphere of abundant alcohol and hyper-charged sexuality.Yet Fabian is not as unaware, or lost (or detached) as he may first seem.  Largely, he's a sympathetic character: decent, and oddly enough, a somewhat conservative moralist whom we understand even better now, knowing what was to come.No, Kastner is not as charming as Zweig, or as polished as Joseph Roth, or as psychologically astute as Schnitzler, but he does provide a unique and invaluable insight, conveyed with a Viennese intensity: a significant of-the-period view of Weimar Berlin, a place where, \"Life is a chance, death is a certainty.\"*********Three final points:The cover art (Christian Schad's `Self Portrait With Model', 1927) is intriguing (note the title block obscures the woman's breast - an unintentional allusion to the censorship of the original edition?)  And although we might visualize Fabian as looking like Schad, the grittier art of either Otto Dix of George Grosz might have been more fitting.Also, a book this important could use a fresh translation as this British-English rendition is at times clumsy.  Anthea Bell`s recent translations of Stefan Zweig are light, engaging, and models of clarity: NYRB should have used her talents here as well.Finally, Rodney Livingstone's introduction is thoughtful and informative, but as is all too common in NYRB titles, its too revealing and should be read as an afterward."}, {"review_sentiment": 4.0, "review_text": "this book left me with a sense of voyeuristic decadence and fear. Our young and ambitious college graduates are not able to practice their skills ,our country is sinking into mediocrity and financial ruin and prejudice is increasing every day.For our heroprovidence ,in the end, solves his dilemma .Depressing!! deja vu all over again"}, {"review_sentiment": 3.0, "review_text": "Erich Kastner lived in that seminal time between World Wars in which so much of modern literature is based. Training to be a teacher, his studies were interrupted when he volunteered for the first and, living in Switzerland during the outbreak of the second, he returned to Germany, now during its Third Reich, with grandiose ideas of novelizing the war. At one point he attended his own book burning. He took up with the school of \"New Objectivity\" that, borne in response to the mass society, found solace in the idea of the individual in much the same way that modern society, increasingly free of disease and hunger, shuns vaccinations and the mass production of food as a return to its humanity, even if this morally base state leaves us wanting.Going to the Dogs take place in the Weimar Republic, shortly before its fall. Kastner's angry but also apathetic with the society in which he finds himself. The crux of his anger is articulated through the editor of the newspaper who invents news, slaughters men without concern, influences opinion (or, \"the most convenient...the public lack of all opinion\"), and is \"too respectable\" to support the government. Society is failing, politically and economically, not because of the \"present (economic) crisis\", but because of the \"spiritual sloth\" that underlies it. In his 1950s preface he bemoans that \"people nowadays understand even less\" because society is \"inoculating the masses with new standardized opinions.\" The idea that our knowledge isn't our own brings up an interesting point; how do we form our own judgments? How - and why - do we know whatever it is we know? How do we separate that which is didactic from that which is dogmatic?Fabian, fictionalized Kastner, is an ascetic, living a Spartan lifestyle; to him, even coffee is sweet. He \"cultivate(s) mixed emotions as a hobby\" and is \"melancholic, so nothing much can happen\" to him, although when he finally attempts to better society it ends so poorly that the results are absurd. It's interesting that, while shunning everything sweet, the writing is full of treacly, moralizing dialogue. In each chapter he attempts to go out on a high note. Like other lesser authors, Kastner is incapable of listing his qualms with society in any way except explicitly, through stilted and unnatural dialogue, that leaves nothing to the reader and nothing ambiguous in which one can find their own meaning or ascribe their own importance.Given that this was written in 1930s Germany, it should come as no surprise that Freudian psychology figures prominently. One man, describing the sexual proclivities of his wife at which we are supposed to balk, says that their marriage \"produced wish-dreams of whose content, my dear sir, you can, happily, form no conception.\" While both genders are overly sexualized (this is, after all, \"satire\"), it's only women who are judged for their deviance. And while women run brothels full of men, \"people were sauntering past along the pavements without any idea of the crazy things that happened behind the house-fronts.\" Any semblance to permanence is only an illusion, as houses catch fire during the night because of defects in their construction.How well can a work of satire concerned with 1930s morals hope to age? It is an interesting dynamic that a book on morals belies the idea as conceptualized by a modern, educated world. In dealing with morals the question always arises of whose, exactly, morals they are to be. That NYRB chose to re-release this now speaks to their belief that history repeats or, at a minimum, educates. So when the newspaper editor laments that the country is falling \"into the hands of foreigners\" or that \"the state bolsters up the bankrupt landowners\" and dares not impose taxes on the rich, you're apt, if you're of a certain mindset, to attempt to make parallels. We like to believe that events are causal and to find meaning in words. But there are just events, and it's humans that make those into stories. So, while we should be wary not only of Kastner's prescriptions on morality, we should be wary too of the idea that history forms some grand narrative through which we can learn."}]}, "authors": ["Erich Kastner"], "isbn": "1590175840", "longitude": 13.3888599, "periods": ["1900s"], "title": "Going to the Dogs: The Story of a Moralist", "word_cloud": "amazing write adult famous child author reason burn era textbook class lot tale decadence time fascinate internal contradiction provoke more time heart get live piece advice read spoil drama write read also afterwards even illustrative contrast impression unique voice call page work rather short good thing flavor time bring forth vinegar work downer great extent general aura much period war situation reflect work bit rebellious spirit futile attempt exultation such attempt make situation ultimately much gloomy see work see everybody want trip lugubrious work reward follow adventure late encounter brawl increasingly dire economic situation bizarre seascapes ribald depress really capture mood febrile last reissue real commission new translation old british translation american sound old british expect editor change title originally publish german wine first english edition entitle edition entitle name know decide give new title base fact write essay claim want entitle well never issue language title one know title call title confuse cluttered various essay commentary sundry introduction great wholly recommend edition leave something desire anyone catch understanding culture educate elite wan year consist series episode experienced protagonist speaks culture emptiness restlessness period author see say le series experience mostly sexual lead least growth coherence learn climactic event rather lose relatively joyless experience yet level satisfies fabian connects experience sympathetic creature lose sure likable perhaps best know child especially much translate film adaptation source publish probe hopelessness intrigue degeneration vivid particular sense purposelessness restlessness generate many intense desperate seek german concept lit come mind clearly feel frustrate long perhaps plunge turmoil end adrift authority institution cultural norm lose force economic circumstance contribute breakdown structure engender vast social cultural aside disastrous end fine art music literature arise come work important part little known much worth read especially historical truly series set piece episode tie together protagonist likely part city best plot even character vital sense time place milieu conveys timeless depiction flaw human meet hypocritical newspaper editor prostitute male female naive activist opportunist politically enrage drunk shoot pistol detach father absent mother deprave husband malignantly jealous academic atmosphere abundant alcohol unaware lose detached largely sympathetic character decent oddly enough somewhat conservative understand even better know charm polish psychologically astute provide unique invaluable insight convey intensity significant view place chance death certainty final point cover art intrigue note title block obscure woman breast unintentional allusion censorship original edition fabian look art important fresh translation rendition time clumsy recent translation light engage model clarity use talent introduction thoughtful informative common title reveal afterward leave sense voyeuristic decadence fear young ambitious college graduate able practice skill country sink mediocrity financial ruin prejudice increase hero providence end solve dilemma deejay cu live seminal time much modern literature base study interrupt volunteer first living outbreak second return grandiose idea novelize war point attend burning take school borne response mass society find solace idea individual much way modern society increasingly free disease hunger shun vaccination mass production food return humanity even morally base state leave place shortly fall angry also apathetic society find crux anger articulate editor newspaper invent news slaughter men concern influence opinion convenient public lack opinion respectable support government fail politically economically present economic crisis spiritual sloth underlies preface bemoans people nowadays even le society inoculate mass new standardized opinion idea knowledge bring interesting point form judgments know whatever know separate didactic dogmatic fictionalize ascetic living lifestyle even coffee sweet mixed emotion hobby melancholic nothing much finally attempt better society end poorly result absurd interesting shun everything sweet write full treacly moralize dialogue chapter attempt go high note lesser author incapable listing qualm society way explicitly stilted unnatural dialogue leave nothing nothing ambiguous find meaning ascribe write come surprise freudian psychology figure prominently man describe sexual proclivity wife suppose balk say marriage produce content dear sir happily form conception gender overly serialize satire woman judge deviance woman run brothel full men people saunter pavement idea crazy thing happen semblance permanence illusion house catch fire night defect well satire concerned moral hope age interesting dynamic moral belies idea conceptualize modern educate world deal moral question always arise exactly morals choose speaks belief history repeat minimum educates so newspaper editor lament country fall hand foreigner state bolster bankrupt landowner dare impose tax rich apt certain mindset attempt make parallel like believe event causal find meaning word event human make story wary prescription morality wary idea history form grand narrative learn", "genres": ["Fiction & Literature", "Politics", "Satire"], "summary": "New York Review Books Classics\r\n\r\nGoing to the Dogs is set in Berlin after the crash of 1929 and before the Nazi takeover, years of rising unemployment and financial collapse. The moralist in question is Jakob Fabian, “aged thirty-two, profession variable, at present advertising copywriter . . . weak heart, brown hair,” a young man with an excellent education but permanently condemned to a low-paid job without security in the short or the long run.\r\n\r\nWhat’s to be done? Fabian and friends make the best of it—they go to work though they may be laid off at any time, and in the evenings they go to the cabarets and try to make it with girls on the make, all the while making a lot of sharp-sighted and sharp-witted observations about politics, life, and love, or what may be. Not that it makes a difference. Workers keep losing work to new technologies while businessmen keep busy making money, and everyone who can goes out to dance clubs and sex clubs or engages in marathon bicycle events, since so long as there’s hope of running into the right person or (even) doing the right thing, well—why stop?\r\n\r\nGoing to the Dogs, in the words of introducer Rodney Livingstone, “brilliantly renders with tangible immediacy the last frenetic years [in Germany] before 1933.” It is a book for our time too.\r\n\r\n“Like his hero Fabian, Kästner was not a cynic as a saddened idealist; the two conditions look much the same, but the latter is more painful….Fabian is a \"key novel\" of the Weimar Republic in its last years. It is a notably efficient novel, with little of the metaphysical resonance of [Thomas Mann’s] Doctor Faustus or that book’s soul-searching, but offering instead a series of moral tableaux, rendered the cooler by the chapter titles, in the form of newspaper headings.” The Times Literary Supplement.", "asin": "1590175840", "rank": "598091", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51EBNzLvMmL.jpg", "country": "Germany", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}