{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 5, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "This book should probably be subtitled \"How to age gracelessly\". But that would be casting a callous interpretation upon it. The story revolves around an irascible Spanish expatriate, Don Celestino. Having fled from Spain during the aftermath of the Spanish Civil because of his anarchist partisanship, he ends up residing in a France he never grew to appreciate, much less love. Despite living there for well over a decade, he doesn't bother to learn its language, always using Spanish despite inconveniences. Truth be told, it's an ever-present question what Celestino actually does love in his old age. A listing would seem uncomfortably anemic: Talking about world politics. Writing about anarchist politics. And his daughter, when she was young. Perhaps bullfighting; but then again, perhaps not..... All else has either fallen out of favor with him, or had never enjoyed it in the first place. Ultimately, the author illustrates to his reader, aging progressively narrows one's worldview as experiences progressively become more meager, isolating, and bottlenecked. Friends pass away. Retirement puts one out of life's bustle which employment insists upon. Clarity of the senses diminishes. Thoughts blur. Identification with the burgeoning youth in society becomes improbable, if not impossible. But our main character distinguishes himself by prodding these natural events along toward their sad conclusions. He breaks with all friends purposely. He manipulates his daughter so as to achieve his selfish ends. He mentally lounges in the old ideas of the Generation of '98 without irony. He writes down his thoughts without hope that anyone will bother to read them. He discovers comfort in cold but beautiful material things used to adorn his shrinking world. His descent into complete loneliness and his mastery in it is close to absolute. \"From the depths of his abyss, he was still in command,\" the narrator informs us. As Celestino descends into isolation, paranoia, anger, and maybe delusion, the reader feels sorry for his miserable slide, until remembering Celestino is exactly where he wants himself to be. His return to his native land is a journey shorn of all affection, undertaken solely for base enrichment from a family loss. His apparent paranoid insistence that people are after him strikes the reader as a stark farce. Unfortunately, Celestino's grasp of the sordid machinations of the world aren't completely without foundation. He has more enemies than even he imagines, perhaps. The completion of the novel ends with the completion of a particularly miserable and sullen life. But it was a life lived almost entirely on its own terms. An impressive achievement, albeit an altogether unheroic one. The title, Chaos and Night, refers to the dichotomy of life as restless tumult)chaos) until the arrival of its ceasing death(night). Maintaining mastery amid flux is one method of keeping the frightful \"trappings\" of death at bay....if only for a brief while. Celestino forces the reader to question whether personal mastery against the chaotic contemporary world acquired through sacrifice of all amiable sociability and human friendship is ever worth the bargain. For night may descend even before biological death occurs, though it often does so only upon request....."}, {"review_sentiment": 5.0, "review_text": "A novelist famously known for his misogyny, Montherlant puts paid to political obsession in this gripping novel.  It deserves to be much better known than it is, because aside from THE GIRLS, his tetralogy, the rest of Montherlant's fiction is not very good, whereas CHAOS AND NIGHT is a triumph, arguably his masterpiece."}, {"review_sentiment": 3.0, "review_text": "Some years ago I read Montherlants' THE GIRLS.I remember thinking, it's good but not especially compelling . It proved to be a book that didn't stick with me. I decided to read CHAOS and NIGHT largely because the Spanish Civil War interests me and I was curious to see what kind of spin an old reactionary like Montherlant would give it.The book centers around Celestino, a Loyalist veteran and refugee  who lives in France.Now there was a time when such people were deemed heroes by the Left and I assume this was so in France. When the book came out in 1960 French literary culture was a left wing province and you'd expect a portrait of a Spanish Republican veteran to be downright reverential. But then you wouldn't be reading a book by Montherlant.I wondered what he'd do to such character. It's not a pretty sight! While Montherlant was fascinated by Spain, he clearly wasn't bowled over by the mythos of the Loyalists.Celestino is a bourgeois pseudo - anarchist and if you are one of those who has trouble reading a book with unlikeable characters, avoid this like the plague .I'm not bothered by unlikeable characters. However I did find Celestino grating.He is not merely unlikeable , he is a complete jerk.Shallow, not particularly well informed or well educated, utterly tone deaf to cultural matters and grossly insensitive ,Celestino imagines he is a deep thinker .He spends his days writing articles that can't get published and that no one wants to read.A talentless bore like Celestino does well to be very nice , instead he goes out of his way to alienate everyone he knows. Worse yet, in doing so he imagines that he is exuding nobility.Periodically he reflects on his civil war past, and Montherlant drops a number of  hints to the effect that Celestino was a vicious political killer during the war.Unsurprisingly these reflections don't perturb Celestino.There is a profoundity to the portrait Montherlant gives us.Celestino is exactly the kind of person who becomes a political executioner.Crackpot ideas and abstractions have always been more real for him than the concrete.He tries to ignore the material world in favor of dwelling in an abstract world where he knows the truth and if he has to kill to attain it , so be it.There is a grim humor to this.That is, Celestino is so intellectually muddled he has no idea what his great truth is.He admits he doesn't understand Marxism .He realizes he's not really an anarchist.He actually hates the people he is so dedicated to delivering to the promised land.What he likes , and he is conscious of this , is destroying things."}, {"review_sentiment": 5.0, "review_text": "As of this writing, there is only one other reader's review of Montherlant's _Chaos and Night_.  Dear reader, if you're tired of mediocre novels just off the press by so-called living authors who have sold out or cut back on their ambition--and there seem to be many--you better try this novel.  Yes, \"back to the classics\" will be my cry.You might have read the basic plot outlines, namely, that an aging Spaniard named Celestino Marcilla has been living in exile in Paris for over twenty years because he was on the losing side of the Spanish Civil War against General Franco and his Fascists; his sister dies in Madrid and Celestino goes back to settle the estate.  The \"action\" of the novel takes place inside Celestino's troubled head--but what a mind!  Celestino is tortured by his role in the civil war, the decisions he made--an understandable dilemma--and then he's like a spoiled brat old man; he can't stand the French he's been living among, but doesn't like his fellow Spaniards, and he even has the ingratitude to fall out with his devoted young daughter, Pascualita, as well as tell his best friends, Ruiz and Pineda to f---off.  But wait, there's more. . . . .On the train to Madrid, to settle his sister's estate, Montherlant brings Celestino to a feverish pitch--fear of arrest and imprisonment are real since Franco is still in power--but Celestino is consumed by another fear, that his beloved bullfighting ritual will have been diluted my commercialism.  Yes, this old war veteran is an aficionado, and his high-minded perfectionism is easily recognized as a spiritual necessity.  As crotchety and irritating as the aging Spaniard is, every step of the way in this novel, Montherlant weaves in hints of Celestino's humanity.  Yes, this is a novel about weakness and strength--about all of us--as Celestino realizes he is dying and must say goodbye to everything that he has ever loved: life itself.There are some great lines:  Celestino: \"Newspapers are more important than machine-guns provided there is no freedom of the Press,\" and \"I can't write my book because I have too many ideas.\"  Ruiz, his fellow exile: \"If you had a job, you wouldn't have time to have ideas.  I work, which is why I have no more ideas than are strictly necessary.\"For those of us unfortunate enough not to read the original French, we've got Terence Kilmartin's translation, which seems impossible to improve upon.  I've never regretted not reading Don Quixote--until now, since old Celestino is a bit quixotic himself."}, {"review_sentiment": 5.0, "review_text": "I don't know how this book ended up on my reading list, but there it was and the text was short, so I thought I'd take the plunge. And I'm glad I did. Besides being an engaging character study (the entire time you are reading this you are wondering whether this guy was truly a revolutionary or someone who is merely manufacturing his past), the ending was simply ... well ... magnificently executed. Read it."}]}, "authors": ["Henry de Montherlant"], "isbn": "159017304X", "longitude": 2.3514992, "periods": ["1900s"], "title": "Chaos and Night", "word_cloud": "probably subtitle age gracelessly cast callous interpretation story revolve irascible spanish expatriate flee anarchist partisanship end reside never grow appreciate much le living well decade bother learn language always use spanish inconvenience tell question actually love old age listing uncomfortably anemic world politics write anarchist politics daughter young perhaps bullfighting perhaps else fall favor never enjoy first place ultimately author illustrate age progressively narrow worldview experience progressively become meager isolate bottle necked friend pass away put life bustle employment insist sense diminishes blur burgeon youth society become improbable impossible main character distinguishes prod natural event sad conclusion break friend purposely manipulate daughter achieve selfish end mentally lounge old idea irony write thought hope anyone bother discover comfort cold beautiful material thing use adorn shrink world descent complete loneliness mastery close absolute depth abyss still narrator informs descend isolation paranoia anger maybe delusion feel sorry miserable slide remember exactly want return native land journey horn affection undertaken solely base enrichment family loss apparent paranoid insistence people strike stark farce grasp sordid machination world completely foundation enemies even imago perhaps completion end completion particularly miserable sullen life life live almost entirely term impressive achievement altogether heroic title refers dichotomy life restless tumult arrival cease death maintain mastery flux method keep frightful trapping death bay brief force question personal mastery chaotic contemporary world acquire sacrifice amiable sociability human friendship ever worth bargain even biological death occur though often upon request novelist famously know misogyny put pay political obsession grip deserve much better know tetra logy rest fiction good whereas triumph arguably masterpiece year motherlands remember think good especially compel prove stick decide largely spanish interest curious kind spin old reactionary center veteran refugee live time people deem hero assume come literary culture leave wing province expect portrait spanish veteran downright reverential wondered character pretty sight fascinate clearly bowl myth bourgeois pseudo anarchist trouble read unlikable character avoid plague bother unlikable character however find merely unlikable complete particularly well inform well educate utterly tone deaf cultural matter grossly insensitive imago deep thinker spend day write article publish want talent less bore well nice instead go way alienate everyone know worse yet imago exude reflect civil war drop number hint effect vicious political killer reflection perturb profundity portrait give exactly kind person become political idea abstraction always real try ignore material world favor dwell abstract world know truth kill attain grim humor intellectually muddle idea great truth admits understand realize really actually hat people dedicated deliver promised like conscious destroy thing write review tire mediocre novel press living author sell cut ambition seem many better back classic plot outline namely age name live exile year lose side sister die go back settle estate action take place trouble head mind torture role civil war decision make understandable dilemma spoil brat old man french living like fellow even ingratitude fall devote young daughter well tell best friend f wait train settle sister estate bring feverish pitch fear imprisonment real still power consume fear beloved bullfighting ritual diluted commercialism old war veteran aficionado perfectionism easily recognize spiritual necessity crotchety irritate age step way weave hint humanity weakness strength realize die goodbye everything ever love life great line important provide freedom many idea fellow exile job time work ideas strictly necessary unfortunate enough original french get translation seem impossible never regret read old bit quixotic know end reading list short think take plunge glad engage character study entire time read wonder guy truly revolutionary someone merely manufacture end simply well magnificently execute", "genres": ["Fiction & Literature"], "summary": "(New York Review Books Classics)\r\n\r\nDon Celestino is old and bitter and afraid, an impossible man. An anarchist who has been in exile from his native Spain for more than twenty years, he lives with his daughter in Paris, but in his mind he is still fighting the Spanish Civil War. He fulminates against the daily papers; he brags about his past exploits. He has become bigoted, self-important, and obsessed; a bully to his fellow exiles and a tyrant to his daughter, Pascualita.", "asin": "159017304X", "rank": "1661703", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/41ndJOdghCL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}