{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 8, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Imagine becoming famous -- posthumously -- not for any novel you have written but for the detailed, vivid, gossipy journals that you wrote with your brother over a long period of time. I thought this was a fascinating read. I love the eccentric touches here, such as the fact that the brothers write in one essaying voice, as if they form a whole. The cameo appearances by legendary authors are worth the price of the book. All the incidental and major characters live so fully on the page."}, {"review_sentiment": 5.0, "review_text": "These guys literally knew anybody who was anybody in Paris, late 1850s-c. early 1890s. Fascinating chunk of cultural history. Down-to-earth first hand accounts of fellow writers."}, {"review_sentiment": 1.0, "review_text": "Such a slow read.However, it does give insight to what Paris was like in the late 1800's."}, {"review_sentiment": 4.0, "review_text": "This volume is a must for research into  Parisian writers and their feuds and friendships. Especially if one does not read French.A distillation of thousands of pages, it really brings to light the very different worldviews of the period.Earthy and scandalous and often hilarious amidst the horror of the disease and poverty of the milieu."}, {"review_sentiment": 5.0, "review_text": "The Goncourts were acquainted with all the luminaries of the 19th century French literary scene, and their journals supply the necessary background to the numerous biographies of Flaubert, Zola, Maupassant, Gautier and a score of others.The brothers are far from objective observers, and their cranky and opinionated views of, say, Zola need to be taken with a huge grain of salt.  But it's fun reading, a must for all admirers of the period.Odd that the Journal is the only book of the Goncourts that's still worth reading.  They were prolific novelists but except for GERMINIE LACERTAUX, very little of their fiction is in print and there are few modern translations into English (GERMINIE done by Leonard Tannock, is the only one I know).Their biography by Andre Billy is also worth reading, even though their books are clearly part of the forgotten past."}, {"review_sentiment": 4.0, "review_text": "Slices of literary and social history that I am too young to have experienced.  Sly wit and smart observation by publishers who knew all the writers of their day."}, {"review_sentiment": 3.0, "review_text": "The Goncourt brothers were quite the pair: they pledged at an early age never to marry (don't worry, they had plenty of mistresses in the proper French form)and dedicated themselves to cultural pursuits of dubious quality and success. Their unquestionable victory, however, is this salacious, gossipy journal.The Goncourts were anti-Semitic royalists who hung out with most of the cultural elite of the day: Zola, Maupassant, Flaubert, and Degas all peopled their vicious circle of decadence and artistic jealousy. Their snippy back-and-forths with Emile Zola over the \"ownership\" of the literary movement of Naturalism is particularly entertaining. Of course Zola went on to defend the maligned Capt. Dreyfus with his \"J'accuse\" letter in 1898, so it is certainly possible to read the Goncourt's racism as an underlying factor in that schism.There are some curious holes in the narrative, though -- this version has absolutely no entry mentioning the funeral of Victor Hugo in 1885, which was one of the most amazing cultural events in all history and turned Paris into one large carnival of drunkenness and sex for almost an entire week.If you want to get a glimpse of life in the fin-de-siecle' then this will give it to you, royalist warts and all."}, {"review_sentiment": 4.0, "review_text": "\"Ever since the world began, the only memoirs of any interest have been written by 'indiscreet individuals,'\" Edmond de Goncourt noted. \"And my only crime is to be still alive twenty years after they were written.\"He got that half-right. Indiscretion is the secret sauce of memoir. But de Goncourt's sin was not to be alive to hear the howls of protest from his victims and their allies --- it was that he and his brother Jules savaged their friends and enemies with equal glee. And that's the first great attraction of this edited edition of one of the greatest journals in all of literature: It's really bitchy.It's really bitchy in large part because the Goncourt brothers had an extremely high opinion of themselves. In 1851, they published their first novel. Their self-review: \"It contains in embryo every aspect of our talent and every colour on our palette.\" Alas, their timing was terrible; Bonaparte had just dissolved the National Assembly and declared himself Napoleon III, dictator of France. From their first diary entry: \"What a time it [our novel] chose to appear! A symphony of words and ideas in the middle of that scramble for office.\"For social beings, the Goncourts could be profoundly anti-social. They loathed half the world on principle --- \"Woman is the animal that lives inside a silk dress\" --- and periodically cut themselves off from the Paris literary scene: \"We had given away our old evening clothes and had no new ones made, so as to be unable to go anywhere. No women, no pleasures, no amusements: just unceasing toil.\" By 1857, they report, \"No friends, no connections, every door shut in our face, and all money spent on books.\"Don't be fooled. They knew everyone: Flaubert, de Maupassant, Victor Hugo, Degas, Rodin, Baudelaire, George Sand, Turgenev. There are regular dinners, and, after, the Goncourts go home and scribble.Flaubert tells them how he lives without a woman: \"I just lie face down and during the night...it's infallible.\"Hugo, they write, \"had a notebook in which he writes down what he has just said.\"One good thing about their deep skepticism about some of the greatest writers in French literature --- when they're at their cattiest, they offer unvarnished opinions that take us much closer to understanding the greats than a lot of more reasoned analysis. Here they are, on the subject of the \"hidden sides\" of their dear friend, Gustave Flaubert: \"He quietly pushes himself forward, establishes relations with important people, creates a network of useful acquaintances, all the while pretending to be independent, lazy, and fond of solitude.\" And they are just as cutting when they take the long view. Voltaire, they observe, \"spent his life taking an interest in something --- himself.\"\"Genius is the talent of a dead man,\" they said. Not quite. The Goncourts believed they possessed it --- and in abundance. But the unanimity of thought which made theirs such a successful collaboration didn't pay off. All told, they wrote about 30-odd plays, novels and books of criticism. None has survived them.The literary immortality of the Goncourt brothers comes, instead, from the writing they threw off easily and without concern for style --- these journals. The extreme realism of their novels had won them no friends and few readers. But the extreme realism --- okay, subjective realism --- of their table talk gives us a picture of Paris in the middle of the 19th century that is fresh, original, acutely observed. Their masterpiece is, in essence, a gossip column."}]}, "authors": ["Edmond de Goncourt", "Jules de Goncourt"], "isbn": "159017190X", "longitude": 2.3514992, "periods": ["1800s"], "title": "Pages from the Goncourt Journals", "word_cloud": "become famous posthumously write detail vivid gossipy write brother long period time think fascinate love eccentric touch fact brother write essay voice form whole cameo appearance legendary author worth price incidental major character live fully guy literally know anybody anybody late early fascinate chunk cultural history first hand account fellow writer such slow give insight late volume research parisian writer feud friendship especially distillation thousand really bring light different worldviews scandalous often hilarious midst horror disease poverty milieu acquaint luminary century literary scene supply necessary background numerous biography score brother far objective observer cranky opinionated view say need take huge grain salt fun reading still worth read prolific novelist little fiction print modern translation english do know biography also worth read even clearly part forget past slice literary social history young experience smart observation publisher know writer day brother quite pair pledge early age never marry worry plenty mistress proper french form dedicate cultural pursuit dubious quality success unquestionable victory however salacious gossipy goncourts royalist hang cultural elite day people vicious circle decadence artistic jealousy snippy ownership literary movement particularly entertaining course go defend malign letter certainly possible racism underlie factor curious hole narrative version absolutely entry mention funeral amaze cultural event history turn large carnival drunkenness sex almost entire want get glimpse life give royalist wart ever world begin memoir interest write individual note crime still alive year write get secret sauce memoir sin alive hear howl protest victim ally brother savage friend enemy equal glee first great attraction edit edition greatest literature really really large part brothers extremely high opinion publish first contain embryo aspect talent color palette timing terrible dissolve declare dictator first diary entry time choose symphony word idea middle scramble office social being goncourt profoundly loathe half world principle animal life silk dress periodically cut literary scene give old evening clothe new one make unable anywhere woman pleasures amusement unceasing toil report friends connection door shut face money spend fool know everyone regular dinner go home tell live woman lie face night infallible write notebook write say good thing deep skepticism greatest writer french literature cattiest offer unvarnished opinion take much closer understanding great lot reason analysis here subject hidden side dear friend quietly push forward establishes relation important people create network useful acquaintance pretend independent lazy fond solitude cut long view observe spend life take interest something talent dead man say not quite believe possessed abundance unanimity thought make successful collaboration pay tell write play novel criticism none survive literary immortality brother come instead write throw easily concern style extreme realism novel friends reader extreme realism realism table talk give picture middle century fresh original acutely observe masterpiece essence gossip column", "genres": ["Biography", "Fiction & Literature"], "summary": "No evocation of Parisian life in the second half of the nineteenth century can match that found in the journals of the brothers Goncourt\r\n\r\nThe journal of the brothers Edmond and Jules de Goncourt is one of the masterpieces of nineteenth-century French literature, a work that in its richness of color, variety, and seemingly casual perfection bears comparison with the great paintings of their friends and contemporaries the Impressionists.\r\n\r\nBorn nearly ten years apart into a French aristocratic family, the two brothers formed an extraordinarily productive and enduring literary partnership, collaborating on novels, criticism, and plays that pioneered the new aesthetic of naturalism. But the brothers’ talents found their most memorable outlet in their journal, which is at once a chronicle of an era, an intimate glimpse into their lives, and the purest expression of a nascent modern sensibility preoccupied with sex and art, celebrity and self-exposure. The Goncourts visit slums, brothels, balls, department stores, and imperial receptions; they argue over art and politics and trade merciless gossip with and about Hugo, Baudelaire, Degas, Flaubert, Zola, Rodin, and many others. And in 1871, Edmond maintains a vigil as his brother dies a slow and agonizing death from syphilis, recording every detail in the journal that he would continue to maintain alone for another two decades.", "asin": "159017190X", "rank": "823550", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/5139BTVrkZL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}