{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 7, "rating": 4.7, "reviews": [{"review_sentiment": 4.0, "review_text": "Dripping with gritty Nostalgia for a tough but soulful Paris that existed after the War.....and overlapped slightly with my own discovery of the city. I took a private pleasure in the book, perhaps not accessible to those visiting the Paris of i-phones, tourist chique and Macdo."}, {"review_sentiment": 4.0, "review_text": "if you love writings about the \"other half\" this will please you."}, {"review_sentiment": 5.0, "review_text": "GOOD BOOK"}, {"review_sentiment": 5.0, "review_text": "What a blessing it is that Jean-Paul Clebert's \"Paris Vagabond,\" first published in France in 1952, is now available in a beautiful translation from the New York Review of Books. Journalistic in style, but not originally written as a journal, the book was cobbled together from random jottings that Clebert penned in the years following World War II, when he was both homeless and unemployed. They tell the tale of a Paris quite different from the  glamorous tourist mecca we know today, a Paris that was then home to a far sketchier population, with many people, like the author, using their wits to survive severe deprivation. In these circumstances, it is particularly notable that the book's many short essays, as they might best be characterized, are so poetic in nature despite being rendered in prose.These essays, 55 in number, are grouped into seven chapters that focus, for example, on obtaining food by methods licit and illicit, finding shelter, and wandering the streets of the capital, all preoccupations of the vagabond Clebert was at that time. One favorite of mine just now is Chapter Three, which concerns eating, for I am simultaneously reading a Maigret mystery that involves a tramp killed in the neighborhood of the old Les Halles food market. In fact, many of the book's essays provide cultural context for Commissaire Maigret's Paris-based police cases.  \"Paris Vagabond\" complements as well Luc Sante's outstanding research in \"The Other Paris\" and additional non-fiction studies on daily life during and just after the War years in France."}, {"review_sentiment": 5.0, "review_text": "Opened a totally unknown world!"}, {"review_sentiment": 5.0, "review_text": "After all the pre-press hype, I was pretty surprised how prosaic Clebert's prose actually is.  Daresay, at times, he's almost kind of boring.  And that's allowing for issues of translation.  If this book was based strictly on the unillustrated first edition, my pretentious ass would grant it maybe 3 stars.  The funny thing is the flip of the coin.  A book of Molinard's photos for the famous second edition would merit the same number of stars--they're roughly printed illustrations shot for the project.  Apparently the half-tone reproductions are all that remain of the original photographs.  Words and images combined--man, it's a fantastic and fascinating document!!!  You will not regret buying this book."}, {"review_sentiment": 5.0, "review_text": "A book of amazingly variegated depths and textures, brim with vitality and exquisite tenderness for both the Paris of the streets and the people who live impoverished but free in them, a human bricolage of de facto anarchists rooted in the city but not of the State.. The photos are as eloquent as the text. Not a polished work of literature - much better than that."}]}, "authors": ["Jean-Paul Clebert"], "isbn": "1590179579", "longitude": 2.3514992, "periods": ["1900s"], "title": "Paris Vagabond", "word_cloud": "drip gritty tough soulful exist overlap slightly discovery city take private pleasure perhaps accessible visit tourist clique love writing half please good bless first publish available beautiful translation style originally write journal cobble together random jotting pen year follow homeless unemployed tell tale quite different glamorous tourist mecca know today home far sketchier population many people author use wit survive severe deprivation circumstance particularly notable many short essay characterize poetic nature render essay number group chapter focus example obtain food method licit illicit finding shelter wander street capital preoccupation time favorite mine concern eat simultaneously read mystery involve tramp kill neighborhood old food market fact many essay provide cultural context police case complement well outstanding research other additional study daily life year open totally unknown world hype pretty surprised prosaic prose actually time almost kind boring allow issue translation base strictly illustrate first edition pretentious as maybe star funny thing flip coin photo famous second edition number star roughly print illustration shot project reproduction remain original photograph image combine man fantastic fascinating document regret buy amazingly variegated depth texture brim vitality exquisite tenderness streets people live impoverish free human bricolage anarchist root city photo eloquent text not polished work literature much better", "genres": ["Memoir"], "summary": "An NYRB Classic Original \r\n\r\nJean-Paul Clébert was a boy from a respectable middle-class family who ran away from school, joined the French Resistance, and never looked back. \r\n\r\nMaking his way to Paris at the end of World War II, Clébert took to living on the streets, and in Paris Vagabond, a so-called “aleatory novel” assembled out of sketches he jotted down at the time, he tells what it was like. \r\n\r\nHis “gallery of faces and cityscapes on the road to extinction” is an astonishing depiction of a world apart—a Paris, long since vanished, of the poor, the criminal, and the outcast—and a no less astonishing feat of literary improvisation: Its long looping breathless sentences, streetwise, profane, lyrical, incantatory, are an adventure in their own right. \r\n\r\nPraised on publication by the great novelist and poet Blaise Cendrars and embraced by the young Situationists as a kind of manual for living off the grid, Paris Vagabond—here published with the starkly striking photographs of Clébert’s friend Patrice Molinard—is a raw and celebratory evocation of the life of a city and the underside of life.", "asin": "1590179579", "rank": "844262", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51027ESXkYL.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}