{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 92, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "He is an amazing man. why don't more people speak of him. I've learned so much from his personal journey. this is an important book as are all his writings"}, {"review_sentiment": 4.0, "review_text": "Part 3 of the trilogy by acclaimed Travel writer, Patrick Leigh Fermor, of a journey on foot from the Netherlands to Constantinople (Istanbul) in 1933-4 is a fantastic close to one of the best travel adventures  of the last 100 years.Fermor flunked out of school in England, grew tired of constant and aimless partying and decided to strike out across Europe by foot.  Financed by an allowance of an English Pound a week from his family, he took months gathering acquaintances and language facility as he went - mooching off of everyone he could on the way.  Fermor's first book of the series, A Time of Gifts: On Foot to Constantinople: From the Hook of Holland to the Middle Danube (New York Review Books Classics), wasn't published until 1977, decades after the real events.  Fermor relied on memory mostly, and some various diaries and manuscripts relating to the trip.  The result was this masterpiece which I feel is the single best travel book of the 20th century.  I'm not alone in that belief, by the way.Fermor's second book, published in 1986, wasn't as good for a variety of reason. Between the Woods and the Water: On Foot to Constantinople: From The Middle Danube to the Iron Gates (New York Review Books Classics) This 3rd book was published after Fermor's death in 2011 and wasn't finished.  However there were draft versions and variations that had been worked on by Fermor and it was almost finished, so don't think this is mostly non-Fermor.  Fermor's biographer, Artemis Cooper Patrick Leigh Fermor: An Adventure, and noted travel author Colin Thubron, successfully edited this book and it reads like vintage Fermor to the end.We get the benefit of an 18 year old starry-eyed wanderer with a glib tongue and a photographic memory superimposed on a much older and wiser author looking  back through the years at people and places all too often destroyed in the coming WWII.  And the journey is fantastic.  A modern day Odysseus, Fermor immerses himself in the experience and as a solitary traveler finds himself out there mixing with royalty and thugs.  Fermor shows a great depth of historical knowledge in the Balkans as well as facility with languages.  And his descriptive prose puts you right into the scenes being described.  I simply don't know enough superlatives to describe this.  I think this 3rd book is actually closer to the first work of genius in this series and better than the second.Lately, we have found that many travel writers embellish or adjust or fabricate (read: lie) about their experiences.  Chatwin, Morris, Kaczynsky and others have all admitted or been found to make up some of their \"non-fiction\".  Fermor doesn't appear to suffer from this artificiality, as near as I can tell - not knowing the area nor the languages spoken there.This is an excellent book, entertaining, humorous, erudite, and just plain fun and adventurous.  Why not 5 stars?  The arrival in Constantinople was never fleshed out by Fermor.  Still,  I highly recommend it and also recommend you start with the first book and read them in order."}, {"review_sentiment": 5.0, "review_text": "There are many fine reviews here already, so I'll just echo them in saying that the whole trilogy is one of the best reading experiences I've ever had. The author's story is incredible, and his enthusiasm for every aspect of the lands he traveled through: their history, their language, the clothing, the landscape, the religions, and on and on, is also amazing. Even if you're not initially interested in the medieval history of the Balkans, he somehow gets you enthused about it.All the books are very good, but I strangely found this one easier to read than the others. He did not live to complete it, and he presumably spent less time editing it. I think that may be why the sentences are a little simpler and shorter (while no less evocative). For whatever reason, the pages turned faster in this volume. I also enjoyed the last section that is more or less verbatim of his journal during his hike through Mount Athos. It's not clear that he got that much out of visiting a dozen or so monasteries, but the depictions of the people and his hike itself were often fascinating.We really should be grateful to NYRB for publishing this and so many other lost gems that otherwise we would likely never know about."}, {"review_sentiment": 4.0, "review_text": "Going to be honest, this book is a bit of a let down. I did not realize before purchasing that it was not explicitly written as the final part of his trilogy, it was apparently mostly written before the previous two books and never published until after he died. Patty's insights into culture and people are still sharp and educational, but overall the narrative seems less focused. His writing here is solid, but not quite as engaging as in his previous two travelogues about this journey. And I was rather sad that this book almost completely omitted his stay in Constantinople/Istanbul, what he had been building up to for so long. I guess you could argue that the adventure is in the journey, not the destination! But still, though I did enjoy reading this, I felt it was not a true finale to his grand walking tour."}, {"review_sentiment": 5.0, "review_text": "One of the landmarks of travel literature is Patrick Leigh Fermor's three-volume account of his 1934 trek across Europe as a nineteen-year-old.  To be sure, though, to characterize the books as \"travel literature\" may do them a disservice, both because they eclipse almost all other representatives of the genre and because they are much more than a travelogue.  PLF mixes in history and ethnology in such an engaging and informative fashion that the books are sui generis.The first two volumes, which I have also reviewed on Amazon, are \"A Time of Gifts\" and \"Between the Woods and the Water\".  The second one ended with PLF at the Iron Gates, a gorge on the Danube River between Serbia and Rumania.  In THE BROKEN ROAD, PLF resumes his journey through portions of Rumania and much of Bulgaria, crisscrossing that country three times.  He travels mostly on foot, sometimes sleeping rough; sometimes staying with shepherds, gypsies, or farmers; sometimes with friends he makes along the way; and on a few occasions with the upper crust.One of the more memorable lodgings was at the \"Savoi-Ritz\" in Bucharest.  When he came upon it, he thought it a small hotel, \"about my level, in spite of its daunting name.\"  It turned out to be a brothel and entertaining indeed is PLF's account of late-night, after-work dinner with the five girls of the establishment -- one from Bukovina, a Moldavian, a Transylvanian, a German from a town in the Carpathian passes, and a Gagauz from the Dobrudja (\"I gazed at her with the reverence of an ornithologist at the glimpse of an Auckland Island merganser\").  Another night was spent with six Bulgarian shepherds and four Greek fishermen in a cave along an isolated inlet of the Black Sea on the coast of Bulgaria.  Against a crackling wood fire, PLF witnessed several soulful folk dances, fueled by the raki that PLF had carried in his rucksack.  At the opposite end of the spectrum, while staying at the apartment of a German diplomat in Rumania PLF went to a dinner party for Artur Rubinstein, where the great pianist played Chopin after which there broke out \"dancing and drinking at an uninhibited tempo\".What helps make THE BROKEN ROAD and its two predecessors special is that PLF wrote them, contemplatively, forty to sixty years after the journey itself, with the benefit of the intervening years of life lessons and much scholarship.  This gives him greater perspective as well as the opportunity to interlace the story of his travels with fascinating information about the history and the peoples of the places he visits.  One small example, this one of the hatred between the Bulgars and the Byzantines:  \"The hatred is epitomized on either side by the act of one Byzantine emperor, Basil the Bulgar-slayer, who totally blinded a captured Bulgarian army of ten thousand men, leaving a single eye to each hundredth soldier so that the rest might grope their way home to the [Bulgarian] czar: a spectacle so atrocious that the czar, when the pathetic procession arrived, died of grief and shock.\"PLF's prose is rather baroque in its intricacies, and his vocabulary is prodigious.  He is prone to elaborate lists and flights of fancy, both of which are evident in his account of when, while trudging along a railway, the Orient Express suddenly appears out of the darkness and whisks past him, setting him to thinking about \"its freight of runaway lovers, cabaret girls, Knights of Malta, vamps, acrobats, smugglers, papal nuncios, private detectives, lecturers in the future of the novel, millionaires, arms' manufacturers, irrigation experts and spies.\"PLF worked on writing the third volume of his pan-European journey off and on between 1990 and his death in 2011, at age ninety-six.  He never finished it.  It ends mid-sentence, with the youthful PLF still in Bulgaria, about 120 miles short of his goal, which was Constantinople (as he preferred to call the city).  As a point of biography, PLF spent several weeks in Istanbul and then embarked on a tour of the Greek Orthodox monasteries on the rugged peninsula of Mount Athos.  During that excursion he maintained a detailed diary, the eighty pages of which are appended to  THE BROKEN ROAD.  It is entitled \"Mount Athos\", and it can be skipped.  The contrast between it and THE BROKEN ROAD and its two predecessors is stark.  As keen an observer as the youthful PLF was, the books written forty and more years later are so much richer and more engaging.  They transcend travel literature; for me they are literature pure and simple, and they are among the highlights of my reading career."}, {"review_sentiment": 5.0, "review_text": "Patrick Leigh Fermor is one of the all-time great personages in English lore.  A traveler, soldier, writer, and a person always seeking to enjoy life.  He lived the kind of life that anyone with an adventurous soul would yearn for.  An amazing character."}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 4.0, "review_text": "A classic travel book from the mid-1930s reconstructed from P.L. Fermor's diaries of a walk from the Netherlands to Constantinople (Istanbul). This volume covers the last third of the journey, for which the original diary had been partly lost. Personal, detailed account from a 100% upper-class English point of view. A parade of sharply-etched characters who befriend (or sometimes annoy) Fermor. A wry, observant view of Southern Europe: Rumania, Bulgaria, Greece and a bit of Turkey just before WWII."}, {"review_sentiment": 5.0, "review_text": "Patrick Leigh Fermor is one of my favorite authors and this Kindle edition is very convenient to read."}, {"review_sentiment": 5.0, "review_text": "Fascinating account of his travels, told in exquisite detail and for that reason not a book to breeze through casually."}]}, "authors": ["Patrick Leigh Fermor"], "isbn": "1590177797", "longitude": 28.9651646, "periods": ["1900s"], "title": "The Broken Road", "word_cloud": "amaze man people speak learn much personal journey important writing trilogy acclaim writer journey foot fantastic close best travel adventure last flunked school grow tired constant aimless partying decide strike foot allowance week family take month gather acquaintance language facility go mooch everyone way first series publish decade real event rely memory mostly various diary manuscript relate trip result masterpiece feel single best travel century alone belief second publish good variety reason publish death finish however draft version variation work almost finish think mostly biographer note travel author successfully edit read vintage get benefit year old wanderer glib tongue photographic memory superimpose much older wiser author look year people place often destroy come fantastic modern day immerse experience solitary traveler find mix royalty thug show great depth historical knowledge well facility language descriptive prose put right scene describe simply know enough superlative describe think actually closer first work genius series better find many travel writer embellish adjust lie experience others admit found make former appear suffer artificiality tell know area language speak excellent entertain humorous erudite plain fun adventurous star arrival never flesh still highly recommend also recommend start first order many fine review already echo say whole trilogy best reading experience ever author story incredible enthusiasm aspect land traveled history language clothing landscape religion also amaze even initially interested medieval history somehow get enthused good strangely find easier others live complete presumably spend le time edit think little simpler shorter le evocative reason page turn faster volume also enjoy last section le verbatim journal hike clear get much visit dozen monastery depiction people hike often really grateful publish many lose gem otherwise likely never go honest bit let realize purchase explicitly write final part trilogy apparently mostly write previous never publish die insight culture people still sharp educational overall narrative seem le focus write solid quite engage previous travelogue journey rather sad almost completely omitted stay build long guess adventure journey destination still enjoy read felt true finale grand walk tour landmarks travel literature account trek characterize travel literature eclipse almost representative genre much travelogue mix history ethnology engage informative fashion sew first volume also review second one end gorge resume journey portion much crisscross country time travel mostly foot sometimes sleep rough sometimes stay shepherd gypsy farmer sometimes friend make along way occasion memorable lodging bucharest come upon think small hotel level spite daunting name turn entertain indeed account dinner girl establishment transylvanian town carpathian pass gaze reverence ornithologist glimpse merganser night spend bulgarian shepherd greek fisherman cave along isolated inlet coast crackle wood fire witness several soulful folk dance fuel rake carry rucksack opposite end spectrum stay apartment german diplomat go party great pianist play break dance drinking uninhibited tempo help make predecessor special write contemplatively forty sixty year journey intervene year life lesson much scholarship give greater perspective well opportunity interlace story travel fascinate information history people place visit small example hatred hatred side act emperor totally blind captured bulgarian army thousand men leave single eye hundredth soldier rest way home czar spectacle atrocious czar pathetic procession arrive died grief shock prose rather baroque intricacy vocabulary prodigious elaborate list flight fancy evident account trudge along railway suddenly appear darkness whisk set think freight runaway lover cabaret girl acrobats smuggler papal nuncio private detective lecturer future millionaire arm manufacturer irrigation expert spy work write third volume journey death age never finish end youthful still mile short goal prefer call city point biography spend several week embark tour monastery rugged peninsula excursion maintain detailed diary eighty page append entitle skip contrast predecessor stark keen observer youthful write year later much richer engage transcend travel literature literature pure simple highlight read career great personage lore traveler soldier writer person always seek enjoy life live kind life anyone adventurous soul amazing character excellent classic travel reconstruct diary walk volume cover last third journey original diary partly lose detailed account english point view parade character befriend sometimes annoy wry observant view bit favorite author edition convenient fascinate account travel tell exquisite detail reason breeze casually", "genres": ["Memoir", "Travel Writing"], "summary": "From the Iron Gates to Mount Athos \r\n\r\nIn the winter of 1933, eighteen-year-old Patrick (“Paddy”) Leigh Fermor set out on a walk across Europe, starting in Holland and ending in Constantinople. Decades later, Leigh Fermor told the story of that life-changing journey in A Time of Gifts and Between the Woods and the Water, works now celebrated as among the most vivid, absorbing, and beautifully written travel books of all time.\r\n\r\nThe Broken Road is the account of the final leg of his journey, catching up with Paddy in the fall of 1934, following him through Bulgaria and Romania and ending in Greece. Days and nights on the road, spectacular landscapes and uncanny cities, friendships lost and found, leading the high life in Bucharest or camping out with fishermen and shepherds—such incidents and escapades are described with all the linguistic bravura and astonishing learning that Leigh Fermor is famous for, but also with a melancholy awareness of the passage of time. Throughout it we can hear the still-ringing voice of an irrepressible young man embarking on a life of adventure.", "asin": "1590177797", "rank": "82609", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51hQ9xHzPIL.jpg", "country": "Turkey", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}