{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 22.2793278, "ratings": {"num_ratings": 22, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Some of the stories are similar as they all share a common theme. A must read for anyone interested in modern Chinese literature."}, {"review_sentiment": 2.0, "review_text": "I will never be able to understand why some stories are considerate example of world literature.Non capiró mai perché alcune storie assurgono agli onori di letteratura, mentre altre no."}, {"review_sentiment": 5.0, "review_text": "thanks"}, {"review_sentiment": 4.0, "review_text": "Still have it on my shelf. A book I kept after my college class."}, {"review_sentiment": 5.0, "review_text": "I loved this book! So compelling. The translation is right on, it did its job of creating amazing images."}, {"review_sentiment": 4.0, "review_text": "One of Eileen Chang's classic novel !"}, {"review_sentiment": 4.0, "review_text": "Unexpectedly original and unique writing. And an insight into a world that previously I'd only viewed from outside. Eileen Chang has given me a view of that world from inside ....."}, {"review_sentiment": 4.0, "review_text": "Ailing Zhang/Eileen Chang's Love in a Fallen City is a collection of works by the author--full of beautiful prose and characters.  Overall, the works are well-written and the language quite beautiful and evocative, but, occasionally, the author gets a bit verbose.  However, these are solid works and worth reading."}, {"review_sentiment": 4.0, "review_text": "Ms. Chang's historic short story fiction gives insight to the emotions and joys and pressures of pre-war Chinese romance. It is a mystic adventure."}, {"review_sentiment": 5.0, "review_text": "I got into this book. China. The 20s. A narrative and relationships different from our own but told in a way we can digest and understand, thinking too that just around the corner after the British are the Japanese, WWll, 1949 and the communists. Oh my then in 1978 there is Nixon and Kissinger leading us straight into now. Throughout all of this each person has her narrative, her life, her story and we have not even begn to hear them."}]}, "authors": ["Eileen Chang"], "isbn": "1590171780", "longitude": 114.1628131, "periods": ["1900s"], "title": "Love in a Fallen City", "word_cloud": "story similar share common theme anyone interested modern chinese literature never able understand story considerate example world capiró mai perch alcune alter thanks still keep college class love so compel translation right job create amazing image classic unexpectedly original unique writing insight world previously view outside give view world ail collection work full beautiful prose character overall work language quite beautiful evocative occasionally author get bit verbose however solid work read historic short story fiction give insight emotion joy pressure chinese romance mystic adventure get narrative relationship different tell way digest understand think corner british japanese communists lead straight person narrative life story even beg hear", "genres": ["Fiction & Literature"], "summary": "New York Review Books Classics\r\n\r\nEileen Chang is one of the great writers of twentieth-century China, where she enjoys a passionate following both on the mainland and in Taiwan. At the heart of Chang’s achievement is her short fiction—tales of love, longing, and the shifting and endlessly treacherous shoals of family life.\r\n\r\nWritten when Chang was still in her twenties, these extraordinary stories combine an unsettled, probing, utterly contemporary sensibility, keenly alert to sexual politics and psychological ambiguity, with an intense lyricism that echoes the classics of Chinese literature.\r\n\r\nLove in a Fallen City, the first collection in English of this dazzling body of work, introduces American readers to the stark and glamorous vision of a modern master.\r\n\r\n“[A] giant of modern Chinese literature” The New York Times\r\n\r\n\"With language as sharp as a knife edge, Eileen Chang cut open a huge divide in Chinese culture, between the classical patriarchy and our troubled modernity. She was one of the very few able truly to connect that divide, just as her heroines often disappeared inside it. She is the fallen angel of Chinese literature, and now, with these excellent new translations, English readers can discover why she is so revered by Chinese readers everywhere.\" Ang Lee", "asin": "1590171780", "rank": "160547", "city": "Hong Kong", "image": "https://images-na.ssl-images-amazon.com/images/I/51%2B-JUH-iYL.jpg", "country": "China", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}