{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 6, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "A+"}, {"review_sentiment": 5.0, "review_text": "a+"}, {"review_sentiment": 2.0, "review_text": "I feel like I stumbled across a journal someone’s accidentally dropped on Friedrichstrasse, and rather than leave it on the sidewalk to be tripped over and stomped on, I picked it up, thought, why not? could be amusing, and took it home.The thing is, a journal in its natural state is a rambling, self involved, unedited, scraggly little creature that more often than not would do better to stay latent in the boxy confines of one’s top night table drawer than parade about in the open, flailing its arms and declaring insistently, “Lookee here! Aren’t I clever?”Berlin Stories is predominantly short observations of Walser’s surroundings. It’s reflective and doesn’t so much tell a story as park itself on a bench and gaze off eager and misty-eyed into the world, hoping to capture a place and people’s essence in a brisk vignette. Calling this a collection of “stories” seems like a glaring misnomer.Many of these 1-2 page “stories” are bland and trivial, in spite of the author’s exuberance. Yet again, the comparison stands: Journal writing begins with the fantasy that every string of thought that passes through the writer’s mind in the course of a day is not only interesting but deserving of inscription (I’ll attest: It takes the sobering experience of reading one’s own journal perhaps 3 or 4 years gone to realize this is emphatically not the case...).I had never heard of Walser before reading this, but I suspect I am not reading his best here. A better, more sensitive and eloquent writer showed up to pen the last 4 stories, and I was equal parts annoyed and impressed. “Frau Wilke” is moving; “Frau Scheer” is a perceptive and intimate portrait of a lonely woman; and the last, “A Homecoming in the Snow” seemed like the only truly personal and sincere account of the writer himself. If those stories are an indication of Walser’s other work, I’d be happy to read more. I mean, this is beautiful:“There I saw on the bed the things which the poor lady had till recently worn, her dress, her hat, her sunshade, and her umbrella, and, on the floor, her small delicate boots. The strange sight of them made me unspeakably sad, and my peculiar state of mind made it seem to me almost that I had died myself, and life in all its fullness, which had often appeared so huge and beautiful, was thin and poor to the point of breaking. All things past, all things vanishing away, were more close to me than ever. For a long time I looked at Frau Wilke’s possessions, which now had lost their mistress and lost all purpose, and at the golden room, glorified by the smile of the evening sun, while I stood there motionless, not understanding anything anymore.”"}, {"review_sentiment": 3.0, "review_text": "Most of these \"stories\" are actually very short newspaper columns written by Walser. Unfortunately, the book doesn't make clear where or in what form each piece was originally published. Many of the pieces here do not translate well to a modern reader; Kafka may have laughed his head off reading \"Mountain Halls\" but without any context it's impossible for me to see why.There are gems hidden within this collection: \"Fire,\" \"Frau Wilke,\" and \"Frau Scheer\" are all well worth your time. Sadly, there are many more stories that should have remained in the scholarly archive, and offer nothing to a casual reader, including most of the \"Theater\" section. Bizarrely, right after \"Frau Scheer\" we are given \"The Millionairess\" which is simply a short outline (rough draft?) of the preceding story.It is fascinating to watch the almost comically hyperbolic optimism of the early newspaper pieces collapse into the black hole of the two late stories, \"Frau Wilke\" and \"Frau Scheer,\" which are both excellent and unrelentingly bleak. However, despite some worthwhile stories, this is definitely not the best introduction to Walser."}, {"review_sentiment": 2.0, "review_text": "I expected to be hypnotized by this book, as I was by Jakob von Gunten, but alas it did not happen.  The stories are disappointingly conventional, compared to the vast imagination found in the novel."}, {"review_sentiment": 5.0, "review_text": "Fans of Robert Walser can rejoice in another translation that brings more of his work to light.  Berlin Stories has numerous terrific moments, the unique context of his time spent in Berlin is fascinating and like all of his writing, it resonates fully across the generations.  My favorite quote from the first essay sums up Walser's beautiful insight into humanity: \"What has become of us as a people that we can possess the beautiful only in dreams.\"  It's a book worth reading over and over and worth sharing amongst friends."}]}, "authors": ["Robert Walser"], "isbn": "1590174542", "longitude": 13.3888599, "periods": ["1900s"], "title": "Berlin Stories", "word_cloud": "feel stumble journal someone accidentally drop rather leave sidewalk trip stomp pick think amuse take thing journal natural state ramble involve unedited scraggly little creature often latent boxy confines top night table drawer parade open flailing arm declare insistently clever predominantly short observation surroundings reflective much tell story park bench gaze eager world hop capture place people essence brisk vignette collection seem glare page bland trivial spite author exuberance comparison stand writing begin fantasy string think pass writer mind course day interest deserve inscription attest take sober experience read journal perhaps year go realize emphatically case never hear read suspect read best better sensitive eloquent writer show pen last equal part annoy impressed move perceptive intimate portrait lonely woman last seem truly personal sincere account writer indication work happy mean saw bed thing poor lady till recently wear dress hat sunshade umbrella floor small delicate boot strange sight make unspeakably sad peculiar state mind make seem almost die life fullness often appear huge beautiful thin poor point break thing past thing vanish away close ever long time look possession lose mistress lose purpose golden room glorify smile even sun stand motionless understand anything anymore most actually short newspaper column write make clear form piece originally publish many piece translate well modern head read context impossible see gem hide collection well worth time sadly many remain scholarly archive offer nothing casual include section bizarrely right give simply short outline rough draft precede fascinate watch almost comically hyperbolic optimism early newspaper piece collapse black hole late excellent unrelentingly bleak however worthwhile definitely best introduction expect hypnotized jacob con ala happen disappointingly conventional compare vast imagination find fan rejoice translation bring work light numerous terrific moment unique context time spend fascinate write resonates fully generation favorite quote first sum beautiful insight humanity become people possess beautiful dream worth read worth share among st friend", "genres": ["Fiction & Literature"], "summary": "In 1905 the young Swiss writer Robert Walser arrived in Berlin to join his older brother Karl, already an important stage-set designer, and immediately threw himself into the vibrant social and cultural life of the city. \r\n\r\nBerlin Stories collects his alternately celebratory, droll, and satirical observations on every aspect of the bustling German capital, from its theaters, cabarets, painters’ galleries, and literary salons, to the metropolitan street, markets, the Tiergarten, rapid-service restaurants, and the electric tram. \r\n\r\nOriginally appearing in literary magazines as well as the feuilleton sections of newspapers, the early stories are characterized by a joyous urgency and the generosity of an unconventional guide. Later pieces take the form of more personal reflections on the writing process, memories, and character studies. \r\n\r\nAll are full of counter-intuitive images and vignettes of startling clarity, showcasing a unique talent for whom no detail was trivial, at grips with a city diving headlong into modernity.", "asin": "1590174542", "rank": "692276", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/61TEVFN5rXL.jpg", "country": "Germany", "story_arc": ["Tragedy", "Things only get worse"]}