{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 55.7507178, "ratings": {"num_ratings": 7, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "One of the best books of the twentieth century. The meaning is the same as current crises ( the cause is the same-imperial wars) and wanderings/death of the people. How poor can you get and have nothing to sell but your SOUL."}, {"review_sentiment": 5.0, "review_text": "A+"}, {"review_sentiment": 5.0, "review_text": "The main story in the collection, \"Soul\" is a bleak and heart wrenching story that has stayed with me long after I've read it. And I re-read it. And will probably read it again. Powerful and moving, but most likely the bleakest story I've ever read."}, {"review_sentiment": 2.0, "review_text": "Most of the stories in here didn't resonate too well with me. The exception being 'The Return' which I liked a lot, but more for anecdotal moments in the story than as a well constructed whole."}, {"review_sentiment": 5.0, "review_text": "As a student of Soviet history I highly recommend this book.  There are many Gulag memoirs available but many of Platonov's stories give a unique view- that of the disillusioned apparatchik working for the mirage that is Socialism. While they are fiction and not history they still add flesh to the bones left by Stalin in the 30's.  However, if you are looking for a fun book to read by the beach this is probably not for you.  When my wife asked me for a synopsis it came out something like this- \"Well, a starving child is rejected by his mother, is sent to Moscow to be educated, enters into an unconsummated marriage out of pity (wife dies), returns to homeland to build Socialism, finds everyone starving to death, manages to keep them from being sold into slavery, at one point is being eaten alive by birds.....\".  That was as far as I got before she waved me off and shook her head- \"How can you read such depressing books?\"."}, {"review_sentiment": 5.0, "review_text": "\"Among Plants and Animals\" is the second of Andrey Platonov's stories anthologized in \"Soul,\" and I am going limit my review to a few remarks about it and one rather long quote. \"Among Plants and Animals\" is a very funny parody of the utopian society which Soviet propaganda alleged to have achieved in the mid-1930's. The protagonist, Ivan Alekseyevich Fyodorov, is a railroad switchman assigned to a remote forest outpost somewhere in Siberia. While he is extremely dedicated to his job, it doesn't entirely satisfy. He yearns for culture. He acquires a radio and a windup gramophone, but they only serve to whet his appetite to \"hear a melody in an orchestra and to watch a spectacle in a theater, so as to have some understanding in his soul about the truth of life and to see the universal horizon\"(p. 169).Fyodorov reads every book that comes his way. He receives a copy of \"The Travels of Marco Polo\" at a lecture given by a member of the Writer's Union, as a gift because he asked sixteen questions. \"The book was extremely interesting. Fyodorov had at once begun reading, from page 26. At the start of a book a writer is just thinking, and that makes it dull; the most interesting part is the middle, or the end, which was why Fyodorov preferred to choose pages at random--now page 50, now page 214. And although every book is interesting, reading this way makes it even better, and still more interesting, because you have to imagine for yourself everything you have skipped and you have to compose anew passages that don't make sense or are badly written, just as if you too are an author, a member of the Soviet Union's Union of Writers. Fyodorov had been so carried away by one book--\"Lime,\" or was it \"Stone?\"--that he had read it from the end all the way to the beginning and had realized that it was a good book but that if you began at the beginning it would be false and ideologically suspect\" (p. 169). Fyodorov eventually gets his wish and is transferred to \"Bear Hill,\" which is Robert Chandler's translation of Medvezhya Gora, the capital of the Gulag Archipelago. Medvezhya Gora was a remote outpost which became the headquarters for the construction of the notorious White Sea Canal, built by prisoners without tools at the cost of a minimum estimate of 25,000 lives. By the mid-1930's so many of the cultural elite had been sent to the camps that Medvezhya Gora \"was said to have one of the best opera houses in Russia, frequented mainly by camp guards\" (p. xxiii). This is the ironic subtext to \"Among Plants and Animals,\" but it only begins to scratch the surface of this fine story.All of the stories in \"Soul\" are different. I choose to focus on the humourous one because I am hoping it will entice any readers of this review to choose to read this fine book by one of the 20th century's most gifted authors."}, {"review_sentiment": 5.0, "review_text": "The back cover description and the Publisher's Weekly paragraphs will give you the main plot lines of the title novella, _Soul_, and the other stories, but I want to say that Platonov is astonishing.  How could anyone--in such a short life--have felt and known so much and also had time to master the craft of story-telling?  Truly a genius.  Platonov loved life so much that he had to write it out, and if he stopped writing, his life would have been too painful.  His combination of harsh objectivity and lyricism could be accounted for by, perhaps, considering the mix of pain in his own life.  He invested the simplest human act with a sense of wonder.  Sitting on a bench waiting for a friend becomes a spiritual moment.  A character who hears a cricket chirping as he approaches a friend's door would be sentimental or precious if written by a lesser artist or someone with fewer hard edges than Platonov, or in a setting less deprived than Russia in the 1930s.While the novella, _Soul_, isn't autobiographical, there is a line about the protagonist, Chagataev, that suggests to me the key to Platonov himself: \"He felt as if he belonged to others, as if he were the last possession of those who have no possessions, about to be squandered to no purpose, and he was seized by the greatest, most vital fury of his life\" (p. 94).These stories and the _Soul_ novella are proof that literature transcends ideology and politics at the same time that politics conditions people's lives.  Platonov and other writers might have been suppressed by men who wanted to dictate what literary art should be, but writers and readers in comfortable, \"democratic\" nations are persecuted by a silent enemy: mediocrity.  Platonov was a total stranger to the \"m\" word.  He never knew complacency.While death and disaster seem to condition the intensity of Platonov's work, it is from out of his vision of humanity that his writing comes; he has a way of getting to the human truth of a scene or conversation in just a sentence, with exactly the right words.  With every carefully constructed sentence, he trained my senses to the point where I was ready to expect the unexpected.  In other words, in every sentence there is a kind of tension that has an undercurrent of doom or despair; every moment I expected the characters to be dealt some horrible blow, or some bitter ending, but inside each character is a kind of heroism that turned everything around.  Most surprising, in the final story, \"The Return,\" is a nearly 12-year-old boy whose courage saves his family and brings a spiritual epiphany to his father, a returning war veteran.  With real boys like that no one needs magic or special effects.And, I never knew a story about railway workers could be so gripping, so impossible to put down, until I read Platonov's \"Among Plants and Animals.\"  I didn't know a man could write so well about women until \"Fro.\"  \"The River Potudan\" is invested with such weightiness that I could sense the huge body of water flowing.In closing, I'd like the reader to know that this translation of Andrey Platonov's _Soul and Other Stories_ reminds me again how NYRB has reinvented the paperback, winning me away from the Penguin and the Oxford classic paperbacks (which I collected for years).  The book covers are well-chosen, and the typeset and spacing between the lines make an easier reading experience, and each page is visually pleasing.  A paperback reading experience does not get better than this.  And now this incredible translation by a team of experts led by Robert Chandler!  Of course, the Platonov we get is due to these translators, and Chandler wrote a remarkable Introduction on Platonov's life and on the art of translating from the Russian and why a group of translators was necessary.  But the unsung heroes are the women and men who (miraculously!) preserved all Platonov's manuscripts until the right translators could be found.  What a work for humanity.  Bravo!"}]}, "authors": ["Andrey Platonov"], "isbn": "159017254X", "longitude": 37.6176606, "periods": ["1900s"], "title": "Soul and Other Stories", "word_cloud": "best twentieth century meaning current crisis cause war people poor get nothing sell main story collection bleak heart wrench story stay long probably move likely bleakest story ever most resonate well exception like lot anecdotal moment story well construct whole student soviet history highly recommend many memoir available many give unique disillusion work mirage fiction history still flesh bone leave however look fun beach probably wife ask synopsis come something starve child reject mother sent educate enters unconsummated marriage pity wife die return homeland build find everyone starve death manages keep sell slavery point alive bird far get wave depressing plant animal second anthologize go limit review remark rather long quote plant animal funny parody utopian society soviet propaganda allege achieve protagonist railroad switch man assign remote forest outpost somewhere extremely dedicated job entirely satisfy yearn culture acquire radio windup gramophone serve whet appetite hear melody orchestra watch spectacle theater understand truth life see universal horizon read come way receive copy lecture give member gift ask sixteen question extremely interesting begin reading page start writer think make dull interesting part middle end prefer choose page random page page interesting reading way make even better still interesting imagine everything skip compose anew passage make sense badly write author member carry away way begin realize good begin begin ideologically suspect eventually get wish transfer translation capital remote outpost become headquarters construction notorious build prisoner tool cost minimum estimate life many cultural send camp say best opera house frequent mainly camp guard xxiii ironic subtext plant animal begin scratch surface fine different choose focus humorous hop entice reader review choose fine century gift author back cover description paragraph give main plot line title novella want say astonish anyone short life felt know much also time master craft genius love life much write stop write life combination harsh objectivity lyricism perhaps consider mix pain life invest simplest human act sense wonder sit bench wait friend become spiritual moment character hear cricket chirp approach friend door precious write lesser artist someone fewer hard edge set le deprived novella autobiographical line protagonist suggest key felt belong others last possession possession squander purpose seize greatest vital fury life novella proof literature transcend ideology politics time politics condition people life writer suppress men want dictate literary art writer reader comfortable democratic nation persecute silent enemy mediocrity total stranger word never know death disaster seem condition intensity work vision humanity write come way get human truth scene conversation sentence exactly right word carefully construct sentence trained sens point ready expect unexpected word sentence kind tension undercurrent doom despair moment expect character dealt horrible blow bitter end inside character kind heroism turn everything most surprising final story nearly boy courage save family bring spiritual epiphany father return war veteran real boy need magic special never know story railway worker grip impossible put know man well woman invest weightiness huge body water close like know translation reminds reinvent paperback win away classic paperback collect year cover typeset space line make easier read experience page visually please paperback reading experience better incredible translation team expert lead course get due translator write remarkable life art translate russian group translator necessary unsung hero woman men miraculously preserve manuscript right translator work humanity", "genres": ["Fiction & Literature"], "summary": "A New York Review Books Original\r\n\r\nThe Soviet writer Andrey Platonov saw much of his work suppressed or censored in his lifetime. In recent decades, however, these lost works have reemerged, and the eerie poetry and poignant humanity of Platonov’s vision have become ever more clear. For Nadezhda Mandelstam and Joseph Brodsky, Platonov was the writer who most profoundly registered the spiritual shock of revolution. \r\n\r\nFor a new generation of innovative post-Soviet Russian writers he figures as a daring explorer of word and world, the master of what has been called “alternative realism.” Depicting a devastated world that is both terrifying and sublime, Platonov is, without doubt, a universal writer who is as solitary and haunting as Kafka.\r\n\r\nThis volume gathers eight works that show Platonov at his tenderest, warmest, and subtlest. Among them are “The Return,” about an officer’s difficult homecoming at the end of World War II, described by Penelope Fitzgerald as one of “three great works of Russian literature of the millennium”; “The River Potudan,” a moving account of a troubled marriage; and the title novella, the extraordinary tale of a young man unexpectedly transformed by his return to his Asian birthplace, where he finds his people deprived not only of food and dwelling, but of memory and speech.\r\n\r\nThis prizewinning English translation is the first to be based on the newly available uncensored texts of Platonov’s short fiction.", "asin": "159017254X", "rank": "348259", "city": "Moscow", "image": "https://images-na.ssl-images-amazon.com/images/I/418YyPd1eXL.jpg", "country": "Russia", "story_arc": ["Tragedy", "Things only get worse"]}