{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 21, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Very fast shipping! The item was exactly how it was described."}, {"review_sentiment": 5.0, "review_text": "I don't remember being quite as self-assured as the lead character when I was her age.  Maybe it's her confidence mixed with naivety that creates a level of youthful arrogance that kept me turning pages.  But where we see danger, Doris--our lead--sees opportunity.  And she takes every one of them.She begins her journal, our book, with such big plans; she will be a star, she will be rich, she will give people exactly what they have coming.  But every step she takes is a step downward--little steps, quarter turns that barely register until she's hit the bottom.  Towards the ends the narrative becomes almost frantic as painful memories and realizations collide with her desperate situation. You can feel her spiraling out of control, and you can feel the anxiety and heartbreak that come when you put someone before yourself for the first time.Unlike other reviewers, I found subtle references to the political climate of the era--although it could have just been me, reading it, knowing what was coming.While I found her attitude about sex fascinating considering the way previous generations have presented themselves (scrubbed clean and chaste), what I found even more surprising was how Doris hated the double standards and misogyny, but still used them to her advantage.  If you can't beat 'em, play 'em a little harder?I'm sure the Nazis had plenty of reasons for wanting to destroy this book.  I'm glad they failed.  I enjoyed it much more than I thought I would."}, {"review_sentiment": 5.0, "review_text": "Through first person narration, a woman in very early Nazi Germany tells her story in intimate detail.  She leaves nothing out while detailing her relationships, with both married and unmarried men,  jobs and even bouts of hunger contrasting with times of living in luxury."}, {"review_sentiment": 2.0, "review_text": "Marginally interesting story about a self-absorbed, poor young woman in 1930s Germany, who attaches herself to men as a way to get by. The events of the day confuse her, but don't hold enough interest for her to probe. She's all \"live for today & tomorrow will take care of itself.\""}, {"review_sentiment": 4.0, "review_text": "Set in Germany in the late 1920s, this is a very absorbing and human novel of the struggles of a somewhat deprived and troubled teen-age girl to make her way to stardom and success.  Of course, she gets nowhere.  Although she’s a petty criminal, marginally a prostitute (to survive), and dishonest, you get the sense that she really has a “heart of gold.”  (But she won’t give up or give back the valuable fur coat she stole and loves so much—a major theme woven throughout the story.) The book is absorbing and titillating in a friendly way.  It is told from the point of view of Doris as she writes in her notebook.  Doris is very perceptive about men and our sexuality.I read this in the original German.  I mean I tried to read it.  It is written in 1920s teenage German vernacular—not easy for me since I mostly familiar with academic German.  There are also many passages that do not make much sense either in German or English translation which I referred to extensively.  Parts of the narrative have a stream-of-consciousness almost Faulknerian lack of structure or continuity.The translator takes liberties with her translation.  Here are just two of many hundreds of examples.  The German says “rushed at me like a storm wind.’  Translation says “rushed at me like a hurricane.”  German says “I must I tell them that I am not Jewish?”  Translation says “I have to tell then that I am not into politics.”  It may be that the translator was using a different edition of this famous book.  I was reading the original German first edition.  But that does not explain all the changes.  Why do translators not just translate instead of embellishing and rewriting?Reading novels like this I cannot help but think of the utter disaster looming over these characters just ten years on.  Their petty concerns will be swept up in catastrophe that Germany will go through in WW II.  And of course a lot of the issues that Doris and her friends face are a result of the disaster of WW I.This book is good tour through a lot of inter-war Berlin and its people and culture.  By the way, I think that artificial silk, Kunstseide auf deutsch, is rayon, or what they called rayon back then when it was still newish."}, {"review_sentiment": 2.0, "review_text": "Just another book they make you read in school to try and find a deeper meaning that is not really there. May have been better if we got a better look at the spectacular era she was living in and not endless complaints about the men she slept with. If you have to get it for class just read the spark notes, you won't miss much."}, {"review_sentiment": 5.0, "review_text": "I feel as though I have been in the driving seat of a woman's mind during the early 1930s of pre-Nazi Germany. Not just any kind of woman, though. The protagonist, Doris, with a lack of education, is a material girl who hopes to achieve a higher status in society by garnering the attentions of successful men and sleeping her way to the top. Three of them in fact, with varying degrees of success and conclusions. It is both funny and sad.Because it is a social critique, this novel's publication was banned by the Nazis. Mostly because of its honesty and openness regarding the subject of the book; The novel is a rich portrait of a working girl sleeping her way to the top and failing. It is relevant even today. The narrative reveals her inner thoughts and attitude towards men. A frightening prospect for the men in that era.The protagonist's thought process is flighty – jumping from idea to idea – and until you become accustomed to that pattern you may struggle to get into the flow of the story.The writing is really quite modern, even today. The way it has been constructed and written makes it timeless. I feel that we are fortunate that a version somehow still exists today. The story of how the book has survived the Nazi period is a tale in itself.The novel has three distinct sections that are quite symbolic and takes place mostly in Berlin, in the first person.Section 1 takes place at the tail end of summer.Section 2 takes place during late autumn.Section 3 journeys from winter into spring; finishing with hope, or so I like to think.Hope is a good way to finish such a tale.Sergiu Pobereznic (author)"}, {"review_sentiment": 5.0, "review_text": "(4.5 stars) First published in Germany in 1932, when author Irmgard Keun was only twenty-two, The Artificial Silk Girl, a bestselling novel of its day, is said to be for pre-Nazi Germany what Anita Loos’s Gentlemen Prefer Blondes (1925) is for Jazz Age America.  Both novels capture the frantic spirit, the eat-drink-and-be-merry ambiance, and the materialism of young people like Doris – and Lorelei Lee in the Loos book – who haunt the urban clubs as they try to work their way into a lifestyle much grander and more vibrant than anything their mothers could ever have hoped for.  Many attractive young women, regardless of their education and social experience, have set their hopes on becoming part of the privileged urban social scene, which they hope to achieve through the attentions of successful men with whom they flirt and seduce.In The Artificial Silk Girl, main character Doris starts out in a small city, where she wants to be an actress, while supporting herself as a stenographer and eventually writing a commentary about her life which author Irmgard Keun presents as Doris’s point of view.  The authorities in Germany were not pleased, however, with Keun’s published depiction of Berlin life as Hitler and the Nazis, preparing to take power, envisioned it.  Within a year, her books were confiscated and all known copies were destroyed.  In 1936, Keun, firmly opposed to Nazism, escaped Germany for Belgium, Holland, and later New York.Doris, the “artificial silk girl,” has no politics, focusing almost completely on her own ambitions, and the novel that follows is both fun and very funny, based entirely on the persona of Doris –  totally goal oriented, unafraid to take chances, willing to do anything to get what she wants, and very clever.  Her voice – honest, bawdy, and surprisingly guileless – also shows her intelligence, and her pointed observations and insights into those around her give the author unlimited opportunities for unique descriptions:  One restaurant is “a beer belly all lit up,” and dancing the tango “when you’re drunk…is like going down a slide.”  Her feverish excitement at getting a small part in a show beguiles the reader, and when her outrageous behavior forces her to escape not only the theater but the city itself, the reader cannot help but root for her eventual success.Dividing the novel into three parts reflecting the seasons and the symbolism associated with them, the author creates a wild, spontaneous, free-for-all of action in Part I, which takes place at the end of summer. Part II begins in Late Fall in Berlin, a much larger city, and the reader expects that this will be a darker and probably more contemplative time.  The gradual change of mood here increases the reader’s identification with Doris and her goals.  Part III, “A Lot of Winter and a Waiting Room,” introduces three men, each of whom affects Doris’s life and future and helps bring about new recognitions by Doris and a realistic conclusion to the novel.  The book’s timeless themes regarding women and how they see themselves, combine with history in a unique way, giving life to a less publicized period of history and new insights into the lives of some of the women who lived through it."}, {"review_sentiment": 1.0, "review_text": "Holly Golightly on the eve of the Third Reich--a fascinating book, first a comedy, then very decidedly not.  I know of nothing quite like it, although Kastner's Going To The Dogs is sort of a male equivalent."}, {"review_sentiment": 4.0, "review_text": "The book is not a pleasant read but a good one.  The main character is a girl who lives from day to day, totally self absorbed, in a Germany that offers little hope for a woman of the lower middle class - other than sleeping with men for survival, and occasionally pleasure.  She lives in the moment, thinks of little but clothes, men, and diversion.  I expected the German equivalent of \"Gentlemen Prefer Blonds.\"  This is darker, more telling, and much sadder.  Banned by Hitler's Germany, it is a small classic that beautifully portrays a certain kind of girl in her own time and place.  Think cigarette smoke, tawdry nights, and a girl with a mixture of cunning and naivete.  If you are looking for the glamor of \"Cabaret\" (The Berlin Stories) you won't find it here.  But you will get a snapshot of a lost world for which one can have little nostalgia."}]}, "authors": ["Irmgard Keun"], "isbn": "1590514548", "longitude": 13.3888599, "periods": ["1900s"], "title": "The Artificial Silk Girl", "word_cloud": "very fast ship item exactly describe remember quite lead character age maybe confidence mixed naivety create level youthful arrogance keep turn page see danger lead see opportunity take begin journal big plan star rich give people exactly come step take downward little step quarter turn barely register hit bottom end narrative becomes almost frantic painful memory realization collide desperate situation feel spiral control feel anxiety heartbreak come someone first reviewer find subtle reference political climate era read know find attitude sex fascinate consider way previous generation present scrubbed clean chaste find even surprising hat double standard misogyny still use advantage little harder sure nazi plenty reason want destroy glad fail enjoy much think first person narration woman early tell story intimate detail leave nothing detail relationship marry unmarried men job even bout hunger contrast time live luxury marginally interesting story poor young woman attache men way get event day confuse hold enough interest probe live today tomorrow care late absorbing human struggle somewhat deprive troubled make way stardom success course get nowhere petty criminal marginally prostitute survive dishonest get sense really heart give back valuable fur coat stole love major theme weave story absorb titillate friendly way tell point view write notebook perceptive men original german mean try write teenage german easy mostly familiar academic also many passage make much sense german english translation refer extensively narrative almost faulknerian lack structure translator take liberty translation here many hundred examples german say rush storm say rush say tell jewish say tell use different edition famous read original first edition explain change translator translate instead embellish rewrite novel help utter disaster loom character year petty concern sweep catastrophe go course lot issue friends face result disaster good tour lot people culture way think auk putsch rayon call rayon back still newish just make school try find deeper meaning really better get better spectacular era living endless complaint men sleep get class spark note much feel drive seat woman early not kind woman protagonist lack education material hop achieve higher status society garner attention successful men sleep way top fact vary degree success conclusion funny social critique publication ban honesty openness regard subject rich portrait work sleep way top fail relevant even today narrative reveals inner thought attitude towards men a frighten prospect men protagonist thought process flighty jump idea idea become accustomed pattern flow write really quite modern even today way construct write make timeless feel fortunate version somehow still exist today story survive nazi period tale distinct section quite symbolic take place mostly first take place tail end take place late journey winter spring finish hope like good way finish author star publish author bestselling day say novel capture frantic spirit ambiance materialism young people haunt urban club try work way lifestyle much grander vibrant anything mother ever hop attractive young woman regardless education social experience set hope become part privilege urban social scene hope achieve attention successful men flirt main character start small city want actress support stenographer eventually write commentary life author present point view authority please however publish depiction life prepare power envision year confiscate known copy destroy firmly oppose escape later politics focus almost completely ambition follow fun funny base entirely persona totally goal orient unafraid take chance willing anything get want voice honest bawdy surprisingly guileless also show intelligence point observation insight give author unlimited opportunity unique description restaurant beer belly light dance tango go feverish excitement get small part show beguile outrageous behavior force escape theater city help eventual part reflect season symbolism associate author create wild spontaneous action take place end summer begin much larger city expect darker probably contemplative time gradual change mood increase identification goal introduces men affect life future help new recognition realistic conclusion timeless theme regard woman see combine history unique way give life le publicized period history new insight live woman live holly eve fascinate first comedy decidedly know nothing quite go sort male equivalent pleasant good main character life day day totally self absorb offer little hope woman lower middle class sleep men survival occasionally pleasure live moment think little clothes men diversion expect german equivalent blonds darker tell much sadder ban small classic beautifully portray certain kind time place cigarette smoke tawdry night mixture cunning naivete look glamour snapshot lose world little nostalgia", "genres": ["Fiction & Literature", "Women's Fiction"], "summary": "Before Sex and the City there was Bridget Jones. And before Bridget Jones was The Artificial Silk Girl. \r\n\r\nIn 1931, a young woman writer living in Germany was inspired by Anita Loos's Gentlemen Prefer Blondes to describe pre-war Berlin and the age of cinematic glamour through the eyes of a woman. The resulting novel, The Artificial Silk Girl, became an acclaimed bestseller and a masterwork of German literature, in the tradition of Christopher Isherwood's Berlin Stories and Bertolt Brecht's Three Penny Opera. \r\n\r\nLike Isherwood and Brecht, Keun revealed the dark underside of Berlin's \"golden twenties\" with empathy and honesty. Unfortunately, a Nazi censorship board banned Keun's work in 1933 and destroyed all existing copies of The Artificial Silk Girl. Only one English translation was published, in Great Britain, before the book disappeared in the chaos of the ensuing war. \r\n\r\nToday, more than seven decades later, the story of this quintessential \"material girl\" remains as relevant as ever, as an accessible new translation brings this lost classic to light once more. Other Press is pleased to announce the republication of The Artificial Silk Girl, elegantly translated by noted Germanist Kathie von Ankum, and with a new introduction by Harvard professor Maria Tatar.\r\n\r\n“Damned by the Nazis, hailed by the feminists ... a truly charming window into a young woman’s life in the early 1930s.” Los Angeles Times\r\n", "asin": "1590514548", "rank": "334169", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51vDVkM12UL.jpg", "country": "Germany", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}