{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 55.7507178, "ratings": {"num_ratings": 42, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Compelling and eye-opening account of individuals' experiences in 20th century Russia through the various revolutions.  Considerations of non-freedom. So much that history books leave out.  I was very moved by this book."}, {"review_sentiment": 5.0, "review_text": "A stunning and masterful indictment of Stalinim."}, {"review_sentiment": 5.0, "review_text": "How terrible life was. Just hope it is not coming back to Russia. Of course, it came back to Middle East."}, {"review_sentiment": 4.0, "review_text": "EVERYTHING  FLOWS is Grossman's  last novel after  LIFE AND FATE. Unlike that novel there is a central plot. Ivan has been released from a Soviet prison camp after 15 or 20 years.He wanders around in Moscow and Leningrad and sees family and people from the past.He  eventually settles in a smaller town  and gets a job.He has a relationship with his landlady and she dies.Then he goes to where he grew up - end of novel.Sounds boring - it isn't. I'd say close to half the novel is taken up by digressions. The digressions are by and large fascinating.His landlady was a minor participant in the collectivization of the Ukraine and tells a long and harrowing tale of terror.After her death , Ivan  delivers his thoughts  on Russia , Stalin and Lenin  and it's strong stuff.In Soviet terms  his comments on Lenin are pure heresy.This novel is an indictment of the Soviet Union and an effective one.Chances are you will come to this after LIFE AND FATE.This is a much shorter work and very different but the two books work well together."}, {"review_sentiment": 5.0, "review_text": "I love this book by the magisterial Vasily Grossman. It's a reflection on both Stalinism and the Holocaust, told in the form of a philosophical novel. The translation by Robert Chandler is very good, and I think I like it better than the previous English translation by Thomas Whitney. Highly recommended to all lovers of great prose."}, {"review_sentiment": 4.0, "review_text": "The work moves a bit unevenly at the outset, following a survivor of the Gulags and his interactions with family, his reminescenses of his past and the displacement he feels for a time and Society to which he feels alienated.  Alienation is a major part of the novel, with the protagonist unable to find any clear fit for himself after his years away from a world he previously understood.  Upon review, the author seems to show that even that life itself was rather ill-fitting and nebulous.  It is as if the world itself was amorphous as much as his current state, a place where all flows along, but flows without clear certainty of footing or permanence. The work seems to culminate with an alliance with an unlikely landlady, this seemingly as unnatural a fit at first as much anything else in this world."}, {"review_sentiment": 4.0, "review_text": "A sad story of a survivor of Soviet Gulag......"}, {"review_sentiment": 5.0, "review_text": "A difficult book (emotionally) to read but essential if you want to have an inkling of where Russia stands today under Putin, and why. Although this is categorized as a novel and there is a fictional narrative, the book stands as an exploration of what freedom is and why it failed to develop during the course of of Russian history. Lenin's revolution promised a new Russia, a free Russia. But instead came tyranny, Stalin, the show trials, the purges, and mass extermination. What happened? Why? How? Grossman's main character, a recently released prisoner who spent 30 years in the Gulag, returns to the cities of his youth and in his wandering tries to understand how this nightmare happened to him and to his people."}, {"review_sentiment": 4.0, "review_text": "Translated from the Russian, this strongly autobiographical story follows Ivan Grigoryevich who returns to society from prison during the Communist regime. It’s hard for us to imagine living with the distrust of friends and family members that Russian citizens did for decades—lifetimes.I’m glad that I read this but it did drag immensely. Perhaps life in Russia did then.Read this if: you want the nitty-gritty of life under Communism in post-WWII Russia. 3½ stars"}, {"review_sentiment": 5.0, "review_text": "Vasily grossman is an excellent writer. I followed the story with great interest. Thank you."}]}, "authors": ["Vasily Grossman"], "isbn": "1590173287", "longitude": 37.6176606, "periods": ["1900s"], "title": "Everything Flows", "word_cloud": "compel account individual experience century various revolution consideration so much history leave move stunning masterful indictment terrible life hope come back course come back last central plot release soviet prison camp wanders see family people eventually settle smaller town get relationship landlady go grow end boring say close half take digression digression large landlady minor participant collectivization tell long harrowing tale death deliver thought strong soviet term comment pure indictment effective come much shorter work different work well together love magisterial reflection tell form philosophical translation good think like better previous english translation recommend lover great prose work move bit unevenly outset follow survivor interaction family reminiscences past displacement feel time feel alienate major part protagonist unable find clear fit year away world previously understood review author seem even life rather nebulous world amorphous much current state place clear certainty foot permanence work seem culminate alliance unlikely landlady seemingly unnatural fit first much anything else world sad story survivor soviet difficult emotionally essential want inkling stand today categorize fictional narrative stand exploration freedom fail develop course russian history revolution promise new free instead come tyranny show trial purge mass extermination happen main character recently release prisoner spent year return city wander try understand nightmare happen people translate russian strongly autobiographical story follow return society prison regime hard imagine live distrust friend family member russian citizen glad drag immensely perhaps life want life star easily gross man excellent writer follow story great interest thank", "genres": ["Fiction & Literature", "Historical Fiction", "Politics"], "summary": "A New York Review Books Original\r\n\r\nEverything Flows is Vasily Grossman’s final testament, written after the Soviet authorities suppressed his masterpiece, Life and Fate. The main story is simple: released after thirty years in the Soviet camps, Ivan Grigoryevich must struggle to find a place for himself in an unfamiliar world. But in a novel that seeks to take in the whole tragedy of Soviet history, Ivan’s story is only one among many. \r\n\r\nThus we also hear about Ivan’s cousin, Nikolay, a scientist who never let his conscience interfere with his career, and Pinegin, the informer who got Ivan sent to the camps. Then a brilliant short play interrupts the narrative: a series of informers steps forward, each making excuses for the inexcusable things that he did—inexcusable and yet, the informers plead, in Stalinist Russia understandable, almost unavoidable. \r\n\r\nAnd at the core of the book, we find the story of Anna Sergeyevna, Ivan’s lover, who tells about her eager involvement as an activist in the Terror famine of 1932–33, which led to the deaths of three to five million Ukrainian peasants. \r\n\r\nHere Everything Flows attains an unbearable lucidity comparable to the last cantos of Dante’s Inferno.", "asin": "1590173287", "rank": "252200", "city": "Moscow", "image": "https://images-na.ssl-images-amazon.com/images/I/516Rz0uIulL.jpg", "country": "Russia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}