{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 19, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Despite some pretty \"show-offy\" and borderline archaic vocabulary, this book was a pretty fun read. Mr. Glassco also knows where to skimp on details and where to splash out, especially where he himself is concerned? But I enjoyed the ride, am a big Paris fan so it was exciting for me!"}, {"review_sentiment": 5.0, "review_text": "Glassco is probably unknown to most US citizens, as he was a lesser-known 20th century Canadian poet. His semi-fictionalized memoir of 1920s Paris and environs is interesting primarily for the celebrities he allegedly met during his short stay as a layabout student - Hemingway, Bricktop, Richard Le Gallienne, Djuna Barnes, Frank Harris, and a host of others. Fascinating as are some of his adventures, he composed this work from memory, decades after the fact, so one has to wonder how much actually happened or how much he much is elaborated. What's missing here, according to the introduction, are the more sordid details of Glassco's money-making schemes, including work as a 'boy for hire.' Still, anyone looking for a bit of amusement will enjoy Glassco's memoir."}, {"review_sentiment": 5.0, "review_text": "Awesome biography, filled with gossip and revealing stories of 1920's Paris."}, {"review_sentiment": 5.0, "review_text": "A great read"}, {"review_sentiment": 3.0, "review_text": "JG definitely belonged to the lay-about category so despised by Hemingway. Unlike Hemingway, he seemed to aspire to an illusion of existentialism that was no more than low life; from sexual depradation to prostitution in the wider sense whilst pretending to be an aspiring writer. The memoirs probably capture the excesses of the belle epoque and in that respect are of interest even if fictitious in many instances."}, {"review_sentiment": 4.0, "review_text": "Surprisingly good, interesting,well paced and surprising.  It is incredible the people the author meets and the relationships he forms.  The memoirs are full of fascinating and odd people"}, {"review_sentiment": 5.0, "review_text": "No complaints"}, {"review_sentiment": 5.0, "review_text": "Anyone who was in the thick of things in Paris in the Twenties, or London in the Sixties, or New York in the Seventies -- and lived to tell the tale -- will love this book."}, {"review_sentiment": 2.0, "review_text": "It didn't engage me.  I couldn't finish it.  I guess it was because I wasn't invested in the main character, and the story didn't seem to be doing anything."}, {"review_sentiment": 5.0, "review_text": "If you want to find out what it was like living in Paris in the late 1920's, buy or download this book immediately. Don't waste your time reading or re-reading Hemingway or Fitzgerald.  This book has it all.  John Glassco's memoir deserves to be much more widely read.  The writing sparkles."}]}, "authors": ["John Glassco"], "isbn": "1590171845", "longitude": 2.3514992, "periods": ["1900s"], "title": "Memoirs of Montparnasse", "word_cloud": "pretty borderline archaic vocabulary pretty fun also know skimp detail splash especially concern enjoy ride big fan excite probably unknown citizen century canadian poet memoir environs interest primarily celebrity allegedly meet short stay student host others fascinate adventure compose work memory decade fact wonder much actually happen much much elaborate miss accord introduction sordid detail scheme include work hire still anyone look bit amusement enjoy memoir biography fill gossip reveal story great definitely belong category despise seem aspire illusion existentialism low life sexual depredation prostitution wider sense whilst pretend aspire writer probably capture excesses belle toque respect interest even fictitious many instance surprisingly good interesting well pace surprise incredible people author meet relationship form full fascinating odd people complaint thick thing live tale love engage guess invest main character story seem anything want find live late buy download immediately waste time read deserve much widely writing sparkle", "genres": ["Memoir"], "summary": "Memoirs of Montparnasse is a delicious book about being young, restless, reckless, and without cares. It is also the best and liveliest of the many chronicles of 1920s Paris and the exploits of the lost generation. \r\n\r\nIn 1928, nineteen-year-old John Glassco escaped Montreal and his overbearing father for the wilder shores of Montparnasse. He remained there until his money ran out and his health collapsed, and he enjoyed every minute of his stay. \r\n\r\nRemarkable for their candor and humor, Glassco’s memoirs have the daft logic of a wild but utterly absorbing adventure, a tale of desire set free that is only faintly shadowed by sadness at the inevitable passage of time.", "asin": "1590171845", "rank": "560358", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/41nhzZEh0tL.jpg", "country": "France", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}