{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 45.5202471, "ratings": {"num_ratings": 48, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Razor sharp writing."}, {"review_sentiment": 4.0, "review_text": "Hard Rain Falling takes readers on a journey through the seamy underbelly of the Pacific Northwest in the years following the Second World War. Through Jack Levitt, the novel's protagonist, readers course through a part of America typically depicted in pulp novels and noir films, a world of hard drinking, corruption, violence, and prurience. Carpenter's writing is terse, blunt, and matter-of-fact. His characterization of Jack, Billy Lancing, Sally, and the other characters makes them three dimensional and elevates them beyond mere stereotype. The hardships of the characters and their response to the strictures of post-war America will eventually inspire the groundswell of protests and counterculture that characterized the late 1960s.Carpenter ostensibly arranges this novel into three major sections: Jack and Billy's hard scramble days as juvenile delinquents, their experiences in prison (both as children and as adults), and Jack's attempt to establish a family and domesticity with Sally, a San Francisco party girl with the sensibilities of a burgeoning femme fatale. Of these sections the final chapters involving Jack and Sally's doomed marriage is the most difficult to buy into, though it is interesting to see the changes in personality and outlook Jack makes by this point in the novel. By contrast, Hard Rain Falling is most successful in its rendering of the penal system and life behind bars, in which men's every movement is controlled and choreographed. Carpenter goes all in here; he critiques the penal system and decries the limits it places on individuals' personal freedoms. His thoughts on prison sexuality, in particular, are insightful and reasoned. Those chapters propel with force and brutal honesty.The most disconcerting aspect of the novel, however, is Carpenter's treatment of race and racism. Although the novel exhibits great historical fidelity in the way the white characters view race (the n-word is deployed often and without comment, not only by the novel's white characters but by the narrator as well) it is difficult to discern whether Carpenter himself evinces the blatant racism threaded throughout the novel or if he has merely aligned the narrator's language with the racist ethos of the environment these characters inhabit. Indeed, Billy, the novel's second protagonist, a light-skinned African American character, has obviously internalized the culture's racism; it, along with his internalized homophobia (I won't spoil) lead to his demise. Yet Carpenter's intention regarding the inclusion of Billy's powerful storyline is murky. Within both the dominate white culture neither Billy nor Jack can exist within and the profligate world of vice, gambling, and criminality where both he and Jack thrive, Billy is viewed as a racial and sexual \"other\". Billy's function in the novel inspires two important questions: Is Billy just another casualty in the long list of racial minorities and sexually fluid characters in Western literature authors use only as a sacrifice for the catharsis of a white man? Is Carpenter using Billy to take an early stand, although aborted, against racism and homophobia? Readers can't be sure. If Carpenter had taken us deeper into the complex relationship between Jack and Billy, the novel would be richer.A common complaint about Hard Rain Falling is that both Jack and Billy spend too much time philosophizing. I see nothing unusual about this. They may be criminals but criminals still ponder existence, the structure of society, and their place within it. Although Hard Rain Falling is not without it faults, it is a fine novel with strong, consistent writing that manages to blend several genres (prison literature, domestic realism, bildungsroman, pulp fiction) into one powerful book."}, {"review_sentiment": 5.0, "review_text": "A small gem of a book."}, {"review_sentiment": 4.0, "review_text": "Hard. Realistic. Poetic. Sad. All at once."}, {"review_sentiment": 4.0, "review_text": "The main character in this book is Jack Levitt.  He is 17 years old and tough.  He has run away from an orphanage.  The only thing he knows about life is that it is hard, and he has no capacity to change is life.  He has never been loved and through out this book he searches for something.  He is possibly searching for love but does not even recognize the feeling.  Throw away people often are locked into their way of life and do not know how to change. When life is hopeless for people they may fail to react to their problems---they go with the flow.  As Jack meets like people this is exactly the way they live  life.  Jack is a little different from most of the gang.  He wishes  for solitude, and quiet and wants to think.  Where ever he is he is trying to figure the whys.  He thinks in jail, and out of jail. Even in pool halls and whore houses Jack is thinking-----but alas it makes no difference, Jack  is still over whelmed with life.  Don Carpenter made the Jack Levitt character live.  I have never known a gang of thugs and I was fascinated with their life on the edge.  As I read about Jack, Denny and Billy the word hopeless kept popping into my thoughts. Jack was the toughest of the group.  In one of his depressed moods he began to think about how he would like to kill someone.  As he factored out his feelings he came to the conclusion that it was necessary to hate the person you planned to kill.  He dropped that plan because he could not think of anyone he hated.  Jack was not a whiner and he blamed only himself for his actions.  He took his punishment but that did not deter him from finding trouble.  The story and the writing are excellent. However, the book is depressing,sexual and raw."}, {"review_sentiment": 4.0, "review_text": "A darn good book, if a little dark. The characters are amazing and will stay with you a long time. An enlightened book for the era in which it was written.Will expand your horizons and you will be glad you read it."}, {"review_sentiment": 4.0, "review_text": "GRITTY GOOD WRITING"}, {"review_sentiment": 5.0, "review_text": "Some rough reading at times, but an amazing and highly underrated piece of American Fiction."}, {"review_sentiment": 5.0, "review_text": "a classic"}, {"review_sentiment": 2.0, "review_text": "Hard to follow"}]}, "authors": ["Don Carpenter"], "isbn": "1590173244", "longitude": -122.6741949, "periods": ["1900s"], "title": "Hard Rain Falling", "word_cloud": "sharp writing take reader journey seamy underbelly year follow second protagonist reader course part typically depict pulp novel nor film world drinking corruption violence prurience write terse blunt characterization character make dimensional elevates mere stereotype hardship character response strictures eventually inspire groundswell protest counterculture characterize late ostensibly arrange major section scramble day juvenile delinquent experience prison child adults attempt family domesticity party girl sensibility burgeon lemme fatal section final chapter involve doom marriage difficult interesting see change personality outlook make point contrast successful render penal system life bar men movement control choreograph go critique penal system decry limit place individual personal freedom thought prison sexuality particular insightful reason chapter propel force brutal disconcert aspect however treatment race racism exhibit great historical fidelity way white character view race deploy often comment white character narrator well difficult discern evinces blatant racism thread merely align narrator language racist environment character inhabit indeed second protagonist african american character obviously internalized culture racism internalized homophobia lead demise yet intention regard inclusion powerful story line murky white culture exist profligate world vice gamble criminality thrive view racial sexual function inspire important question be casualty long list racial minority sexually fluid character western literature author use sacrifice catharsis white man be use early stand aborted racism homophobia sure take deeper complex relationship common much time philosophize see nothing unusual criminal still ponder existence structure society place fault fine strong consistent writing manages blend several genre prison literature domestic realism bildungsroman pulp fiction powerful small gem main character year old tough away thing know life capacity change life never love search something possibly search even feeling away people often lock way life know change life hopeless people problem flow meet people exactly way live life little different gang wish solitude quiet want think ever try figure why think jail jail even pool hall whore house think ala make difference still whelm life make character live never know gang thug fascinate life edge word hopeless keep pop thought toughest group depressed mood begin think someone factored feeling come conclusion necessary hate person plan kill drop plan anyone hat whiner blame action take punishment deter find trouble story write excellent however depress sexual raw darn good little dark character amaze stay long time enlightened era expand horizon glad writing rough reading time amaze highly underrated piece american classic follow", "genres": ["Fiction & Literature", "Mystery & Suspense", "Action & Adventure"], "summary": "New York Review Books Classics\r\n\r\nDon Carpenter’s Hard Rain Falling is a tough-as-nails account of being down and out, but never down for good—a Dostoyevskian tale of crime, punishment, and the pursuit of an ever-elusive redemption. The novel follows the adventures of Jack Levitt, an orphaned teenager living off his wits in the fleabag hotels and seedy pool halls of Portland, Oregon. Jack befriends Billy Lancing, a young black runaway and pool hustler extraordinaire. \r\n\r\nA heist gone wrong gets Jack sent to reform school, from which he emerges embittered by abuse and solitary conﬁnement. In the meantime Billy has joined the middle class—married, fathered a son, acquired a business and a mistress. But neither Jack nor Billy can escape their troubled pasts, and they will meet again in San Quentin before their strange double drama comes to a violent and revelatory end.\r\n\r\n\"Carpenter's masterpiece, long out of print, is the definitive juvenile-delinquency novel and a damning indictment of our justice system that is still relevant today.\" The Village Voice", "asin": "1590173244", "rank": "70585", "city": "Portland", "image": "https://images-na.ssl-images-amazon.com/images/I/41DBqIFVSdL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}