{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 70, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent book! Get it if you are interested in WWI trench warfare history. One of the best I have read."}, {"review_sentiment": 5.0, "review_text": "Absolutely a must-read."}, {"review_sentiment": 4.0, "review_text": "Great anti war book, very realist and revealing."}, {"review_sentiment": 5.0, "review_text": "Told in the first person by a young soldier named Dartemont. Dartemont is a social rebel who is against the war and the near religious fervor of nationalism and its follies. Early on he describes the euphoria the citizenry exhibit at the announcement they are going to war. Police beat people for \"not displaying sufficent enthusiasm.\" In the battlefields, he experiences indescribable horrors. These are some of the most gruesome yet artistically written passages of death I've come upon. Back home, no one wants to hear of the realities. They just want to hear the good parts, the killing of the Boche, the glory and valor, acts of heroism. Dartemont is turned off by the wanton self-delusional behavior of those around him. The Sheep. He finds solace among his fellow soldiers who had gone through the nightmware,"}, {"review_sentiment": 5.0, "review_text": "Excellent, well written. A must read for those interested in WW1 and war in general. Amazingly transcends time with today's world."}, {"review_sentiment": 5.0, "review_text": "WWI trenches were hell on earth."}, {"review_sentiment": 5.0, "review_text": "When I was a child my parents took me to see the \"Boyau de la Mort\" or The Trench of Death\" . This was( and still is) a preserved part of the trenches right next to the river Yser near the Flemish town of Diksmuide where the Allies faced the Germans for 4 long and miserable years. Even as a kid I didn't need much imagination to get an inkling of the horror that took place there a mere 50 years before. That part of Flanders is always windswept , and even in summer , in those flatlands near the river , you feel a chill. Since then I've read Celine's traumatic war experiences in  \"Journey to the End of the Night\" , \"Nothing New from the Western Front \" by Erich Maria Remarque , and Junger's \"Storm of Steel\" amongst others, but nothing shows you the daily horror, the blood and the gore, the fear, the weeping, the unending suffering of the common soldier as Gabriel Chevalier's masterpiece does. You will find no heroism in here, at least not the heroism that is State-sponsored and political, but you will find the true heroism of the simple soldier trying to make it through another day and mindful and protective of the guy right next to him .This must read book transported me back to that day of my youth when I stood, uncomprehendingly, at the hand of my father in those not-high-enough trenches and imagined the bullets and bombs in search of their victims."}, {"review_sentiment": 5.0, "review_text": "The book is in prime condition completely happy with it"}, {"review_sentiment": 5.0, "review_text": "Simply an amazing novel about World War I.  This is dark, but given that the author was a veteran of the Great War it is realistic.  A must read for anyone wanting to get lost in the trenches of World War I"}, {"review_sentiment": 5.0, "review_text": "Realism and dissent at its best."}]}, "authors": ["Gabriel Chevallier"], "isbn": "1590177169", "longitude": 2.3514992, "periods": ["1900s"], "title": "Fear: A Novel of World War I", "word_cloud": "excellent interested trench warfare history best absolutely anti realist reveal first person young soldier name social rebel religious fervor nationalism folly describe citizenry exhibit announcement go beat people display sufficient enthusiasm battlefield experience indescribable horror gruesome yet artistically write passages death come home want hear reality want hear good part kill glory valor act heroism turn wanton behavior find solace fellow soldier go nightmare well write interested general transcend time today trench hell earth child parent take see still preserve part trench right next river town face long miserable year even kid need much imagination inkling horror take place mere year part always windswept even summer flatland river feel chill traumatic experience others nothing show daily horror blood gore fear weep unending suffer common soldier masterpiece find heroism least heroism political find true heroism simple soldier try day mindful protective guy right next transport back day youth stand uncomprehendingly hand father trench imagine bullet bomb search victim prime condition completely happy amazing dark give author veteran realistic anyone want get lose trench dissent best", "genres": ["Fiction & Literature", "Historical Fiction", "WWI"], "summary": "An NYRB Classics Original \r\n\r\nWinner of the Scott Moncrieff Prize for Translation\r\n\r\n1915: Jean Dartemont heads off to the Great War, an eager conscript. The only thing he fears is missing the action. Soon, however, the vaunted “war to end all wars” seems like a war that will never end: whether mired in the trenches or going over the top, Jean finds himself caught in the midst of an unimaginable, unceasing slaughter. After he is wounded, he returns from the front to discover a world where no one knows or wants to know any of this. Both the public and the authorities go on talking about heroes—and sending more men to their graves. But Jean refuses to keep silent. He will speak the forbidden word. He will tell them about fear. \r\n\r\nJohn Berger has called Fear “a book of the utmost urgency and relevance.” A literary masterpiece, it is also an essential and unforgettable reckoning with the terrible war that gave birth to a century of war.", "asin": "1590177169", "rank": "179525", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51e4ATMzPRL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}