{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 17, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "This book is a sequel, so you have to slog through some back story otherwise avoided. There are so many characters, and so much detail attached to each, that one almost needs to take the sort of notes kept for, say, a sophomore course in political science. There are also close brushes with U.S. senate rules, each of which is like taking time out for ten minutes of driver's ed. And the less-than-credible heroine? I still am not entirely clear why she was in the story.So many hurdles set before the reader! It's a sign of the author's exemplary talents that the book works so very well.It's easier, I imagine, if you can read it in two or three long sessions. If you put it down for two or three days, getting back up to speed might not be so easy."}, {"review_sentiment": 5.0, "review_text": "Complex. Complicated. Twists and turns. This is a rollercoaster ride from start to finish. Putting it down was not an option."}, {"review_sentiment": 5.0, "review_text": "Another five-star for Charles McCarry! He never disappoints."}, {"review_sentiment": 3.0, "review_text": "Readers who like McCarry's \"Paul Christopher\" books will find this somewhat interesting, but likely not satisfying. It shares some of the tangential characters from the popular series and makes reference to to others, but is focused on a byzantine plot by the radical left to seize control of the US government. None of the characters are particularly interesting or sympathetic, and the plot is extremely dense as it builds out from the earlier and equally so-so \"Better Angels.\" The concept behind the plot is intriguing, as are the ways in which the Constitution is found to have some holes in it if things get really crazy, but it's overly long and loses momentum."}, {"review_sentiment": 5.0, "review_text": "Charles McCarry has done justice to the term heart pounding. I defy anyone who reads this book to voluntarily put it down before the end"}, {"review_sentiment": 2.0, "review_text": "this book is poorly written and conceived of when compared to McCarry's other novels due to his intense bias against librals. It is very difficult to read and enjoy because rather than focusing attention on the plot, the author expends all his energy on his characterizations of the polital left and right. I rarely don't finish a book, but in this case I only made it to page 60 (this was the point at which he was characterizing the media as being so left leaning that they wouldn't cover the most interesting story of the time)."}, {"review_sentiment": 3.0, "review_text": "McCarry is an excellent author and this is a good story, but is not what is advertised, as a \"thriller.\""}, {"review_sentiment": 2.0, "review_text": "Overblown plot  --  not really believeable."}, {"review_sentiment": 4.0, "review_text": "Very good"}, {"review_sentiment": 5.0, "review_text": "McCarry's usual complex characters and skillful plotting combined with perceptive take on political types keeps this one moving briskly and engagingly toward a fine payoff at the end."}]}, "authors": ["Charles McCarry"], "isbn": "1590204751", "longitude": -77.0366456, "periods": ["1900s"], "title": "Shelley's Heart: A Thriller", "word_cloud": "sequel slog back story otherwise avoid many character much detail attach almost need take sort note keep say sophomore course political science also close brush senate rule take time ten minute driver ed still entirely clear many hurdle set author exemplary talent work easier imagine long session put day get back speed twist turn roller coaster start finish option never disappoints reader find somewhat interesting likely satisfy share tangential character popular series make reference others focus byzantine plot radical leave seize control government none character particularly interesting sympathetic plot extremely dense build earlier equally concept plot intriguing way find hole thing get really crazy overly long loses momentum do justice term heart pound defy anyone read voluntarily put end poorly write conceive compare novel due intense bias liberal difficult rather focus attention plot author expend energy characterization pol ital leave right rarely finish case make page point characterize medium leave lean interesting story time excellent author good story advertise plot really believable very good usual complex character skillful plot combined perceptive political type keep move briskly engagingly fine payoff end", "genres": ["Fiction & Literature", "Mystery & Suspense", "Politics"], "summary": "The first presidential election of the twenty-first century, bitterly contested by two men who are implacable political rivals but lifelong personal friends, is stolen through computer fraud.\r\n\r\nOn the eve of the Inauguration the losing candidate presents proof of the crime to his opponent, the incumbent President, and demands that he stand aside. The winner refuses and takes the oath of office, thereby setting in motion what may destroy him and his party, and even bring down the Constitution.\r\n\r\nFrom this crisis, master storyteller Charles McCarry, author of such classic thrillers as The Tears of Autumn and The Last Supper weaves a masterpiece of political intrigue. Shelley's Heart is so gripping in its realism and so striking in its foresight that McCarry's devoted readers may view this tale of love, murder, betrayal, and life-or-death struggles for the political soul of America as an act of prophecy.\r\n\r\n\"The most masterful political thriller I have ever read. It is loaded with intrigue and counter-intrigue at the very top level of government in Washington.\" Richard Condon, author of The Manchurian Candidate ", "asin": "1590204751", "rank": "691492", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51e5YIhRY6L.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}