{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 55.7507178, "ratings": {"num_ratings": 198, "rating": 4.5, "reviews": [{"review_sentiment": 3.0, "review_text": "The book is a bit disjointed as it frequently opens up a chapter with an unknown character."}, {"review_sentiment": 5.0, "review_text": "Life and Fate"}, {"review_sentiment": 5.0, "review_text": "Fantastic book Incredible to learn about Rusia in Stalin’s time"}, {"review_sentiment": 5.0, "review_text": "This is a book that demands a second read. It gets better and better as you get to know the characters and immerse yourself in the realities of the Eastern Front and USSR at the time."}, {"review_sentiment": 5.0, "review_text": "The battle of Stalingrad was the most significant battle fought in during WW2, and arguably the most significant battle fought in world history.  Read this book to find out why.  Maybe read Beevor's 'Stalingrad' and Grossman's memoir 'Writer and War' first."}, {"review_sentiment": 5.0, "review_text": "A visceral, brutal version of War and Peace. Grossman is among the greatest writers of our time. Buy this book!"}, {"review_sentiment": 5.0, "review_text": "Amazing, fantastic - such wonderful interesting insights.  Makes you stop and think about how you view your life!"}, {"review_sentiment": 5.0, "review_text": "A beautifully written masterpiece with Stalingrad as a backdrop. The characters are well developed and descriptive as you learn of their destinies and fate . Truly an epic novel that's well worth reading."}, {"review_sentiment": 5.0, "review_text": "Gave it to my girlfround"}, {"review_sentiment": 5.0, "review_text": "A masterpiece! Wonderful writing about the hardest days of the 20th century. As Grossman died in 1967, some parts may seem outdated but on the whole a must read."}]}, "authors": ["Vasily Grossman"], "isbn": "1590172019", "longitude": 37.6176606, "periods": ["1900s"], "title": "Life and Fate", "word_cloud": "bit disjoint frequently open chapter unknown character learn time demand second get better better know character immerse reality time battle significant battle fight arguably significant battle fought world history find first visceral brutal version greatest writer time fantastic wonderful interesting insight stop think view beautifully write masterpiece backdrop character well develop descriptive learn destiny epic well worth read girlfriend masterpiece write hardest day century die part outdated whole", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "New York Review of Books Classics\r\n\r\nA book judged so dangerous in the Soviet Union that not only the manuscript but the ribbons on which it had been typed were confiscated by the state, Life and Fate is an epic tale of World War II and a profound reckoning with the dark forces that dominated the twentieth century.\r\n\r\nInterweaving a transfixing account of the battle of Stalingrad with the story of a single middle-class family, the Shaposhnikovs, scattered by fortune from Germany to Siberia, Vasily Grossman fashions an immense, intricately detailed tapestry depicting a time of almost unimaginable horror and even stranger hope.\r\n\r\nLife and Fate juxtaposes bedrooms and snipers’ nests, scientific laboratories and the Gulag, taking us deep into the hearts and minds of characters ranging from a boy on his way to the gas chambers to Hitler and Stalin themselves.\r\n\r\nThis novel of unsparing realism and visionary moral intensity is one of the supreme achievements of modern Russian literature.\r\n\r\n\"World War II’s War and Peace. Written (mainly) from the vantage point of a Soviet Jew, this masterpiece was judged far too ambivalent in its treatment of the 'Great Patriotic War' to be published in the author’s lifetime.\" The New York Times", "asin": "1590172019", "rank": "48470", "city": "Moscow", "image": "https://images-na.ssl-images-amazon.com/images/I/51RTSyN1X%2BL.jpg", "country": "Russia", "story_arc": ["Tragedy", "Things only get worse"]}