{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 8, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Nescio's Amsterdam Stories presents almost the entire life's work of a barely known Dutch author. This gorgeous little translation is a slim volume of perfect prose that provides a fresh voice to American audiences. Nescio examines the interior lives of strong characters, all of whom seem to live with a quiet desperation. His writers never perfect the art of poesy. This strong authority in Nesico's narratives, and even stories as short as \"The Valley of Obligations\" accomplish a muted explosiveness and quiet rage in only a few sentences. Absolutely amazing, Amsterdam Stories seems to contain a life's work that holds great weight in a handful of words. My favorite piece in the collection was easily \"Little Poet,\" as it reflects the difficulty of balancing love and connection with the insatiable hunger to create, create, create. These beautiful pieces beg to be reread, and beg the question of how much more he could have produced in his lifetime had he the time and energy. This concept is simply what spoke to me so profoundly and deeply by the time I finished."}, {"review_sentiment": 5.0, "review_text": "Brilliant heartbreaking stories from the 20th century master of Dutch Prose.  These interconnected stories show the death of youthful ambition and idealism and the almost inevitable descent into disappointment, madness, and death.  A great little book."}, {"review_sentiment": 2.0, "review_text": "A translation from the original Dutch, I believe, the stories and characters appear flat to me.  Even though I lived in Amsterdam and know the modern city fairly well, I cannot relate to the city as described  in this book.  It's a pity, because I don't speak Dutch well enough to read it in the original - it is supposed to be 'the most beautiful Dutch writing ever'."}, {"review_sentiment": 4.0, "review_text": "The description of The Netherlands and in particular Amsterdam takes the reader back into history. How life was and more importantly how the landscape and city looked like."}, {"review_sentiment": 5.0, "review_text": "I am in love with the New York Review Books Classics. Yes, I've been devoted to Penguin Classics since my early teens but NYRB manages to surprise readers by giving them the 'other' reads. (I also recommend Dedalus from Britain which releases fascinating if not darker novels, novellas and story collections).And once again, NYRB doesn't disappoint.I have read several of these stories twice. Nescio is a grand master of capturing the angst, the romanticism, the lyrical longing of youth. These are stories about young men about to become indoctrinated into the serious routines of life - finding a job, getting married, having kids and so forth. And still, these are poets and painters, thinkers, philosophers, all of them friends, hanging out, taking long walks in the countryside, wandering through the streets of Amsterdam. They hang out in attic apartments and drink jenever (Dutch gin). They smoke, they tease each other. They feel lost. They're human.I would say the above description succinctly summarizes the two stories of Little Titans and The Freeloader but Amsterdam Stories is more than what I've just written. Nescio in his works conveys a sense of place and emotion about that very place. Nescio (pseudonym for Jan Hendrik Gröhloh) was born and raised in Amsterdam. In a sense this is his youth, his city he is writing. He became the successful business man. He married and  had four daughters. These stories are an elegy to his idealism, to the city he knew before he became successful. New York, Berlin, Paris and Munich have all had their writers, men and women who wrote and gave the world their collected vision of their city. For such a cosmopolitan town as Amsterdam, we have very few internationally known authors who've brought the city to life in literary prose.Nescio has achieved that. And now, after over 80 years of relative obscurity in the English language, NYRB has brought this slender volume out, a beautiful translation by Damion Searls. Also, an excellent introduction by Joseph O'Neill, author of Netherland.Read Nescio for all these reasons - for being young and idealistic. Read it for Amsterdam, a city beyond its Red Light District and coffeehouses. Read it because here's a beautiful opportunity to read a masterpiece by a Dutch author. This is beautiful stuff here. These aren't stories but prose poems with characters you know and understand. You love these people because they might be a lot like you or how you used to be."}, {"review_sentiment": 4.0, "review_text": "New York Review Books have a real oddity in this one: the four stories and five fragments that together comprise a large part of the published work of the Dutch author Jan Hendrik Gröloh, writing under the self-effacing pen name of Nescio (Latin for \"I don't know\"). Three of the stories, The Freeloader, Young Titans, and Little Poet, belong to the period 1909-19; the fourth, the darkly enigmatic Insula Dei, comes from 1942, when Holland was under German occupation. But although both World Wars are visible very faintly in the background, Nescio's real subject is the inner lives of young people hoping to make a mark as writers or artists, determined to break free of bourgeois convention, but inevitably getting either sucked back into it or destroyed by it. \"It was a strange time. And when I come to think about it, I realize that that time must still be happening now, it will last as long as there are young men of nineteen or twenty running around. It's only for us that the time is long since past.\"That quotation is from Young Titans, perhaps the most characteristic of the stories, though it shares the same cast of would-be bohemians as three other items in the book. They sit up all evenings in ill-heated attics, one paints a picture, another writes a poem, they go for long walks in the Dutch countryside: \"Every day we longed for something, without knowing what. It got monotonous. Sunrise and sunset and sunlight on the water and behind the drifting white clouds [...] all things I had seen so many times and thought about so many times while I was gone and would see again so many more times, so long as I didn't die. Who can spend his life watching all these things that constantly repeat themselves, who can keep longing for nothing? Trusting in a God who isn't there?\"Perhaps you need to be Dutch to get the most out of Nescio's writing, which is not only place- but culture-specific. Perhaps you need to have come to terms with the predictability as well as the occasional magnificence of all that flatness, to be comfortable with conformity. For Nescio's young Titans become respectable businessmen or, very touchingly in the 1942 story, an unemployed widower living only in the island of his memories. These are stories in which very little actually happens; there is pathos here, but little tragedy. Fortunately, though, there is also a good deal of gentle comedy: in his description of the eternal sponger Japi in The Freeloader, or in the suppressed eroticism of the Little Poet, for whom \"the prettiest girls are always walking on the other side of the canal. And so his whole life turned into one long poem, and that can be tedious too.\"Joseph O'Neill, the author of NETHERLAND and Dutch raised himself, says in his introduction that \"one reads Nescio in the first person plural; his voice speaks to all our selves.\" I would so much like to agree, but unfortunately I find these fragments easier to admire from a distance than to access for myself."}, {"review_sentiment": 4.0, "review_text": "These short sketches portray a group of young male friends living in and around Amsterdam and their intense longings to leave a mark. Poetic and descriptive language is abundant in these often humorous and often nihilistically bleak short stories. The author was a master of using natural phenomena as a foil to the overall mood and tone of his characters.  Written in the early 20th century these stories capture a  feeling of the intensity of youthful longing for bigger things common to every generation. A very fine selection."}, {"review_sentiment": 5.0, "review_text": "The New York Times Book reviewer found nothing to like about the yellow landscapes and minimal character development, thus revealing himself to be tone deaf to this writer's unique gifts."}]}, "authors": ["Nescio"], "isbn": "1590174925", "longitude": 4.8936041, "periods": ["1900s"], "title": "Amsterdam Stories", "word_cloud": "present almost entire life work barely know author gorgeous little translation slim volume perfect prose provide fresh voice american audience examine interior life strong character seem live quiet desperation writer never perfect art strong authority narratives even short accomplish mute explosiveness quiet rage sentence absolutely amaze seem contain life work hold great weight handful word favorite piece collection easily reflect difficulty balance love connection insatiable hunger create create create beautiful piece beg reread beg question much lifetime time energy concept simply speak profoundly deeply time finish brilliant heartbreaking century master interconnected show death youthful ambition idealism almost inevitable descent disappointment madness death great little translation original believe character appear flat even live modern city fairly well relate city describe pity speak dutch well enough original suppose beautiful dutch writing ever description particular take back history life importantly landscape city look love devote early teen manage surprise reader give read also recommend release fascinate darker novel novellas story collection several twice grand master capture angst romanticism lyrical longing youth young men indoctrinated serious routine life find job get married kid forth still poets painter thinker philosopher friend hang take long walk countryside wander street hang attic apartment drink jenever gin smoke tease feel lose description succinctly summarize little write work conveys sense place emotion place pseudonym bear raise sense youth city write become successful business man marry daughter elegy idealism city know become successful writer men woman write give world collected vision city cosmopolitan town internationally know author bring city life literary achieve year relative obscurity language bring slender volume beautiful translation also excellent introduction author reason young idealistic city coffeehouses beautiful opportunity masterpiece author beautiful stuff prose poems character know understand love people use real oddity fragment together comprise large part publish work author write pen name know little belong period fourth darkly enigmatic come german occupation visible faintly real subject inner live young people hop make mark writer artist determine break free bourgeois convention inevitably get suck back destroy strange time come think realize time still happen last long young men nineteen twenty run time long past quotation perhaps characteristic share cast bohemian item sit evening attic paint picture write poem long walk countryside day long something know get monotonous sunset sunlight water drift white cloud thing see many time think many time go many time long die spend life watch thing constantly repeat keep longing nothing perhaps write perhaps come term predictability well occasional magnificence flatness comfortable conformity young become respectable businessmen touchingly story unemployed widower live island memory little actually happen pathos little tragedy also good deal gentle comedy description eternal sponger suppress eroticism prettiest girl always walk side canal whole life turn long poem tedious author raise say introduction read first person plural voice speak self much agree unfortunately find fragment easier admire distance access short sketch portray group young male friend live intense longing leave mark descriptive language abundant often humorous often nihilistic ally bleak short author master use natural phenomenon foil overall mood tone character write early century capture feel intensity youthful longing bigger thing common generation fine selection reviewer find nothing yellow landscape minimal character development thus reveal tone deaf writer unique gift", "genres": ["Fiction & Literature"], "summary": "New York Review Books Classics\r\n\r\nNo one has written more feelingly and more beautifully than Nescio about the madness and sadness, courage and vulnerability of youth: its big plans and vague longings, not to mention the binges, crashes, and marathon walks and talks. No one, for that matter, has written with such pristine clarity about the radiating canals of Amsterdam and the cloud-swept landscape of the Netherlands. \r\n\r\nWho was Nescio? Nescio—Latin for “I don’t know”—was the pen name of J.H.F. Grönloh, the highly successful director of the Holland–Bombay Trading Company and a father of four—someone who knew more than enough about respectable maturity. Only in his spare time and under the cover of a pseudonym, as if commemorating a lost self, did he let himself go, producing over the course of his lifetime a handful of utterly original stories that contain some of the most luminous pages in modern literature. \r\n\r\n“Nescio’s utter simplicity goes hand-in-hand with a great command of humour, irony, matter-of-factness, understatement and sentiment (never sentimentality or self-pity), all of which miraculously balance each other out. He is essentially a lyricist, a poet writing in prose.” Dutch Foundation for Literature\r\n\r\nThis is the first English translation of Nescio’s stories.", "asin": "1590174925", "rank": "704707", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/41o-kaQFkyL.jpg", "country": "The Netherlands", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}