{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 34.5260131, "ratings": {"num_ratings": 21, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Not a review. Just a brief comment. Like travel stories from long ago and far away? Buy and read this book. A nice change of pace from Bill Bryson (:"}, {"review_sentiment": 4.0, "review_text": "This travel book has an introduction by Patrick Leigh Fermor, which attracted me to it.  In no way does it compare with Fermor's writing about his own adventures, however.  Too much of Bouvier's narrative describes the mechanical failures of his vehicle and the attempts to get it repaired.  There is too much detail about engine failure and not enough description of his hosts' viewpoint, the cultural differences he encounters, and the general atmosphere surrounding the Balkans, Turkey, Iran and Afghanistan.  Still, it is an enjoyable treatment of an unusual journey that contrasts greatly with the present situation in that part of the world."}, {"review_sentiment": 5.0, "review_text": "Wonderful book."}, {"review_sentiment": 5.0, "review_text": "2 Swiss/French  guys jump in to small fiat and travel in 1953 from Serbia to Afghanistan. this is 20 years after Patrick Fermor walks his way thru the eastern Europe to the black sea. what a difference 20 years make! whole nations have disappeared. whole peoples have been swept away. the survivors are left and you can see how life after WW II was like. you can also read how the Persians felt after the royalist coup swept the shah of iran back in - still life goes on. the 2 guys appreciate the sounds and smells and life all around even in the winter in Tabriz.excellent prose. well written and thoughtful from a non-USA perspective."}, {"review_sentiment": 5.0, "review_text": "In the fifties, the author and his artist painter friend set out to travel from Europe to India with next to nothing in their pockets.  They are put into the hands if strangers and are reminded that most of the world us good.  This book takes you back to a time when people traveled by foot and heart.Great book."}, {"review_sentiment": 5.0, "review_text": "Excellent piece of travel writing, in content and style.  Required reading for anyone interested in travel literature. x x x"}, {"review_sentiment": 5.0, "review_text": "I was very happy, after I missed the recieving first, to catch up and then get it safely. Thank You very much for Your efficient assistance!By by"}, {"review_sentiment": 4.0, "review_text": "Having lived many years in Geneva I was attracted to this 'travelogue' at once, given the number plate on the cover and that I owned a car once there from the same period that the journey took place... 1953.The contrast between this calm and well-organised city and the places visited by these two young men is stark and comes over in the text without overstatement. The descriptions of the amazing scenery they saw, as well as the political environments they experienced were impressive, the latter being in contrast to the much less appealing situations we face today in some of the places they visited."}, {"review_sentiment": 5.0, "review_text": "This book was unique in my reading history. It was especially interesting to follow a couple of literate, artistic young men traveling through country that is viewed today as explosive and deadly dangerous. The reality of danger in the time span of Bouvier's trip is not ignored but described as it was then understood, reasonable, human and right sized. This allows the reader to enter the various idioms of personality and culture on the ground as it were - face to face and without hyperbole.Bouvier is a most graceful writer and although this is a translation I found it endlessly satisfying and transporting and full of humor deep and rich.Most highly recommended"}, {"review_sentiment": 5.0, "review_text": "Nicolas Bouvier is an enjoyable travel companion.  He is observant, clever and writes well.  His insights are excellent and he is absolutely fearless in relating ALL of the travel experience, whether good or bad.  Bouvier's style is relaxed and very comfortable.  One of his best aspects in relating his trip across the Middle East to India is his lack of judgmental cultural imperialism.  Bouvier remains open to people, and because of this, he is welcomed and accepted. He comes in contact with a great cast of characters.  It is most enlightening to look at the people and countryside through his 1953 eyes and see the area in an earlier time.  I would highly recommend this book and author to anyone interested in the Middle East in specific and travel in general.  Read it and take away some excellent lessons in how to be a good traveler and a welcome guest in another country."}]}, "authors": ["Nicolas Bouvier"], "isbn": "1590173228", "longitude": 69.1776476, "periods": ["1900s"], "title": "The Way of the World", "word_cloud": "not brief comment travel story long ago far away nice change pace travel introduction attract compare writing adventure however too much narrative describes mechanical failure vehicle attempt get repair much detail engine failure enough description host viewpoint cultural difference encounter general atmosphere surround still enjoyable treatment unusual journey contrast greatly present situation part wonderful guy jump small fiat travel year walk thru eastern black sea difference year make whole nation disappear whole people sweep away survivor leave see life also felt royalist coup sweep shah iran back still life go guy appreciate sound smell life around even winter prose well write thoughtful perspective fifty author artist painter friend set next nothing pocket put hand stranger remind good take back time people travel foot excellent piece travel write content style require reading anyone interested travel literature happy miss receive first get safely much efficient assistance have live many year geneva attract give number plate cover own car period journey take place contrast calm city place visit young men stark come text overstatement description amaze scenery saw well political environment experience impressive latter contrast much le appealing situation face today place visit unique read history especially interest follow couple literate artistic young men travel country view today explosive deadly dangerous reality danger time span trip ignore described understood reasonable human right size allow enter various idiom personality culture ground face face graceful writer translation find endlessly satisfy transport full humor deep highly recommend enjoyable travel companion observant clever write well insight excellent absolutely fearless relate travel experience good bad style relax comfortable best aspect relate trip lack judgmental cultural imperialism remain open people welcome accept come contact great cast character enlighten look people countryside eye see area earlier time highly author anyone interested specific travel general excellent lesson good traveler welcome guest country", "genres": ["Memoir", "Travel Writing"], "summary": "New York Review Books Classics\r\n\r\nIn 1953, twenty-four-year old Nicolas Bouvier and his artist friend Thierry Vernet set out to make their way overland from their native Geneva to the Khyber Pass. They had a rattletrap Fiat and a little money, but above all they were equipped with the certainty that by hook or by crook they would reach their destination, and that there would be unanticipated adventures, curious companionship, and sudden illumination along the way. \r\n\r\nThe Way of the World, which Bouvier fashioned over the course of many years from his journals, is an entrancing story of adventure, an extraordinary work of art, and a voyage of self-discovery on the order of Robert M. Pirsig’s Zen and the Art of Motorcycle Maintenance. As Bouvier writes, “You think you are making a trip, but soon it is making—or unmaking—you.”", "asin": "1590173228", "rank": "802958", "city": "Kabul", "image": "https://images-na.ssl-images-amazon.com/images/I/51E4Z5uRcZL.jpg", "country": "Afghanistan", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}