{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 42, "rating": 3.9, "reviews": [{"review_sentiment": 2.0, "review_text": "I had high hopes for Paris Stories by Mavis Gallant, largely because of the glowing preface by Michael Ondaatje, whose novel, The English Patient, I admire greatly.Unfortunately Gallant’s stories tend toward the ponderous, both in style of the prose and pacing.  She is writing for another time and place, and while that does not discount a book’s quality (and in fact, it can be a virtue) for Gallant this scars the whole collection.  I found myself constantly searching for a perch where, as a person, I could feel the pulse of Gallant's stories.  I only found a few.Yes, Gallant can write, and write well.  And therein may be the central problem: her stories are too solidified, too set into place; they do not breathe, and this makes for suffocating reading."}, {"review_sentiment": 3.0, "review_text": "Short stories some very good some just okay."}, {"review_sentiment": 5.0, "review_text": "Mavis Gallant is a brilliant writer! Within every thoughtful sentence is a world of meaning and insight.  Her stories should not be read quickly; they are meant to be savored. Gallant's deep understanding and empathy for the lives of immigrants, writers, and lovers shimmers on each page.  We are uplifted and made all the better after reading her timeless work.  I think Elizabeth Strout's writing comes close in style and approach to that of Mavis Gallant."}, {"review_sentiment": 4.0, "review_text": "Impressive collection of Gallant’s stories.  Lovely nuanced writing.  Stories with intriguing characters, some with backstories that I wished were more fleshed out."}, {"review_sentiment": 4.0, "review_text": "Wonderfully written introspective of human beings, their loves, lives and failings.Each short story takes on a totally different subject."}, {"review_sentiment": 5.0, "review_text": "Gallant's stories reveal a rare and acute emotional intelligence rendered in perfect, unpretentious prose."}, {"review_sentiment": 5.0, "review_text": "Loved this book, will now read the whole series."}, {"review_sentiment": 5.0, "review_text": "I have had this volume on my iPad for nearly a year.  I downloaded it in preparation for a week in Paris.  I soon discovered the stories are less \"stories\" than novellas.  Don't expect a quick read with this book.  Don't even try to breeze through it.  It's like a pot of gold and every nugget is something to be savored and cherished.  The stories are long and full of rich language and plot lines that are both interesting and unique.  So it's taken me almost a year to finish the book.  I say, so what? It was like a box of exotic Swiss chocolates that can't be eaten in one sitting...it needs to be savored, page by page (if you'll excuse the mixed metaphor.)There are a lot of pages in this book, so I would suggest getting it in a Kindle edition.  You'll save weight and it will fit snug on your lap as you read away in the Gardens of Luxemburg or in your soft feathered bed in a hotel near St. Suplice...like I did.Personally, I can't think anyone can see themselves as a traveller or serious reader or potential writer without having experienced this amazing book."}, {"review_sentiment": 2.0, "review_text": "I am surprised by the rather good reviews - but I guess that is the beauty of having different tastes.The most important disappointment for me was the fact that the title of the book only means that these stories have been written during the time the writer lived in Paris. They are not about Paris. Nowhere on the cover, back or blurb does it say that. It's in the (long-ish) introduction that most of us won't read before we buy a book in a bookstore, and we obviously can't read when we buy online. Ondaatje sort of apologizes for it, saying that the writer herself eased his mind by saying that technically, they ARE Paris stories because they're written there. I say, technically, it's misleading and disappointing, especially for me, having bought this book not because of the writer but because of the subject.But, always willing to be introduced to new writing, I started reading. I have read three stories. And I will not read any more. I can say the stories are beautifully written - there aren't many writers like this. But the stories don't go anywhere. They have no beginning, no end, they're merely a description of random parts of people's lives. They are written in a way that you think there will be a climax, a secret revealed, an understanding dawning... but unless I'm particularly thick, there's nothing to understand, no hidden clue. They're very low-paced and drawn-out descriptions of uneventful lives. Well-written ones. But I couldn't help feeling a bit betrayed after each ending - like three unkept promises in a row."}, {"review_sentiment": 5.0, "review_text": "Accurate description. Timely delivery."}]}, "authors": ["Mavis Gallant"], "isbn": "1590170229", "longitude": 2.3514992, "periods": ["1900s", "Recent Releases"], "title": "Paris Stories", "word_cloud": "high hope largely glow preface admire gallant tend ponderous style prose pace write time place discount quality fact virtue scar whole collection find constantly search person pulse find write write well therein central problem solidify set place breathe make suffocate read short good okay brilliant writer thoughtful sentence world meaning insight quickly mean savored deep understand empathy life immigrant writer lover shimmer page uplift make better read timeless work think write come close style approach impressive collection lovely nuanced write intrigue character backstories wish flesh wonderfully write introspective human being love life short story take totally different subject gallant reveal rare acute emotional intelligence render perfect unpretentious prose love whole series volume ipad nearly year download preparation week soon discover novella do even breeze pot gold nugget something savor cherish long full rich language plot line interest unique so take almost year finish say box exotic chocolate sit need savor page page excuse mixed metaphor lot page get edition save weight fit snug lap away soft feather bed hotel anyone see traveler serious potential writer experienced amazing surprise rather good review guess beauty different important disappointment fact title mean write time writer live back blurb say introduction bookstore obviously online sort apologize say writer ease mind say technically write say technically mislead disappoint especially buy writer always willing introduce new writing start read say beautifully write many writer go anywhere begin end merely description random part people live write way think climax secret reveal understanding dawn particularly thick nothing understand hide clue descriptions uneventful life one feel bit betrayed end unkempt promise row description timely delivery", "genres": ["Fiction & Literature"], "summary": "New York Review Books Classics\r\n\r\nInternationally celebrated, award-winning author Mavis Gallant is a contemporary legend: an undisputed master of the short story whose peerless prose captures the range of human experience while evoking time and place with unequalled skill. \r\n\r\nThis new selection of Gallant’s stories, edited by novelist and poet Michael Ondaatje, gathers the best of her many stories set in Paris, where Gallant has long lived. Here she writes of expatriates and locals, exile and homecoming, and of the illusions of youth and age, offering a kaleidoscopic impression of the world within the world that is Paris.", "asin": "1590170229", "rank": "331005", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/61LlQFg9S1L.jpg", "country": "France", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}