{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 7, "rating": 3.2, "reviews": [{"review_sentiment": 2.0, "review_text": "It got boring and couldn't figure out the real plot."}, {"review_sentiment": 4.0, "review_text": "The story is to some extent in the range of exageration but in total the characters are reality. I could enter and understand the motivation."}, {"review_sentiment": 3.0, "review_text": "This book is about three lonely, lost souls trying to find their place in the world. Noah, Joyce and an unnamed bookstore owner are all misfits who are connected in ways they do not realize and whose lives have a lot of parallels to each other, even if they are not conscious of each other. All three of them were raised by a single parent and they all have, for one reason or another, distanced themselves from their families and are making their way in the world alone. They all are searching for meaning in their lives and, in that vein, all have a fascination with their roots and ancestry. All of them have a strong connection to maps and/or travel guides. They all have a fascination with trash or discarded objects in one way or another. The bookstore owner sells used books, even ones that others have thrown away, Noah majors in archaeology with a fascination for the archeaology of trash, and Joyce becomes a trash-diving treasure hunter as part of her quest to become an cyber-pirate.The three story lines, although they intersect only tangentially, flow beautifully and the language is very lyrical (which is very interesting given that this book was translated from French and translations usually are a bit stilted). Of the three, my favorite character was Noah. He is so sweet and earnest and was a bit more focused and in control of his destiny than the other two. Although I adore books, bookstores and used bookstores in particular, I found it a little hard to relate to the bookstore owner because he is never identified by name and the author (perhaps deliberately) keeps the reader more distant from him. Joyce is a very interesting character but not quite as empathetic as Noah.Overall, this was an excellent first novel by Nicholas Dickner. He has a real flair for character development and for seamlessly incorporating quirky traits and elements into the story (the archaeology of trash being only one example). I will look forward to reading future books by him."}, {"review_sentiment": 4.0, "review_text": "Nikolski is a entertaining read.  The book follows several characters who at some point own or possess the same book. My only complaint - I expected the lives to intertwine or somehow be impacted by the book more. Definitely worth reading though."}, {"review_sentiment": 4.0, "review_text": "Every character in this light comedy-satire seems to be fishing for something, although not necessarily fish or even in water. Yet, most places where the action takes place are somehow located on islands:  Montreal Island, Stevenson Island, and an island off the Venezuelan coast. Finally, and not to be overlooked the \"magnetic north\" and the title of the novel, Nikolski, a village one of the small Aleutian islands off Alaska.  Sounds a bit like a mystery story? In a way, yes, as first time Quebec novelist Nicolas Dickner spins a delightful yarn around his three primary characters, either moving to or through and/or living in Montreal until...Noah, who, until he was eighteen, lived with his mother a nomadic life in a trailer, crisscrossing the western regions of Canada, arrives in Montreal to study archaeology and discovers the \"archaeology of trash\" as an intriguing topic, \"trash being the artifacts of civilization\" and much \"fishing\" is involved.  Joyce, from a long line of Doucettes of dubious reputation in Atlantic Canada, pursues her ambitions to live up to the family's tradition and to become a modern-day pirate. She also goes on fishing expeditions, but of a different kind: she scrounges through industry trash to find all the bits needed to get a workable computer built and much more... Finally, a first person narrator of a kind, who runs a second-hand bookshop also has some fishing to do...Do these characters link together in some way? Are the connections stronger than strangers meeting in the night? It is for the reader to find out.  The author introduces some secondary characters, charming in their own way, who may have to offer some clues or provide connections.  Along the way, Dickner's easy-going, ironic style hits a few punches at Canadian multicultural society and the modern way of life.  His descriptions are off-beat yet apt, whether he describes certain areas of Montreal or of one of the other islands in the novel.  The novel won the 2010 Canada Reads competition, and the sensitive and lively English translation won a major Canadian award.  3.5 stars [Friederike Knabe]"}, {"review_sentiment": 4.0, "review_text": "Some books make you feel; other books make you think.Nicolas Dickner's clever debut, Nikolski, definitely falls largely into the latter category. As a matter of fact, it still has me turning over its intricacies in my head months after I've finished it. This tightly woven tale is packed with ideas that challenge the customary thinking about the nature of personal identity. Dickner asks if who we are is a result of nature or nurture, genealogy or geography, or, perhaps, a combination of all four.Early in the story, we are introduced to the three main characters, all distantly related, although not necessarily aware of one another's existence. They are the unnamed narrator - a second hand bookshop clerk who is in possession of a compass that always points in the direction of Nikolski, a tiny Aleutian Island, Noah - son of an itinerant Native American mother and absentee father, who learned to read from roadmaps and Joyce - a restless young woman descended from a family of French-Canadian pirates. The three stories unfold in alternating chapters as each begins a pilgrimage to unearth their family connections, seek their place in the world, establish their destinies and find themselves.Like the Nikolski compass, the writer postulates that all people have a built-in homing instinct. A family of Dominican fishmongers (who rent a room to Noah and employ Joyce in their retail shop), despite being long time residents of Canada, hold a monthly \"jututo\" to enjoy their native foods and boisterously debate Dominican politics. And humorously, we see how Joyce (and her erstwhile mother) inadvertently fall into a twentieth century version of the family business - as computer pirates. Ties to place, ethnicity and family not only dictate our actions, but define who we are.This was a deceptively easy and enjoyable read. There was a certain sense of mystery, plus a fair bit of suspense, that pulled me along until the end. It's particularly impressive to see how the author weaves all the threads together. Much like the \"three-headed book\" that passes through the hands of both Noah and Joyce, before ending up on the bookstore's shelves, Dickner manages to stitch three disparate stories into one cohesive, and endlessly captivating, whole. Definitely one of a kind."}, {"review_sentiment": 4.0, "review_text": "In Nikolski, Dickner tracks the lives of three wandering characters whose lives cross--and who share a family tree--but who do not really interact with each other to any great extent.  The narrative jumps quickly between the various characters; most chapters are no more than a couple pages.  This lends a feeling of disjointedness to the novel, but that mimics some of the disjointedness of the characters themselves.  The characters share more than a family tree, as Dickner weaves similar motifs into all of their stories.  For example, one character wants to be an archaeologist of garbage who learned to read by looking at maps as he and his mother traversed Canada throughout his essentially homeless childhood.  Another steals discarded computer parts from corporate dumpsters and computer books from a used bookstore.  The unnamed narrator works in said bookstore and owns a compass that does not point north, but instead points toward the tiny island of Nikolski where his own father had died.Dickner also makes sure to pay homage to his literary precursors.  Most significantly, the novel has an ongoing conversation with Moby Dick (the novel opens with the narrator telling us \"My name is not important.\").  Melville's work appears at several other key points in the novel, as if the search for the white whale was somehow a parallel for the lives of these characters.  The parallel, though, never really quite works out, and some of the other recurrent allusions to authors like Dante and Joyce are left undeveloped.  Those are minor weaknesses in an otherwise strong novel.  I'll be looking forward to more of Dickner's work in the future."}]}, "authors": ["Nicolas Dickner"], "isbn": "1590307143", "longitude": -73.6103642, "periods": ["1900s", "Recent Releases"], "title": "Nikolski: A Novel", "word_cloud": "get bore real plot story extent range exaggeration total character reality understand motivation lonely lose soul try place world unnamed bookstore owner misfit connect way realize life lot parallel even conscious raise single parent reason distanced family make way world alone search mean life vein fascination root ancestry strong connection map travel guide fascination trash discard object way bookstore owner sell use even one others throw away major archaeology fascination archaeology trash become treasure hunter part quest become story line intersect tangentially flow beautifully language lyrical interest give translated french translation usually bite stilted favorite character sweet earnest bit focus control destiny adore bookstore use bookstore particular find little hard relate bookstore owner never identify name author perhaps deliberately keep distant interesting character quite empathetic excellent first real flair character development seamlessly incorporate quirky trait element story archaeology trash example look forward reading future entertain follow several character point posse complaint expect life somehow impacted worth read character light seem fish something necessarily even water place action take place somehow locate island island coast overlook magnetic north title village small aleutian island bit mystery story way first time novelist spin delightful yarn primary character move live eighteen live mother nomadic life trailer crisscross western region arrive study archaeology discovers archaeology trash intriguing topic trash artifacts civilization much fishing involve long line couchettes dubious reputation pursue ambition live family tradition become pirate also go fishing expedition different kind scrounges industry trash find bit need get workable computer build much first person narrator kind run bookshop also fish character together way connection stronger stranger meet night find author introduces secondary character charm way clue connection way ironic style hit punch canadian multicultural society modern way life description yet apt describes certain area islands competition sensitive lively english translation major canadian award star make feel make clever debut definitely fall largely latter category matter fact still turn intricacy head month finish tightly weave tale pack idea challenge customary thinking nature personal identity ask result nature nurture genealogy geography perhaps combination story introduce main character distantly relate necessarily aware existence unnamed narrator second hand bookshop clerk possession compass always point direction tiny son itinerant native american mother absentee father learn road maps restless young woman descend family pirate story unfold alternate chapter begin pilgrimage unearth family connection seek place world destiny find nikolai compass writer postulate people home family fishmonger rent room employ retail shop long time resident hold monthly jututo enjoy native food boisterously debate politics humorously mother inadvertently fall twentieth century version family business computer pirate tie place ethnicity family dictate action define deceptively easy enjoyable certain sense mystery fair bit suspense pull along particularly impressive see author weave thread together much pass hand end bookstore shelf manage stitch disparate story cohesive endlessly captivate whole definitely kind track life wander character life cross share family tree really interact great extent narrative jump quickly various character chapter couple page lend feel disjointedness mimic disjointedness character character share family tree weave similar motif story example character want archaeologist garbage learn look map mother traverse essentially homeless childhood steal discard computer part corporate dumpster computer use unnamed narrator work say bookstore own compass point north instead point tiny island father also make sure pay homage literary precursor most significantly ongoing conversation open narrator tell name work appear several key point search white whale somehow parallel live character parallel never really quite work recurrent allusion author leave undeveloped minor weakness otherwise strong look forward work future", "genres": ["Fiction & Literature"], "summary": "Spring 1989. Three young people leave their far-flung birthplaces to follow their own songs of migration. Each ends up in Montreal, each on a voyage of self-discovery, dealing with the mishaps of heartbreak and the twisted branches of their shared family tree.\r\n\r\nFilled with humor, charm, and good storytelling, this novel shows the surprising links between cartography, garbage-obsessed archeologists, pirates past and present, a mysterious book with no cover, and a broken compass whose needle obstinately points to the Aleutian village of Nikolski (a minuscule village inhabited by thirty-six people, five thousand sheep, and an indeterminate number of dogs).", "asin": "1590307143", "rank": "2335303", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/51beSm%2BjaQL.jpg", "country": "Canada", "story_arc": ["Tragedy", "Things only get worse"]}