{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": -34.6075616, "ratings": {"num_ratings": 64, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "ok"}, {"review_sentiment": 3.0, "review_text": "Not as good as most of the earlier novels but the next one in the series is starting offf to a great start"}, {"review_sentiment": 5.0, "review_text": "Another swashbuckling adventure featuring two interesting main characters. I've read each of the novels to this point"}, {"review_sentiment": 4.0, "review_text": "This is the fourth book about Captain Kydd that I've read, (the previous were \"Kydd\", \"Artemis\" and \"Victory\") and this was my favorite. The story is about an ill-fated British attack on Spanish held Buenos Aries during the Napoleonic Wars. I'd never heard much about this expedition before, so it was a welcome change of pace from my usual reading on the naval history of the time. The story was well told with interesting characters, both real and fictional. Kydd, the main character is engaging and believable as he finds himself pulled, first willingly and then with reservations, on the unauthorized expedition. And, unlike most books in this genre, Kydd is capable of making mistakes. My only complaint was at the end, Stockwin seemed to be rushing to complete the book. Otherwise I enjoyed it and will look forward to reading more of his work."}, {"review_sentiment": 4.0, "review_text": "another very readable book....."}, {"review_sentiment": 5.0, "review_text": "Everything as expected thank you"}, {"review_sentiment": 2.0, "review_text": "I love this genre.. and normally when I start reading a series I continue almost uninterrupted until the final book. The Kydd series however continues to be a struggle. The early few books were great. Since then it has been hit or miss with some books so bad I stop reading the series for a while.  I am 7 years into the series and still have not reached the current book.. the reason is that books like this one totally knock the wind out of my sail..  It is slow, boring, the dialogue is totally over the top and I continue to struggle to even like the main character. The way he deals with others makes him unlikable.  After this dreadful book, it will likely be a while before I read the next."}, {"review_sentiment": 5.0, "review_text": "I've read a variety of authors who wrote about the 'sailing navy'...C.S. Forester ( Hornblower series) Alexander Kent (R. Bolitho series); Dudley Pope (Lord Ramage), etc.  I find Julian Stockwin's books on Thomas Kydd to as enjoyable as the others.  The books are entertaining and well presented.  I find myself waiting for additional books in the series (although I don't know if any more are in the works.)"}, {"review_sentiment": 4.0, "review_text": "No problems"}, {"review_sentiment": 4.0, "review_text": "The plot was very predictable from the start and got rather bogged down along with the mud flat."}]}, "authors": ["Julian Stockwin"], "isbn": "1590136551", "longitude": -58.437076, "periods": ["1800s", "Recent Releases"], "title": "Betrayal: A Kydd Sea Adventure", "word_cloud": "ok not good earlier novel series start off great start swashbuckling feature interesting main character novels point fourth previous favorite story british attack spanish hold never hear much expedition welcome change pace usual reading naval history time story well tell interest character real fictional main character engage believable find pull first willingly reservation unauthorized expedition genre capable make mistake complaint end seem rush complete enjoy forward reading work readable everything expect thank love normally start read series continue almost uninterrupted final series however continue struggle early great hit miss bad stop read series year series still reach current reason totally slow bore dialogue totally top continue struggle even main character way deal others make unlikable dreadful likely next variety author write navy series series find julian enjoyable others entertain well present find wait additional series know work problem plot predictable start get rather bogged mud flat", "genres": ["Fiction & Literature", "Historical Fiction", "Action & Adventure"], "summary": "Book 13/15 in Kydd Sea Adventures \r\n\r\nCape Colony is proving a tiresome assignment for Captain Kydd's daring commander-in-chief Commodore Popham. Rumours that South America's Spanish colonies are in a ferment of popular unrest and of a treasure hoard of silver spur him to assemble a makeshift invasion fleet and launch a bold attack on the capital of the Viceroyalty of the River Plate, Buenos Aires.\r\n\r\nNavigating the treacherous bars and mud flats of the river, the British invasion force lands and wins a battle against improbable odds, taking the capital and the silver. But nothing is as simple as it seems in this region of the world: the uprising that will see the end of Spanish rule never arrives and the locals begin to see dark conspiracies behind the invader's actions. Soon the tiny British force finds itself surrounded by an ever more hostile population. The city begins to revolt against its liberators.\r\n\r\nNow Kydd's men must face fierce resistance and the betrayal of their closest allies. Can they save themselves, and their prize?\r\n\r\n'Stockwin, who based this tale on a factual debacle easily overlooked by history, is a master of Napoleonic-era atmosphere and rich descriptions of the military, politics, and society. With the last two books, Stockwin's series is approaching the level of C.S. Forester's Hornblower books.' Publishers Weekly", "asin": "1590136551", "rank": "1428795", "city": "Buenos Aires", "image": "https://images-na.ssl-images-amazon.com/images/I/51yAjCSYYoL.jpg", "country": "Argentina", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}