{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 15.593325, "ratings": {"num_ratings": 59, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Good book needed it for my literature class"}, {"review_sentiment": 4.0, "review_text": "This book presents the sweet and rough sides of Sudanese society in a way that only a local author could describe it.  While the central story (the story within the story of Mustafa Saed) is somewhat blurry and not fully resolved in the book (at least for this reader), the contextual story developed by the narrator, including descriptions of family life and landscapes, are beautiful and riveting.  My book club read it in combination with \"Heart of Darkness,\" because Mr. Salib was inspired in part by Conrad's tale of pain and despair in the collision between two very different cultures."}, {"review_sentiment": 5.0, "review_text": "An all-time favorite. Some of the best prose work I've ever read."}, {"review_sentiment": 5.0, "review_text": "Loved this book!"}, {"review_sentiment": 5.0, "review_text": "This novel is a must read!"}, {"review_sentiment": 4.0, "review_text": "Good writer, first time reading one of his novels. Great background on African culture"}, {"review_sentiment": 3.0, "review_text": "This novel is very well written and has a flowing style.  The story centers around two main characters who both leave Sudan to study in London with very different results.  These men seem to be stuck in one of two modes, aggression or apathy.The story addresses several themes during the course of the book.  They key theme is the after affects of Colonialism on a country and its people.  The novel shows a lot of brutality toward women.  There is some playful character development in a group of the village elders, however, the book overall is not one that will leave you uplifted or whistling a happy tune at its conclusion. I read the English translation, in which the translator worked extremely closely with the author, however, there is also one in Arabic which is said to have beautiful wording.  My suggestion would be to read this book  if you are interested in this topic, otherwise, you may find something of more interest elsewhere."}, {"review_sentiment": 5.0, "review_text": "A must read!"}, {"review_sentiment": 3.0, "review_text": "When all is said and done ,I enjoyed reading this book but it has some issues.It's confusing at points, disjointed and episodic.It's overly symbolic and arguably misogynistic.Yet , it grabs you primarily with its gripping depiction of village life near the Nile in north Sudan.At the heart of the book is a mystery of sorts, the story of Mustafa Saeed.Saeed is both an intriguing character and a problem.The author makes him carry too much weight. Saeed is a symbolic figure for the impact of western colonialism on the third world.This takes some decidedly strange paths including - no joke - a journey into sado- masochism with a pronounced necrophiliac edge.I find it hard to believe that a reader could encounter some of this and not say - oh come on ! Still , when the author sticks to the earth , he gives you some rather well wrought social realism.Already in the '50s you're encountering  the massive corruption of the new ruling elite.In a village apparently dominated by something called the National Socialist Democratic Party, the old mores are completely in force, especially when it comes to women.Women are property , to be disposed of accordingly.I was also intrigued by the casual attitude toward drinking.Sudan would  later come to be dominated by a strain of repressive Islamic \"fundamentalism\" that if this novel is any indication was essentially imported.So all and all , worth while."}, {"review_sentiment": 5.0, "review_text": "One of my favorite novels."}]}, "authors": ["Tayeb Salih"], "isbn": "1590173023", "longitude": 32.53565, "periods": ["1900s"], "title": "Season of Migration to the North", "word_cloud": "good need literature class present sweet rough side sudanese society way local author central story story story somewhat blurry fully resolve least contextual story develop narrator include description family life landscape beautiful rivet club combination inspire part tale pain despair collision different culture favorite best prose work ever love good writer first time read novel background african culture well write flow style story center main character leave study different result men seem stick mode aggression story address several theme course key theme affect country people show lot brutality woman playful character development group village elders however overall leave uplift whistle happy tune conclusion english translation translator work extremely closely author however also say beautiful word suggestion topic otherwise something interest elsewhere say do enjoy read confuse point disjoint overly symbolic arguably grab primarily grip depiction village life heart mystery sort story intriguing character author make carry much weight symbolic figure impact western colonialism third take decidedly strange path include joke journey masochism pronounce necrophiliac find hard believe still author stick earth give rather well wrought social encounter massive corruption new ruling village apparently dominate something call old more completely force especially come property dispose also intrigue casual attitude later dominate strain repressive fundamentalism indication essentially worth favorite novel", "genres": ["Fiction & Literature"], "summary": "New York Review Books Classics\r\n\r\nAfter years of study in Europe, the young narrator of Season of Migration to the North returns to his village along the Nile in the Sudan. It is the 1960s, and he is eager to make a contribution to the new postcolonial life of his country. Back home, he discovers a stranger among the familiar faces of childhood—the enigmatic Mustafa Sa’eed. Mustafa takes the young man into his confidence, telling him the story of his own years in London, of his brilliant career as an economist, and of the series of fraught and deadly relationships with European women that led to a terrible public reckoning and his return to his native land.\r\n\r\nBut what is the meaning of Mustafa’s shocking confession? Mustafa disappears without explanation, leaving the young man—whom he has asked to look after his wife—in an unsettled and violent no-man’s-land between Europe and Africa, tradition and innovation, holiness and defilement, and man and woman, from which no one will escape unaltered or unharmed.\r\n\r\nSeason of Migration to the North is a rich and sensual work of deep honesty and incandescent lyricism. In 2001 it was selected by a panel of Arab writers and critics as the most important Arab novel of the twentieth century.\r\n\r\n“This depthless, elusive classic …explores not just the corrosive psychological colonisation observed by Frantz Fanon, but a more complex two-way orientalism, in which the charms of western thought, embodied in its poetry and liberal ideals, prove irresistible, even as the novel’s Sudanese narrators understand these as the tempting fruit of a poisoned tree.” The Guardian ", "asin": "1590173023", "rank": "44215", "city": "Khartoum", "image": "https://images-na.ssl-images-amazon.com/images/I/51r-xvrrxcL.jpg", "country": "Sudan", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}