{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 47.4983815, "ratings": {"num_ratings": 371, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "This is a great book and I am so happy I can buy this for my non-Hungarian friends so they can read some Hungarian literature. She was a great author, I wish there would be more of her books in English here. Do not expect something cheerful though - it is somewhat depressing. If that does not bother you, I definitely recommend going for it. It is about the relationship between a writer and her cleaning lady. Nothing kinky, to me it is about human relationships, and about how hard it is to care about one another when we are so different."}, {"review_sentiment": 3.0, "review_text": "Well written but not compelling"}, {"review_sentiment": 5.0, "review_text": "A sad, funny, tragic human story,, populated with interesting characters and wonderfully well written.  It gripped my imagination and took hold of my heart.  A book to savor, to learn from and to treasure."}, {"review_sentiment": 5.0, "review_text": "Beautifully written (pure prose)!  It is initially a deceptively simple story of basically 5 characters, 2 major ones, that takes place mostly on 1 street.  But of course, it turns into a tumultuous, wrenching life history (just like the volatile history of their country, Hungary).  The main 2 characters are vivid, complex, interesting and you care an awful lot about both. The period in question has flash backs to WW1 to present day.  Great book."}, {"review_sentiment": 5.0, "review_text": "Very interesting read."}, {"review_sentiment": 2.0, "review_text": "Very repetitive and not very holding after the first 100pages. It was a translation which could be the problem but I do not recommend it."}, {"review_sentiment": 5.0, "review_text": "Such a great story. I wish more books were translated into English...or that I knew how to read all the languages of the world. I'm glad someone took the time to translate this one."}, {"review_sentiment": 5.0, "review_text": "This book woke me at night to think about its characters. The principal, an elderly woman named Emerence, defies description: incisively intelligent without formal education, domineering, dignified in servitude, unsentimentally loving, selfless to death. She shadows more intelligible figures in her Hungarian town, including the intelligentsia, politicians, and the petty bourgeoisie who survived the horrors of the 20th century. In the process, she is completely without peers. Each person seems to understand her and interact with her in a unique way, revealing as much about their own weaknesses as about her strengths. At the center is an archetype: a woman who is completely incapable of understanding selflessness and love in their truest sense, and who surrenders everything to ambition. The novel is written with crushing intensity and a great feel for provincial life. This is the first work I've read by Szabo, and I'm sorry I got to the party so late."}, {"review_sentiment": 1.0, "review_text": "This book is so well reviewed, but I found it boring. Both main characters were unlikeable. I guess it was just me."}, {"review_sentiment": 5.0, "review_text": "Really gripping plot...enjoyed this book."}]}, "authors": ["Magda Szabo"], "isbn": "1590177711", "longitude": 19.0404707, "periods": ["1900s"], "title": "The Door", "word_cloud": "great happy buy friend hungarian literature great author wish something cheerful somewhat depress bother definitely recommend go relationship writer clean lady kinky human relationships hard care different well write compelling sad funny tragic human story populate interesting character wonderfully well write grip imagination take hold heart savor learn treasure beautifully write pure initially deceptively simple story basically character major one take place mostly street course turn tumultuous wrench life history volatile history country main character vivid complex interesting care awful lot period question flash back present day very interesting very repetitive hold first translation problem recommend such great story wish translated know language world glad someone take time translate wake night think character principal elderly woman name defies description incisively intelligent formal education domineer dignify servitude unsentimental love selfless death shadow intelligible figure hungarian town include intelligentsia politician petty bourgeoisie survive horror century process completely peer person seem understand interact unique way reveal much weakness strength center archetype woman completely incapable understand selflessness love truest sense surrender everything ambition write crushing intensity great feel provincial life first work sabot sorry get party late well review find bore main character unlikable guess really grip plot enjoy", "genres": ["Fiction & Literature", "WWII"], "summary": "One of The New York Times Book Review's \"10 Best Books of 2015\"\r\n\r\nAn NYRB Classics Original \r\n\r\nThe Door is an unsettling exploration of the relationship between two very different women. Magda is a writer, educated, married to an academic, public-spirited, with an on-again-off-again relationship to Hungary’s Communist authorities. Emerence is a peasant, illiterate, impassive, abrupt, seemingly ageless. She lives alone in a house that no one else may enter, not even her closest relatives. \r\n\r\nShe is Magda’s housekeeper and she has taken control over Magda’s household, becoming indispensable to her. And Emerence, in her way, has come to depend on Magda. They share a kind of love—at least until Magda’s long-sought success as a writer leads to a devastating revelation. \r\n\r\nLen Rix’s prizewinning translation of The Door at last makes it possible for American readers to appreciate the masterwork of a major modern European writer.\r\n\r\n“The Door tells a great deal about the sufferings of 20th-century Hungary through the heart and mind of a single fearless woman, as Magda is taught by example to consider her own inadequacies. Magda Szabó’s great book was published in Hungary as long ago as 1987; Len Rix’s fluent translation is a belated and welcome gift to readers in English...profoundly moving.” The Independent", "asin": "1590177711", "rank": "21330", "city": "Budapest", "image": "https://images-na.ssl-images-amazon.com/images/I/415rbk9Z1VL.jpg", "country": "Hungary", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}