{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 72, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Well written, interesting, stories. A somber tone, overall, but highly recommended."}, {"review_sentiment": 5.0, "review_text": "Eerie,unsettling, and tightly written stories. Great."}, {"review_sentiment": 4.0, "review_text": "It was suspenseful and just long enough for a short story!!"}, {"review_sentiment": 5.0, "review_text": "Read du Maurier years ago and am finding each of these stories dramatic, fresh, and strangely modern. Don't Look Now still packs a wallop, even if you know the conclusion."}, {"review_sentiment": 5.0, "review_text": "I like a good mystery, and this one does not disappoint.  Moreover, I like her writing: clear, crisp, with well constructed sentences and paragraphs.  I read REBECCA but have waited too long to read other mysteries by this fine writer."}, {"review_sentiment": 3.0, "review_text": "I was looking for the short story, The Birds.  Its not in this volume"}, {"review_sentiment": 5.0, "review_text": "Loved it. What an amazing writer! Very scary in an intelligent, believable, nightmarish way. Very creepy."}, {"review_sentiment": 5.0, "review_text": "Gripping, absolutely gripping – my listening to three Daphne du Maurier tales on audio: No Motive and two from this collection, Don’t Look Now and the author’s famous The Birds. Each reading spanning an hour and a half, the storytelling so compelling, picking up dramatic momentum every single minute, I dare not take a break until the shocking conclusion. And to add a bit more atmosphere to my listening to The Birds, out my apartment window, down at the pond, a gaggle of Canadian Geese started honking and fighting and honking some more.Patrick McGrath writes in his astute Introduction to this New York Review Books (NYRB) edition how Daphne du Mauier possessed an uncanny genius to craft her stories in ways to sustain tension right up until the the final sentence, an ending frequently shocking and disturbing in the extreme. I enjoyed each of the nine pieces collected here but two most especially: Don’t Look Now with its clairvoyant older twins and creepy happenings and the story serving as the focus of my review: The Birds. And please don't think of the Hitchcock film - other than attacking birds and terrorized humans, Daphne du Maurier's tale is a hundred shades darker, incomparably more ominous and threatening, even to the point of impending cataclysm for the entire human race.THE BIRDS“Black and white, jackdaw and gull, mingled in strange partnership, seeking some sort of liberation, never satisfied, never still. Flocks of starlings, rustling like silk, flew to fresh pasture, driven by the same necessity of movement, and the smaller birds, the finches and the larks, scattered from tree to hedge as if compelled.” Handyman Nat Hocken lives in remote farming country out on a peninsula in England and remarks to one of the farmers how there’s something quite strange about all the bird behavior this autumn. Just how strange? Nat finds out very quickly when that very night birds enter the bedroom window of his little son and daughter, dozens of little birds, attacking both of them, trying to peck out his son’s eyes. Nat takes immediate action, gets his children out of the room, closes the door, and frantically swings a pillow left and right, up and down, to kill as many birds as he can.The next morning: “Nat gazed at the little corpses, shocked and horrified. They were all small birds, none of any size, there must have been fifty of them lying there upon the floor. There were robins, finches, sparrows, blue tits, larks, and bramblings, birds that by nature’s law kept to their own flock and their own territory, and now, joining one with another in their urge for battle, has destroyed themselves against the bedroom walls, or in the strife had been destroyed by him.” And this is only the beginning. Later that day Ned is attacked by bigger birds out in a field and, after he races home for protection, both he and his wife hear on the radio that the government of England has called a state of emergency, advising all citizens to remain inside and take the necessary precautions to ensure their safety. But, above all else, people are urged to remain calm.Fun facts: there exists almost ten thousand different species of birds and according to some experts, the total worldwide bird population could total as many as four-hundred-billion. Whoa! Four-hundred-billion. No matter how you look at it, that’s a lot of birds. Imagination what would happen if, as if directed and coordinated by some unseen unifying force, all those birds began an attack en masse on humans.Slovenian philosopher and cultural critic Slavoj Žižek believes the author was targeting the prevailing welfare state for their inability to effectively deal with the attacking birds. Patrick McGrath notes how du Maurier’s story anticipates a global ecological disaster. I myself think McGrath is on the mark and Žižek is way off the mark. As Nat Hocken asserts, survival, at least immediate survival, has everything to do with the sturdiness of the one's shelter. Sorry, Slavoj - politicians of any stripe will be of little help in fending off a nonstop attack conducted by billions of birds.Daphne du Maurier delves into the unsettling psychology produced by such an attack. Almost to be expected, initial reactions revolve around denial and rationalization. Very understandable since the cycle of human existence is completely dependent on the laws of nature. And the more we understand the laws of nature, the more we feel we are in control. Herein lies the terror of the tale – the laws of nature remain intact with one glaring exception: the behavior of the birds. All of a sudden nature has transformed itself into the unknown. As writers such as H.P. Lovecraft recognized, there is no stronger human emotion than fear and no great fear than fear of the unknown.As per the well-worn admonition, “Don’t just stand there, do something!” humans being humans, there is a natural instinct to take action. Upon hearing a roaring sound, Nat reflects how the authorities have sent out airplanes but knows this is sheer suicide since aircraft would be useless against thousands and thousands of birds flinging themselves to death against propellers, fuselages and jets.Then Nat hears another sound, a sound prompting him to have one last smoke: “The hawks ignored the windows. They concentrated their attack upon the door. Nat listened to the tearing sound of splintered wood, and wondered how many million years of memory were stored in those little brains, behind the stabbing beaks, the piercing eyes, now giving them this instinct to destroy mankind with all the precision of machines.” Did I mention gripping? I can assure you, you will never encounter a more chilling, spellbinding, mesmerizing tale then this one. Darn, down at the pond, those Canadian Geese are still honking up a storm. But no attacks on humans have been reported . . . yet."}, {"review_sentiment": 5.0, "review_text": "Some good suspense stories in here. Very, very strange."}, {"review_sentiment": 5.0, "review_text": "Love all things du Maurier, plus enjoy short stories and novellas - especially in the genre of strange. This is the first collection that successfully filled the void after I'd devoured everything by R. Aichman.  Read this collection years ago, but remembered little enough to make it totally worth the revisit. Am ready to re-read all her novels now!"}]}, "authors": ["Daphne Du Maurier"], "isbn": "1590172884", "longitude": 12.3345898, "periods": ["1900s"], "title": "Don't Look Now: Selected Stories", "word_cloud": "well write interesting somber tone overall highly recommend unsettle tightly write suspenseful long enough short story dew year ago find dramatic fresh strangely modern now still pack even conclusion like good mystery disappoint moreover like write clear crisp well constructed sentence paragraph wait long mystery fine writer look short story volume love amazing writer scary intelligent believable nightmarish way creepy grip absolutely grip listen tale audio collection now author famous read span hour half storytelling compel pick dramatic momentum single minute dare break shock conclusion bit atmosphere listen apartment window pond gaggle start honk fight honk write astute edition dew possess uncanny genius craft way sustain tension right final sentence end frequently shock disturb extreme enjoy piece collect especially now clairvoyant older twin creepy happening story serve focus review film attack bird terrorize human dew tale hundred shade darker incomparably ominous threaten even impend cataclysm entire human white jackdaw gull mingle strange partnership seek sort liberation never satisfy never still starling rustle silk fly fresh pasture drive necessity movement smaller bird finch lark scatter tree hedge live remote farm country peninsula remark farmer something quite strange bird behavior autumn strange find quickly night bird enter bedroom window little son daughter dozens little bird attack try peck son eye take immediate action get child room close door frantically swing pillow leave right many bird morning gaze little corps shock horrify small bird none size lie floor robins finch sparrows blue tit lark ramblings bird nature law keep flock territory join urge battle destroy bedroom wall strife destroy begin day attack bigger bird field race home protection wife hear radio government call state emergency advise citizen remain inside take necessary precaution safety else people urge remain fact exist almost ten different specie bird accord expert total worldwide bird population many matter lot bird direct coordinated unseen unify force bird begin philosopher cultural critic believe author target prevail welfare state inability effectively attack bird note dew story anticipate global ecological disaster think mark way mark assert survival least immediate survival everything sturdiness shelter politician stripe little help fend nonstop attack conduct billion dew delf unsettle psychology produce attack expect initial reaction revolve denial rationalization understandable cycle human existence completely dependent law nature understand law nature control lie terror tale law nature remain intact glare exception behavior bird sudden nature transform unknown writer recognize stronger human emotion fear great fear fear admonition stand something human humans natural instinct take action hear roar sound reflect authority send airplane know sheer suicide aircraft thousand thousand bird fling death propeller fuselages hear sound sound prompt last smoke hawk ignore windows concentrate attack door listen tear sound splinter wood wonder many year memory store little brain stab beak pierce eye give instinct destroy mankind precision mention grip assure never encounter chill spellbind mesmerize tale pond still honk storm attack human report yet good suspense strange thing dew short novellas especially genre strange first collection successfully fill void devour everything collection year ago remember little enough make totally worth revisit ready novel", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "John and Laura have come to Venice to try and escape the pain of their young daughter's death. But when they encounter two old women who claim to have second sight, they find that instead of laying their ghosts to rest they become caught up in a train of increasingly strange and violent events.\r\n\r\nThe four other haunting, evocative stories in this volume also explore deep fears and longings, secrets and desires: a lonely teacher who investigates a mysterious American couple, a young woman confronting her father's past, a party of pilgrims who meet disaster in Jerusalem and a scientist who harnesses the power of the mind to chilling effect.", "asin": "1590172884", "rank": "73008", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51ukbSQ4khL.jpg", "country": "Italy", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}