{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 47.4983815, "ratings": {"num_ratings": 34, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "A memoir written by a young aspiring artist who is conscripted into the Austrian Hungarian army at the outbreak of WWI, The Burning Of The World is a poignant and somewhat unique view into how people in the Eastern theater of operations experienced the Great War. Having read other first hand accounts typically dealing with the Western Front I found this book fascinating both historically and from the personal depth of the writers observations as his unit is decimated by the Russian army very early in the conflict and he returns home to Budapest and tries to adjust to a new reality. A short work that deserves a wide readership."}, {"review_sentiment": 4.0, "review_text": "There’s a war brewing in Europe.For years, centuries, millennia these words have been repeated; farmers and peasants and priests and citizens, mercenaries and nobles – Europe has been at war forever. The 20th century saw maybe the worst of it – although only by degrees. The First World War, the 2nd – the cold war, gulags and concentration camps and mass starvation, a war against not only the body but also the mind. The shattering of Yugoslavia – pieces flying every which way. The Armenians – nobody ever talks about them, do they? Not politically correct, I suppose, to mention that genocide.We in America are obsessed with World War II. It’s probably the grotesqueness of Hitler, the darkness of Nazism, the flagrant evil that didn’t bother to hide. Slaughter, cold and heartless and mechanized. But the reality is that World War I was more existential for Europe. While WWII was about despotism and tyranny, the First World War was the remaking of an old order. The redrawing of boundaries, the fall of dynasties, the final destruction of the “Sick Man of Europe”. Setting the table for all the geopolitical messes for a hundred years – messes we are still dealing with, like Turkey and Palestine and Syria and Jordan. The House of Saud.But these epic tales of nations are carved all by individual men. We like to think of those men as Churchill or Stalin or Roosevelt – of “Lawrence of Arabia”. But those are just the names we remember. Most are forgotten; “uncounted lives that are buried without drums and trumpets under the foundations of monumental successes” as Joseph Conrad says.“The Burning of the World: A Memoir of 1914” is about that. It’s the story of Bela Zombory, a poor Hungarian painter and his first year of war. Drafted into the army, he’s forced to the front to fight the Russians – always the Russians. He is injured, and is returned to Budapest to recover. It’s his story – a short story, simple and uncomplicated. But not plain – full of the emotions of a man who does not want to fight, nor does he want to die. It is not a treatise against great powers – it is not a diatribe against war – it is not a self-serving heroic autobiography. It’s just a story of a boy, an artist, and his first year of war.If you are intrigued by Europe and the wars. If you are a student of war. And if you are a reader – you’ll enjoy “The Burning of the World.”"}, {"review_sentiment": 4.0, "review_text": "An interesting perspective on WWI from a young artist drafted in the Hungarian army early in the war.He is skeptical from the start.  Wounded in his first engagement, he experiences a harrowing evacuationto hospital and displays what is now recognized as classic PTSD symptoms.  Unfortunately, the memoiris incomplete and ends after only a few months."}, {"review_sentiment": 4.0, "review_text": "\"The Burning of the World\" by Bela Zombory-Moldovan is an interesting first-hand account of the days leading up to World War One in Central Europe, and the first months of that war.  So much confusion and so much of the unknown--and the account of the author's first experience of battle is very revealing.  This is a short work, but very much worth reading to get the feeling of 1914 in Central Europe."}, {"review_sentiment": 5.0, "review_text": "An entire generation of Hungarian young men marched north by foot to Rawa Ruska, Poland in August 1914.  By September 15, 90% had been killed or maimed by Russian artillery shells.  Not.  Even.  Imaginable."}, {"review_sentiment": 2.0, "review_text": "A Hungarian cry baby"}, {"review_sentiment": 5.0, "review_text": "Wonderful first person narrative of WWI. Absolutely one of my favorite wartime perspectives because it not only focuses on the actual war, but the nature of society during war and one's role upon returning to it."}, {"review_sentiment": 5.0, "review_text": "I loved this book! Beautifully written and wonderfully evocative, it's a charming, melancholy account of a serene way of life in a societyabout to vanish and a talented artist whose life has been irreparably damaged. B. Z-M. deserves a far greater audience! The war scenesare esp. noteworthy.Provides a valuable and unusual glimpse of the WWI \"eastern front\" which is so infrequently covered & highlights the massivebungling with huge confusion leading to the (totally unsurprising!) obliteration of the Habsburg empire."}, {"review_sentiment": 5.0, "review_text": "A fine book that adds to a ever growing collection of WW1 material. Good service from supplier."}, {"review_sentiment": 5.0, "review_text": "“The Burning of the World” a non-fiction work by Bela Zombory-Moldoran (1885-1967) is short, beautiful and sad.  The story is told in the first person and is a memoir by the artist Bela Zombory-Moldovan.  Even with zero knowledge or understanding of the Hungarian language, I sense that the translation is excellent. It was assembled and translated by the grandson, Peter. Read the book first, and then go back and read the Introduction.It is a rare thing, indeed, to find in a war story such flowing, colorful, glorious prose, as here where the reader is treated to a panoply of sounds, smells, feelings, food, and --- especially – colors, as only a painter can render.Bela goes to war in the first weeks of WWI as a junior officer in the Hungarian military. He is wounded rather severely not many weeks later, while serving in Galicia, fighting the Russians. Today no doubt his diagnosis would include PTSD.  He is a symbol of Old Europe and a victim of the absolute unpreparedness of the Austrian-Hungarian Empire for the disaster that the war and its outcomes bring, including not many years later by the second disaster of WWII, and Hungary’s shrinkage and virtual disappearance.It isn’t so much the story of the war’s beginning and eventual stalemate that is impressive. In fact, the political discussions held from time to time by Bela with relatives, friends and colleagues, are among the least interesting, least intellectually cogent aspects of this excellent book.  What the reader sees and feels instead is the old culture, the geography, the Adriatic Sea, the mountains, the change of seasons, the battlefield, and the man – Bela --who loses himself and his anchor in life as a result of his brief stint of wartime gunbattle. We see family and tradition, caring and pathos, joy and sadness.  Lacking entirely is any suggestion of sexuality or romance.  This is, essentially, an asexual story. But there is a palpable closeness between and among the people who come to life in the grandson’s re-creation of this book in English, from a hand-written original manuscript on old, yellowed scrap-paper.Read it for the sensuality of feelings and color. He’s at his best when on a train. Read it if only to enjoy good writing, but also to understand an often-forgotten chapter in the awful history that was World War I.A 5, for sure."}]}, "authors": ["Bela Zombory-Moldovan"], "isbn": "1590178092", "longitude": 19.0404707, "periods": ["1900s"], "title": "The Burning of the World: A Memoir of 1914", "word_cloud": "write young aspire artist conscript austrian hungarian army outbreak poignant unique view people theater operation experience first hand account typically deal western find fascinate historically personal depth writer observation unit decimate russian army early conflict return home try adjust new reality short work deserves wide readership war brewing year centuries millennium word repeat farmer peasant priest citizen mercenary noble war forever century saw maybe worst degree cold war gulag concentration camp mass starvation war body also mind shatter piece fly way nobody ever talk not politically correct suppose mention obsess probably grotesqueness darkness flagrant evil bother hide cold heartless mechanize reality existential despotism tyranny remake old order redrawing boundary fall dynasty final destruction table geopolitical mess year mess still deal epic tale nation carve individual men like think men name remember most forgotten uncounted life bury drum trumpet foundation monumental success story poor painter first year war army force front fight always injure return recover story short story simple uncomplicated plain full emotion man want fight want die treatise great power diatribe war heroic autobiography story boy artist first year intrigue war student war interesting perspective young artist draft hungarian army early skeptical start wound first engagement experience harrow evacuation to hospital display recognize classic symptom unfortunately memoirs incomplete end month interest account day lead first month war so much confusion much unknown account author first experience battle reveal short work much read feeling entire generation young men march north foot kill maimed russian artillery shell not even imaginable hungarian cry baby first person narrative favorite wartime perspectives focus actual war nature society war role return love write wonderfully evocative charm melancholy account serene way life vanish talented artist life irreparably damage deserves far greater audience war scenes are esp valuable unusual glimpse eastern front infrequently cover highlight massive bungling huge confusion lead totally unsurprising obliteration empire fine add ever grow collection material service supplier work short beautiful sad story tell first person artist even knowledge understand hungarian language sense translation excellent assemble translate grandson first back rare thing indeed find war story flow colorful glorious prose treat panoply sound smell feeling food especially color painter go war first week junior officer hungarian military wound rather severely many week later serve fight doubt diagnosis symbol victim absolute unpreparedness disaster war outcome bring include many year later second disaster shrinkage virtual much story war begin eventual stalemate impressive fact political discussion hold time time relatives friend colleague least interest least intellectually cogent aspect excellent see feel instead old culture geography mountains season man lose anchor life result brief stint wartime gun battle see family tradition care pathos joy sadness entirely suggestion sexuality romance essentially asexual story palpable closeness people come life grandson original manuscript old yellow sensuality feeling color best train enjoy good writing also understand chapter awful history sure", "genres": ["Fiction & Literature", "WWI"], "summary": "New York Review Books Classics\r\n  \r\nThe budding young Hungarian artist Béla Zombory-Moldován was on holiday when the First World War broke out in July 1914. Called up by the army, he soon found himself hundreds of miles away, advancing on Russian lines and facing relentless rifle and artillery fire. Badly wounded, he returned to normal life, which now struck him as unspeakably strange. He had witnessed, he realized, the end of a way of life, of a whole world. \r\n\r\nPublished here for the first time in any language, this extraordinary reminiscence is a powerful addition to the literature of the war that defined the shape of the twentieth century.\r\n\r\n“The Burning of the World is a compact self-portrait against a background of carnage and disillusionment.” The New York Times", "asin": "1590178092", "rank": "327223", "city": "Budapest", "image": "https://images-na.ssl-images-amazon.com/images/I/51AbK1K0aOL.jpg", "country": "Hungary", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}