{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 14, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "A+"}, {"review_sentiment": 5.0, "review_text": "Wonderful, unexpected book. Gadda's prose is unlike anyone else's. Certainly a difficult read, but worth the effort. Just don't expect a typical story, written in a typical way."}, {"review_sentiment": 5.0, "review_text": "This is an excellent book by Emilio Gadda. Travel to Rome and go to Via Merulana Street to see for yourself- Richard Burton made a movie of this W.W. II event, in which the Nazis slaughter a group of the Italian resistance fighters, the slaughter taking place near the Jewish Resistance Museum, near the Lateran Church, in Rome. Arrived quickly enough and in great condition. Ordered a second copy and gave it to Italian friends. Thank you."}, {"review_sentiment": 5.0, "review_text": "A nice book"}, {"review_sentiment": 5.0, "review_text": "Carlo Emilio Gadda's name seems inextricably linked with that of James Joyce, but upon further scrutiny their only real similarity is that they both perplex people who don't read carefully. If you want a taut plot, heartbreakingly realistic character development, and a thrilling buildup and climax, this is not the book for you. On the other hand, if you like the wealth of bizarre details in almost any Thomas Pynchon novel, or if you like the skewed worldview of Witold Gombrowicz, then Gadda will be a revelation. Essentially this is a murder mystery written as poetry, with lots of dry humor and earthy Italian flavor. No, the mystery isn't really solved, but if you read this book lovingly, you won't care in the least. Gadda presents life on this planet as the fundamental mystery, and that will never be explained by a novel."}, {"review_sentiment": 5.0, "review_text": "... stay off the Autostrada! If you can't dodge Vespas and stare down pedestrians, don't drive in Roma! Likewise, if you don't like prose that zigzags capriciously, that scorns all stop-sign punctuation, that slams to a stop in mid-passage to gawk at an allusion or a fascinating irrelevancy, stay very far away from Carlo Gadda's work and in particular his best-known crime novel \"That Awful Mess on the Via Merulana.\" It's nobody's idea of easy reading.I tried to read \"Quer Pasticciaccio Brutto de la Via Merulana\" years ago, when I lived in Roma and walked along the Via Merulana once or twice a week. I failed miserably. I wasn't alone in failure, however; fully 99% of native Italian speakers would have just as much trouble with it. Gadda's prose is a jangle of school Italian, Roman dialect, and words that can't be found in any normal dictionary, including quite a few that Gadda coined. Gadda's puns in Italian are outrageous -- outrageously funny, that is, if you catch them. Gadda's allusions to history, science, theology, and engineering are frighteningly broad and arcane, and some of them are simply Gaddaesque humbug. You truly do need to have a sense of place, of the physical and social topography of Roma, to wind your way through the narrative. Even more important, you need a reasonable knowledge of Italian history and a thorough knowledge of the Mussolini era, first to make sense of Gadda's anti-Duce tirades and second to give a damn about them. So: CAVEAT LECTOR!I confess that I was skeptical when another amazoony reviewer alerted me to this translation by William Weaver. Are books like Joyce's Ulysses and Nabokov's Pale Fire really translatable? The \"Pasticciaccio\" belongs in that select company. But Weaver has done an astounding job of replicating Gadda's style -- all but the Romanaccio slang -- and capturing his bizarre humor. This is, in English, a very funny, quirky, bawdy, blasphemous book!The novel is purportedly a murder mystery, and in fact it has some of the ambience of classic crime fiction, including a dour \"flatfoot\" cop who would be at home in a Raymond Chandler or Arnoldur Indridasson novel. If you demand a tight-tushy conclusion, I warn you, you won't be pleased at how much of the \"mess\" on Via Merulana remains \"awful\" to the end. The crime is only a pretext for superbly eccentric ruminations and historical retributions against Italian fascism.Now the question: would you let the frenetic confusion of traffic in Roma prevent you from visiting the world's most interesting city? The analogy is here for you to figure out."}, {"review_sentiment": 5.0, "review_text": "Carlo Gadda is a light of literature hidden from most of us.  He is without question of the first tier writers of the previous century.  He is a writer who forces the writers' purposes for all to read.  Life, or Being, are too complex for logic alone to address.  Theoretical abstractions, purest in formal logic and mathematics is trivial without context, useless for consciousness.Gadda is firstly engineer and scientist; think of Primo Levi.  But his training never soils his prose.  Instead, you enjoy his talk of gems or physiology.  For him, the novelist is sometimes capable of taking you into the real, or, because of extended narrative and plot, through the real.  But at any moment he is capable of setting out before us the array of impinging forces on a given moment.  His point will be set, then open, then closed again.  We resolve nothing. So no ending can make any genuine sense.  He bothers not with endings.  Not just here, but as a matter of an artist's course.What better vehicle, then, could there be for such a writer who mixes stone and blood, than a murder mystery?  It is perfect because it is nonsense in this context.  How could any writer bring off a worthy mystery in this wacky cosmology?  So forward he goes, which is the smile of his plunge.The murder mystery is the perfect anti-solution, where we all focus upon the puzzle without seeing the very structure of the puzzle.  Brilliant.  Ecco borrowed this move for his own superb murder mystery.  This is Gadda's level of humor, and humor in the un-funny sense, too.  He paints real layers on a fake canvass.  He writes phenomenology across the shroud of our past certainties.  And he does it well.  The story is never subordinate to his world vision.  Here he breaks our models of imagining only orderly thought.  He cannot help but collide with the political.Yet he keeps faith with the tradition of literature, and of human culture.  Therefore he brings to us his hero, Don Ciccio.  Ciccio in Italian is not a proper name.  It is a fun name because of the sound.  And so he is.  Not a proper detective, but a fun one.  He is as far away from Roma as Gadda was.  Ciccio is as far, culturally, from the Roma of 1926 as could be.  So Gadda locates him in the Molise, where standard Italian never had been known.Now Gadda lets the gatto out of his bag.  He has Ciccio say for him, \"...unforeseen catastrophe are never the consequence of the effect, if you prefer, of a single motive, of a cause singular;  but they are rather like a whirlpool...towards which a whole multitude of converging causes have contributed...\"Quite a belief for a mere detective.  How could you catch a perpetrator with such a method in your mind?  As if anticipating the very question, Gadda has Ciccio respond \"We must reform within ourselves the meaning of the category of cause.\"  Good Luck, my little neo-Kantian.Like trying to be such a detective as Ciccio is,  the whole project of this translation is equally hopeless.  Gadda can never attain an appeal equal to his equals  because of his dedication to fixedly capture the vanishing dialects of his day.  At least, culturally, for the curious or serious reader, the attendant cultural references are thickly planted.The form of the mystery is a clever conveyance for this novel.  It brings Gadda's work into high relief, high contrast.  Gadda writes the form of the novel because it alone can bring to light what no other form can do for these ideas.  You cannot sculpt or paint them.  They move to develop,  and are realized, only in the forth dimension -- time.  Yet cinema is helpless for such a project.  And it has been tried.Gadda knows that without a cracking good story (he picks a true story for his ephemeral anchor), well told, the whole enterprise is hollow, an echolalia the likes of Fox News.He writes of people as he does of the scenery against which we see them act.  His inner monologue of each character has clear voice, and is in clearer contrast to the spoken voice we read in their dialogues. Gadda fires on all cylinders.His device of the apartment house is effective in focusing the action, while compartmentalizing both the unfolding of the plot, and of the characters, each in a little cell.  As is his physical model, which we have so often seen in the Ptolemaic toy, so is his meat-physical model the novel, his humaniverse.  Everybody gets into the act.  Via Merulana is on that busy inner city street between Saint John Lateran to the southeast and stopped at the opposite end by Santa Maria Maggiore.But he chose this street because it echoes the ancient road of that name.  This is how Gadda funnels in all the past into the already crowded present.  All history and clans flow this way in, impossible to escape or divert. Thus is Destiny's \"field of forces\" piped into \"a historic predisposition\" for disaster.  Nota bene, Gadda does not say \"pre-ordained\".  Destiny is different from fate.  He sees more a vision of converging probabilities, each maintaining its own twisted chord into the vortex.Gadda, soon enough for mystery readers, settles into the best business, the narrative.  Again, as a murder mystery demands of me, I could have referred to it as a plot.  Yet it is only in form, but the writing itself can stand completely alone.  Once Gadda has made his prologue which bleeds into the story, he frees himself to get on with a good story.Gadda would not be himself without thumbing his nose at the fascists.  He  slings fragrant dung at the New Order.  He thumbs his nose at the morality of the state rag publications.  He even laments the comparative beneficence of the good old yellow journalism of the recent past.  At least they pandered instead of splayed for murderers.I am happy the New York Review Of Books has chosen this to revive.  Please understand, readers, that this edition has an intrepid translator, William Weaver.  He includes essential footnotes."}, {"review_sentiment": 2.0, "review_text": "First off, DO NOT READ THE $#%@ing INTRODUCTIONS.  This is not an easy book to get through - but it's much harder to get through when the introductions reveal the ending and deprieve you of your (much needed) motiviation to plow through this text.  Am I the only one who thinks we need more Afterwords?  The main reason I bought the book was for Italo Calvino's introduction - and even in the introduction the book sounded boring.Here's the problem:  You have a typical literary crime novel drowning in  what appears to be an encyclopedia.  You have sprawling descriptions of cities, metal processes, historical respectives, a minor treatise of pastries, etc.  And occasionally, there plot plods drunkenly on.  It is so bad that the real investigation does not get underway until will into the second half of the book.  Oddly, despite the piles of description in the text, you get no real sense for anyone in the book.It reads like the Italian answer to Joyce's Ulysses only something of a story.The sentences in this book are verbal labyrinths- by the time you finish a sentence, you forgot were it began and how it related to the sentence in front of it or how it related to the novel.Here's an example of the actual text (and yes, this is one sentence):\"A majolica pan, as if from a clinic of the first category, was set on the brick floor, and not even near the wall: and neither did it lack some undeciphered content, on the consistence, coloration, odor, viscosity, and specific weight of which both the lynx eyes and bloodhound scent of Ingravallo felt that it wasn't necessary to investigate and analyze: the nose, of course, could not exempt itself from its natural functioning, that is from that activity, or to be more accurate, the papillary passivity which is proper to it, and which does not admit, helas, and interlude or inhibition or absence of any kind from its duty.\"All that is too say:  There's poo in the bucket and it smells quite bad.If you're looking to read 300 pages of jammed meandering narrative like that above, this is the book.  The jammed style isn't accidental, you get the feeling it is supposed to be humorous and makes typical references to the joys of a young buxom girls.  The joke, however, becomes tedious  within two minutes.  And then you start wondering:  Is this a joke?  Was he getting paid by the word?  Did the author enjoy peculiar snacks, such as mercury thermometers?"}, {"review_sentiment": 5.0, "review_text": "Obviously Gadda's novel is not the usual crime novel. Basically it's a literary masteripiece which happens to be *also* a crime novel. In it you have everything you usually find in a \"classical\" whodunit: a victim, a detective, some suspects, police inquiry, and the culprit. But these things are no more than a pretext for such an immense writer like Gadda to talk about Fascist Italy and the city of Rome (Gadda was born in Milan, but he chose to move to Rome and knew the city and the surrounding area incredibly well). Then you have his gift for language, his corrosive irony, his restless intelligence, his deep understanding of the human mind (also with a lot of psychoanalytical insight). Plus a wealth of references to Italian and Latin literature (such as the Retalli family, whose names echo those of Aeneas' family in Virgil' Aeneid). Plus a wide knowledge of Italian geography and anthropology. Not bad for a man who had graduated in engineering!Somebody complained about descriptions. Well, actually those descriptions, which seem pointless at a first reading, are the plot itself. In the novel, if you read it carefully, you are even told who really killed the rich signora of Via Merulana (btw, a street which really exists in Rome, though at n. 219 there is a shop, not a block of flats). But everything is shown obliquely, indirectly, through allusions and hints that you may easily miss on a hurried reading. I'd say that this is a novel that unfolds reading after reading--just like all real masterpiece.And I am not surprised Calvino extolled Gadda. Gadda is a slightly greater novelist than Calvino. Ehm, did I say \"slightly\"? I should have said \"decidedly\"! Obviously Calvino is one of the greats... but good ol' uncle Carlo Emilio is one of the \"greatests\". I am afraid, though, that some of his greatness may get lost in translation, though he has been \"rewritten\" by such a fine translator as William Weaver.It's a pity Gadda's other masterpiece, his essay Eros and Priapo, a bewildering but absolutely brilliant psychonalysis of Fascism (told in a baroque mix of styles), hasn't been translated into English. Heh, this ain't a perfect world, folks..."}, {"review_sentiment": 2.0, "review_text": "I read the book in a new and good Dutch translation, that tries to render Gadda's use of dialects. The book has an interesting beginning and seems to be a detective work, but then Gadda looses himself in endless descriptions and the crimes are not solved at all. In the end the reader is left with a unsatisfactory feeling."}]}, "authors": ["Carlo Emilio Gadda"], "isbn": "1590172221", "longitude": 12.4829321, "periods": ["1900s"], "title": "That Awful Mess on the Via Merulana", "word_cloud": "unexpected prose anyone else certainly difficult worth effort typical story write typical way excellent go see make movie event slaughter group italian resistance fighter slaughter take place jewish quickly enough great condition second copy give italian friend thank nice name seem inextricably link scrutiny real similarity perplex people carefully want taut plot heartbreakingly realistic character development thrill buildup climax hand wealth bizarre detail almost skew worldview revelation murder mystery write poetry lot dry humor earthy italian flavor mystery really solve lovingly least present life planet fundamental mystery never explain stare pedestrian drive prose zigzag capriciously scorn punctuation slam stop gawk allusion fascinate irrelevancy stay far away work particular crime nobody idea easy tried year ago live walk twice week fail miserably alone failure however fully native italian speaker much trouble prose jangle school italian dialect word normal dictionary include quite coin pun outrageous outrageously funny catch allusion history science theology engineering frighteningly broad arcane simply humbug truly need sense place physical social topography wind way narrative even important need reasonable knowledge italian history knowledge era first sense tirades second give damn confess skeptical amazoony reviewer alert translation really belongs select company do astound job replicate style slang capture bizarre humor english funny quirky bawdy blasphemous purportedly murder mystery fact ambiance classic crime fiction include dour flatfoot cop demand conclusion warn pleased much remain crime pretext superbly eccentric rumination historical retribution italian question frenetic confusion traffic prevent visit world interest city analogy figure light literature hide question first tier writer previous century writer force writer purpose complex logic alone address theoretical abstraction purest formal logic mathematics trivial context useless firstly engineer scientist think train never soil prose instead enjoy talk gem physiology novelist sometimes capable take real extend narrative plot real moment capable set array impinge force give moment point set open close resolve nothing so end make genuine sense bother ending not matter artist better vehicle mix stone blood murder mystery perfect nonsense context bring worthy mystery wacky cosmology forward go smile murder mystery perfect focus puzzle see structure puzzle borrow superb murder mystery level humor humor sense paint real layer fake canvas write phenomenology shroud past certainty well story never subordinate world vision here break model imagine orderly think keep faith tradition literature human culture bring hero proper name fun name sound not proper detective fun far away far culturally so locates standard never let gotta bag say unforeseen catastrophe never consequence effect prefer single motive cause singular rather whirlpool towards whole multitude converge cause contribute belief mere detective perpetrator method mind anticipate question respond mean category cause little try detective whole project translation equally hopeless never attain appeal equal equal dedication fixedly capture vanish dialect day least culturally curious serious attendant cultural reference thickly form mystery clever conveyance bring work high relief high contrast write alone bring light form idea sculpt paint move realized forth dimension time cinema helpless project know crack good story pick true story ephemeral anchor well tell whole enterprise hollow echolalia like write people scenery see inner monologue character clear voice clearer contrast spoken voice dialogue fire device apartment house effective focus action compartmentalize unfolding plot character little cell physical model often see toy model humaniverse get act busy inner city street southeast stop opposite end choose street echo ancient road name funnel already crowd present history clan flow way impossible escape divert field force pip historic predisposition disaster been say different fate see vision converge probability maintain twisted chord soon enough mystery reader settle best business narrative murder mystery demand plot form writing stand completely alone make prologue bleeds story free get good thumb nose fascist sling fragrant dung thumb nose morality state rag publication even lament comparative beneficence good old yellow journalism recent past least pandered instead splay happy choose revive understand reader edition intrepid translator include essential footnote first ing easy much harder get introduction reveal end deprive much need motivation text think need main reason buy introduction even introduction sound problem typical literary crime drown appear sprawl description city metal process historical respective minor treatise pastry etc occasionally plot plod drunkenly bad real investigation underway second half pile description get real sense anyone read italian answer ulysses something sentence verbal time finish sentence forget begin related sentence front related example actual text yes sentence majolica pan clinic first category set brick floor even wall lack undeciphered content consistence coloration odor viscosity specific weight lynx eye scent felt necessary investigate analyze nose course natural functioning activity accurate papillary passivity proper admit heals interlude inhibition absence kind duty say poo bucket smell quite look page jam meander narrative jammed style accidental get feeling suppose humorous make typical reference joy young buxom girls joke however becomes tedious minute wondering joke get pay word author enjoy peculiar snack mercury thermometer obviously usual crime literary masterpiece happen crime everything usually find classical whodunit victim detective suspect police inquiry culprit thing pretext immense writer talk city bear choose city surround area incredibly well then gift language corrosive irony restless intelligence deep understanding human mind also lot psychoanalytical insight wealth reference italian literature family name echo family wide knowledge italian geography anthropology not bad man graduate engineering somebody complain description actually descriptions pointless first read plot carefully even tell really kill rich signora street really exist shop block flat everything show obliquely indirectly allusion hint easily hurried reading say unfolds read reading real surprise extol slightly greater novelist say slightly say decidedly great good lo uncle greatest afraid greatness lose translation rewritten fine translator pity essay bewilder absolutely brilliant psychoanalysis tell baroque mix style translate english ai perfect world folk new good dutch translation try render use dialects interesting beginning seem detective work loose endless description crime solve end leave unsatisfactory feeling", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "In a large apartment house in central Rome, two crimes are committed within a matter of days: a burglary, in which a good deal of money and precious jewels are taken, and a murder, as a young woman whose husband is out of town is found with her throat cut. Called in to investigate, melancholy Detective Ciccio, a secret admirer of the murdered woman and a friend of her husband’s, discovers that almost everyone in the apartment building is somehow involved in the case, and with each new development the mystery only deepens and broadens. Gadda’s sublimely different detective story presents a scathing picture of fascist Italy while tracking the elusiveness of the truth, the impossibility of proof, and the infinite complexity of the workings of fate, showing how they come into conflict with the demands of justice and love. \r\n\r\nItalo Calvino, Pier Paolo Pasolini, and Alberto Moravia all considered That Awful Mess on the Via Merulana to be the great modern Italian novel. Unquestionably, it is a work of universal significance and protean genius: a rich social novel, a comic opera, an act of political resistance, a blazing feat of baroque wordplay, and a haunting story of life and death.", "asin": "1590172221", "rank": "723837", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51PcR1sC6kL.jpg", "country": "Italy", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}