{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 45.2551338, "ratings": {"num_ratings": 5, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "A neglected part of history. Explains a lot about the ongoing conflict in this part of the world."}, {"review_sentiment": 5.0, "review_text": "The poetic description of sadness at the heart of this short novel is very moving.Within the pages of this book, Tisma has brought to life a small part of the world which, at the time, was sadly caught between  the clash of two ideologies that were slowly descending, like dark clouds, upon Europe - communism and fascism. The consequent racial suspicions, which leave no one untouched, are real: Hungarians, Jews, Serbians, all are caught in the ideological swirl which, as we know, had devastating consequences for the people of the region: pogroms, the invasion  by Arrow Cross Hungarians, the murder of communists (Blam's sister)...The novel also delves into the unconscious of violent retribution, something which, as we have learned in recent years, only leads to the perpetuation of violence.  Mr. Tisma must have had the wars that raged throughout the 90s in mind (i.e., Croatia, Bosnia-Herzegovina) while he was writing his novel. (The precariousness of the region, of which we are all aware, is in part the result of a failure to put the past behind, to let go, to forgive.) The dream-like scenes, where long-dead friends of Blam's pay their executioners in kind, are harrowing.A short novel about a region of the world whose history we unfortunately know too little about, and but one tiny chapter in the book of horrors that were visited upon the European Jewish community."}, {"review_sentiment": 5.0, "review_text": "The Book of Blam is a wonderful book and an important book. It recounts the events during the Holocaust period in what is now Serbia. After reading this and Tisma's Kapo, he has a style of writing that is unlike most  writers that I have read from Eastern Europe; concise, flowing storylines  and easy to read. His story has been told many times before but there is  something to Tisma's writing that makes Genocide appear as normal to these  killers as washing their hands or going for a walk.  His is a voice of  reason in Novi Sad, a city with little tolerance then and now. After the  events in the Balkans during the recent past, sad to say, not much has  changed."}, {"review_sentiment": 5.0, "review_text": "This is the literary equivalent and then some of the photographic essay \"A Vanished World\" and Anne Frank's diary in 1950, had she survived. And an all too useful exploration of how survivors of the abyss  might look at the world. I can't  say I'm looking forward to reading  Tisma's other work, but read it I must."}, {"review_sentiment": 4.0, "review_text": "In the past several weeks (April, 1999), Nato bombs dropped two of Novi Sad's bridges into the Danube River.  This excellent novel, written by a man who experienced the human or inhuman tragedies of Novi Sad in the  1930's and 1940's helped me get a feeling for this city. The book appears  to fill a gap in what can be found in ordinary U.S. public libraries."}]}, "authors": ["Aleksandar Tisma"], "isbn": "159017920X", "longitude": 19.8451756, "periods": ["1900s"], "title": "The Book of Blam", "word_cloud": "neglected part history lot ongoing conflict part world poetic description sadness heart short page bring life small part world time sadly catch clash ideology slowly descend dark cloud communism fascism consequent racial suspicion leave untouched real catch ideological swirl know devastate consequence people region pogrom invasion murder communist sister also delve unconscious violent retribution something learn recent year lead perpetuation violence rag mind write precariousness region aware part result failure put let forgive scene friend pay executioner kind short region world history unfortunately know little tiny chapter horror visit european community wonderful important recount event period read style write writer concise flow story lines story tell many time something writing make genocide appear normal killer wash hand go voice reason city little tolerance event recent sad say much change literary equivalent photographic essay diary survive useful exploration survivor aby world look forward read work past several week bomb drop bridge excellent write man experience human inhuman tragedy help feeling city appear fill gap find ordinary public library", "genres": ["Fiction & Literature", "WWII"], "summary": "New York Review Books Classics\r\n\r\nThe Book of Blam, Aleksandar Tišma’s “extended kaddish . . . [his] masterpiece” (Kirkus Reviews), is a modern-day retelling of the book of Job.\r\n\r\nThe war is over. Miroslav Blam walks along the former Jew Street, and he remembers. He remembers Aaron Grün, the hunchbacked watchmaker; and Eduard Fiker, a lamp merchant; and Jakob Mentele, a stove fitter; and Arthur Spitzer, a grocer, who played amateur soccer and had non-Jewish friends; and Sándor Vértes, a lawyer who was a Communist. All dead. As are his younger sister and his best friend, a Serb, both of whom joined the resistance movement; and his mother and father in the infamous Novi Sad raid in January 1942—when the Hungarian Arrow Cross executed 1,400 Jews and Serbs on the banks of the Danube and tossed them into the river.\r\n\r\nBlam lives. The war he survived will never be over for him.", "asin": "159017920X", "rank": "1378224", "city": "Novi Sad", "image": "https://images-na.ssl-images-amazon.com/images/I/41-dR6AntML.jpg", "country": "Serbia", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}