{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 40, "rating": 3.3, "reviews": [{"review_sentiment": 5.0, "review_text": "This is my favorite of all of McDonald's works so far. He expertly weaves together three different stories in dramatically differing time periods but does this with such apparent ease and fluidity of language (including a lot of the Portuguese idiom) that the complexity of the whole work is illuminated but never overwhelming. Father Luis Quinn, an Irish Jesuit cleric sent by the Portuguese Jesuit authorities to \"admonish\" a fallen priest in the deep jungles of 18th century savage and slave-ridden colonial Brazil is also my favorite of all of McDonald's characters. Quinn, a huge strong paradox of a man with a dark past, asks only for a \"task most difficult.\" He gets this and we get a brilliant read in return."}, {"review_sentiment": 2.0, "review_text": "I love Ian McDonald, he wrote one of my absolute favorite books in Evolution's Shore. I was really looking forward to reading this one but frankly I was disappointed.First of all, the excessive Portuguese. I usually really like unusual stylistic choices, but his use of Portuguese crossed way over the line and became an annoying affectation. It felt pretentious, and didn't add anything notable to the book. If the point was immersion, there are far more skillful ways to do that and this choice was really ham handed.And I don't think that McDonald had the authority to use that much of an actively spoken foreign language that he doesn't speak, in his novel. Sadly some of the reviews I've seen from native speakers have blasted the awkward phrasing and weird use. Could you imagine someone doing this with English? Wait, that exists, and we call it Engrish and it's terribly awkward. Why would it be good writing to do it to another language? I can see he had consultants, and I am sure he did tons of research but that frankly is not enough.Although that would have been forgivable, just annoying, had the content of the book stood up. Sadly it did not. I found the characters fairly interesting, unlike some reviewers who hated the MC-- she was pretty hate able, and I'm a little worried that this is the only type of interesting female character McDonald seems to enjoy writing, but she was also kind of hilarious in her hateability and very self aware of her flamboyant flaws. So I actually liked her-- which is why i felt betrayed when certain character changes happened near the end of the book which felt completely out of the blue and nonsensical. There was no real build up to her change in character into the person she was at the end, she was just one way in one chapter and totally different in the next.Also the plot is a sloppy mess. Eighty percent interesting ideas building up to a final twenty percent \"oh god I have to make the novel end the way I planned, how do I get from here to there\" and the answer was contrived and boring.The multiple time lines that bothered other people didn't bother me, I liked them. Just the stuff above.Anyways, a disappointment. I expected better."}, {"review_sentiment": 4.0, "review_text": "This was a complex read but the whole thing has really stuck with me. The characters and their surroundings are fleshed out with intricate aesthetics and the premise continues to be thought-provoking several months later."}, {"review_sentiment": 1.0, "review_text": "I read and enjoy a wide variety of Sci-Fi, but this book is terrible - hackneyed, derivative ideas and overwrought prose masquerading as \"cool\", utterly shallow. This book and \"The Wind-up Girl\" rate as the worst and most over-hyped sci-fi of the last few years"}, {"review_sentiment": 3.0, "review_text": "Love the multiverse idea but when entire sections are rendered puzzling by the overuse of Brazilian words/slang, it becomes a chore, not a read. Certainly didn't make me feel any more immersed in the world - had quite the opposite effect. And the ending was just a wee bit abrupt, making me feel like this was the overly long, conclusion-free introduction to a series of novels (rather than a self-contained piece of goodness)."}, {"review_sentiment": 5.0, "review_text": "I knew a lot of it was nonsense. In particular, his alternate timelines and his explanation of quantum theory; but I was more than willing to let it pass. It helped that Ian MacDonald made the background seem real. In fact, he did some research to make it seem, and it is the only action/adventure I know of with a bibliography. Of course, it also helped that he placed his tale in an exotic location."}, {"review_sentiment": 5.0, "review_text": "One sub-genre of book I love, is mixed language, or created language books. They are a tough challenging read. Usually it takes at least two readthroughs to really grasp everything, and I don't really mind, because the extra effort usually pays off. I do believe this type of language usage really seperates the writter from the rest of the pack. I have only really read three books like this, but I have loved all three. A Clockwork Orange, And the As Saw the Angel, now Brasyl. The fact that I am a fan of Cyberpunk makes this book stand out, and is now one of my favorites. If not familiar with the genre, you can be put off by some of the slang, as it comes off as a bit cheesy, but you must also understand that people can really be like this. They are try hards, that can be somewhat clueless as to what is cool, and really make themselves look awkward.  Essentialy achieving the opposite effect of what they were after in the first place. One thing about this book is the disjointed writing style. I wished he would have seperated when it cuts to another scene better. It reads more like a screenplay than a novel, but once you figure out what he is doing you are more prepared for when he does it next. Overall, I feel the shortcomings are overshadowed by the sheer awesomeness of this book, and that is why I gave it 5 ★★★★★"}, {"review_sentiment": 1.0, "review_text": "The concept is interesting; although the writing is a bit chaotic. But the main problem was that if a writer intends to use words from another language to illustrate the narrative, he/she should always ask for support from native speakers, Brazilian Portuguese, in this case; although the writer thanks some Brazilian Portuguese-speaking people at the end, there are blatant errors which lead to the question \"where they Brazilian Portuguese native speakers?\".And a note on the electronic version: there was too much space between paragraphs; a single space would suffice, except for when there is a change of \"scene\"."}, {"review_sentiment": 4.0, "review_text": "This book educated me about the Brazilian martial art of Capoeira, enough to look up some fight videos on YouTube. Marcelina seemed very present-day in our particular universe. The depiction of the Portuguese colonial era in Brazil was also educational, but not entirely in our universe. I even \"youtubed\" and listened to some of the music pieces in the \"playlist for Brasyl\" at the end of the book. I also looked for the golden frog, but all I could find was the exquisite gold-on-black eyes of the common American toad, whose skin exudations of bufotenine can cause vomiting and useless hallucinations (no multiverse-viewing!). It was also nice to see a reference to that actual Vegetao DMT-herbal church based in Brazil.This book (temporarily) made we want to learn Portuguese and move to Brazil... but maybe I already did that in a nearby world?As for all the quantum computing world-shifting superposition mind=perception stuff: The creator's name is G-D/YHVH and the known universe is His mind/computer... we all need to get with the programming!"}, {"review_sentiment": 4.0, "review_text": "How does Ian McDonald do it. He delighted me with River of Gods. He surprised me with Cyberabad Days. This is an absolute beauty.There are three parallel stories all set in different times in Brazil. The one I liked most is set in the 17th century and is about a prise Luiss Quinn(that I remember after two weeks ought to speak for the book). The sword fights are the equal to anything that Alexandre Dumas does in Three Musketeers and the writing is fantastic. I also learnt a lot of strange facts about a lot of strange things including the origin of computing.The second arc is set in the present and concerns itself with a reporter on the hunt of disgraced Goalkeeper who lost Brazil the fateful final against Uruguay. This probably has the best description of a football match that I have ever read. (Admittedly I haven't read many but its hard to see how it can get better than this).The third strand is set in the future and I found it to be the most confusing. Quantum technology has reached the street and is with any technology that is made available, strange and unconventional uses are found all the time. Admittedly I didn't enjoy this strand as much.As with Ian McDonald and like in River of Gods it all connects in the end thanks to the many worlds interpretation of Quantum Physics. McDonald is a wonderfully gifted writer and the prose is clipped and of all the authors I read I think I read McDonald the fastest. I would still rate River of Gods higher than Brasyl though."}]}, "authors": ["Ian McDonald"], "isbn": "1591027357", "longitude": 0.0, "periods": ["1800s", "1900s", "2000s", "Recent Releases"], "title": "Brasyl", "word_cloud": "favorite work far expertly weave together different story dramatically differ time period apparent ease fluidity language include lot idiom complexity whole work illuminate never overwhelm cleric send portuguese authority admonish fall priest deep jungle century savage colonial also favorite character huge strong paradox man dark asks task difficult get brilliant return love write absolute favorite really look forward read frankly excessive portuguese usually really like unusual stylistic choice use portuguese crossed way line become annoy affectation felt pretentious anything notable point immersion far skillful way choice really ham think authority use much actively spoken foreign language speak review see native speaker blast awkward phrase weird use someone exist call english terribly awkward write language see consultant sure ton research frankly annoy content stand sadly find character fairly interest reviewer hat pretty hate able little worried type interest female character seem enjoy write also kind hilarious hate ability aware flamboyant flaw so actually like felt betrayed certain character change happen end felt completely blue nonsensical real build change character person end way chapter totally different plot sloppy mess percent interest idea build final twenty percent god make end way plan get answer contrive multiple time line bother people bother like stuff disappointment expect better complex whole thing really stick character surroundings flesh intricate aesthetic premise continue several month later enjoy wide variety terrible hackneyed derivative idea masquerade cool utterly shallow rate worst last year multiverse idea entire section render puzzle overuse brazilian become chore certainly make feel immersed world quite opposite effect end wee bit abrupt make feel overly long introduction series novel rather piece goodness know lot nonsense particular alternate timeline explanation theory willing let pas help make seem real fact research make seem know bibliography course also help tale exotic location love mixed language create language tough challenge usually take least breakthrough really grasp everything really extra effort usually pay believe type language usage really separate writer rest pack really love fact fan make stand favorites familiar genre put slang come bit cheesy also people really try hard somewhat clueless cool really look achieve opposite effect first place thing disjoint write style wish separate cut scene better read screenplay figure prepare next feel shortcoming overshadow sheer awesomeness give concept interest write bit chaotic main problem writer intend use word language illustrate narrative always ask support native speaker brazilian case writer thanks brazilian people end blatant error lead question brazilian native speaker note electronic version much space paragraph single space change scene educate brazilian martial art enough look fight video seem particular depiction colonial era also educational entirely universe even you tubed listened music piece playlist end also look golden frog exquisite eye common american toad skin exudation bufotenine cause vomit useless hallucination also nice see reference actual church base temporarily make want learn move maybe already nearby world quantum compute superposition stuff creator name know need get program delight surprise absolute parallel story set different time brazil like set century pry remember week sword fight equal anything write fantastic also learn lot strange fact lot strange thing include origin second arc set present concern reporter hunt disgrace lose fateful final uruguay probably best description football match ever admittedly many hard see better third strand set future find confuse technology reach street technology make available strange unconventional us find time admittedly enjoy strand connect end thanks many world interpretation wonderfully gift writer prose clip author think fastest still rate higher", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "Science Fiction"], "summary": "Think Bladerunner in the tropics... \r\n\r\nBe seduced, amazed, and shocked by one of the world’s greatest and strangest nations. Past, present, and future Brazil, with all its color, passion, and shifting realities, come together in a novel that is part SF, part history, part mystery, and entirely enthralling. \r\n\r\nThree separate stories follow three main characters: \r\n\r\nEdson is a self-made talent impresario one step up from the slums in a near future São Paulo of astonishing riches and poverty. A chance encounter draws Edson into the dangerous world of illegal quantum computing, but where can you run in a total surveillance society where every move, face, and centavo is constantly tracked? \r\n\r\nMarcelina is an ambitious Rio TV producer looking for that big reality TV hit to make her name. When her hot idea leads her on the track of a disgraced World Cup soccer goalkeeper, she becomes enmeshed in an ancient conspiracy that threatens not just her life, but her very soul. \r\n\r\nFather Luis is a Jesuit missionary sent into the maelstrom of 18th-century Brazil to locate and punish a rogue priest who has strayed beyond the articles of his faith and set up a vast empire in the hinterland. In the company of a French geographer and spy, what he finds in the backwaters of the Amazon tries both his faith and the nature of reality itself to the breaking point. \r\n\r\nThree characters, three stories, three Brazils, all linked together across time, space, and reality in a hugely ambitious story that will challenge the way you think about everything.", "asin": "1591027357", "rank": "1644474", "city": "Rio de Janeiro", "image": "https://images-na.ssl-images-amazon.com/images/I/51H42Qy4VOL.jpg", "country": "Sao Paolo", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}