{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 36.775348, "ratings": {"num_ratings": 8, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "This is a wonderful book.Extremely well written with characters that I cared about. I have read almost all of Khadra's books, and I have loved them all. He is an amazing wtiter"}, {"review_sentiment": 3.0, "review_text": "This is not the best book to read around Christmas time, so I promised myself to finish it at least one week before the Holidays.It is an informative read if you want to have a more profound perspective on Islamist fundamentalism and terrorism.  We are fed in the American news with the notion that these people attack other cultures, but are seldom informed about what they do to their own people.  Nor are we told that fundamentalism feeds on social injustice.  For it is in the underprivileged part of the population that terrorists recruit.  Without realizing it, this part of the population goes from one form of exploitation (by the rich) to another (religious fanatics more hungry for power than the Allah whom they claim to defend).Khadra is incisive and merciless in his portrayals.  In French we say: \"Il ne fait de cadeau à personne.\"  Literally, he gives presents to no one.  The spoiled rich are depicted as silly and cruel; the fundamentalists as absurd and even crueller; the followers as naive and unable to think for themselves until it is too late.Khadra's writing style is sharp and incisive and only lets poetry intervene when he describes nature, which he often personifies.For the reasons mentioned above, I think everyone interested in terrorism and social injustice should read this book."}, {"review_sentiment": 2.0, "review_text": "This book was just okay. Boring at times, but I got through it. Definitely doesn't even compare to Husseini's Kite Runner and Thousand Splendid Suns. Try reading those, they're among the best books I've ever read."}, {"review_sentiment": 5.0, "review_text": "This chilling tale describes the descent of a young Algerian, an aspiring movie actor, who is swept by the soul-crushing forces of poverty and a repressive government into the arms of the Islamist insurgency. A stint as a driver for a wealthy family exposes him to the ruthless abuses of privilege and pushes him in revolusion back to his Muslim faith and from there under the influence of political rhetoric to the fringes of the Resistance, where he becomes an assassin and eventually an armed underground fighter engaging in attacks on government forces.Along the way there is much bloodshed and sorrow, treachery, betrayal, and unspeakable acts, all in the professed service of God. The author's distate for the Islamist movement in his home country is undisguised, and he has written a disturbing account of its worst excesses. A short novel, it moves with the swiftness of well-written crime fiction. It includes a glossary and a time-line identifying the key dates in Algerian political history from the War of Independence (1954-1962) to the first years of the 21st century."}, {"review_sentiment": 4.0, "review_text": "The book is written by Mohammed Moulessehoul under a female pen name, Yasmina Khadra.  He did this to avoid persecution, being an officer in the Algerian Army.  He eventually revealed his true identity, years later while in exile in France.The story follows Nafa Walid, a man who hopes to become an actor in the movie industry, but he begins to gradually loses control of his destiny and becomes drawn into the Algerian Islamic Fundamentalist movement. \"Wolf Dreams\" shows how dissatisfaction and disillusionment in a corrupt nation can give rise to fundamentalism, and how the chaos of civil war can transform a normal, middle-class young man into an indoctrinated assassin; a man who inflicts pain and terror on others without qualms, and accepts the idea of his own death with the devotion of a true-believing fanatic.It is definitely worth the time to read; it's gritty and pulls no punches, showing the corruption of the country's aristocracy, but at the same time, it doesn't glorify Islamic fundamentalism.  It shows that fighting monsters has a nasty habit of turning people into monsters themselves.I give it four stars for the reasons mentioned above.  It may not be for everyone, but it is an eye-openner to what leads people down the path to terrorism and murder."}, {"review_sentiment": 5.0, "review_text": "Khandra's books are simple with multiple levels of perception.  More importantly, they are masterfully wordsmithed (the over-used term is well earned in this case).  These are the kind of books that haunt you for years as they become part of your psyche.....and you see parallels to the writing all around you.......the writing truly provides you with a new perception of your own life.Here are all the books to date, with a bit of info on each:Swallows of Kabul (2004)A bit hit in France, this story of 2 couples and their attempts to cope with the rule of the Taliban is mesmerizing.Wolf Dreams (2003) 3rd of an Algerian trilogyA story of a Moslem Jihadi, from sweet boy to fanatic fundamentalist has been recommended for insight into the driving force of suicidist youngsters.Morituri (2003) 2nd of an Algerian trilogyAn Algerian kidnaping story that provides a compelling look at the definition of crime in a permanently impoverished society.In The Name Of God (2000) 1st of an Algerian trilogyA look at the phenomena of Moslem fundamentalism in Algeria, this book has strong parallels to Camu's \"The Plague.\"  In some ways it is a more modern variation on a theme of Camu's work."}, {"review_sentiment": 5.0, "review_text": "I really enjoyed this book.  It followed the path of Jihadi from disaffected youth to unstoppable monster.  It showed how vague idealism and vanity can create a perfect storm from which otherwise normal and ambitious young men are transformed into vicious monsters that will kill women and children.  I thought the complexity of this book extended further than expected, including portrayals of strong (but amoral) women as well as redeeming grace and nobility from otherwise corrupt aristocrats.  The author is often ambivalent about the competing sects in Algerian society, even though it is plain that he does not withhold moral judgment from the terrorist/protagonist.  I think that the issue of our times is Islamic terorrism and Yasmina Khadra gets inside of the terrorist mind and the social-psychology of the Casbah in a way that is neither overly didactic, nor morally obtuse.  I think this book exceeds \"In the Name of God\" both as a narrative and for showing how Islamists are a form of revolutionary at war with existing society, in spite of their pretensions of conserving Islam in pure form."}, {"review_sentiment": 5.0, "review_text": "This is a book that surprised me with its insights.  The author was recommended by NYT book review but the insights into the Islamic Fundamentalist culture and the violent whirlpool that a young man can be sucked into were a surprising revelation.  The relatively innocent immature young man who starts out the book slowly is degraded into a monster who is to be destroyed.  I often thought of the young men who flew planes into the World Trade Center and the corruption of their souls that turned them into monsters who needed to be destroyed."}]}, "authors": ["Yasmina Khadra"], "isbn": "1592641865", "longitude": 3.060065, "periods": ["2000s"], "title": "Wolf Dreams", "word_cloud": "wonderful well write character care almost love amaze witter best time promise finish least week informative want profound perspective fundamentalism terrorism feed american news notion people attack culture seldom informed people told fundamentalism feed social injustice underprivileged part population terrorists recruit realize part population go form exploitation rich religious fanatic hungry power claim defend incisive merciless portrayal french say ne fiat cadeau personnel give present spoil rich depict silly cruel fundamentalist absurd even crueler follower naive unable think write style sharp incisive let poetry intervene describes nature often reason mention think everyone interested terrorism social injustice okay time get definitely even reading best ever chill tale descent young aspire movie actor sweep force poverty repressive government arm insurgency stint driver wealthy family expose ruthless abuse privilege push revolution back faith influence political rhetoric fringe become assassin eventually arm underground fighter engage attack government way much bloodshed sorrow treachery betrayal unspeakable act profess service author distaste movement home country undisguised write disturb account worst excesses short move swiftness crime fiction include glossary identify key date algerian political history first year century write female pen name avoid persecution officer algerian eventually reveal true identity year later exile story follow man hop become actor movie industry begin gradually lose control destiny becomes draw algerian movement show dissatisfaction disillusionment corrupt nation give rise fundamentalism chaos civil war transform normal young man indoctrinate assassin man inflict pain terror others qualm accepts idea death devotion definitely worth time gritty pull punch show corruption country aristocracy time fundamentalism show fight monster nasty habit turn people monster give star reason mention everyone lead people terrorism murder simple multiple level perception more importantly masterfully wordsmith ed term well earn case kind haunt year become part psyche see parallel write write truly provide new perception date bit info bit hit story couple attempt cope rule story sweet boy fanatic fundamentalist recommend insight drive force suicidist trilogy an kidnap story provide compelling look definition crime permanently impoverish name trilogy a look phenomenon fundamentalism strong parallel way modern variation theme work really enjoy follow path disaffect youth unstoppable monster show vague idealism vanity create perfect storm otherwise normal ambitious young men transform vicious monster kill woman child think complexity extend expect include portrayal strong amoral woman well redeem grace nobility otherwise corrupt aristocrat author often ambivalent compete sect algerian society even plain withhold moral judgment think issue time terrorism get inside terrorist mind way overly didactic morally obtuse think exceeds narrative showing islamist form revolutionary war exist society spite pretension conserve pure form surprised insights author recommend review insight culture violent whirlpool young man suck surprising revelation relatively innocent immature young man start slowly degrade monster destroy often think young men fly plane corruption soul turn monster need destroyed", "genres": ["Fiction & Literature"], "summary": "How does a handsome young man who keeps company with poets and dreams of fame and fortune in the movie business become a brutal killer who massacres women and children without turning a hair? Wolf Dreams reveals this transformation in a novel of unflinching detail and commanding prose. \r\n\r\nThe story follows Nafa Walid, heart-throb of the Casbah, as he gradually loses control of his destiny and becomes drawn into the Islamic Fundamentalist movement. Wolf Dreams illustrates how disappointment and disillusion, when they intersect with the persuasive voice of fundamentalism and the chaos of civil war, can transform a normal, middle-class young man into a mindless assassin; a man who inflicts pain and terror on others without qualms, and accepts the idea of his own death with devotion.\r\n\r\n\"A writer who can understand man whereever he is...\" The New York Times", "asin": "1592641865", "rank": "1660549", "city": "Algiers", "image": "https://images-na.ssl-images-amazon.com/images/I/41edxfItjcL.jpg", "country": "Algeria", "story_arc": ["Tragedy", "Things only get worse"]}