{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 21, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "thanksit is just what i wanted"}, {"review_sentiment": 5.0, "review_text": "It is so beautifully written and extremely descriptive. I can't wait to get to see the real Venice for myself now."}, {"review_sentiment": 5.0, "review_text": "astonishingly sharp, evocative, emotional, spiritual and optimistic. Really the cleanest most focused prose I have read in a long long time."}, {"review_sentiment": 5.0, "review_text": "Having been to Venice a few times over the past 40 years, I am familiar with the City and did NOT need a typical guide book.  Mr. Scarpa gave travel tips, BUT they were woven into a beautifully-written love story of Venice!"}, {"review_sentiment": 5.0, "review_text": "Funny book from a native Venetian perspective."}, {"review_sentiment": 5.0, "review_text": "Perfect transaction! Great book."}, {"review_sentiment": 5.0, "review_text": "I was there four years ago...this brought back a lot of memories.  I do wish I had read it first.  I think it would have added another layer of pleasure to the visit.  If you're going, or if you've been, I think you will enjoy this collection."}, {"review_sentiment": 4.0, "review_text": "Interesting"}, {"review_sentiment": 2.0, "review_text": "If I understood Italian, I would have preferred this book in the original version.  The English translation includes complex and over the top  descriptive text."}, {"review_sentiment": 5.0, "review_text": "Tiziano Scarpa's \"Venice Is a Fish: A Sensual Guide\" provides a unique, almost magical, means of exploring the canals and alleyways of Venice. Be warned, this is not another guidebook that will lead you on a shopping excursion from Piazza San Marco to the Rialto Bridge, but instead Scarpa's volume is almost a book of spells that will enchant you and subsequently haunt you. Scarpa grew up in Venice and the ghosts of his past flicker in and out of our view as he leads us through the labyrinth of stories that is Venezia. We embody the feet, legs, hearts, hands, faces, ears, mouths, noses, and eyes of those who have come before us. Their senses conjured by Scarpa summon us to a dance of time. We meet Casanova and Vivaldi, Titian and Veronese, Ruskin and Maupassant. Scarpa reminds us that for centuries each viewpoint in Venice has been recorded in verse, paint, and song. The weight of beauty as much as the high water (alte acqua) threatens to sink this illustrious city. Scarpa's splendid volume acts as a literary life raft to lift us and carry us through the Venice of memory, dreams, and decay."}]}, "authors": ["Tiziano Scarpa"], "isbn": "1592404073", "longitude": 12.3345898, "periods": ["2000s", "Recent Releases"], "title": "Venice Is a Fish: A Sensual Guide", "word_cloud": "thank sit want beautifully write extremely descriptive see real astonishingly sharp evocative emotional spiritual optimistic cleanest focus prose long long time have time past year familiar typical give travel tip woven love story native perspective perfect transaction year ago bring lot memory wish first think layer pleasure visit go think collection interest understand italian original version english translation include complex top descriptive text provide unique almost magical mean explore canal alleyway warn guidebook lead shopping excursion instead volume almost spell enchant subsequently haunt grow ghost past flicker view lead labyrinth story embody foot leg heart hand face ear mouth nose eye sens conjure summon dance time meet remind century viewpoint record verse paint song weight beauty much high water late aqua threaten sink illustrious city splendid volume act literary life raft memory dream decay", "genres": ["Travel Writing", "Urbanism"], "summary": "One of Italy’s brightest literary lights reinvents travel writing with a seductive, intoxicating celebration of the magical saltwater city \r\n\r\n“Venice is a fish,” writes Tiziano Scarpa. “It’s like a vast sole stretched out against the deep. How did this marvelous beast make its way up the Adriatic and fetch up here, of all places?” Paying homage to his native city in a lyrical and evocative style, he guides readers down tiny alleys, over bridges, and through squares, daring us to lose ourselves, forget the guidebooks, and experience Venice as Venetians do. \r\n\r\nVenice Is a Fish provides no hotel ratings or museum hours. Instead, in a delightful initiation, Scarpa tells us how to balance while standing on a gondola; where lovers will find the best secret hiding places; the finer points of etiquette and navigation during an agua alta; and how best to defend ourselves from the pitiless beauty of one of the world’s most stimulating cities. Open Venice Is a Fish, and Scarpa’s magnificent images, secret history, and hidden lore unfold like a treasure map of the senses.", "asin": "1592404073", "rank": "2509539", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51Cg2sWsg0L.jpg", "country": "Italy", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}