{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 191, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Loved the read."}, {"review_sentiment": 5.0, "review_text": "Great book, super service from supplier!!!  Couldn't be happier with this one!"}, {"review_sentiment": 5.0, "review_text": "I immediately began reading this book a second time! It is full of insights into the French culture. Easy to read and so valuable for understanding the French."}, {"review_sentiment": 3.0, "review_text": "I read this since I'll be going to Paris soon. It was helpful to learn about some of the customs but I wouldn't really recommend it otherwise."}, {"review_sentiment": 4.0, "review_text": "Really enjoyed this though perhaps I should have read it rather than gotten the audio version (hence the four stars). The woman reading has the loveliest voice when speaking English, but I cringe each time she pronounces french words and or imitates the French accent. That said... I would especially recommend for anyone currently living in France (notably Paris) from the English speaking world, who's having a bout of homesickness and or needs to hear some common experience. It's helped me feel a little less alone especially on those rough homesick days!<3 <3 Thank you Sarah Turnbull for sharing your experience."}, {"review_sentiment": 4.0, "review_text": "lovely book, well done transaction.  Thanks"}, {"review_sentiment": 5.0, "review_text": "I've read it 3 times..........Great story and writer.I'm on her sequel"}, {"review_sentiment": 2.0, "review_text": "I supposed I like books with a bit more suspense, as it mattered not to me weather I was picking up this book or putting it down..."}, {"review_sentiment": 5.0, "review_text": "Almost French is a great read, and enjoyed by each adult who has read it."}, {"review_sentiment": 4.0, "review_text": "Very entertaining following her journey in France.  I would have liked a little more details of their relationship, as I wasn't sure how serious it was."}]}, "authors": ["Sarah Turnbull"], "isbn": "1592400825", "longitude": 2.3514992, "periods": ["2000s", "Recent Releases"], "title": "Almost French: Love and a New Life in Paris", "word_cloud": "love super service supplier happier immediately begin read second time full insight french culture valuable understanding french go soon helpful learn custom really otherwise really enjoy perhaps rather get audio version hence star woman read loveliest voice speak english cringe time pronounces french word imitate french accent say especially anyone currently live notably speaking world homesickness need hear common experience help little le alone especially rough homesick day share experience lovely well do transaction thanks time story sequel suppose like bit suspense matter weather pick put french great enjoy adult very entertain follow journey little detail relationship sure serious", "genres": ["Memoir", "Travel Writing"], "summary": "The charming true story of a spirited young woman who finds adventure--and the love of her life--in Paris.\r\n\"This isn't like me. I'm not the sort of girl who crosses continents to meet up with a man she hardly knows. Paris hadn't even been part of my travel plan...\"\r\n\r\nA delightful, fresh twist on the travel memoir, Almost French takes us on a tour that is fraught with culture clashes but rife with deadpan humor. Sarah Turnbull's stint in Paris was only supposed to last a week. Chance had brought Sarah and Frédéric together in Bucharest, and on impulse she decided to take him up on his offer to visit him in the world's most romantic city. Sacrificing Vegemite for vichyssoise, the feisty Sydney journalist does her best to fit in, although her conversation, her laugh, and even her wardrobe advertise her foreigner status. But as she navigates the highs and lows of this strange new world, from life in a bustling quatier and surviving Parisian dinner parties to covering the haute couture fashion shows and discovering the hard way the paradoxes of France today, little by little Sarah falls under its spell: maddening, mysterious, and charged with that French specialty-séduction.\r\n\r\nAn entertaining tale of being a fish out of water, Almost French is an enthralling read as Sarah Turnbull leads us on a magical tour of this seductive place-and culture-that has captured her heart", "asin": "1592400825", "rank": "343938", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51OQKEDk3LL.jpg", "country": "France", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}