{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 50, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "great book...bought 2 for Christmas gifts"}, {"review_sentiment": 5.0, "review_text": "Resurrection came as ordered even faster than I thought.A friend was so excited about the book I wanted to begin reading as soon as possible."}, {"review_sentiment": 5.0, "review_text": "Excellent read, great suspense, even made me think about my faith.  I hope to get my daughter and granddaughter to read this one."}, {"review_sentiment": 3.0, "review_text": "British army nurse Gemma Bastion is struggling to recover from the horrors of WWII when her archaeologist father dies in Cairo. She travels there for his memorial service, staying at the home of his closest friend. Very shortly, it becomes apparent that he must have been murdered, and Gemma determines to discover how and why. As she clears out his office at the archaeology museum, she comes to suspect that his work, centering upon ancient papyrus scrolls, lead directly to his death.Author Malarkey does a creditable job of resurrecting the English colony in late 1940's Cairo. She also resurrects, from that earlier perspective, the themes that drove The DaVinci Code. There's little new here, and the plot tends to drag in the middle. But Resurrection is an adequately presented novel about a young woman, her quest for truth, her recovery from trauma, and her growing desire to reconnect with humanity and love again. Conservative Christians will probably take offense, but this is a well written version of the historical data that has given rise to so much recent controversy."}, {"review_sentiment": 2.0, "review_text": "Take some basic controversial Christian themes, mix in an exotic setting and here you have an uninspired novel. What could have been an interesting examination of women, Christianity and their place in modern society ends up feeling much more light summer reading than anything profound. Too bad, as the potential was there to say something deeper."}, {"review_sentiment": 3.0, "review_text": "I personally found this book rather boring.  The premise is interesting, but the character development was disappointing.  I found it very hard to care about any of the characters.  I did not care one bit about what happened to Gemma, and her dual flirtation was annoying.  Anthony was too perfect for words, and Michael conversely flawed.  The sad truth was I just didn't care.  Too bad, because the potential was there."}, {"review_sentiment": 3.0, "review_text": "This is a decent novel about the gnostic gospels which were discovered in Nag Hammadi. The world of Biblical scholarship is well aware of them and well aware of the many differences between the gnostic versions and the Gospels in the New Testament. I prefer the New testament myself over the gnostic presentations. However, I digress. The novel is a decent story about the finding of these gospels and other materials.J. Robert Ewbank author \"John Wesley, Natural Man, and the 'Isms'\""}, {"review_sentiment": 5.0, "review_text": "Many of us already know about the Nag Hammadi scrolls (papyrus codices), discoverd in the 1940's. They are a significant discovery - not just of early written history - but also of a very different understanding of the early Christian beliefs. (The only complete copy of the \"Gospel of Thomas\" is among these Nag Hammadi codices.) It took decades for translation and dissemination to be complete, so only within the past few decades have we had full access. (Translations began to appear in the 1970's.)Despite their importance, not many of us have really read the translated Nag Hammadi documents. Even when we do, it's often hard to get a sense of their significance - and their role vis-a-vis the more well-known gospels and letters of the New Testament. Thus, getting a sense of how these codices were discovered - and what they contained - is of great value. It helps us round out our understanding - bringing our knowledge of early Christian beliefs into a more complete realm.Tucker Malarkey has done us all a great service in not only describing (via a fictionalized account, but somewhat plausible and containing many key elements of) how the Nag Hammadi scrolls were actually found - and later how they made their way into scholar's hands for translation.She also piques our interest by presenting us with portions of these texts, as \"read\" by the heroine Gemma and others in her story.By putting this significant discovery in the context of a very readable and likeable story, Ms. Malarkey inspires us to go read the original (translated) sources, and appreciate the new depths and richness that they bring.Ms. Malarkey's characters are interesting and engaging, the plot is well-worked, the settings are beautifully done, and overall, this book is a very satisfying read.I reference \"Resurrection\" as a recommended book at the end of Chapter 13 in \"Unveiling: The Inner Journey,\" as a good way to get a deeper appreciation of Mary the Magdalene's role in the early church.Alianna J. Maren, Ph.D.Author (under the nom de plume \"Alay'nya\")\"Unveiling: The Inner Journey\""}, {"review_sentiment": 4.0, "review_text": "The discovery of the Nag Hammadi library in Egypt in the 1940s was one of the most significant archeological finds of the 20th century. It is a remarkable collection of books that were hidden for some 1500 years, and finally discovered just 65 years ago. Evidently the original owners of this collection in the 4th century thought their works were in serious danger from the established church, and hid them in hopes of saving them from destruction. Tucker Malarkey takes the facts of this discovery, adds some international intrigue, throws in some irrational fear on the part of heavy handed ecclesiastical authorities, and comes up with a compelling story.Like Dan Brown in The da Vinci Code, Malarkey sometimes plays fast and loose with the facts, but weaves a tale that is worth reading nonetheless. The story concerns a woman seeking to understand the death of her father. She happens to be one of those into whose hands fall some of these ancient, unorthodox books. Why did her father die? Was it at the hands of some nefarious persons who were threatened by their teachings? What was her father's interest in these volumes in the first place? Her search for answers, combined with her own journey of faith, love and understanding form the basis for this well woven tale.The plot thickens when it is discovered that these ancient teachings concern some new gospels, in particular a Gospel of Thomas. These new gospels suggest that Jesus and the earliest believers were not nearly as down on women as Christianity seems to be today. Truth be told, much of the Christian world is moving along nicely in accepting the full humanity of women. But the author eschews such nuances, and refuses to let the facts get in the way of a good story. I say this even though she consulted with one of the foremost Nag Hamadi scholars in the world today, which speaks well of her research.I found it refreshing and enjoyable to read about this archeological discovery from such a fanciful perspective. It is good to see the Gospel of Thomas and other important ancient books get some popular exposure in the world today. The books themselves are worth reading and if their appearance in this novel increases their awareness, so much the better.Resurrection deals with much historical truth, and some of the characters are actual people, but it all comes together in a story that, even though it stretches the truth at some points, is well crafted and nicely presented. Far from being a \"bunch of Malarkey\", hers is a novel of keen insight and human drama."}, {"review_sentiment": 3.0, "review_text": "The plot of this informative story in the style of THE DA VINCI CODE is a bit tedious, maybe because it has been done too many times. However, the presentation of the revelations and discovery of the Gnostic Gospels is interesting and informative. Set in the 1940's, the time when the scrolls of these ancient gospels were discovered at Nag Hammadi, the characters struggle to discover the value and truths of the lost gospels, while church supporters try to hide them and what they mean."}]}, "authors": ["Tucker Malarkey"], "isbn": "159448919X", "longitude": 31.243666, "periods": ["1900s", "Recent Releases"], "title": "Resurrection", "word_cloud": "great buy gift come order even faster friend excited want begin read soon possible excellent great suspense even make think faith hope daughter granddaughter british army nurse struggle recover horror archaeologist father dy travel memorial service stay home closest friend very shortly become apparent murder determine discover clear office archaeology museum come suspect work center ancient papyrus scroll lead directly creditable job resurrect english colony late also resurrect earlier perspective theme drive little new plot tends drag middle adequately present young woman quest truth recovery grow desire reconnect humanity love probably take offense well write version historical data give rise much recent controversy basic controversial theme mix exotic setting uninspired examination woman place modern society end feel much light summer read anything profound bad potential say something deeper personally find rather bore premise interesting character development disappoint find hard care character care bit happen dual flirtation annoy perfect word conversely flaw sad truth care too bad potential decent gnostic gospel discover world scholarship well aware well aware many difference gnostic version prefer testament gnostic presentation however digress decent story find gospel author many already know scroll papyrus codex discover significant discovery early write history also different understand early christian complete copy codices take decade translation dissemination complete past decade full access begin appear importance many really translate document even often hard get sense significance role gospel letter get sense codex discover contain great value help understand bring knowledge early belief complete do great service describe fictionalize account somewhat plausible contain many key element scroll actually find later make way scholar hand also pique interest present portion texts heroine others put significant discovery context readable likable story inspire go original translated source appreciate new depth richness character interest engage plot setting beautifully do overall satisfying reference recommend end chapter unveil good way get deeper appreciation role early unveil discovery library significant archaeological find century remarkable collection year finally discover year ago evidently original owner collection century think work serious danger establish church hid hop save destruction take fact discovery add international intrigue throw irrational fear part heavy hand ecclesiastical authority come compel da sometimes play fast loose fact weave tale worth read nonetheless story concern woman seek understand death father happen hand fall ancient unorthodox father die hand nefarious person threaten teaching father interest volume first place search answer combine journey faith love understand form basis well woven plot thickens discover ancient teaching concern new gospel particular new gospel suggest earliest believer nearly woman seem today tell much christian world move along nicely accept full humanity woman author eschews nuance refuse let fact way good story say even consult foremost scholars world today speak well find refresh enjoyable archaeological discovery fanciful perspective good see important ancient popular exposure world today worth read appearance increase awareness much deal much historical truth character actual people come together story even stretch truth point well craft nicely present bunch keen insight human drama plot informative story style bit tedious maybe do many time however presentation revelation discovery interest informative time scroll ancient gospel discover character struggle value truth lose gospel church supporter try hide mean", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "A lost past. A hidden Gospel. A shocking discovery. \r\n\r\nIt's 1948, and British nurse Gemma Bastian travels to Cairo to close the affairs of her late father, staying at the home of David Lazar, her father's oldest friend, and his enigmatic sons. While she's there she stumbles across her father's last and most closely guarded archaeological project, one that could change the Christian world forever: the discovery of the legendary Lost Gospels. \r\n\r\nTorn between two brothers and beset by ominous warnings, Gemma finds herself caught in an intricate web of love and betrayal where she fights to resurrect her own shattered life and a faith that was lost to all of humanity.", "asin": "159448919X", "rank": "2057232", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/511EB1VG2QL.jpg", "country": "Egypt", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}