{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 80, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "The life of immigrants coming to America.  The statue of liberty beckons but what truly awaits?  Sometimes escape from the hell they are fleeing, otherwise why make the leap into the unknown?  Other times misery and racial persecution equal to their homeland.  In the end we have the utterly unique lives we are given and the choice between optimism, life, or cynicism, death.  This autobiography/novel wonderfully provokes us to consider what we are doing."}, {"review_sentiment": 3.0, "review_text": "According to Hemon, Lazarus was resurrected, raised from the grave by a prophet and part-time miracle worker called  J. Christ and went on to live in Marseilles. Hemon is an avowed atheist who cleverly weaves various acts of resurrection into this kaleidoscopic novel about alter ego (?) Brik, a Bosnian refugee from Sarajevo and struggling writer in Chicago, researching the death by police bullets there in 1908 of Lazarus Averbuch (LA), a young Jewish immigrant from the Ukraine, and its cover-up.About 100 years later, Brik, whose granddad arrived from the Ukraine in Bosnia with his parents aged 8, secures a grant and decides to find out more about LA in Eastern Europe, but not alone. He talks fellow exile and Sarajevo schoolmate Rora into joining him. Rora is a scion of an old, influential family, a story-teller, wisecracker, Muslim, coffee addict and compulsive  photographer. And a chancer who thrived during the siege of Sarajevo, the start of which Brik missed by weeks because of a short visit to Chicago. Rora is also Hemon’s and Brik’s best material witness to write about what they missed from this blatant feat of European inaction.The novel switches constantly between Brik’s puerile draft on Lazarus, his sister Olga and ugly 1908 newspaper reports about often Jewish immigrants with anarchistic leanings, and the pair’s travels and field research. A renewed surge of populism in press and politics may have prompted Hemon to write this book. Their Odyssey sheds light on reasons for wishing to live somewhere else: violence, stagnating economies, corruption, impunity, organized crime incl. human trafficking.What do migrants or refugees experience when they reach a host country? This is perhaps the main theme of this novel, expressed confusedly and eloquently by Brik himself. “Home is where someone notices your absence”, he says more than once. He comes across as a negative person, wounded, unkind, anxious, opinionated, scornful about religion, his wife’s work ethic and parents, what not…Aleksandar Hemon deftly wove personal names and words into a fabric of sorts across time and space by repeating e.g. s***, sardines, candy, armpit, flying carpet, home, etc.  I acknowledge its deeper messages, but also hate the miserable way he ended this book."}, {"review_sentiment": 2.0, "review_text": "So much potential, all wasted.A pointless, rambling \"buddy road trip\" novel whose worst offense is boredom, followed closely by unlikable characters and awkward \"dialogue\".My advice: skip this convoluted snoozer. Or risk ending up like me, wishing I had those hours of my life back."}, {"review_sentiment": 5.0, "review_text": "Another fantastic book by Hemon."}, {"review_sentiment": 3.0, "review_text": "And he has a particular fondness for onomatopoeic words. He is much smarter and more accomplished than most of us who read books and struggle to write book reviews that we hope are coherent. You will see this as quickly as you begin reading “The Lazarus Project,” a book written in beautiful English. It’s amazing that Mr. Hemon was able to begin publishing in English in just a few years after emigrating to the US. Kudos are due him for this and all his considerable accomplishments.This novel is an intricate frame story of sorts. The author skillfully alternates our attention between the early nineteenth century character,Lazarus Averbuck, and Brik, the present day Bosnian-American narrator; Brik’s life in the US, recollections of his past in the Balkans; his relationships to people in the US; and an on-going research trip back to Eastern Europe to do background research on eponymous Lazarus. Lazarus is a poor Jewish émigré fleeing the pogroms of Russia. He tragically meets his end at the hands the racist Chicago Chief of Police.Mr. Hemon’s depiction of the people of Chicago as extreme xenophobic anti-Semites is a bit overboard. He paints the people of Chicago, and by extension the rest of the US, as paranoid racists expecting to find an anarchist in every immigrant. Clearly this extreme characterization of Americans and the juxtaposition of the narrative between the early twentieth century US and the early twenty-first century US is a thinly-veiled denunciation of current American attitudes towards Muslims and the current demagogic leadership seeking to instill fear of terrorists. This comes off as heavy-handed. Heavy-handedness is exceeded only by the irony of a Bosnian pointing out the flawed race attitudes of today’s Americans."}, {"review_sentiment": 5.0, "review_text": "Deftly written, wry, and striking. A fascinating read for Americans (or anyone) unfamiliar with the immigrant experience, considering travel in Southeastern Europe, or generally satisfied to discover the relative nature of their own beliefs about the \"way things are.\""}, {"review_sentiment": 3.0, "review_text": "Well written, but the author seemed to forget his point and leave his major character in a place unrelated to the initial goal of the plot."}, {"review_sentiment": 3.0, "review_text": "Interesting."}, {"review_sentiment": 4.0, "review_text": "A little hard to follow but pretty compelling."}, {"review_sentiment": 2.0, "review_text": "The writing was very beautiful and I did become engrossed in the story. After awhile, however, I got bored with the tro men and their road trip. It was trying to be Jack Kerouac and the whole reasoning became lost on me. It is a very masculine tale and men may enjoy it more."}]}, "authors": ["Aleksandar Hemon"], "isbn": "1594483752", "longitude": -87.6244212, "periods": ["1900s", "2000s", "Recent Releases"], "title": "The Lazarus Project", "word_cloud": "life immigrant come statue liberty beckons truly awaits sometimes escape hell flee otherwise leap unknown other time misery racial persecution equal homeland end utterly unique life give choice optimism life cynicism death wonderfully provoke accord resurrect raise grave prophet miracle worker call go live avow atheist cleverly weave various act resurrection kaleidoscopic alter ego refugee struggle writer research death police bullet young immigrant year later granddad arrive parent age secures grant decides find la alone talk fellow exile schoolmate join scion old influential family wisecracked coffee addict compulsive photographer chancre thrive siege start miss week short visit also best material witness write miss blatant feat european switch constantly puerile draft sister ugly newspaper report often jewish immigrant anarchistic leaning pair travel field research renew surge populism press politics shed light reason wish live somewhere else violence stagnate economy corruption impunity organize crime incl human migrant refugee experience reach host country perhaps main theme express confusedly eloquently someone notice absence say come negative person wound unkind anxious opinionated scornful religion wife work ethic parent deftly weave personal name word fabric sort time space repeat sardine candy fly carpet home etc acknowledge deeper message also hate miserable way end so much potential pointless ramble buddy road trip worst offense boredom follow closely unlikable character awkward dialogue advice skip convolute snooze risk end wish hour life back fantastic lemon particular fondness onomatopoeic word much smarter accomplished struggle write review hope coherent see quickly read write beautiful amaze able begin publish english year emigrate due considerable intricate frame story sort author skillfully alternate attention early nineteenth century character present day narrator life recollection past relationship people research trip back research eponymous poor flee pogrom tragically meet end hand racist depiction people extreme bit overboard paint people extension rest paranoid racist expect find anarchist immigrant extreme characterization juxtaposition narrative early twentieth century early century denunciation current american attitude current demagogic leadership seek instill fear terrorist come exceeded irony pointing flaw race attitude today deftly write strike fascinating anyone unfamiliar immigrant experience consider travel generally satisfy discover relative nature belief way thing well write author seem forget point leave major character place unrelated initial goal plot interest little hard follow pretty compel write beautiful become engrossed story awhile however get bored men road trip try whole reasoning become lose masculine tale men", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "The only novel from MacArthur Genius Award winner, Aleksandar Hemon -- the National Book Critics Circle Award winning The Lazarus Project.\r\n\r\nOn March 2, 1908, nineteen-year-old Lazarus Averbuch, an Eastern European Jewish immigrant, was shot to death on the doorstep of the Chicago chief of police and cast as a would-be anarchist assassin.\r\n\r\nA century later, a young Eastern European writer in Chicago named Brik becomes obsessed with Lazarus's story. Brik enlists his friend Rora-a war photographer from Sarajevo-to join him in retracing Averbuch's path.\r\n\r\nThrough a history of pogroms and poverty, and a prism of a present-day landscape of cheap mafiosi and even cheaper prostitutes, the stories of Averbuch and Brik become inextricably intertwined, creating a truly original, provocative, and entertaining novel that confirms Aleksandar Hemon, often compared to Vladimir Nabokov, as one of the most dynamic and essential literary voices of our time.", "asin": "1594483752", "rank": "255381", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/51JHdAR8AKL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}