{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 59, "rating": 4.4, "reviews": [{"review_sentiment": 2.0, "review_text": "First off, this book is about 10years of date.  Updating the introduction did little to help. The book itself just seemed to be a collections of previously written articles stuffed into a book.  It has no focus, no order, and ends up being basically a disaffected journey through various aspects of Mexico City that the author found interestingly quirky but to me it got boring other quickly.  I was ready to put it down about 2/3's of the way through but soldiered on- to no good end.  Indeed the overall tone of all the articles was  disturbingly downcast.  I kept wondering why the author lived there for a decade if it was so dissolute and depressing.  His presentation did not reflect at all how incredibly fascinating and inspiring the city is and did not reflect at all the city I found it to be on three visits now."}, {"review_sentiment": 5.0, "review_text": "very readable.  theres many depressing parts, but its supposed to be accurate not sugarcoated"}, {"review_sentiment": 2.0, "review_text": "A number of years ago, while on my way to Costa Rica, a delay caused the airline to put me up in a Mexico City hotel for the night. There were a couple of parties past the lobby with Mexican families - people dancing, singing, drinking and donning masks. I was invited to join in the festivities by a few of the guests - the fun was infectious. Afterwards I was treated to a scenic drive through the area. It was enough to compel me to visit again which proved another amazing adventure. While preparing for a longer sojourn my mother came across a promotional email about Lida's book and forwarded it to me. I read the book in good faith and took its contents to heart. There are relatively few books written by ex-pats living in Mexico City, and unfamiliar with the niche, perhaps I gave this particular account too much credence. Lida's account of life in Mexico City, I realized later, was peppered with exaggerations, opinion and personal bias. He writes about the breakdown in law and order, about how the police are detested and untrusted by the public so much that people avoid them like the devil, even in crucial times of need - even if one is lost and in need of directions. He offered anecdotes of mob violence including lynchings of officers outed as corrupt. If you want to get a basic sense of DF in a nutshell this book is not without merit, but reading this book is a distracting affair, akin to reading an opinion blog strung together. I found the writing disjointed, and the overall style voyeuristic, touristy, distant and dispassionate. I would much rather hear was Rick Steves has to say after a brief visit. Sure, there are plenty of interesting and informative descriptions and factoids thrown in that may prove useful. But if you want a deeper, more intimate and sophisticated understanding - to feel the enchantment and soul of Mexico - there are better reads out there. The Interior Circuit: A Mexico City Chronicle, by Francisco Goldman, is one of them."}, {"review_sentiment": 4.0, "review_text": "Good book. Interesting and entertaining."}, {"review_sentiment": 5.0, "review_text": "Great book. Easy read. I took it with me on a family vacation to Mexico City, Christmas week 2015. Read about half on the plane over, more while I was there. At first I was thinking, this is too much inside baseball, it's for folks who live there. But wouldn't you know it, on my first two days I encountered most of the little details of street and daily life that Lida highlighted. I kept telling my wife and kids,\"Oh yeah, I read about this in the book\". Chalk it up to a sharp journalistic eye coupled with the perspective of a non-native. I'd love to see Lida's take on how the city has progressed since the book was published in 2008."}, {"review_sentiment": 5.0, "review_text": "David Lida is a fine writer.  The man has a way with words.  And he uses them skillfully, artistically, and at moments emotionally, to illuminate non-traditional aspects of his adopted home city, el Distrito Federal - aka el. D.F. - better known in gringolandia as Mexico City.  For the thoughtful traveler who wishes to immerse him or herself in the quirks and oddities of Mexican culture before visiting either Mexico City or Mexico in general, this book is somewhere between entertaining and indispensable.  It gets my highest serious real world recommendation.  As an added treat, those not familiar with David Lida's writing/s....should be surprised and occasionally delighted."}, {"review_sentiment": 5.0, "review_text": "The masterful Irish writer Colm Toibin provided a blurb for the cover of this book that is too good not to repeat: “From now on, anyone who goes to Mexico City without David Lida’s book is mad.”  First Stop in the New World is that fascinating. Even someone not travelling to the “cultural capital of the Spanish-speaking world” will find David Lida’s examination of the city he was once too scared to enter challenging and enthralling.This book offers a far better preparation for a visit to Mexico City than any of the tourist guides available. Lida immerses his readers in the everyday lives of Mexicans from the various social divisions in the city, as pronounced, he believes, as any to be found in England or India. He is especially insightful in presenting the city’s poor and working class and how they function with so little monthly income and remain seemingly invisible to the upper classes. But Lida spans all facets of city life – the mania for wrestling matches among the populace, the preponderance of Wal-Marts, the furtiveness of sex as a cultural reality, the search to obtain the fine dining that many tourists seek, and what makes various neighborhoods distinctive.  Especially important is the author’s take on the steep difference between reported and real crime in the city (much less than visitors fear).Mexico City can be chaotic and overwhelming, but First Stop in the New World makes it much less so. Reading it allows you to become an insider on some of the forces at play.Michael Helquist, author, MARIE EQUI: Radical Politics and Outlaw Passions"}, {"review_sentiment": 5.0, "review_text": "This is an excellent book. Very well documented and written. I bought this book because I wanted to learn more about the culture of my country. Because I am Mexican, many behaviors we have in Mexico city are completely \"normal\" to me. This \"normalization\" very often hides the specificities of the culture. The view from outside always helps to highlight the differences. David Lidia's book helped me to realize some of these specificities.He has been living in Mexico city for decades. So he knows quite well what he is talking about. I have even learnt some details about my city that I didn't know. He picked up some views of different social classes (rich and poor, also foreigners). The experience of living in this city depends on the social situation in which you are. It is not the same thing to live as a worker (badly paid, living in the east of the city) or as a manager or an incredibly wealthy politician living in Santa Fe. Even foreigners obtain good jobs more easily than natives do.David Lidia has some critical views. He denounced social inequalities (it's a pity that the richest man in earth –Carlos Slim- lives here, meanwhile there is a huge poor population living in unworthy conditions), machism (girls and women are victims of harassment), and the double moral (appearances, people who behave in different ways in public and private spaces, e.g. sexual fidelity in public, cheaters in private).A very interesting point he makes is about the sense of insecurity in Mexico city. He claims that the feeling of insecurity in this city is over exaggerated. Chilangos consider everyday very seriously to avoid the possibility of being a victim of murder, robbery, etc. There is a strong lack of trust between unknown people. But the point is that according to statistics the probability of being a victim of murder is higher in LA, Chicago or Washington DC than in Mexico city. But there are some firms who take advantage of this situation (they offer security services). Even the government obtains a piece of cake, as they manage to focus the political debate on these topics –the death penalty, a more severe punishment for criminals-, in order to avoid the debate of social problems caused by neoliberalism.At the end of the book Lidia talked about how the mexican working class is living in this chaotic city despite the government (bad urban plans and corruption both in federal and local levels). The shocking point is that this city has not collapsed yet in spite of the chaos. Why? The answer Lidia explores is related to resilience. Mexican people have learnt to deal with uncertainty. The earthquake of 1986 is a case in which people helped each other without the “aid” of a corrupt government (the political party called “PRI”). The same story goes with the economic crisis and neoliberalism. Mexican people developed an “informal economy” which creates jobs, decreases the prices of basic goods and this has helped hitherto the survival of the mexican working class."}, {"review_sentiment": 5.0, "review_text": "Very interesting. A great read."}, {"review_sentiment": 5.0, "review_text": "Wonderful, funny, a different approach. I have lived in Mexico City for more than 30 years, and still learned a lot."}]}, "authors": ["David Lida"], "isbn": "1594483787", "longitude": -99.1333416, "periods": ["2000s", "Recent Releases"], "title": "First Stop in the New World", "word_cloud": "date introduction little seemed collection previously write article order end basically disaffect journey various aspect author find interestingly quirky get boring quickly ready way soldier good end indeed overall tone article disturbingly downcast keep wonder author live decade dissolute depress presentation reflect incredibly fascinate inspire city reflect city find visit readable theirs many depress part suppose accurate sugarcoat number year ago way delay cause airline put hotel night couple party lobby family people dance sing drink don mask invite join festivity guests fun infectious afterwards treat scenic drive area enough compel visit prove amazing adventure prepare longer mother come promotional email forward good faith take content heart relatively write live unfamiliar niche perhaps give particular account much credence account life realize later pepper exaggeration opinion personal bias write breakdown law order police detest entrusted public much people avoid devil even crucial time need even lose need direction offer anecdote mob violence include lynching officer out corrupt want get basic sense nutshell merit read distract affair akin reading opinion blog string together find write disjoint overall style voyeuristic touristy distant dispassionate much rather hear say brief visit plenty interest informative description factoid thrown useful want deeper intimate sophisticate understanding feel enchantment soul better read good entertaining take family vacation week half plane think much baseball folk live day encounter little detail street daily life highlight keep tell wife kid yeah chalk sharp journalistic eye couple perspective love city progress publish fine writer man way word use skillfully artistically moment emotionally illuminate aspect adopt home city e aka e better know gringolandia thoughtful traveler wish immerse quirk oddity mexican culture visit general somewhere entertain indispensable get highest serious real recommendation added treat familiar surprise occasionally delighted masterful irish writer provide blurb cover good repeat anyone go fascinate even someone travel cultural capital find examination city scar enter challenge offer far better preparation tourist guide available immerse reader everyday life various social division city pronounce believe find especially insightful present city poor work class function little monthly income remain seemingly invisible upper class span facet city life mania wrestling match populace preponderance furtiveness sex cultural reality search fine din many tourist seek make various neighborhood distinctive especially important author take steep difference report real crime city much le visitor fear chaotic overwhelm make much le read allow become insider force author passion excellent very well document write buy want learn culture country mexican many behavior city completely normal normalization often hide specificity culture view always help highlight difference help live city decade so know quite well talk even learn detail city know pick view different social class rich poor also foreigners experience live city depend social situation thing live worker badly pay live east city manager incredibly wealthy politician live foreigner good job easily natives critical view denounce social inequality pity richest man earth live meanwhile huge poor population live unworthy condition machismo girl woman victim harassment double moral appearance people behave different way public private space sexual fidelity public cheater private interesting point make sense insecurity city claim feel insecurity city exaggerate everyday seriously avoid possibility victim murder robbery etc strong lack trust unknown people point accord statistic probability victim murder higher city firm take advantage situation offer security service even government obtains piece cake manage political debate topic death penalty severe punishment order avoid debate social problem cause end talk mexican work class live chaotic city government bad urban plan corruption federal local level shocking point city collapse yet spite chaos answer explore relate resilience mexican people learn deal uncertainty earthquake case people help aid corrupt government political party call story go economic crisis neoliberalism mexican people develop informal economy create job decrease price basic good help hitherto survival mexican work class very interest great wonderful funny different approach live year still learn lot", "genres": ["History", "Travel Writing"], "summary": "The definitive book on Mexico City: a vibrant, seductive, and paradoxical metropolis-the second-biggest city in the world, and a vision of our urban future.\r\n\r\nFirst Stop in the New World is a street-level panorama of Mexico City, the largest metropolis in the western hemisphere and the cultural capital of the Spanish-speaking world. Journalist David Lida expertly captures the kaleidoscopic nature of life in a city defined by pleasure and danger, ecstatic joy and appalling tragedy-hanging in limbo between the developed and underdeveloped worlds. \r\n\r\nWith this literary-journalist account, he establishes himself as the ultimate chronicler of this bustling megalopolis at a key moment in its-and our-history.", "asin": "1594483787", "rank": "302323", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/51muAc8VFBL.jpg", "country": "Mexico", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}