{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 66, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "At first I didn't like it. But the author has such a way of drawing the four characters for you that you fall in love with each of them, and care desperately about their lives. Charming. Not heavy but charming."}, {"review_sentiment": 4.0, "review_text": "Somewhat difficult at first but only due to my inabilities.  When I finally caught up with the characters, I loved every word.  very intelligent ."}, {"review_sentiment": 2.0, "review_text": "It was an okay read, more like a beach read. It was sweet, fun, and romantic. Towards the end, it simply moved far too slowly for me. I keep hearing how the movie is far better. I don’t think that I’ll be able to see that anytime soon. All in all, this wasn’t as good as I had hoped it would be. Maybe I just wasn’t in the right mood.One of my favorite quotes:“Our certainties never really hold water. One day you feel like dying and the next you realize all you had to do was go down a few stairs to find the light switch so you could see things a bit more clearly.”"}, {"review_sentiment": 5.0, "review_text": "loved it!"}, {"review_sentiment": 5.0, "review_text": "Loved all the characters in this book!"}, {"review_sentiment": 5.0, "review_text": "We read this for our book club. It was a great read. I am inspired to read more from this author."}, {"review_sentiment": 5.0, "review_text": "Couldn't wait to get back to reading each time. I loved spending time with these flawed souls, trying their best to navigate life despite their counterproductive defenses."}, {"review_sentiment": 3.0, "review_text": "Interesting story and characters, but sometimes I just felt a little lost.  I didn't feel as if it wasn't worth reading...it was just okay for me. Maybe if I knew a little more about it going in so it made more sense."}, {"review_sentiment": 5.0, "review_text": "great book"}, {"review_sentiment": 5.0, "review_text": "Lovely read. Enjoyed every minute of it."}]}, "authors": ["Anna Gavalda"], "isbn": "159448144X", "longitude": 2.3514992, "periods": ["2000s", "Recent Releases"], "title": "Hunting and Gathering", "word_cloud": "first like author way draw character fall care desperately live charm not heavy charming somewhat difficult first due inability finally catch character love word intelligent okay beach sweet fun romantic end simply move far slowly keep hear movie far better think able see anytime soon all good hop maybe right favorite quote certainty never really hold water day die next realize go stair find light switch thing bit clearly love love character club great inspire author wait back reading time love spending time flaw soul try best navigate life counterproductive defense interest story character sometimes felt little lose feel worth read okay maybe know little go make sense great lovely enjoy minute", "genres": ["Fiction & Literature"], "summary": "Prize-winning author Anna Gavalda has galvanized the literary world with an exquisite genius for storytelling. Here, in her epic new novel of intimate lives - and filled with the \"humanity and wit\" (Marie Claire) that has made it a bestselling sensation in France - Gavalda explores the twists of fate that connect four people in Paris. Comprised of a starving artist, her shy, aristocratic neighbor, his obnoxious but talented roommate, and a neglected grandmother, this curious, damaged quartet may be hopeless apart, but together, they may just be able to face the world.", "asin": "159448144X", "rank": "376192", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51dkFqhT0mL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}