{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 44.0505054, "ratings": {"num_ratings": 104, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Ever since I got involved with track and field/ cross country in high school, running has been a hobby for me and just be able to escape from all the negative thoughts. Kenny Moore's book on \"Bill Bowerman and The Men Of Oregon\" was an instant hit for me! I was able to relate to the times where you ran a hard workout before a big meet, how the team was pretty much a family, and having an inspiring distance coach be with you through thick and thin. I know what it's like. If you are like me, who has been running in high school and college (and even if you are not on college track team), I highly suggest buying this book! Who knows, it might inspire you to lace up those spikes and run on the track."}, {"review_sentiment": 5.0, "review_text": "Great read for anyone that enjoys running and reading about running."}, {"review_sentiment": 5.0, "review_text": "I greatly enjoyed this look into the extraordinary achievements and innovations that Coach Bowerman brought to middle distance running in the 20th century. Author Kenny Moore, a world class marathoner himself, was the perfect individual to communicate to the reader the intensity of elite track and field. This book is a great read for anyone interested in endurance athletics snd athletes."}, {"review_sentiment": 4.0, "review_text": "Bowerman was quite a man who had a huge impact on track and on life in general. My main complaint with the book is Moore's verbosity. He could have edited this thing down by 30 percent and produced a much more readable book.  As one example, he goes into detail ad nauseum about Barbara Bowerman's vacillations over boy friends and her twitterpation over Bill. Good, grief. Who cares? I had to skim rapidly through some of the trite details (in many instances) to get through the book. Still, Bowerman was a heckofa man, and I'm glad to have read about him."}, {"review_sentiment": 5.0, "review_text": "An iconic book by one of, if not the best, running authors - ever! Kenny Moore experienced this period in running history firsthand, and he captures every event, experience and emotion as only He can.  A truly great read!"}, {"review_sentiment": 5.0, "review_text": "kenny moore is a fine writer on a great subject. Go Ducks!"}, {"review_sentiment": 5.0, "review_text": "Kenny Moore was not only a great Duck track star but he is an even better author.  This is much more than a sports book it also includes the life of Bowerman, his family, including his ancestors. Additionally the book gives an in depth perspective on his athletics including their skill levels but more importantly their personalities, family lives and their strengths and weakness both as athelics and as human beings.  A great read!"}, {"review_sentiment": 5.0, "review_text": "Great book.  From insight to early running theory, olympics, the 10th Mountain in World War 2, to the orgins of Nike. Time to think about waffle soles and go for a jog."}, {"review_sentiment": 5.0, "review_text": "I thought I knew the story of Bowerman, Ducks, and Pre. this gave more emotion and context than I could imagine"}, {"review_sentiment": 5.0, "review_text": "Great book, I had been wanting to read it for years and finally remembered to download it. Kenny Moore went on to become the pre-eminent track and field writer of our time, but before that he was a world class runner who just happened to run at Oregon in that magic time of Bowerman and Prefontaine, among other greats. On top of that, former Oregon runner Phil Knight was starting up Nike in the same timeframe. All of which makes for incredible stories, which Moore captures with his talented pen."}]}, "authors": ["Kenny Moore"], "isbn": "1594867313", "longitude": -123.0950506, "periods": ["1900s", "2000s"], "title": "Bowerman and the Men of Oregon: The Story of Oregon's Legendary Coach and Nike's Cofounder", "word_cloud": "ever get involve track cross country high school run hobby able escape negative thought instant hit able relate time run hard workout big meet team pretty much family inspire distance thin know run high school college even college track team highly suggest buy know lace spike run track anyone enjoy run read run greatly enjoy look extraordinary achievement innovation bring middle distance run century world class marathoner perfect individual communicate intensity elite track field great anyone interested endurance athletics and athlete quite man huge impact track life general main complaint verbosity thing percent produce much readable example go detail ad nausea vacillation boy friend twitterpation grief care skim rapidly trite detail many instance get still checkoff man glad iconic best running author ever experience period run history firsthand capture event experience emotion truly great kenny moore fine writer great subject great track star even better author much sport also include life family include ancestor additionally give depth perspective athletics include skill level importantly personality family live strength weakness athletics human being great great insight early run theory olympics groin nike waffle sol go jog think know give emotion context want year finally remember download go become track field writer time world class runner happen run magic time great top former runner start time frame make incredible story capture talented pen", "genres": ["Biography", "Business & Finance", "Sport"], "summary": "The first biography of the legendary track coach, and founder of Nike, who had an unparalleled impact on the sport of running\r\n\r\nDuring his tenure as track coach at the University of Oregon from 1949 through 1972, Bill Bowerman won 4 national team titles, trained dozens of milers to break the 4-minute barrier, and his athletes set 13 world and 22 American records. Single-handedly he helped turn the college town of Eugene, Oregon, into the running capital of the world.\r\n\r\nIn Bowerman: The Wings of Nike, Kenny Moore, a world-class marathon runner and one of Bowerman's Oregon men, tells the story of his mentor and hero, drawing on years of taped interviews and the full cooperation of the Bowerman family and Nike, the company that Bowerman helped to found through his invention of the waffle-soled running shoe.\r\n\r\nWhether providing a fresh look at the tragic siege at the 1972 Munich Olympic Games, where Bowerman coached the track and field team; offering a close-up view of the coach's relationship with runner Steve Prefontaine (subject of the movie Without Limits, co-written and co-produced by Moore); or exploring Bowerman's role as a Nike innovator, this illuminating portrait is compelling reading throughout―ample evidence of why Bowerman's widow, noting how well the author understood her husband, said: \"If anyone should write Bill's life story, it's Kenny Moore.\"", "asin": "1594867313", "rank": "115119", "city": "Eugene", "image": "https://images-na.ssl-images-amazon.com/images/I/51NovwT3X9L.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}