{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 296, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Simply amazing! From the intriguing and intricately woven storyline, to the complex and well honed personalities of the characters, to the beautiful prose and even the vulgarity of the world as it was for the Jamaican sugar cane plantation slavery culture. All narrated in a jamaican patois that rolls so smoothly along, lending to bringing the reader in to this dark and dangerous world that the beautiful smart young protoganist has found herself born into."}, {"review_sentiment": 5.0, "review_text": "Wowwwwww...  I could not put the book down. I am a Jamaican living  in Mexico and seeing jamaica from an external viewpoint was very eye opening. Marlon captured the language,  culture and tradition with precision. My only regret is that he does not have more books apart from 7 killings and john crow.Will he públish a new one soon?5 start for the way he captured this epic piece of my culture"}, {"review_sentiment": 5.0, "review_text": "My Creative Writing professor mentioned this book in class but it was her facial expression when she said its name that made me buy it.  This book is without competition the most amazing, attention grabbing book I have ever read. I will never forget it."}, {"review_sentiment": 4.0, "review_text": "Great Book"}, {"review_sentiment": 5.0, "review_text": "This book literally had me on the edge of my seat.... I had to finish the book even though Hurricane Irma was bearing down on Florida.  Wonderful book."}, {"review_sentiment": 5.0, "review_text": "Quite possibly one of the best books I've ever read. You don't just read this book. You live it."}, {"review_sentiment": 5.0, "review_text": "This book blew me away; could not put it down..."}, {"review_sentiment": 5.0, "review_text": "Awesome read"}, {"review_sentiment": 4.0, "review_text": "A compelling story that should be read by everyone, especially those white nationalist racists. The literal patois took a little getting used to, but once I got used to it, the power and truth of the story was riveting. The telling through the eyes of a Jamaican slave made the story all the more real and heartfelt. We'd like to ignore or forget the beastly, inhuman cruelty of slavery, but at this point in history with racism rearing its ugly face in our government, our society needs all of the reminding it can get."}, {"review_sentiment": 5.0, "review_text": "Although this is a work of fiction the author made every character and situation so vivid, so real. Absolutely extraordinary."}]}, "authors": ["Marlon James"], "isbn": "1594484368", "longitude": 0.0, "periods": ["1800s", "Recent Releases"], "title": "The Book of Night Women", "word_cloud": "amaze intrigue intricately woven story line complex well hone personality character beautiful prose even vulgarity world sugar cane plantation slavery culture narrate jamaican patois roll smoothly lend bring dark dangerous world beautiful smart young protagonist find born live see jamaica external viewpoint eye open capture language culture tradition precision regret apart killing john publish new soon way captured epic piece culture creative professor mention class facial expression say name make competition amaze attention grabbing ever never literally edge seat finish even bear quite possibly best ever live blow away compelling story everyone especially white nationalist racists literal patois take little get use get used power truth story rivet tell eye slave make story real heartfelt like ignore beastly inhuman cruelty slavery point history racism rear ugly face government society need remind work fiction author make character situation real absolutely extraordinary", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "From the WINNER of the 2015 Man Booker Prize for A Brief History of Seven Killings\r\n\r\n\"An undeniable success.” — The New York Times Book Review\r\n\r\nA true triumph of voice and storytelling, The Book of Night Women rings with both profound authenticity and a distinctly contemporary energy. \r\n\r\nIt is the story of Lilith, born into slavery on a Jamaican sugar plantation at the end of the eighteenth century. Even at her birth, the slave women around her recognize a dark power that they- and she-will come to both revere and fear. The Night Women, as they call themselves, have long been plotting a slave revolt, and as Lilith comes of age they see her as the key to their plans. \r\n\r\nBut when she begins to understand her own feelings, desires, and identity, Lilith starts to push at the edges of what is imaginable for the life of a slave woman, and risks becoming the conspiracy's weak link. But the real revelation of the book-the secret to the stirring imagery and insistent prose-is Marlon James himself, a young writer at once breath­takingly daring and wholly in command of his craft.", "asin": "1594484368", "rank": "133464", "city": "Jamaica", "image": "https://images-na.ssl-images-amazon.com/images/I/51bAgr9lMTL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}