{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 102, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "I read this lyrical book a few years ago and it has stayed with me. It gave me new insights into the displaced immigrant and the longing for love and home. The main character is so likable, I was immediately drawn in to this poignant story. Because of this book I still think about the brave and hopeful loneliness of strangers in a strange land.  Beautiful and understated."}, {"review_sentiment": 3.0, "review_text": "I had to get this book for a school project and loved it!"}, {"review_sentiment": 5.0, "review_text": "It shows many cultural differences but easy to read!"}, {"review_sentiment": 5.0, "review_text": "Loved this book!!!!"}, {"review_sentiment": 4.0, "review_text": "One does not read this novel for plot.  It's an excellent book, set in contemporary Washington DC, which deals with questions of race,  politics, poverty, gentrification, real-estate... A sad and honest book."}, {"review_sentiment": 5.0, "review_text": "Definitely worth a read. Esp if you like diaspora experiences and those looking for homes in new places. Let me know if you read it!"}, {"review_sentiment": 5.0, "review_text": "Great piece of world literature."}, {"review_sentiment": 2.0, "review_text": "The really good writers can tell a story with eloquence and insight. Classic examples are Hemingway, Gore Vidal, Henry Miller, Victor Hugo and more recently Christopher Hitchens and David Foster Wallace. Then there are the writers who tell a very good story even though their prose is not great. Examples are John Krakauer, Michael Crichton and Dan Brown. One tries to avoid books that have bad prose and an uninteresting story. That would describe The Beautiful Things That Heaven Bears. In spite of my opinion however, this book is required reading for all freshmen at Middlebury College in Vermont. By page 50, one could care less about any of the characters who, frankly, do nothing interesting. Well, yes, they do some things: drink too much, quit jobs, act lazy, have a relation with a prostitute, go to nude bars, fail to pay the rent, read Dostoyevsky to an 11 year old girl and play word games about African dictators. Every now and then someone throws a brick through a car window. As for the writing, it is not very inspired. Mr. Mengestu drones on about what people are thinking about saying, how they feel about saying something, what they might do if something else was said or whatever. The dialogue is underwhelming. He loves to end sentences with prepositions and the main character pretends he knows what everyone else is thinking and for the most part he is either wrong or no one cares. All that being said, I realize I am in the minority here, but even as an immigration novel, this is a far cry from A Tree Grows in Brooklyn, Angela’s Ashes, Middlesex or Lolita. However, a lot of people thought this thing was great. Rob Nixon, a professor of English at the University of Wisconsin wrote in the New York Times, “This is a great African novel, a great Washington novel and a great American novel.” Zero for three, professor. The Los Angeles Times reviewer wrote this: “Seldom has a character emerged in a recent novel who is so compellingly dark but honest, hopeful but dismal, and able to turn his chronicle into a truly American tapestry.” And of course Oprah's reviewer loved it. So, maybe it’s just not my cup of tea"}, {"review_sentiment": 5.0, "review_text": "The Beautiful Things that Heaven Bears by Ethiopian author Dinaw Mengestu centers on Sepha Stephanos, an Ethiopian immigrant living in Logan Circle, Washington, D.C. after fleeing Ethiopia because of war. The book focuses on Sepha’s relationship with his new, white neighbor Judith and her biracial daughter, Naomi. Amid their friendship, Sepha’s main conflict is with the failing grocery store he runs amid the gentrification of his neighborhood. This book insightfully demonstrates aspects of the American immigrant experience to readers through Sepha’s journey. In my opinion, the most poignant example of this is Mengestu portrayal Sepha chasing the American dream. One of Sepha’s defining moments as a character is when he realizes the reality of this dream: the isolation he feels as a lonely store owner is a feeling that many immigrants can relate to and his realization that what he desires most is a home rather than success is a universal common feeling that all Americans can relate to. Although the book deals with many tragic situations, the friendships throughout the novel  are juxtapositions against the pain in Sepha’s life, offering readers solace. Though Sepha often struggles alone, his friendships remain central to the novel and hold importance through good and bad times. The book’s narration is divided between past and present; it is engaging to read, and allows Mengestu to further develop Sepha as a dynamic character by contrasting his past and present identity. While many may see The Beautiful Things that Heaven Bears as a story of immigration, Mengestu’s writing and storytelling allow the events depicted in the novel to transcend and apply to humanity as a whole. I highly recommend this book, whether for pleasure reading or to be taught as part of a class curriculum. The book is a short read, and deals with contemporary, difficult topics, while allowing readers to empathize with and better understand aspects of the immigrant experience."}, {"review_sentiment": 5.0, "review_text": "Thoroughly enjoyed this book!"}]}, "authors": ["Dinaw Mengestu"], "isbn": "1594482853", "longitude": -77.0366456, "periods": ["2000s", "Recent Releases"], "title": "The Beautiful Things That Heaven Bears", "word_cloud": "lyrical year ago stay give new insight displace immigrant longing love home main character likable immediately draw poignant story still think brave hopeful loneliness stranger strange land understate get school project love show many cultural difference easy love plot excellent set contemporary deal question race politics poverty gentrification sad honest definitely worth diaspora experience look home new place piece world literature really good writer tell story eloquence insight examples recently then writers tell good story even prose great try avoid bad prose uninteresting story spite opinion however required read freshman page le character frankly nothing interesting yes drink much quit job act lazy relation prostitute go nude bar fail pay rent year old girl play word game african dictator someone throw brick car window writing inspire drone people think say feel say something something else say dialogue underwhelming love end sentence preposition main character pretend know everyone else think part wrong care say realize minority even immigration far cry however lot people think thing great professor write great african great great american reviewer write character emerge recent compellingly dark honest hopeful dismal able turn chronicle truly american course reviewer love so maybe cup tea author center immigrant living flee war focus relationship new white neighbor biracial daughter friendship main conflict fail grocery store run gentrification neighborhood insight fully demonstrate aspect american immigrant experience reader journey opinion poignant example portrayal chase american dream define moment character realize reality dream isolation feel lonely store owner feel many immigrant relate realization desire home rather success universal common feeling relate deal many tragic situation friendship juxtaposition pain life offer reader solace often struggle alone friendship remain central hold importance good bad time narration divide past present engaging allow dynamic character contrast past present identity many story immigration write storytelling allow event depict transcend apply humanity whole highly recommend pleasure read taught part class curriculum short deal contemporary difficult topic allow reader empathize better understand aspect immigrant experience thoroughly enjoy", "genres": ["Fiction & Literature", "Politics"], "summary": "Seventeen years ago, Sepha Stephanos fled the Ethiopian Revolution for a new start in the United States. Now he finds himself running a failing grocery store in a poor African-American section of Washington, D.C., his only companions two fellow African immigrants who share his bitter nostalgia and longing for his home continent. \r\n\r\nYears ago and worlds away Sepha could never have imagined a life of such isolation. As his environment begins to change, hope comes in the form of a friendship with new neighbors Judith and Naomi, a white woman and her biracial daughter. But when a series of racial incidents disturbs the community, Sepha may lose everything all over again.\r\n\r\n", "asin": "1594482853", "rank": "73292", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/514JbjxtugL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}