{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 181, "rating": 3.5, "reviews": [{"review_sentiment": 4.0, "review_text": "Do not read this novel of your looking for a happy ending, wrapped in a neat package. Do read this novel if you can haddle a complex story told from the perspectives of several difficult and deeply flawed characters. I am writing this review more than 3 years after reading it and the ache embedded in this novel is still a part of me."}, {"review_sentiment": 5.0, "review_text": "The Night Watch is about a small group of women and men, some of whom know each other and some who do not, whose lives become connected during World War II.  Some are homosexual, at a time of less tolerance than our own.  The book also deals with abortion in that time.The book picks up the characters' lives in the years just after the war and then fills in the rest of the story by returning to the war years, during the bombing raids on London.  For me this was an intriguing way to structure the book.This is my fourth Sarah Waters novel and she has never disappointed as an observer of human beings, a master of suspense, and a depicter of history."}, {"review_sentiment": 3.0, "review_text": "I didn't really like the way the author took me back and forth between current time and the history of each character.  When I got used to it the book ended.  I'm not homophobic but felt the sexual scene from the two women to be too explicit for my tastes.  However , the scenes of war in London were quite convincing in emotional."}, {"review_sentiment": 4.0, "review_text": "Interesting story and characters. The only thing I didn't like that much was the reverse timeline - although most things were explained by the end of the book I would have liked more resolution of some of the situations in the first section (later time period)."}, {"review_sentiment": 2.0, "review_text": "Great character development  but no actual plot to keep me interested"}, {"review_sentiment": 3.0, "review_text": "For some reason, I kept getting Helen, Julia, and Viv mixed up, but even so I couldn't put this one down. It was full of intrigue and drama. The going back in time arrangement really worked, and at the end I wanted to just sit back and go, \"Huh. I want to start at the beginning now. Or read it backwards.\" This was written really well, it was very descriptive, and I couldn't let go - kept wanting to get back to the story and to these memorable characters."}, {"review_sentiment": 5.0, "review_text": "Duncan is in a dead-end job, having been in prison. His sister is seeing a married man. Kay lives a solitary aimless life. Julie and Helen’s relationship is rocky due to Helen’s jealousy. Little bits of their 1947 lives are dropped as hints that something in their past is relevant to their situations now. And then we go back, and a little further back, to see what happened.This story looks at an existing situation and shows us how the characters got to where they now are. The war is an ever-present horror in the later sections and a haunting wraith in the first. Sarah Waters’ writing is always beautiful and the characters’ dialogue is spot on, bringing them to life. I really love this idea of going back in a story, rather than forward. We are often given hints of a back-story but here we live through those events as they happen – just in reverse order. This fills in a lot of things we didn’t know, but explains the situation in the earlier, 1947 section. It’s an unusual device but it worked very well for me."}, {"review_sentiment": 3.0, "review_text": "This is definitely not one of Sarah Waters' most crowning achievements, when an author tries to be cheeky with timelines and the whatnot, it's a very tricky balance, one in which Waters did not accomplish in the least. She also lost tension and narrative along the way, something that I absolutely love about her talent and past works (Tipping the Velvet).If she only would have slowed down and broken it up a bit better, I do believe the book would have ranked up their with her best."}, {"review_sentiment": 5.0, "review_text": "What remarkable book!  Sarah Waters is a literary marvel.  This book is written Backwards -- begins in 1947 -- about 225 pages worth of full character development and plot evolution, then we get to 1944 ... for another 225 pages or so ... than to 1941 for a final 50 pages.  When I had completed the first section, I was concerned that I  might not care to continue.  After all, I already knew \"what happened.\"  It is a tribute to Waters' genius that it took very little time to become fully absorbed in the details of the earlier developments.  How does she do it?  She sets remarkable challenges for herself, and comes through  with aces, every time.  What a book !!"}, {"review_sentiment": 1.0, "review_text": "I should have read these reviews before I plunged into this book.  The main problem is that any tension that might have been created by elements of the plot was totally eradicated by the flashback structure.  In the first few chapters, you learn about the main characters and then you flash back to the heart of the war.  But you don't have to worry about whether any of the characters will die, which characters will end up together, whether a character will survive a dangerous situation, or anything like that because you already know!  And there were plenty of these potentially tense situations.  But I just yawned through them knowing that everything would work out in a certain way.  It's such a shame because \"The Paying Guests\" was very good (except for the terrible ending)."}]}, "authors": ["Sarah Waters"], "isbn": "1594482306", "longitude": -0.12574, "periods": ["1900s", "Recent Releases"], "title": "The Night Watch", "word_cloud": "look happy end wrapped neat package complex story tell perspective several difficult deeply flaw character write review year read ache embed still part small group woman men know live become connected homosexual time le tolerance also deal abortion pick character live year war fill rest story return war year bomb raid intrigue way structure fourth never disappoint observer human being master suspense depicted history really like way author take back forth current time history character get use end homophobic felt sexual scene woman explicit taste however scene war quite convince emotional interest story character thing like much reverse timeline thing explain end resolution situation first section later time period great character development actual plot keep interested reason keep get mix even full intrigue drama go back time arrangement really worked end want sit back go want start beginning write really well descriptive want back story memorable character duncan job prison sister see married man live solitary aimless life relationship rocky due jealousy bits life drop hint something past relevant situation back little see story look exist situation show character get war horror later section haunt wraith first write always beautiful character dialogue spot bring life really idea go back story rather forward often give hint live event reverse order fill lot thing know explain situation earlier section unusual device work well definitely crown achievement author try cheeky timeline tricky balance accomplish least also lose tension narrative way something absolutely love talent past work broken bit better believe best remarkable sarah literary marvel write begin page worth full character development plot evolution page final page complete first section concern continue already know happen tribute genius take little time become fully absorbed detail earlier development set remarkable challenge come ace time review plunge main problem tension create element plot totally eradicated flashback structure first chapter learn main character flash back heart war worry character die character end together character survive dangerous situation anything already potentially tense situation yawn know everything certain way shame pay guest good terrible end", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "Moving back through the 1940s, through air raids, blacked out streets, illicit liaisons, sexual adventure, to end with its beginning in 1941, The Night Watch is the work of a truly brilliant and compelling storyteller.\r\nThis is the story of four Londoners - three women and a young man with a past, drawn with absolute truth and intimacy. Kay, who drove an ambulance during the war and lived life at full throttle, now dresses in mannish clothes and wanders the streets with a restless hunger, searching . . . Helen, clever, sweet, much-loved, harbours a painful secret . . . Viv, glamour girl, is stubbornly, even foolishly loyal, to her soldier lover . . . Duncan, an apparent innocent, has had his own demons to fight during the war. Their lives, and their secrets connect in sometimes startling ways. War leads to strange alliances . . .\r\n\r\nTender, tragic and beautifully poignant, set against the backdrop of feats of heroism both epic and ordinary, here is a novel of relationships that offers up subtle surprises and twists. The Night Watch is thrilling. A towering achievement.", "asin": "1594482306", "rank": "213855", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41DEFkZMC4L.jpg", "country": "England", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}