{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 419, "rating": 3.5, "reviews": [{"review_sentiment": 3.0, "review_text": "If you're looking for an amazing novel, this is not it. But, it's a nice light read, even though it's about suicide. Pretty basic and simple premise an characters. No big reveals or complications to immerse yourself into."}, {"review_sentiment": 5.0, "review_text": "I never knew!  What took me so long to read a Nick Hornby book?  It was great fun from the very first page.  I love the way he writes and his characters are wonderful.  It's light reading, but not too light.  The entire cast is suicidal after all.  The writing is clever and full of humor.  He's a master of the ironic moment. There's not a trite wrap up at the end.  There could be, it is that sort of book.  But instead he does a great scene that's a parody of the trite, happy-ending, wrap up. And it's just that sort of thing that makes the book so fun.  I plan to read many more of his books."}, {"review_sentiment": 3.0, "review_text": "This was an okay book about a group of sometimes likable and sometimes not so likable people.  The character development was good, but I was done caring about them halfway through the book."}, {"review_sentiment": 5.0, "review_text": "I really enjoyed this story.  It is the first book I have read by Hornby.  I picked it up on a clearance table at the bookstore and it sounded interesting so I gave it a go.  Almost instantly I was hooked.  Following four people on their journey of deciding whether they want to live or die may seem very dark and depressing, however, Hornby writes these characters with such great minds, voices, and thoughts that you find yourself really enjoying reading what they have to say. I thoroughly enjoyed traveling through the lives of these battered people and I already made a return trip to the bookstore for another Hornby title! Up next...About a Boy."}, {"review_sentiment": 3.0, "review_text": "Really enjoyed some of his earlier books, High Fidelity, About a Boy in particular.  This one was more dark and even though the characters in his other books were flawed, they were still likable.  Not sure I really liked or cared much about any of the characters in this book.  Also could not really relate to them.  Guess I'm just not the suicidal type."}, {"review_sentiment": 4.0, "review_text": "Not gonna lie, the movie is better. But if you liked the movie you'll probably like the book"}, {"review_sentiment": 5.0, "review_text": "My favorite book of all times."}, {"review_sentiment": 3.0, "review_text": "I really loved \"High Fidelity\" and \"All about a Boy\" so naturally I'm going to pick up anything by Nick Hornsby who manages to write great novels from an everyman perspective without being crude, in fact he is actually introspective writer.I love the way this novel begins. The concept of four strangers accidentally bumping into each other on a roof top on New Year's eve and getting into each others way of commiting suicide is brilliant and hilarious in it's awkwardness. The friendships and reluctant support group that forms between Martin, a failed television personality bogged down in scandal, Jess a hyperactive, insensitive gutter-punk, J.J. an American musician stuck in the UK in obscurity and Maureen a lonely, middle-aged single parent of a disabled child is also intriguing and I actually enjoyed that Hornsby introduced his characters by alternating their narratives.However, Hornsby, who is famous for being introspective and touching but in a quirky way kind of over-reaches when he decides to have his characters focus more on maintain media attention and I felt lost the plot. This took up the entire middle of the book and it stunted the development and growth of the characters for the sake of unnecessary sensationalism. Hornsby also uses the F-bomb - A lot - in this novel almost like a period except he not only punctuated his sentences with it he begins a lot of them with it too. During this section of the book I wondered if Hornsby left his computer unattended while writing the novel and an acquaintance came by an filled in as a bad joke. The result is a muddying of the storyline and that the Jess character is allowed a platform to become even more obnoxious and aggravating enough to almost give up on the book altogether.And then the book suddenly rockets back to being an insightful novel that deals rather touchingly with the tough topic of depression and suicide. Because of the uneveness of the novel this is not Hornsby's best, but it does have some very good and very moving and thoughtful moments which successfully prevent it from being terrible."}, {"review_sentiment": 2.0, "review_text": "Terrific beginning, but after the first couple of chapters there is no development. Dragged a little to be able to read it to the end."}, {"review_sentiment": 4.0, "review_text": "Did I enjoy this book: There’s got to be at least one character in a book that I care about. I was slogging through a modern classic–I won’t name it here–with the least likable set of characters I’d ever encountered. I pushed through to the halfway mark, and then I said, “Why am I doing this? I’m going to find a novel whose people touch my heart.”I was lucky enough to pick up Nick Hornby’s A Long Way Down. I really enjoyed the book.The cover of my copy of A Long Way Down shows four pairs of shoes hovering over a blue sky. The wing tips are fallen talk show host Martin’s. The comfortable oxfords are 51-year-old Maureen’s. Teenaged smart-mouth Jess owns the black Keds (and the red socks), and the boots belong to rock star wannabe JJ. These four unlikely compatriots meet atop Topper’s Tower in London one New Year’s Eve. Each climbs to the roof alone, intending to jump and end a life that no longer has meaning.They come down in a pack, on a mission to find Jess’s erstwhile boyfriend. Then, mission accomplished, they find they can neither break their connection nor complete their original mission.The book is told in all four voices, so we get inside each of their heads–miserable screw-up Martin, who had it all and lost it via his own stupidity; self-effacing Maureen, whose life has been spent caring for a son so disabled he has no awareness; the jilted Jess, whose sister is missing–a probable suicide; and musician JJ, who lost his band, his love, and his will to live.This band of misfits screws up regularly and sometimes spectacularly. They’re drifty and lunatic, self-centered and clueless, and yet–I care about each one.Would I recommend it: I recommend A Long Way Down if you want a funny book with likable characters that admits to hope. Don’t look for saccharine, though–true love doesn’t come waltzing through the door, nor do the foolish become wise with the flash of a Hogwarts’ wand. But people on the wrong course do manage, with determination and an odd kind of courage, to turn their baggage-heavy ships. They get by,–yes, they do,–with a little help from their odd cast of friends.As reviewed by Pam at Every Free Chance Books."}]}, "authors": ["Nick Hornby"], "isbn": "1594481938", "longitude": -0.12574, "periods": ["2000s"], "title": "A Long Way Down", "word_cloud": "look amaze nice light even suicide basic simple premise character big reveals complication immerse never know take great fun first page love write character wonderful light read light entire cast suicidal writing clever full humor master ironic moment trite wrap end instead great scene parody trite wrap sort thing make fun plan many okay group sometimes likable sometimes likable people character development good do care halfway really enjoy story first horn by pick clearance table bookstore sound interesting give instantly hook follow people journey decide want live die dark depress however write character great mind voice thought find really enjoy read say thoroughly enjoy travel life batter people already make return trip title next really enjoy earlier high particular dark even character flaw still likable not sure really like cared much character also really suicidal type not movie better liked movie probably favorite time really love naturally go pick anything manage write great novel every man perspective crude fact actually introspective begin concept stranger accidentally bump top eve get others commute suicide brilliant hilarious friendship reluctant support group form fail television personality bogged scandal hyperactive insensitive american musician stick obscurity lonely single parent disable child also intrigue actually enjoy introduce character alternate famous introspective touch quirky kind decide character focus maintain medium attention felt lose plot take entire middle stunt development growth character sake unnecessary sensationalism also use lot almost period punctuated sentence begin lot section wonder leave computer unattended write acquaintance come fill bad joke result muddy story line character allow platform even obnoxious aggravate enough almost give suddenly rocket back insightful deal rather touchingly tough topic depression suicide unevenness best good move thoughtful moment successfully prevent terrible begin first couple chapter development drag little able end enjoy get least character care slog modern name least likable set character ever encounter push halfway mark say go people touch lucky enough pick really enjoy cover copy show pair shoe hover blue sky wing tip fall talk show host comfortable oxford own black red sock boot belong rock star wannabe unlikely compatriot atop climb roof alone intend jump end life longer pack mission erstwhile boyfriend then mission accomplish find neither break connection complete original tell voice get lose stupidity life spend care son disable awareness jilted sister probable suicide musician lose band love band misfit screw regularly sometimes spectacularly drift lunatic clueless care recommend recommend want funny likable character admits hope look saccharine love come waltz door foolish become wise flash hogwarts wand people wrong course manage determination kind courage turn ship get little help cast review", "genres": ["Fiction & Literature"], "summary": "Nick Hornby mines the hearts and psyches of four lost souls who connect just when they’ve reached the end of the line. \r\n\r\nIn four distinct and riveting first-person voices, Hornby tells a story of four individuals confronting the limits of choice, circumstance, and their own mortality. This is a tale of connections made and missed, punishing regrets, and the grace of second chances.", "asin": "1594481938", "rank": "278390", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51fKCAPkVgL.jpg", "country": "England", "story_arc": ["Tragedy", "Things only get worse"]}