{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 4.5980772, "ratings": {"num_ratings": 305, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "A brilliant multi-layered look at the Colombian drug wars in microcosm.  Excellent characterizations, compelling prose (I read it in Spanish), but given Vasquez's reputation, I can imagine the translation is just as good."}, {"review_sentiment": 5.0, "review_text": "Amazing book"}, {"review_sentiment": 5.0, "review_text": "A beautiful, multilayered look at the devastation the narcos and the war on drugs wreaked for a generation in Colombian history.  Well worth the time to read."}, {"review_sentiment": 4.0, "review_text": "Liked the first half better; became a bit \"tele-novela-ish\" in the second..."}, {"review_sentiment": 5.0, "review_text": "thanks"}, {"review_sentiment": 5.0, "review_text": "For a fine fellow who has distanced himself from South American magical realism, it's hard to get more realistically fabulous or naturally strange."}, {"review_sentiment": 5.0, "review_text": "Absolutely brilliant. It immediately grabs you from the first page and pulls you deep into turmoil and pscyhe of Colombia - pre and post-Escobar.. Living here now I needed that insight to understand my cohabitants. For those living elsewhere, the masterful storytelling will be more than enough. Just don't expect any sort of magical realism."}, {"review_sentiment": 5.0, "review_text": "I lived in Bogotá during part of the 1980's, and nothing brought back such vivid memories of those terrible years as this remarkable novel.  I even learned a few new things about Colombian history and how Colombians themselves have dealt with their past."}, {"review_sentiment": 5.0, "review_text": "This is one of the best books I've read in a long time. I wish it didn't have to end. The writing was truly poetic, engaging and a book I could hardly wait to get to each day. So much history about Columbia that was interesting."}, {"review_sentiment": 5.0, "review_text": "Really liked the story."}]}, "authors": ["Juan Gabriel Vásquez"], "isbn": "159463274X", "longitude": -74.0761028, "periods": ["1900s", "Recent Releases"], "title": "The Sound of Things Falling", "word_cloud": "brilliant look colombian drug war microcosm excellent characterization compel prose spanish give reputation imagine translation good amaze beautiful multilayered look devastation narc war drug wreak generation colombian history time like first half better become bit second thanks fine fellow distance south american magical realism hard get realistically fabulous naturally strange absolutely brilliant immediately grab first page pull deep turmoil psyche need insight understand cohabitants living elsewhere masterful storytelling enough sort magical realism live part nothing bring back vivid memory terrible year remarkable even learn new colombian history deal past best long time wish end writing truly poetic engaging hardly day so much history interesting really liked story", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "\"A brilliant new novel.\" New York Times \r\n \r\nFrom a global literary star comes a prize-winning tour de force – an intimate portrayal of the drug wars in Colombia.\r\n\r\nJuan Gabriel Vásquez has been hailed not only as one of South America’s greatest literary stars, but also as one of the most acclaimed writers of his generation. In this gorgeously wrought, award-winning novel, Vásquez confronts the history of his home country, Colombia.\r\n \r\nIn the city of Bogotá, Antonio Yammara reads an article about a hippo that had escaped from a derelict zoo once owned by legendary Colombian drug kingpin Pablo Escobar. The article transports Antonio back to when the war between Escobar’s Medellín cartel and government forces played out violently in Colombia’s streets and in the skies above. Back then, Antonio witnessed a friend’s murder, an event that haunts him still. As he investigates, he discovers the many ways in which his own life and his friend’s family have been shaped by his country’s recent violent past. His journey leads him all the way back to the 1960s and a world on the brink of change: a time before narco-trafficking trapped a whole generation in a living nightmare.\r\n\r\nVásquez is “one of the most original new voices of Latin American literature,” according to Nobel Prize winner Mario Vargas Llosa, and The Sound of Things Falling is his most personal, most contemporary novel to date, a masterpiece that takes his writing—and his literary star—even higher.", "asin": "159463274X", "rank": "67053", "city": "Bogota", "image": "https://images-na.ssl-images-amazon.com/images/I/5186vKLN-QL.jpg", "country": "Colombia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}