{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 13, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Great product. Fast service"}, {"review_sentiment": 4.0, "review_text": "Old but still OK."}, {"review_sentiment": 5.0, "review_text": "if you don't love this book, check your heart because you may have no soul!!!"}, {"review_sentiment": 5.0, "review_text": "it is studs telling it like it was a must read for studs fans"}, {"review_sentiment": 3.0, "review_text": "I gave it to my husband as a gift, he is a big fan of Studs Terkel.  He has only read the first few pages so I wish I could say he liked it, but I think he is having a hard time getting in to it."}, {"review_sentiment": 5.0, "review_text": "This is my book club selection for discussion next week and I'm totally enjoying it. I like the dialogue from different individuals and its a true depiction of Chicago at that time. I'm from Chicago so it is truly interesting to me."}, {"review_sentiment": 5.0, "review_text": "This early effort stands with the best oral histories by author/radio host Stud's Terkel.  In the mid-1960's Terkel took his tape recorder and let dozens of ordinary Chicagoans open up.  Showing our City's diversity and divisions, we hear from executives, laborers, teachers, factory hands, social workers, rich, poor, and middle-class.  Many are white, others are black (\"Negro\") or Latino, and they range from young swingers, to stressed-out parents, to aged retirees.  Nearly all offer engaging tales, views, and outlooks.  Among the major issues are life in Chicago, work, racial tensions, Vietnam, worship, Martin Luther King, the Bomb, opportunity, and (President) Lyndon Johnson.  Anton Faber describes tool-and-die making in The Kaiser's Germany and then Chicago after arriving in 1912.  Eva Barnes recalls coal miners, teen marriages, and bootlegging in her small town, plus working in Chicago's once-vast stockyards.  Janice Majewski and her colleagues describe teaching at Marshall High School, then as now one of our city's more troubled facilities.  Luci Jefferson arrived seeking work in the Great Migration of Southern Blacks, while activist Florence Scala fought City Hall.  Many support the elusive goal of racial reconciliation, others nervously sense the decline of the traditional factory economy (replaced by white-collar services).  As with many later Terkel efforts, the interviewees lean more left than right, with definite strains of anti-establshment sentiment - even among some we'd labed as distinctly \"establishment.\"Studs Terkel (1912-2008) made his mark by letting his subjects do the talking, and readers are better off for it.  I'd have liked to hear from even more persons, plus those then fleeing to suburbia due to racial fears - what greater division existed both then and today?  Still, this stellar book is as worth reading as many later Terkel efforts like HARD TIMES, WORKING, AMERICAN DREAMS, COMING OF AGE, etc."}, {"review_sentiment": 4.0, "review_text": "Division Street is Studs Terkel's attempt to make sense of Chicago. Terkel constructs Division Street in the \"oral-history\" style that he used in so many of his other works; specifically, he went out into Chicago, recorded a group of interviews with people who represented a cross section of 1960s Chicago, and then included verbatim quotes from his interviewees in Division Street.Perhaps the best part of the book is the candor with which Terkel's subjects speak. I am not certain how Terkel got his interview subjects to drop their guards, but it seems that no subject is taboo. After reading the book, you do have the feeling that you \"know\" each of the interviewees on a fairly-deep level.If I have a criticism of Division Street, it is that the book is something of a downer. Terkel's books focus on the disappointments and frustrations of life. In Division Street he is particularly concerned with race relations and The Bomb. Though I liked the book, prospective readers should be aware that it is by no means uplifting.Each reader will come away with a feeling that he or she knows something of Chicago. In the end, Terkel leaves the conclusions up to the reader. I suspect, therefore, that different readers will interpret Division Street in different ways. For those readers who want to learn something about Chicagoans, the effort will be worthwhile."}, {"review_sentiment": 5.0, "review_text": "I just reread this book as a kind of wake to Terkel after his passing.  I first read it in my mid-twenties and was completely absorbed.  Now, almost twenty years later, I've just finished it alongside Joseph P. Lash's \"Franklin and Eleanor\" and I'm fascinated by how topical both books seem as Obama prepares to take office amid economic catastrophe, internal homeland strife, and war.  The '30s, the late '60s, and our times seem like stepping-stones in history, so similar in revolutionary content:  forward-thinking, transformative and yet violent and painful.  Yet the differences are clear, too.  Depression-era policies focused just to establish social programs; civil rights had to wait 'til another day.  That day emerged during the time covered by \"Division Street,\" which reveals how far from black-and-white those issues were even to people who felt strongly about them.  Time and again as I read I thought, this book was written forty years ago...some of these people must still be alive.  What do they think now?  And that question begged another:  What will we think in forty years?  If for no other questions than these, \"Division Street\" is abundantly worth reading.  It's a true American classic--the voice of her people."}, {"review_sentiment": 4.0, "review_text": "As I have done on other occasion when I am reviewing more than one work by an author I am using some of the same comments, where they are pertinent, here as I did in earlier reviews. In this series the first Studs Terkel book reviewed was that of his \"The Good War\": an Oral History of World War II.Strangely, as I found out about the recent death of long time pro-working class journalist and general truth-teller \"Studs\" Terkel I was just beginning to read his \"The Good War\", about the lives and experiences of, mainly, ordinary people during World War II in America and elsewhere, for review in this space. As with other authors once I get started I tend to like to review several works that are relevant to see where their work goes. In the present case the review, his first serious effort at plebian oral history, Division Street: America, despite the metaphorically nature of that title, focuses on a serves a narrower milieu, his \"Sweet Home, Chicago\" and more local concerns than his later works.Mainly, this oral history is Studs' effort to reflect on the lives of working people (circa 1970 here but the relevant points could be articulated, as well, in 2008) from Studs' own generation who survived that event, fought World War II and did or did not benefit from the fact of American military victory and world economic preeminence, including those blacks and mountain whites who made the internal migratory trek from the South to the North. Moreover, this book presents the first telltale signs that those defining events for that generation were not unalloyed gold. As channeled through the most important interviewee in this book, Frances Scala, who led an unsuccessful but important 1960's fight against indiscriminate \"urban renewal\" of her neighborhood (the old Hull House of Jane Addams fame area) Studs make his argument that the sense of social solidarity, in many cases virtually necessary for survival, was eroding.Studs includes other stories of those , including the lumpen proletarian extraordinaire Kid Pharaoh who will be met later in Hard Times and the atypical Chicago character who gladly joins the John Birch Society in order to assert his manhood, who do not easily fit into any of those patterns but who nevertheless have stories to tell. And grievances, just, unjust or whimsical, to spill.One thing that I noticed immediately after reading this book, and as is true of the majority of Terkel's interview books, is that he is not the dominant presence but is a rather light, if intensely interested, interloper in these stories. For better or worse the interviewees get to tell their stories, unchained. In this age of 24/7 media coverage with every half-baked journalist or wannabe interjecting his or her personality into somebody else's story this was, and is, rather refreshing. Of course this journalistic virtue does not mean that Studs did not have control over who got to tell their stories and who didn't to fit his preoccupations and sense of order. He has a point he wants to make and that is that although most \"ordinary\" people do not make the history books they certainly make history, if not always of their own accord or to their own liking. Again, kudos and adieu Studs."}]}, "authors": ["Studs Terkel"], "isbn": "1595580727", "longitude": -87.6244212, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Division Street: America", "word_cloud": "product service still check heart stud tell fan give husband gift big fan first page wish like think hard time get club selection discussion week totally enjoy like dialogue different individual true depiction time truly interest early effort stand best oral history host take tape recorder let dozen ordinary open diversity division hear executive laborer teacher factory hand social worker rich poor white others black range young swinger parent age retiree nearly offer engage tale view outlooks major issue life work racial tension worship opportunity describe make arrive recall coal miner teen marriage bootleg small town work stockyard colleague describe teach city trouble facility arrive seek work activist fight support elusive goal racial reconciliation others nervously sense decline traditional factory economy replace service many later effort interviewee lean leave right definite strain sentiment even bale distinctly establishment make mark let subject talk reader better like hear even person flee suburbia due racial fear greater exist today still stellar worth read many later effort etc attempt make sense construct style use many work specifically go record group interview people represent cross section include verbatim quote interviewee best part candor subject speak certain get interview subject drop guard seem subject taboo read feel know interviewee criticism something downer focus disappointment frustration life particularly concern race relation like prospective reader aware mean come feel know something end leave conclusion suspect therefore different reader interpret different way reader want learn something effort worthwhile reread kind wake passing first completely absorb now almost year later finish alongside fascinate topical seem prepares take office economic catastrophe internal homeland strife war late time seem history similar revolutionary content trans formative yet violent painful difference clear policy focus social program civil right wait day day emerge time cover reveals far issue even people felt strongly think write year ago people still beg think forty year question abundantly read true american classic voice people do occasion review work author use comment pertinent earlier review series first review find recent death long time class journalist general begin live experience mainly ordinary people elsewhere review space author get start tend review several work relevant see work go present case review first serious effort plebeian oral history metaphorically nature title focus serve narrower milieu local concern later oral history effort reflect live work people circa relevant point articulate well generation survive event fought benefit fact american military victory world economic preeminence include black mountain white make internal migratory trek moreover present first telltale sign define event generation unalloyed gold channeled important interviewee france lead unsuccessful important fight indiscriminate urban renewal neighborhood old fame area make argument sense social solidarity many case virtually necessary survival include story include lumpen proletarian extraordinaire meet later atypical character gladly join order assert manhood easily fit pattern nevertheless story tell grievance unjust whimsical thing notice immediately read true majority interview dominant presence rather light intensely interested interloper story better worse interviewee get tell story unchain age medium coverage journalist wannabe interject personality somebody else story rather refreshing course journalistic virtue mean control get tell story fit preoccupation sense order point want ordinary people make history certainly make history always accord like kudos adieu", "genres": ["History"], "summary": "Division Street, Studs Terkel’s first book of oral history, established his reputation as America’s foremost oral historian and as “one of those rare thinkers who is actually willing to go out and talk to the incredible people of this country” (in the words of Tom Wolfe).\r\n\r\nViewing the inhabitants of a single city, Chicago, as a microcosm of the nation at large, Division Street chronicles the thoughts and feelings of some seventy people from widely varying backgrounds in terms of class, race, and personal history. From a mother and son who migrated from Appalachia to a Native American boilerman, from a streetwise ex–gang leader to a liberal police officer, from the poorest African Americans to the richest socialites, these unique and often intimate first-person accounts form a multifaceted collage that defies any simple stereotype of America.\r\n\r\nAs Terkel himself put it: “I was on the prowl for a cross–section of urban thought, using no one method or technique. . . I guess I was seeking some balance in the wildlife of the city as Rachel Carson sought it in nature. Revealing aspects of people’s lives that are normally invisible to most of us, Division Street is a fascinating survey of a city, and a society, at a pivotal moment of the twentieth century.\r\n\r\n“Remarkable. . . . Division Street astonishes, dismays, exhilarates.”  The New York Times", "asin": "1595580727", "rank": "897238", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/51tJpr1BRBL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}