{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 31, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Good photos and easy to read"}, {"review_sentiment": 5.0, "review_text": "A new favorite with the grandson (age 6)."}, {"review_sentiment": 5.0, "review_text": "Beautifully illustrated!"}, {"review_sentiment": 5.0, "review_text": "Beautiful and accurately informative book for kids. We bought it for our 6-year old before we traveled to the Galapagos."}, {"review_sentiment": 5.0, "review_text": "Absolutely stunning work of non-fiction! The book focuses on the story of an island from the eruption of volcanoes to animal and plant inhabitants to evolution and to in sinking back into the sea. Each step in the 6 million year processes is accompanied by breath taking detailed illustrations that will fascinate young readers while they watch the island and animals change. This is a great piece to introduce evolution to a young audience and it ends perfectly segueing into Charles Darwin."}, {"review_sentiment": 5.0, "review_text": "Beautiful and informative!"}, {"review_sentiment": 5.0, "review_text": "great book"}, {"review_sentiment": 5.0, "review_text": "I read this book to my second graders.  The information was presented in a way they could understand.  We had a Gallapagos Island project to complete."}, {"review_sentiment": 5.0, "review_text": "Gorgeous illustrations. Good for kids ~8+."}, {"review_sentiment": 1.0, "review_text": "Not worth the price. Information and pictures does not do justice to the actual scenery, habitat and wildlife. We want to return this item."}]}, "authors": ["Jason Chin"], "isbn": "1596437162", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Island: A Story of the Galápagos", "word_cloud": "good photo easy new favorite grandson age beautifully illustrate accurately informative kid buy old travel absolutely stunning work focus island eruption volcano animal plant inhabitant evolution sink back sea step year process accompany breath take detailed illustration fascinate young reader watch island animal change great piece introduce evolution young audience end perfectly segue informative great second grader information present way project complete gorgeous illustration good kid not worth price information picture justice actual scenery habitat want return item", "genres": ["History", "Science & Nature", "Children's Books"], "summary": "Charles Darwin first visited the Galápagos Islands almost 200 years ago, only to discover a land filled with plants and animals that could not be found anywhere else on earth. How did they come to inhabit the island? How long will they remain?\r\n\r\nThoroughly researched and filled with intricate and beautiful paintings, this extraordinary book by Award-winning author and artist Jason Chin is an epic saga of the life of an island―born of fire, rising to greatness, its decline, and finally the emergence of life on new islands. Chin's approach makes this book a must-have common core tool for teachers and librarians introducing scientific principals to young students.\r\n\r\nIsland is one of Kirkus Reviews' Best Children's Books of 2012", "asin": "1596437162", "rank": "32386", "city": "Galápagos Islands", "image": "https://images-na.ssl-images-amazon.com/images/I/511vpZVaJxL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}