{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 78, "rating": 4.6, "reviews": [{"review_sentiment": 4.0, "review_text": "Interesting of read a novel about a different culture."}, {"review_sentiment": 3.0, "review_text": "The story was interesting. It is engaging but reads much like a soap opera. I enjoyed it to the end but was hoping for a bit more depth."}, {"review_sentiment": 5.0, "review_text": "Good Read especiallysince I have been to Egypt and enjoyed all the little things about the people @  their culture that I Now could relate to"}, {"review_sentiment": 4.0, "review_text": "Loved the story.Number of characters a bit overwhelming and a bit cumbersome so needs to be read without taking long stretches of days in between sessions. Often disappointed in endings, but this one was excellent."}, {"review_sentiment": 5.0, "review_text": "What a little treasure of a book. I almost passed it by.  Love every minute."}, {"review_sentiment": 5.0, "review_text": "I read this book many years ago and absolutely loved it.  I bought this copy so that it was on my kindle and I plan to read it this winter."}, {"review_sentiment": 5.0, "review_text": "This book was reall good.  I love historical type books but this type isn't one I've read before. This be starts out in 1945 in Egypt. And spans until almost the pleasant day. It is a family novel rich in history of the times, and as a Jew I found it t be in a lot f ways the other side of the coin for me. This family aren't Jewhaters though, in fact the family matriarch has a Jewish woman as her neighbor and best friend, she considers her to be a sister. IT starts out with the family being the friends and Doctor of the King, and goes through the coup that overthrows the Royal family, and what happens to those that were friends with them. I really found this to be a really good read, and am thankful that a cousin of mine recommended it to me. I recommend it to you. I hate paying that much for an ebook but it is worth it."}, {"review_sentiment": 5.0, "review_text": "Excellent story about an Egyptian family from right after WWII to the present. It gives a clear view of the women's rights (none) in a Muslem country."}, {"review_sentiment": 5.0, "review_text": "I loved this book. a modern day fiddler on the roof  Aparents trying to  keep old traditions and  yet knowing  that love of family is  what's important  a struggle  against  Why is right and wrong  Egyptian  Family in crisis"}, {"review_sentiment": 5.0, "review_text": "I really enjoyed reading this book. It was difficult to put down"}]}, "authors": ["Barbara Wood"], "isbn": "1596528613", "longitude": 31.243666, "periods": ["1900s", "Recent Releases"], "title": "Virgins of Paradise", "word_cloud": "interest different culture story interest engage read much soap opera enjoy end hop bit depth good especially since enjoy little thing people culture now love character bit overwhelming bit cumbersome need take long stretch day session disappoint ending excellent little treasure almost pass minute many year ago absolutely love buy copy kindle plan winter real good love historical type type start span almost pleasant day family rich history time find lot f way side coin family fact family matriarch woman neighbor best friend considers sister start family friend go coup overthrow family happen friend really find really good thankful cousin mine recommend recommend hate pay much book worth excellent story egyptian family right present give clear view woman right none country love modern day roof parent try old tradition yet know family important struggle right wrong egyptian crisis really enjoy read difficult put", "genres": ["Fiction & Literature", "Romance", "Historical Fiction", "WWII", "Women's Fiction"], "summary": "From New York Times bestselling author Barbara Wood: A magnificent coming-of-age saga about two sisters from an aristocratic Egyptian family who rebel against tradition.\r\n\r\nInside a beautiful mansion on Virgins of Paradise Street in post-World War II Cairo, Jasmine and Camelia Rasheed grow to womanhood under the watchful eyes of their grandmother and the other women of the prominent Rasheed family. Despite the glamour and elegance of the city, women still wear the veil and live in harems. But as Egypt begins to change, so do Jasmine and Camelia. \r\n\r\nRebelling against a society in which the suppression of women is assumed, Jasmine and Camelia embark on turbulent personal and professional voyages of discovery. Cast out of the family, Jasmine travels to America to become a doctor while Camelia sets out to become one of the foremost beledi dancers in the Middle East. \r\n\r\nSensuous, spicy, and romantic, Virgins of Paradise is a spellbinding novel set in an exotic and erotic culture. Brilliantly portraying two sisters' search for identity amidst historic change, Wood also conveys a portrait of an ancient nation merging into the modern era while mired in superstition, magic, and mythology.", "asin": "1596528613", "rank": "1324532", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51nS8UDlfnL.jpg", "country": "Egypt", "story_arc": ["Tragedy", "Things only get worse"]}