{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 118, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Loved it. Informative. Well written. Crammed with history."}, {"review_sentiment": 1.0, "review_text": "There are no art plates in the Kindle edition. Navigation takes you to the start of the corresponding chapter, where you'll find a b&w; thumbnail of the art in question. I had to google the artwork to see it. Even at the Kindle sale price, I feel duped buying it. I don't have a lot to say about the content because I stopped reading due to the lack of visuals.  What I did read seemed interesting, but I could tell it was written by an academic."}, {"review_sentiment": 2.0, "review_text": "I was disappointed, admittedly my own fault. I failed to  note the entire title and expected a book about Vermeer. I had read The Pearl Earring and appreciated that book. This book detailed a couple of paintings and spent the rest of the time on the history of China, which I found boring."}, {"review_sentiment": 1.0, "review_text": "The book is fine, however, the eight color plates/illustrations did not download properly.  Two calls to Kindle Help did not  troubleshoot the problem. So will have to order hardback book in order to view the plates."}, {"review_sentiment": 5.0, "review_text": "Excellent book, very informative on the beginnings of global trade in the seventeenth century."}, {"review_sentiment": 5.0, "review_text": "Great"}, {"review_sentiment": 4.0, "review_text": "good"}, {"review_sentiment": 5.0, "review_text": "Very entertaining even if one's not versed in art."}, {"review_sentiment": 5.0, "review_text": "A very well-researched and well-written series of historical speculations prompted by the items the author observes in paintings by Vermeer.  He uses these as \"doors\" to show how the world was becoming a global economy and society in the 17th Century.  I learned a great deal and was prompted to speculate along with the author.  It was a valuable and enjoyable book."}, {"review_sentiment": 5.0, "review_text": "Amazing"}]}, "authors": ["Timothy Brook"], "isbn": "1596915994", "longitude": 4.8936041, "periods": ["1600s", "Recent Releases"], "title": "Vermeer's Hat: The Seventeenth Century and the Dawn of the Global World", "word_cloud": "love write history art plat edition take correspond chapter find b w thumbnail art question google artwork even sale price feel duped buying lot say content stop read due lack visuals seem interest write academic disappoint admittedly fault fail note entire title expect appreciate detailed couple painting spend rest time history find bore fine however color download properly call troubleshoot problem order hardback order view plate excellent informative beginning trade great good very entertain even verse art series historical speculation prompt item author observe painting use door show become economy society learn great deal prompt speculate author valuable enjoyable amaze", "genres": ["Biography", "Art & Architecture", "History"], "summary": "In this critical darling Vermeer's captivating and enigmatic paintings become windows that reveal how daily life and thought-from Delft to Beijing--were transformed in the 17th century, when the world first became global.\r\n\r\nA Vermeer painting shows a military officer in a Dutch sitting room, talking to a laughing girl. In another canvas, fruit spills from a blue-and-white porcelain bowl. Familiar images that captivate us with their beauty--but as Timothy Brook shows us, these intimate pictures actually give us a remarkable view of an expanding world. The officer's dashing hat is made of beaver fur from North America, and it was beaver pelts from America that financed the voyages of explorers seeking routes to China-prized for the porcelains so often shown in Dutch paintings of this time, including Vermeer's.\r\n\r\nIn this dazzling history, Timothy Brook uses Vermeer's works, and other contemporary images from Europe, Asia, and the Americas to trace the rapidly growing web of global trade, and the explosive, transforming, and sometimes destructive changes it wrought in the age when globalization really began.", "asin": "1596915994", "rank": "103293", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/51qXZ%2BFB1bL.jpg", "country": "The Netherlands", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}