{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 49.262428, "ratings": {"num_ratings": 101, "rating": 3.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Lots of typos in the kindle edition.  clearly been OCRed."}, {"review_sentiment": 4.0, "review_text": "Funny and sharp"}, {"review_sentiment": 5.0, "review_text": "Brilliant novel that I keep coming back to every couple of years. I love all the characters and the random lists."}, {"review_sentiment": 1.0, "review_text": "Oh, how I wanted to like this book.The sections with the jpod employees were funny enough, and I loved the parts about adding a hip turtle to the nearly-finished skateboarding game. The rest of the book, along with the main story line were SO boring. Then there were lots of bold random headlines, emails, word lists, and unnecessary filler that I wasn't sure exactly what Coupland was trying to do.There was also some 4th wall breaking, in which characters talked about Douglas Coupland. I usually like that kind of thing, but it kind of fell flat here for me.I kept checking Kindle's progress bar each time I turned a page, hoping to be almost done."}, {"review_sentiment": 5.0, "review_text": "This is my favorite book. There is really no way to predict the plot-- or the amazing one-liners and trips down the rabbit hole of nostalgic tech culture. It's also a great study on what happens to Gen X and Y when they grow up-- and the absurdity of the world around us. I keep re-reading it again."}, {"review_sentiment": 4.0, "review_text": "love this book, twisted humorous outlook on the workplace."}, {"review_sentiment": 5.0, "review_text": "If you're a programmer, gamer, tech savvy, or just love twisted comedy, you'll love this book. Microserfs and JPod are two of my favorites. Coupland is absolutely brilliant. I'd also suggest \"the bubblegum thief\". They're all hysterical."}, {"review_sentiment": 5.0, "review_text": "I love this book!"}, {"review_sentiment": 4.0, "review_text": "if you are interested in some interesting and unique characters, then this book might be for you. especially if you liked the canadian tv adaptation of the book."}, {"review_sentiment": 5.0, "review_text": "Good book, 10/10 would read again"}]}, "authors": ["Douglas Coupland"], "isbn": "1596911050", "longitude": -123.11554, "periods": ["2000s", "Recent Releases"], "title": "JPod", "word_cloud": "typo kindle edition clearly sharp keep come back couple year love character random list want section employee funny enough love part add hip turtle skateboard game rest main story line boring then lot bold random headline email word list unnecessary filler sure exactly try also break character talk usually kind thing kind fell flat check progress bar time turn page hop almost do favorite really way predict plot amaze trip rabbit hole nostalgic tech culture also great study happen grow absurdity world keep love twist humorous outlook workplace programmer gamer tech savvy love twist comedy love favorite absolutely brilliant also suggest bubblegum thief hysterical love interested interesting unique character especially liked canadian tv adaptation", "genres": ["Fiction & Literature"], "summary": "A lethal joyride into today’s new breed of technogeeks, Coupland’s forthcoming novel updates Microserfs for the age of Google.\r\n\r\nEthan Jarlewski and five co-workers whose names start with J are bureaucratically marooned in jPod. jPod is a no-escape architectural limbo on the fringes of a massive Vancouver game design company.\r\n\r\nThe six workers daily confront the forces that define our era: global piracy, boneheaded marketing staff, people smuggling, the rise of China, marijuana grow ops, Jeff Probst, and the ashes of the 1990s financial tech dream. jPod’s universe is amoral and shameless. The characters are products of their era even as they’re creating it. \r\n\r\nEverybody in Ethan’s life inhabits a moral grey zone. Nobody is exempt, not even his seemingly strait-laced parents or Coupland himself, as readers will see.\r\n\r\nFull of word games, visual jokes and sideways jabs, this book throws a sharp, pointed lawn dart into the heart of contemporary life. jPod is Douglas Coupland at the top of his game.", "asin": "1596911050", "rank": "558021", "city": "Vancouver", "image": "https://images-na.ssl-images-amazon.com/images/I/51-ezIXdkML.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}