{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 392, "rating": 4.4, "reviews": [{"review_sentiment": 3.0, "review_text": "New York, 1967. Rosemary and Guy move into the Bramford - a prestigious apartment that everyone wants to move into. This is the decade when all of the horror movie classics were released, including Psycho and The Night of the Living Dead. A year after Rosemary's Baby was published, it also joined the list of the movie classics, and a Google search will show you that the movie seems more popular than the book! 1967 is also around the time of the Vietnam war, so it is not surprising that the classic horror movies came out in this time period. They are a means of escape, of seeing monsters outside of people's own reality.I learned a while ago that if you are desperate to have something, that decision is most likely illogical. Anything I have wanted desperately that I ever got was something I regretted later. For example, I am from Canada, but my husband got a job in the U.S. I desperately wanted to stay in Canada, even though his American job not only paid double what he would make in Canada, it is also cheaper to live. Luckily, my husband pushed us to leave because we are better off now than we would have been in Canada.So, I knew from the beginning of the novel that nothing was going to go right.Guy and Rosemary already signed a lease for another apartment and lied their way to break the lease so they could get the apartment at the Bramford. Although it is a beautiful apartment, it is smaller and older. However, Rosemary pushes for it because it is the apartment of their dreams. Even though her friend Hutch warns against it because of the weird accidents and deaths that happen there. Even though the guests are a bit odd and nosy. One thing that this novel made me think about is how most horror stories somehow link to the past. This gives the impression of an evil entity that surpasses time and is more indestructible. Horror movies such as The Conjuring do similar things by showing the \"original\" story of the monsters and give the impression that this evil will never die. However, something has to be said about older societies that make it easier for these evil entities to take hold. The only thing about this movie that I would complain about is the fact that, in this modern age, we know exactly what will happen in the classic horror stories. Almost from the beginning, I knew what would happen, so nothing was much of a surprise. If you do not mind knowing pretty much what will happen next - give this book a shot! It is a fun and easy read that will get you to pass the time without having to think too much. Although this story is not a surprise, and it may make you annoyed, the classic horror feel you get brings you back to a different era, and allows you to enjoy a few simple hours of your day. Who Should Read this Novel:- Fans of the classic horror movies and horror novels.- Those who like an easy and entertaining read."}, {"review_sentiment": 4.0, "review_text": "Such a good book and movie, how rare is that????"}, {"review_sentiment": 5.0, "review_text": "A classic for a reason. I've heard that when asked if you should read the book or see the movie, Stephen King said, \"Either will do.\" And as often has been commented on, the film is one of the closest adaptations to exist. But do read the book!  Ira Levin's writing in this novel is worthy of study. His prose hits with a surgical precision that one almost never sees. Even with my familiarity of the plot, I was kept on the edge of my seat as the tendrils of paranoia reached off the page. I only wish I had read it earlier. Highly recommended!"}, {"review_sentiment": 4.0, "review_text": "I put this on my TBR after reading a post about it written by someone on Wordpress and it did NOT disappoint. She recommended not reading the blurb beforehand, so I went in cold and I'd like to echo that suggestion. Do NOT read the blurb beforehand! It definitely gives away part of the plot and, imo, is a better read if you don't know. Anyway, it was a great book, spooky without being scary scary. It actually pulled me out of a bit of a reading slump, which was great! Drags on a bit occasionally, but overall very good."}, {"review_sentiment": 4.0, "review_text": "not a literary wonder ; a quick read"}, {"review_sentiment": 3.0, "review_text": "Rosemary's Baby is not very scary but it was pretty strange and I enjoyed it.Rosemary and her husband were really wanting to get into the Bramford apartment complex and right when they had signed a lease on another apartment it becomes available and Rosemary begs her husband Guy to get them out of the lease and into the Bramford. Wrong move on her part! :)Not real long after they had been living there they meet an old couple who really seems to take over their lives but Rosemary doesn't see it until it's to late. Rosemary doesn't see a lot of things till it's too late. I know I keep saying wake up woman!It wasn't to long after they met the old couple that Guy gets his big break in acting and it seems he is on fire with his career and then Rosemary gets pregnant and that is when the old couple really become a bit obsessed with her and the care of her baby, they even get her to go to a doctor they recommend, give her  vitamin drinks, etc.Like a lot of older horror it was more atmospheric than scary. The reader can see what his happening and is worried for Rosemary though she is a bit slow to realize what is happening. There was a few times I really wanted to scream at Rosemary for not catching onto things that were happening around her.The ending is a little strange and well I don't know. I am not even sure what I was expecting. I do think I am glad that I read this one before seeing the movie and now I would like to watch the movie. (Seeing the movie ruined my enjoyment of The Exorcist novel).I am reading this book called Paperbacks from Hell and it's the history of the horror industry from the 70's and 80's and the author says there was three books that really was a turning point for horror and those are The Exorcist, Rosemary's Baby and The Other. So I have one more to go and I will have all three read. :) Let me tell you this book is wreaking havoc on my TBR...lol.Even though it's classed as horror I think I would put it as more suspense than horror, especially towards the end. I would recommend it to those who might like a little spooky suspense as it would be great for those who don't like to get to scared. I know a few of you out there...lol."}, {"review_sentiment": 3.0, "review_text": "I still don't know what to think about this book.The story line & details of information were very well explained, in a very appropriate amount of time. However, the specific points of focus/detail, gave the plot/mystery away.The build up was very good & kept me interested the whole way through. Even to the end, the very end.. but that's where it stops. The book LITERALY stops, right when there is so much more to be explained. There is a whole story still to be told.. but It just ends. With no warning."}, {"review_sentiment": 4.0, "review_text": "Read this book a long time a ago and wanted to revisit the story in its original format.  Although the movie follows the book and dialog very closely I still found it an enjoyable read."}, {"review_sentiment": 5.0, "review_text": "A darkly brilliant classic tale of the mundane becoming highly sinister.I'll admit to being a ROSEMARY \"virgin.\" Seriously, had never read this book (or seen the movie in its entirety)--and it's celebrating 50 years this fall.Rosemary and Guy Woodhouse are newly-wed and moving into their first NYC apartment, The Bramdford (known in real-life as The Dakota). Guy is struggling actor who has appeared in a few commercials and radio, Rosemary is an innocent housewife. Grandparent-like neighbors come nosing around and soon befriend the couple, though Rosemary has some reservations about them; she just wants to hang out with people her own age.I had expected ROSEMARY'S BABY to much more scary than it is. In many ways, it reads like a contemporary psych thriller ala B.A. Paris meets Shari Lapena. It's a fast, easy read but an undercurrent of sinister and discomfort pulses through every line, every scene; something's 'off,' but what?Of course, we all know (not even having had the book, I knew the general plot/premise). Still, I was surprised and wow-ed with Levin's deft and subtle plotting, propelling me to keep turning those pages. Plus, I loved Rosemary's interest in home decor and also the architecture of the old apartment building.There's also a few 'mental illness' moments that satisfied my psych suspense reading. Such a well-done tale."}, {"review_sentiment": 5.0, "review_text": "Tired from a stream of \"serious\" literature, I recalled previously enjoying an Ira Levin book.Searching under his name, my goodness(!), I was struck by how many were familiar titles - many made into blockbuster movies of my childhood.Well, having chosen Rosemary's Baby for my quick confection of a read, I am now inclined to devour (or re-devour, for those I read a jillion years ago) his entire catalog.No, it's not literature to brag about, it's something different, but equal: immersive storytelling. Well done!"}]}, "authors": ["Ira Levin"], "isbn": "1605981109", "longitude": 0.0, "periods": ["1900s"], "title": "Rosemary's Baby", "word_cloud": "move prestigious apartment everyone want decade horror movie classic release include year publish also joined list movie classic search show movie seem popular also time war surprise classic horror movie come time period mean escape see monster outside people learn ago desperate something decision likely illogical want desperately ever get something regret later example husband get job desperately want stay even american job pay double also cheaper live husband push leave better begin nothing go already sign lease apartment lie way break lease apartment beautiful apartment smaller older however rosemary push apartment dream even friend warn weird accident death even guest bite odd nosy thing make think horror story somehow link give impression evil entity surpasses time indestructible movie similar thing show original story monster give impression evil never die however something say older society make easier evil entity take thing movie fact modern age know exactly happen classic horror story beginning know nothing much surprise mind know pretty much next give shot fun easy pas time think much story surprise annoyed classic horror feel get bring back different era allow enjoy simple hour day classic horror movie horror easy entertain such good movie rare classic reason hear ask see movie say often comment film closest adaptation exist write worthy study prose hit surgical precision almost never see even familiarity plot keep edge seat tendril paranoia reach page wish earlier recommend put read post write someone recommend read blurb beforehand go cold like echo suggestion beforehand definitely give part plot imo better know anyway great spooky scary scary actually pull bit reading slump great bit occasionally overall good literary wonder quick rosemary scary pretty strange enjoy husband really want get apartment complex right sign lease apartment become available begs husband lease part not real long live meet old couple really seem take life see late see lot thing till late know keep say wake woman long meet old couple get big break act seem fire career get pregnant old couple really become bit obsessed care even doctor recommend give vitamin drink lot older horror scary see happen worried bit slow realize happen time really want scream catch thing happen end little strange well know even sure expect think glad see movie watch movie movie ruin reading call history horror industry author say really turn point horror other go wreak havoc classed horror think suspense horror especially towards end little spooky suspense great get scar know lo still know think story line detail information well explain appropriate amount time however specific point give build good kept interested whole way even stop stop right much explain whole story still end warn long time ago want revisit story original format movie follow dialog closely still find enjoyable darkly brilliant classic tale mundane become highly admit virgin seriously never see movie entirety celebrate year move first apartment know struggle actor appear commercial radio innocent housewife neighbor come nose around soon befriend couple rosemary reservation want hang people expect much scary many way read contemporary psych thriller meet fast easy undercurrent sinister discomfort pulse line scene something course know even know general still surprise deft subtle plot propel turning page love rosemary interest home decor also architecture old apartment also illness moment satisfy psych suspense reading such tale stream serious literature recall previously enjoy name goodness strike many familiar title many make blockbuster movie choose quick confection incline devour gillion year ago entire literature brag something different equal immersive storytelling do", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "A masterpiece of spellbinding suspense, where evil wears the most innocent face of all...\r\nRosemary Woodhouse and her struggling actor husband Guy move into the Bramford, an old New York City apartment building with an ominous reputation and mostly elderly residents. Neighbors Roman and Minnie Castavet soon come nosing around to welcome the Woodhouses to the building, and despite Rosemary's reservations about their eccentricity and the weird noises that she keeps hearing, her husband takes a special shine to them. \r\n\r\nShortly after Guy lands a plum Broadway role, Rosemary becomes pregnant, and the Castavets start taking a special interest in her welfare. As the sickened Rosemary becomes increasingly isolated, she begins to suspect that the Castavets' circle is not what it seems...", "asin": "1605981109", "rank": "596724", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51cCXO3IQmL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}