{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 7, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Historically accurate and prescient of the future"}, {"review_sentiment": 5.0, "review_text": "Great book"}, {"review_sentiment": 5.0, "review_text": "Was given as a gift to my boss.  He loved it also."}, {"review_sentiment": 5.0, "review_text": "These are good photos. Evan's is better known for his work for the FSA. These photos of Cuba show another aspect to his eye. Well worth picking up, it belongs on any photographer's bookshelf."}, {"review_sentiment": 5.0, "review_text": "Cuba's poverty is shown, the reasons for Fidel's win are all too evident.A beautiful country mired in poverty.The triumph of the Revolution in black and white."}, {"review_sentiment": 2.0, "review_text": "because of the famous photographer and famous commentator, but the book doesn't get a spot in my library because it bears no witness to the Cuba I saw, and, frankly it's not the best work of its creators."}, {"review_sentiment": 5.0, "review_text": "Book was beautifully wrapped (plastic covering) and recd in very good condition.Made an excellent gift for two people who had gone to Cuba. Walker Evans is a superior photographer and it would make an great 'coffee table' book gift."}]}, "authors": ["Andrei Codrescu"], "isbn": "1606060643", "longitude": -82.3658671, "periods": ["1900s"], "title": "Walker Evans: Cuba", "word_cloud": "historically accurate prescient future great give gift love also good photo better know work photo show aspect eye pick belongs photographer poverty show reason win beautiful country mire triumph black white famous photographer famous commentator spot library bear saw frankly best work creator beautifully wrap plastic covering recd good excellent gift people go superior photographer great table gift", "genres": ["Essay", "Art & Architecture", "Travel Writing"], "summary": "In 1933, Walker Evans traveled to Cuba to take photographs for The Crime of Cuba, a book by American journalist Carleton Beals. Beals’s explicit goal was to expose the corruption of dictator Gerardo Machado and the torturous relationship between the United States and its island neighbor. Evans’s photographs are fascinating both for their subject matter and the evidence they provide of his artistic development. This volume brings together more than sixty of these images—all from the J. Paul Getty Museum’s extensive holdings of the photographer’s work.\r\n\r\nCodrescu’s spirited text helps to provide a sense of the aesthetic and political forces that were shaping Evans’s art in the early 1930s. He argues that the photographs are the work of a young artist whose temperament was distinctly at odds with Beals’s impassioned rhetoric and shows that Evans was just beginning to combine his early, formalist aesthetic with the social concerns that would figure so prominently in his later work. Together, the images and the insightful essay provide a compelling study of a major artist at an important juncture in his career.", "asin": "1606060643", "rank": "508692", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/51DRoi6Uz-L.jpg", "country": "Cuba", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}