{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 449, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "great recipes although they can be challenging"}, {"review_sentiment": 5.0, "review_text": "A wonderful read, especially if you love Paris, and food, and the art of cooking."}, {"review_sentiment": 5.0, "review_text": "I love David Lebovitz!  Reading his stories and recipes is both entertaining and inspirational."}, {"review_sentiment": 5.0, "review_text": "I have started a project where I am cooking every recipe from this book and I must say I am close to 15% done and each and every recipe I have made (with the exception of Sardine Spread) has come out spectacular. The writing and story of each recipe is very informative and interesting and the recipes which range from novice to expert are laid out in a very coherent way. Just a joy to cook from this book and with a little investigating you can find my blog on wordpress. Great cookbook and I highly recommend it."}, {"review_sentiment": 5.0, "review_text": "Everything David writes is a favorite of mine. I laugh, I cry, and most of all I love. I've ordered/pre-ordered everything he has ever written and never been disappointed. My favorite author! :)  My Paris Kitchen is filled with delicious recipes + stories from David about his life in Paris and so much more. This book is definitely my go-to book for what pot or pan to cook with, pantry necessities, and kitchen tips from an expert."}, {"review_sentiment": 5.0, "review_text": "Book just as advertised, beautiful book"}, {"review_sentiment": 5.0, "review_text": "I love this book and especially enjoy David's writing style. All the stories he included about Paris, and his trials and tribulations of moving to Paris, his appreciation of food, especially desserts, made for a delightful book! My husband first brought home a copy from the library for me, I fell in love with it and carried it around the house with me every day and hid it so he couldn't return it to the library until I could get my own copy delivered."}, {"review_sentiment": 5.0, "review_text": "If you like unpretentious French food (and I do) this is a great book."}, {"review_sentiment": 5.0, "review_text": "I cannot wait for the autumn weather to arrive so I can get back to cooking from the beautiful book."}, {"review_sentiment": 5.0, "review_text": "Always an entertaining read, and recipes too."}]}, "authors": ["David Lebovitz"], "isbn": "1607742675", "longitude": 2.3514992, "periods": ["2000s", "Recent Releases"], "title": "My Paris Kitchen: Recipes and Stories", "word_cloud": "great challenge wonderful especially love food art cooking love entertain inspirational start project cook recipe close do recipe make exception come spectacular write story recipe informative interesting range novice expert laid coherent way joy cook little investigating blog word press cookbook highly recommend everything write favorite mine laugh cry love everything ever write never disappoint favorite author fill delicious life much definitely pot pan cook pantry necessity kitchen tip expert advertise beautiful love especially write style include trial tribulation move appreciation food especially dessert make delightful husband first bring home copy library fell love carry house day hid library copy deliver unpretentious french food great wait autumn weather arrive get back cook beautiful always entertain", "genres": ["Food and Wine"], "summary": "A collection of stories and 100 sweet and savory French-inspired recipes from popular food blogger David Lebovitz, reflecting the way Parisians eat today and featuring lush photography taken around Paris and in David's Parisian kitchen.\r\n\r\nIt’s been ten years since David Lebovitz packed up his most treasured cookbooks, a well-worn cast-iron skillet, and his laptop and moved to Paris. In that time, the culinary culture of France has shifted as a new generation of chefs and home cooks—most notably in Paris—incorporates ingredients and techniques from around the world into traditional French dishes. \r\n     \r\nIn My Paris Kitchen, David remasters the classics, introduces lesser-known fare, and presents 100 sweet and savory recipes that reflect the way modern Parisians eat today. You’ll find Soupe à l’oignon, Cassoulet, Coq au vin, and Croque-monsieur, as well as Smoky barbecue-style pork, Lamb shank tagine, Dukkah-roasted cauliflower, Salt cod fritters with tartar sauce, and Wheat berry salad with radicchio, root vegetables, and pomegranate. And of course, there’s dessert: Warm chocolate cake with salted butter caramel sauce, Duck fat cookies, Bay leaf poundcake with orange glaze, French cheesecake...and the list goes on. David also shares stories told with his trademark wit and humor, and lush photography taken on location around Paris and in David’s kitchen reveals the quirks, trials, beauty, and joys of life in the culinary capital of the world.", "asin": "1607742675", "rank": "13776", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51x3tUfS%2BRL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}