{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 85, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "There are moments of real beauty and insight in Ru, but many of the chapters fail to deliver. The choice to write subject based fragments is interesting and I think would have been more successful if each were as balanced and provoking as the best of them were. Without chronological order to tie the fragments together each segment must carry its own weight. When one fails it feels like a missing piece or a lost opportunity. There's still much to be gained from reading Ru, and the powerful chapters make it worth the time it takes to get to them."}, {"review_sentiment": 4.0, "review_text": "You have to be willing to go back and forth with her, but she has a very natural style, and she is not glamorizing Vietnamese people.  She shows things from a lot of perspectives, even within her family."}, {"review_sentiment": 3.0, "review_text": "It's ok"}, {"review_sentiment": 5.0, "review_text": "The book is not as dark as I was afraid whenever I saw a book about wars and the Vietnamese refugees. It was like reading a poem, the kind of poems like \"Truyen Kieu\". It was like swimming slowly in a shalow stream, perfectly safe and peaceful"}, {"review_sentiment": 4.0, "review_text": "What I liked about the book was what I also disliked about the book, the way it moved from one place and period to another, but of course this is how we remember.  I was disappointed that it said that none of characters were real, yet reading about Kim Thuy it obviously was based on her own experiences.  The book was beautifully written especially as it was a translation. There were some enchanting vignettes and others almost horrific.  The book is so relevant today when you see the problems faced by those currently fleeing despotic regimes.  I was surprised that when we went to Vietnam no one had told us about the no no of touching someone's head, the cultural issues about food were fascinating. Part of the charm of the book is also in what is not said, she leaves certain matters in the air.  I understand that another of her novels Mãn is even better, I can't wait to read it."}, {"review_sentiment": 4.0, "review_text": "Decades before the current refugee crisis in Europe, the world had faced an almost similar - by means of transportation, at least - human catastrophe: the Vietnamese trying to escape by boat the war ravaged country. Kim Thuy was one of those people, arriving in Canada when 10. Ru - lullaby in Vietnamese, but sounding also like the French word for street and river - is her account of her identity appropriation.Like a slow river, the writing - I've read the English translation, as the book was published in French - flows, with point-counterpoint of topics developed from a vignette to the other. 'I first saw the light of day in Saigon, where firecrackers, fragmented into a thousand shreds, coloured the ground red like the petals of cherry blossoms or like the blood of the 2 million soldiers deployed and scattered through the villages and cities of a Vietnam that had been ripped in two'.It is less than autobiography, and more an account of the 'boat people' destinies and past, aimed to be a 'voice of the Vietnamese people', aiming to compensate the silence of historical references. The life in the new society - Canadian in this case - was hard, but achievable, and many succeeded build a new life. According to her literary testimony, there were less tensions and drama, just a lot of work and desire to integrate. Each one of the slow paced stories is a testimony, tells a little human story revealing more about the Vietnamese society, its human touch and lost memories. Although a literary fiction, it forces the reader to go deep into the anatomy of feelings and to open up to a new world. At the end of the book, the slow sound of the river song still flows in your ears, reminding you to see more than a thing differently. It is both history, especially political history - and psychology in one single little book. You may feel guilty that it took some time to understand this generation of Vietnamese and grateful for such a testimony to bring you the shades of truths.Rating: 4 stars"}, {"review_sentiment": 4.0, "review_text": "Beautifully written. This book made me think."}, {"review_sentiment": 5.0, "review_text": "Way too short!  What a compliment to any book."}, {"review_sentiment": 5.0, "review_text": "An engaging verbal montage! Poignancy born on the wings of hope."}, {"review_sentiment": 3.0, "review_text": "The meaningfulness of the story was somewhat missing in the translation."}]}, "authors": ["Kim Thúy"], "isbn": "1608198987", "longitude": -73.6103642, "periods": ["1900s", "Recent Releases"], "title": "Ru: A Novel", "word_cloud": "moment real beauty insight many chapter fail choice write subject base fragment interest think successful balance provoke best chronological order tie fragment together segment weight fail feel miss piece lose opportunity still much gain read powerful chapter make worth time take willing back forth natural style glamorize vietnamese people show thing lot perspective even family dark afraid saw war vietnamese refugee read poem kind poem swim slowly shallow stream perfectly safe peaceful like also dislike way move place period course remember disappoint say none character real yet read obviously base experience beautifully write especially translation enchant vignette others almost horrific relevant today see problem face currently flee despotic regime surprise go tell touch someone head cultural issue food fascinate charm also say leaf certain matter air understand novel even better decade current refugee crisis world face almost similar mean transportation least human catastrophe try escape boat war ravage country people arrive lullaby vietnamese sound also word street river account identity slow river write english translation publish french flow topic develop vignette first saw light day firecracker fragment shred color ground red petal cherry blossom blood soldier deploy scattered village city rip le autobiography account people destiny aim vietnamese people aim compensate silence historical reference life new society canadian case hard achievable many succeed build new life accord literary testimony tension drama lot work desire slow pace story testimony tell little human story reveal vietnamese society human touch lose memory literary fiction force go deep anatomy feeling open new world end slow sound river song still flow ear remind see thing differently history especially political history psychology single little guilty take time understand generation grateful testimony bring shade star beautifully write make think short compliment engage verbal montage bear wing hope meaningfulness story somewhat missing translation", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A runaway bestseller in Quebec, with foreign rights sold to 15 countries around the world, Kim Thúy's Governor General's Literary Award-winning Ru is a lullaby for Vietnam and a love letter to a new homeland.\r\n\r\nRu. In Vietnamese it means lullaby; in French it is a small stream, but also signifies a flow - of tears, blood, money. Kim Thúy's Ru is literature at its most crystalline: the flow of a life on the tides of unrest and on to more peaceful waters. In vignettes of exquisite clarity, sharp observation and sly wit, we are carried along on an unforgettable journey from a palatial residence in Saigon to a crowded and muddy Malaysian refugee camp, and onward to a new life in Quebec. There, the young girl feels the embrace of a new community, and revels in the chance to be part of the American Dream. As an adult, the waters become rough again: now a mother of two sons, she must learn to shape her love around the younger boy's autism. \r\n\r\nMoving seamlessly from past to present, from history to memory and back again, Ru is a book that celebrates life in all its wonder: its moments of beauty and sensuality, brutality and sorrow, comfort and comedy.", "asin": "1608198987", "rank": "304494", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/51Uta0MU6vL.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}