{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 35, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "A well written book about a little known part of Jamaica's history.  I really enjoyed it."}, {"review_sentiment": 5.0, "review_text": "This book is a page turner, that presents you with a multitude of perspectives. If you are Caribbean then the written accent doesn't phase you. Otherwise, it's a small learning curve to understand the slang but it's worth it. I recommend this book to any and everyone!"}, {"review_sentiment": 5.0, "review_text": "amazing book about Jamaica"}, {"review_sentiment": 5.0, "review_text": "This books is amazing. You are able to find connection with China and Jamaica. How each are different but yet the same in their own context."}, {"review_sentiment": 3.0, "review_text": "Quite interesting."}, {"review_sentiment": 5.0, "review_text": "It's the story of a man's life and his position in the community he was brought into. The slang and Yoda like sentence structuring make it a bit of a mental exercise at the beginning but you get used to it, my problem was my inner character voice was more hillbilly than Chinese immigrant"}, {"review_sentiment": 5.0, "review_text": "Reading this book evoked so many memories in me. Beautifully told, simple yet complex. It called me back over and over."}, {"review_sentiment": 4.0, "review_text": "Engaging. A fiction based on historical reality without the boredom of reading history."}, {"review_sentiment": 4.0, "review_text": "Great read for Jamaicaphiles in particular, rich detail, fast-moving story."}, {"review_sentiment": 5.0, "review_text": "A novel to savour, gripping story."}]}, "authors": ["Kerry Young"], "isbn": "1608195074", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "Pao", "word_cloud": "well write little known part history really enjoy page turner present multitude perspective write accent phase small learn curve understand slang worth recommend everyone amaze amazing able find connection different yet context quite interesting story man life position community bring slang sentence structure make bit mental exercise begin get use problem inner character voice hillbilly chinese immigrant read evoke many memory tell simple yet complex call engage fiction base historical reality boredom read history great particular rich detail story savor gripping story", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "As a young boy, Pao comes to Jamaica in the wake of the Chinese Civil War and rises to become the Godfather of Kingston's bustling Chinatown. Pao needs to take care of some dirty business, but he is no Don Corleone. The rackets he runs are small-time, and the protection he provides necessary, given the minority status of the Chinese in Jamaica. Pao, in fact, is a sensitive guy in a wise guy role that doesn't quite fit. \r\n\r\nOften mystified by all that he must take care of, Pao invariably turns to Sun Tzu's Art of War. The juxtaposition of the weighty, aphoristic words of the ancient Chinese sage, with the tricky criminal and romantic predicaments Pao must negotiate builds the basis of the novel's great charm.\r\n\r\nA tale of post-colonial Jamaica from a unique and politically potent perspective, Pao moves from the last days of British rule through periods of unrest at social and economic inequality, through tides of change that will bring about Rastafarianism and the Back to Africa Movement. Pao is an utterly beguiling, unforgettable novel of race, class and creed, love and ambition, and a country in the throes of tumultuous change.\r\n\r\nKerry Young was born in Kingston, Jamaica, to a Chinese-African mother and a Chinese father-a businessman in Kingston's shadow economy who provided inspiration for Pao. Young moved to England in 1965 at the age of ten. She earned her MA in creative writing at Nottingham Trent University. This is her first novel.", "asin": "B0071UK7FK", "rank": "4326644", "city": "Jamaica", "image": "https://images-na.ssl-images-amazon.com/images/I/51HLqdZ9oqL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}