{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 13, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "No doubt about it, this is a demanding book to read. The analysis is deep and the style of writing requires your full concentration. With a greater  knowledge of Spain and the Spanish I would have got more out of it. The beginning is slow and I risked abandoning altogether, however I stuck with it and it paid off, just about. The very end makes worthwhile in an unexpected way."}, {"review_sentiment": 5.0, "review_text": "This is a fascinating book about one of the most important events in the modern history of Spain that no one has heard of.  However, there are two warnings that must be stated first: as this book was written for a Spanish audience it assumes the reader is knowledgeable about the political history of Spain for the last 75 years; the author also has a very distinct style of writing. He favors very long, convoluted sentences with numerous repetitions of ideas. This book is about an attempted coup d’état on February 23, 1981, when a small detachment of Civil Guards (a militarized police force) stormed the Spanish Parliament and took all the delegates hostage. They sprayed the chamber with the bullets while the delegates cowered under their desks. This occurred six years after the death of Francisco Franco who had ruled as a dictator for 39 years. The idea was that Prince Juan Carlos, who had been schooled by Franco, would become King and support the continuation of an authoritarian government.  However, Aldopho Suarez, who is also central to this book and had been the last General Secretary of the ruling fascist political party under Franco, became the Prime Minister.  He actively steered the country towards a democracy. This greatly disturbed the military and other leaders of the prior regime.  While the Parliament was being stormed Suares, the Prime Minister, sat upright in his seat at the front of the chamber while bullets flew around him. The entire event was captured on television cameras tht were automatically taping the Parliamentary session.  Due to the Prime Minister’s refusal to deal with attempted military revolution and the fact that the King immediately declared on Spanish television his unwavering support for the new constitution, the military leaders behind the coup backed off and it quickly failed. As the author points out, this was the first time in the history of Spain that a democracy was able to survive a military coup against it. As is usual with a failed revolt, there is little documentation and the stories of the people involved change drastically over time. The author does an excellent job of describing the confusion that existed over the planning of the coup and carefully analyzing the varying accounts of individuals involved. He then presents the most logical scenario for this event. If you have any interest in the politics of modern Spain, this book is highly recommended."}, {"review_sentiment": 4.0, "review_text": "“The Anatomy of a Moment” is a moving account of a failed coup d’etat whose failure solidified Spain’s transition to democracy.  It is also an account of a key figure in that  transition, the Prime Minister Adolpho Suarez.  The coup began with a takeover of parliament, in which Suarez exhibited grace under pressure.  Sitting at his desk while all but two others were ducking for cover, he was caught on TV tape, but the tape was not broadcast until days later; in fact, the reader comes to realize that Suarez was not a factor in the events which led to the failure of the coup.  I infer that the decisive actor was the king’s aide, Fernandez Campo, who stood firm in talking to the senior plotter and rallied the king to stand firm.Cercas successfully employs a rhetorical style to convey the significance of the moment and of the transition which in a sense finally ended the Spanish civil war of the 1930’s.  History is  personified.  Memorable phrases are created and repeated.  Just as one can listen appreciatively to a spell binding orator, the reader can enjoy the repetition in this work. At the same time, Cercas plays the role of a careful investigator to reach his conclusions about what role each of the principals played in the coup and its failure. He uses these same skills, and his powers as a novelist, to tease out the motivations and psychology of Suarez.  Suarez was an ambitious Falangist functionary who grew into his greatness with a strong sense of his role in history.  He was an archetypal politician, and in Cercas’ view, “perhaps nobody comes to power without using dubious or dangerous or simply evil means”.  He brought about democracy by deceiving his conservative friends, by acting quickly and decisively, and by getting the Communist Carillo to place the future of Spain above any desire for revenge. The skills of the orator and the novelist are not necessarily the skills which are most effective in presenting complex material .  A more linear account would have been clearer.  For some reason, Cercas waits almost to the book’s end to identify the specifics of  Spain’s economic and governance problems prior to the coup, and what specifically General Armada  was hoping to achieve by “trimming” democracy. Cercas devotes much space to the role of a major Cortina, and it is not clear why.  Cercas is taken with the analogy between Suarez and a fictional character in an Italian film, and gets too  repetitious about it."}, {"review_sentiment": 4.0, "review_text": "If your interest is history, Spanish History, then this is the book for you. Javier Cercas has shown why he is regarded as a top literary specialist for his country. As a non-Spaniard I enjoyed reading about the political mayhem in another country and couldn't help but compare 'the coup' with the experience in Australia in the seventies when The people's choice of prime minister and party was removed from office by the far right, and illegally! It left me feeling less isolated and much less a political victim knowing that these behaviours are not only happening in the land down under!"}, {"review_sentiment": 5.0, "review_text": "This is a gripping, thoughtful account of the attempted 1981 golpe de estado (23-F) in Spain. Cercas' meandering account of the plot, it's 'placenta' and goals, and the bravery during the assault on parliament of three pro-democracy protagonists--Adolfo Suárez, Manuel Gutiérrez Mellado, and Santiago Carrillo--circles about into a perceptive appraisal of the early years of the Spanish transition and a fascinating portrait of Suárez as an ambitious provincial Falangist who became the truest apostle of Spanish democracy.  The judgment is debatable, but the way Cercas arrives at it is fascinating.  One caveat--either the author or his translator (I don't have the Castilian original at hand), or both, are addicted to sentences unduly prolonged by too many colons and semicolons."}, {"review_sentiment": 1.0, "review_text": "This book tells a fascinating story in such a loquacious way that one is bored and irritated long before one is a third of the way through.  The author is repetetive and verbose, repeating any phrase he thought good endlessly.  It needed and still needs the services of a good editor.John Ronayne."}, {"review_sentiment": 5.0, "review_text": "Javier Cercas' passionate, clever literary attack on the vestiges of Francoism focuses on the February 23, 1981 failed coup d'etat and takeover of the Cortes, Spain's legislature,  by the Spanish military, its major actors and the politics of post Franco Spain. \"Anatomy\" in the title refers to the dissection of the careers of the three politicians who refused to cower or retreat in the swirl of the golpistas' bullets; the prime minister, his main military supporter,  and the head of the Communist Party. From these portraits of the three members of the Cortes,  Cercas, an agile writer of intellect, subtlety and force, weaves a stunning examination of this minute by minute struggle for democracy in the face of this attempted military coup. This book, focused on the first nascent government after the death of Franco, transcends Spain and its volatile politics; it is an analysis of the essence of the European power game of parliamentary democracy, the struggle for primacy, its shifting alliances, and the emergent coalitions of forces on the right and the left.Cercas, the author of the brilliant \"Soldiers of Salamis,\" employs various stategies to tell his tale; literary allusions, repetition, philosophising on the politics and his artistry can overwhelms the story line at some points. A fuller discussion of the Estado de las Autonomias, the autonomy legislation for Basque, Catalonia and Galicia, was needed. He is too general of the lack of achievements of the Prime Minister,  Adolpho Suarez,  in the two years immediately preceding the coup. His treatment of the career of Juan Carlos I is skimpy even though the Index shows he relied on the notable Spanish scholar Paul Preston's biography of the monarch.  Anne McLean's translation  is superb as it catches the fluidity and daring of Cervas' writing,  making the book a joy to read. These comments are not intended to detract from the force of this thoroughly fascinating book.  One may even find the actual televised attack in the Cortes on YouTube. This book was bought in Europe and I look forward to its availability in the United States."}, {"review_sentiment": 5.0, "review_text": "Following his unconvincing meditation on American atrocities in the Vietnam war in \"The speed of light\" Javier Cercas returns to his own country's history for his latest work. \"The anatomy of a moment\" revisits the theme of the Spanish Civil War and its consequences that Cercas so brilliantly explored in \"Soldiers of Salamis\". However in his new book he eschews fiction, even the \"post-modern\" variety that he practices, which blurs the distinction between the real and the imaginary. Instead he employs a part philosophical, part journalistic meditation on the 1981 attempted coup to overthrow Spanish democracy.\"The anatomy of a moment\" focuses on the three parliamentarians who refused to duck when the Civil Guard who invaded the Cortes opened fire. They were Gutteriez Mellado, a former Francoist general now deputy Prime Minister, Santiago Carillo, head of the Spanish Communist party, and Adolfo Suarez, the outgoing Prime Minister. Suarez is above all the hero of the book - in Cercas account a Francoist functionary and \"provincial non-entity\" who grew into the architect of democracy and a giant of Spanish history. The author returns again and again to the image of Suarez sitting alone on the prime minister's bench as the bullets fly around him, one of only three people prepared to risk their necks while those with more impecible democratic credentials cower behind their desks, as most of the rest of us would naturally and rationally have done in similar circumstances.Parts of the book are difficult - the author talks to the reader as if they are already au fait with the history and politics of Spain. This leads, I thought, to a richer experience than books which spoonfeed the reader the historical background: in the end you feel you have earned the understanding you have achieved.In places the book has the characteristics of a non-fiction thriller as the details of both the coup, led by senior elements in the army, and the countercoup, led by the King, are plotted. The book is also very moving, particularly regarding the travails of Suarez in later life, and a deeply affecting coda when the author reflects upon the life and politics of his own father.The book is also deeply political, rejecting a current view prevalent in Spain that the rupture between Francoism and democracy was false and that Suarez ensured that those who had power under the dictatorship retained it under the constitutional monarchy. Cercas argues instead that the rupture was real and that Suarez was a \"hero of the retreat\" from dictatorship. That the author is prepared to set out such forthright opinions on this and other aspects of the coup add to the pleasure of the book: it is widely researched, deeply opinionated history, provocative, but not gratuitously controversialist. It demands the reader thinks while keeping them entertained.A great book."}, {"review_sentiment": 5.0, "review_text": "Between fact and fiction, the story of a failed coup is delivered in the most fascinating way. Through Cercas we witness a critical moment in Spanish democracy. A personal account of a moment lived by a whole nation in vigil. Javier Cercas is an excellent storyteller who will transport the reader back in time to a moment when the future of the Spanish democracy looked bleak."}, {"review_sentiment": 5.0, "review_text": "I will try to be understated, but this is a rave review.  \"The moment\" of THE ANATOMY OF A MOMENT is the attempted coup d'etat (\"golpe de estado\" in Spanish) that occurred in Spain in February 1981, when a band of Civil Guards armed with automatic weapons took over the Spanish Parliament (the \"Cortes\"), interrupting voting on the next Prime Minister, and held all of the deputies hostage for eighteen hours.  The failure of that golpe de estado, this book contends, is the most significant event in Spanish history since the Spanish Civil War.  Arguably it even marked the end of the Spanish Civil War.Javier Cercas initially set out to write a novel about the February 1981 golpe.  But he abandoned that effort in favor of writing a history because \"the events of 23 February on their own possessed all the dramatic force and symbolic power we demand of literature and I understood that, even though I was a writer of fiction, for once reality mattered more to me than fiction or mattered to me too much to want to reinvent it by substituting it with an alternative reality, because none of what I could imagine about 23 February concerned me and excited me as much or could be as complex and persuasive as the pure reality of 23 February.\"  Hence, what we have in THE ANATOMY OF A MOMENT is a book of history written by a skilled writer of fiction --  an attempt to explicate reality with fidelity to the known (or most likely) facts and with a novelist's eye for drama, irony, nuance, and meaning.By happenstance, the golpistas' commandeering of the Cortes on February 23, 1981 was captured on film for television (though, contrary to the \"memory\" of many Spaniards, it was not broadcast live).  Cercas uses the thirty-five minutes of that film as an anchor for the book, returning again and again to events recorded by the film and to the four central actors of the film.  Much of the book is devoted to what happened (and didn't happen).  Even more is devoted to the background and causal roots for what happened (and didn't happen).  And much is dedicated to assessing the significance of what happened (and didn't happen) for Spanish democracy and Spain today.The central figure - hero, even -- of the book is Adolfo Suárez, who had resigned as Prime Minister and in the film calmly sits upright in his seat in the assembly room while bullets whiz around him and virtually everyone else (all but two) hide, cower, and duck.  Suárez had been appointed Prime Minister by the King soon after the death of Franco, and then in 1976 he was elected Prime Minister in the first free nationwide elections in Spain in forty years.  He had been a Falangist and at first many Spaniards thought he would continue the programs and privileges of Francoism.  Instead, he embarked on transforming Spain into a true democracy, even legalizing the Communist Party (an act that alienated the Right and the military and was the most conspicuous trigger for 23 February).  Cercas discusses a 1989 esssay by Hans Magnus Enzensberger, in which he identified a new type of hero - \"heroes of retreat\" (rather than triumph and conquest), heroes who renounce and dismantle the political structure that originally empowered them.  Enzensberger named three such heroes of retreat from recent history:  Mikhail Gorbachev, Wojciech Jaruzelski, and Adolfo Suárez.  In THE ANATOMY OF A MOMENT, Cercas makes a compelling case for Suárez as such a hero; moreover, a man whose unique political abilities and instincts reconciled an irreconcilable Spain and enabled democracy in Spain as a political reality.Suárez was not the only figure in the book to turn his back on his original power base and on the past.  Two others in the book are General Gutiérrez Mellado  (Deputy Prime Minister) and Santiago Carrillo (head of the Communist Party in Spain).  All three were often called traitors.  \"In a certain sense they were:  they betrayed their loyalty to an error in order to construct their loyalty to a truth; they betrayed their own people in order not to betray themselves; they betrayed the past in order not to betray the present. * * * Sometimes treason is more difficult than loyalty.  * * * We have an ethics of loyalty, but we don't have an ethics of betrayal.  We need an ethics of betrayal.  The hero of retreat is a hero of betrayal.\"The above is an example - and not an isolated one - of Cercas venturing into the realm of political philosophy.  When he does, it usually is cogent and rewarding.  Nonetheless, THE ANATOMY OF A MOMENT may not appeal to many general readers.  Cercas's writing style is informal, discursive, maybe even wordy.  I could only read the book in 40-50 page chunks.  But if you are interested in any of the following specific subjects, the book is nigh essential:  1) the failed golpe de estada of February 1981; 2) modern Spanish democracy; 3) Adolfo Suárez; or 4) alternative approaches to writing history.  And for someone of my perhaps peculiar general tastes, the book is great!Javier Cercas (born in 1963) is one of the leading contemporary writers in Spain.  I read, reviewed, and was intrigued by his novel \"The Speed of Light\".  After reading THE ANATOMY OF A MOMENT I will now make a point of seeking out and reading everything of his in English translation (unless and until something badly disappoints me - I will keep my fingers crossed).The only complaint I have is addressed to the publisher.  At the end of the book there are fifteen pages of notes to the text.  Most cite sources for quotations or the more potentially contentious statements made in the text, but some also elaborate on the text or provide background information.  These endnotes supposedly are keyed to the text by page number.  For example, there is a note to a statement by Adolfo Suárez on page 105.  The problem is that the statement in question appears on page 99 of this paperback edition.  The same problem plagues all of the endnotes.  Presumably, the pagination of the paperback edition differs from the hardback, but no one bothered to change the endnote references to reflect those differences."}]}, "authors": ["Javier Cercas"], "isbn": "1608194914", "longitude": -3.7035825, "periods": ["1900s", "Recent Releases"], "title": "The Anatomy of a Moment: Thirty-Five Minutes in History and Imagination", "word_cloud": "doubt demand analysis deep style write require full concentration greater knowledge spanish get beginning slow risk abandon altogether however stick pay end make worthwhile unexpected way fascinate important event modern heard however warning state first write spanish audience assumes knowledgeable political last year author also distinct style write favor long convoluted sentence numerous repetition idea attempt coup small detachment militarize police force storm spanish take delegate hostage spray chamber bullet delegate cowered desk occur year death rule dictator year idea school support continuation authoritarian government however also central last rule fascist political party become actively steer country towards democracy greatly disturbed military leader prior regime storm sit upright seat front chamber bullet fly entire event capture television camera thy automatically tap session refusal deal attempt military revolution fact immediately declare spanish television unwavering support new constitution military leader coup back quickly fail author point first time democracy able survive military coup usual fail revolt little documentation story people involve change drastically time author excellent job describe confusion exist plan coup carefully analyze vary account individual involve present logical scenario event interest politics modern highly recommend move account fail coup teat failure solidify transition democracy also account key figure transition coup begin takeover parliament exhibit grace pressure sit desk others duck cover catch tv tape tape broadcast day later fact come factor event lead failure coup infer decisive actor king aide stand firm talk senior plotter rally king stand successfully employ rhetorical style convey significance moment transition sense finally end spanish civil war personify memorable phrase create repeat listen appreciatively spell bind orator enjoy repetition work time play role careful investigator reach conclusion role principal play coup failure use skills power novelist tease motivation psychology ambitious functionary grow greatness strong sense role archetypal politician view perhaps nobody come power use dubious dangerous simply evil mean bring democracy deceive conservative friend act quickly decisively get place future desire revenge skill orator novelist necessarily skill effective presenting complex material linear account reason wait almost end identify specific economic governance problem prior coup specifically hop achieve trim democracy devote much space role major clear take analogy fictional character italian film get repetitious interest spanish show regard top literary specialist country enjoy read political mayhem country coup experience seventies people choice prime minister party remove office far right illegally leave feel le isolated much le political victim know behavior happen land grip thoughtful account attempt gospel meander account plot goal bravery assault parliament protagonist circle perceptive appraisal early year spanish transition fascinate portrait ambitious provincial become truest apostle spanish democracy judgment debatable way arrive fascinate caveat author translator castilian original hand addict sentence unduly prolong many colon semicolon tell fascinating story loquacious way bore irritate long third way author repetitive verbose repeat phrase think good endlessly need still need service good passionate clever literary attack vestige focus fail coup takeover legislature spanish military major actor politics post title refers dissection career politician refuse cower retreat swirl golpistas bullet prime minister main military supporter head portrait member writer intellect subtlety force weave stun examination minute minute struggle democracy face attempt military coup focus first nascent government death transcend volatile politics analysis essence european power game parliamentary democracy struggle primacy shift alliance emergent coalition force right author brilliant employ various strategy tell tale literary allusion repetition philosophize politics artistry overwhelms story line point fuller discussion autonomy legislation need general lack achievement year immediately precede treatment career skimpy even show rely notable spanish scholar biography monarch translation superb catch fluidity dare write make joy comment intend detract force thoroughly fascinate even actual televise attack buy look forward availability follow unconvincing meditation american atrocity war speed light return country latest work moment revisits theme spanish consequence brilliantly explore however new eschews fiction even variety practice blur distinction real imaginary instead employ part philosophical part journalistic meditation attempt coup overthrow spanish democracy moment focus parliamentarian refuse duck invade open fire former general deputy head party outgo hero account functionary provincial grow architect democracy giant spanish author return image sit alone prime minister bench bullet fly people prepared risk neck impeccable democratic credential cower desk rest naturally rationally do similar difficult author talk already au fiat politics lead think richer experience spoon feed historical background end feel earn understanding place characteristic thriller detail coup lead senior element army counter coup lead plot also move particularly regard travail later life deeply affect coda author reflect life politics also deeply political reject current view prevalent rupture democracy false ensure power dictatorship retain constitutional monarchy argue instead rupture real hero retreat dictatorship author prepare set forthright opinion aspect coup add pleasure widely research deeply opinionated provocative gratuitously controversialist demand think keep great fact fiction story fail coup deliver fascinating way witness critical moment spanish democracy personal account moment live whole nation vigil excellent storyteller transport back time moment future spanish democracy look bleak try understated rave moment attempt coup gospel spanish occur band arm automatic weapon take spanish interrupt vote next hold deputy hostage eighteen hour failure gospel contend significant event spanish spanish even mark end initially set write gospel abandon effort favor write event possess dramatic force symbolic power demand literature understand even writer fiction reality matter fiction matter much want reinvent substitute alternative reality none concern excited much persuasive pure reality write skilled writer fiction attempt explicate reality fidelity know likely fact novelist eye drama irony nuance happenstance golpistas commandeer capture film television contrary memory many broadcast live use film anchor return event record film central actor film much devote happen even devote background causal root happen much dedicate assess significance happen happen democracy central figure hero even resign film calmly sits upright seat assembly room bullet whiz virtually everyone else hide cower duck appoint soon death elect first free nationwide election forty year falangist first many thought program privilege instead embark transform true democracy even legalize act alienate right military conspicuous trigger discuss essay identify new type hero hero retreat rather triumph conquest hero dismantle political structure originally empower name hero recent make compelling case hero moreover man unique political ability instinct reconcile irreconcilable enable democracy political figure turn original power base others head often call traitor certain sense betray loyalty error order construct loyalty truth betray people order betray betray past order betray present treason difficult loyalty ethics loyalty ethic need ethic hero retreat hero example isolate venture realm political philosophy usually cogent reward many general reader carcass write style informal discursive maybe even wordy chunk interested follow specific subject nigh essential fail gospel modern democracy alternative approach write someone perhaps peculiar general taste great bear lead contemporary writer review intrigue read make point seek read everything translation something badly disappoint keep finger cross complaint address publisher end fifteen page note most cite source quotation potentially contentious statement make text also elaborate text provide information end notes supposedly key text page number example note statement page problem statement question appear page paperback edition problem plague end notes pagination paperback edition differs hardback bother change end note reference reflect difference", "genres": ["History"], "summary": "In February 1981, Spain was still emerging from Franco's shadow, holding a democratic vote for the new prime minister. On the day of the vote in Parliament, while the session was being filmed by TV cameras, a band of right-wing soldiers burst in with automatic weapons, ordering everyone to get down. Only three men defied the order. For thirty-five minutes, as the cameras rolled, they stayed in their seats.\r\n\r\nCritically adored novelist Javier Cercas originally set out to write a novel about this pivotal moment, but determined it had already gained an air of myth, or, through the annual broadcast of video clips, had at least acquired the fictional taint of reality television. Cercas turned to nonfiction, and his vivid descriptions of the archival footage frame a narrative that traverses the line between history and art, creating a daring new account of this watershed moment in modern Spanish history.\r\n\r\nThe Anatomy of a Moment caused a sensation upon its publication in Spain, selling hundreds of thousands of copies. The story will be new to many American readers, but the book stands resolutely on its own as a compelling literary inquest of national myth, personal memory, political spectacle, and reality itself.", "asin": "1608194914", "rank": "672548", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/51DMbIQ2WiL.jpg", "country": "Spain", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}