{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 42.6511674, "ratings": {"num_ratings": 25, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "This was almost like reading a lyrical epic poem on early Austrailia."}, {"review_sentiment": 5.0, "review_text": "Great fun book"}, {"review_sentiment": 5.0, "review_text": "Great story, it's a piece of fiction based on historical fact."}, {"review_sentiment": 5.0, "review_text": "A wonderful journey through the early times of colonization in south Western Australia told with sensitivity from the aboriginal perspective. Scott's writing is both intriguing and poetic. There is a music in his words as the title may suggest. That deadman dance is not only a great book by an Australian author of aboriginal descent, it is a book of fine literature that holds itself on the world stage!"}, {"review_sentiment": 4.0, "review_text": ".Good read"}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 4.0, "review_text": "Sensitive story on Western Australian British settlements effect on indigenous people."}, {"review_sentiment": 4.0, "review_text": "evocative landscapes and ocean felt I was there, deals with a difficult time in Australia's history that feels right, there are not evil people just people of their time"}, {"review_sentiment": 1.0, "review_text": "I understand partially why he did not have the characters have an actual conversation. But in doing so it was very difficult to follow the narrative.  The story skips around so much so it was difficult to learn who was the actual story teller."}, {"review_sentiment": 4.0, "review_text": "I almost didn't finish this book, but I am so glad that I did. Scott takes the reader inside utterly divergent cultural perspectives as they collide, blend, and separate as transformed entities. Like waves flooding the mouth of a freshwater stream, Scott approaches the beauty, ugliness, humor and sorrow of contact between technical and spiritual cultures with a dream-like quality reminiscent of Leslie Marmon Silko's Ceremony. The first half of the book, I would hazard to say, is difficult for a Westerner to make his way through (it certainly was for me). Episodes in time are presented in a cascade of flashbacks that their own winding way to the more cohesive (and Western style) narrative of the latter half of the novel. This is not a book one can judge in the first 200 pages; and this may be a stretch for some readers.The payoff comes through Scott's exquisite prose, with lyrical descriptions of the southwest Australian coastal environment that bring to mind Annie Dillard and Gretel Ehrlich: \"Beyond the sea was all shifting troughs of darkness and the inside of ocean bleeding at each crest.\" Not only the sea, but water itself is a central motif running throughout the novel, as seen in another passage from the later chapters: \"The moon was old bone in a blue sky, dissolving as the sun rose higher. Clouds gathered in the southwest, drifted to meet a plummeting sun and spread across the dome of sky so that by dark-time there were no stars or even a moon, only a soft drizzling rain. Mitjal: a rain like tears.\" Here water is not an overt focus until the last line, but one can sense its flow throughout the passage. For the reader, this subterranean rhythm in Scott's prose provokes the sensation that one is spontaneously dreaming the story rather than reading it. Many times in Deadman, I would feel meaning before I had completed the physical read. I found this quality of his writing powerful to the point of disconcerting at times, and truly beautiful!Where I really struggled was with limited depth of characterizations in the novel. Scott portrays the lives of Bobby Wabalanginy, Geordie Chaine, Killam and Skelly as they change through the formative years of British colonization in Western Australia. Since these men, and several others are pivotal in the story, I was wanting more of sense of what was happening in their heads.  This never really happens, as readers are presented with omniscient narration throughout. In all honesty, That Deadman Dance works better as a long, achingly beautiful prose poem than it does a novel. And yet a novel appears to have been Scott's intention, and so the story languishes in a limbo zone between the two.Ultimately, I greatly admire this book. It is a significant contribution to indigenous and post-colonial literature that avoids demonizing or glorifying the peoples within its pages. Here is a very Melville-like story of individuals at cultural odds with one another who still manage to intermingle and recreate one another. As such, it is perhaps a greater statement about our future as a species, than about our historical past. In terms of these greater visions, Scott sublimely succeeds.Iain Mavro Coggins is the author of Lost Apple, available at Amazon."}]}, "authors": ["Kim Scott"], "isbn": "1608197794", "longitude": -73.754968, "periods": ["1800s", "Recent Releases"], "title": "That Deadman Dance: A Novel", "word_cloud": "almost read lyrical epic poem early fun story piece fiction base historical fact wonderful journey early time colonization south western tell sensitivity aboriginal perspective write intriguing poetic music word title dance great australian author aboriginal descent fine literature hold world stage excellent sensitive story settlement effect indigenous people evocative landscape ocean felt deal difficult time history feel right evil people people time understand partially character actual conversation difficult follow narrative story skip around much difficult learn actual story teller almost finish glad take inside utterly divergent cultural perspective collide separate transformed entity wave flood mouth freshwater stream approach beauty ugliness humor sorrow contact technical spiritual culture quality reminiscent first half difficult way certainly time present cascade flashback wind way cohesive western style narrative latter half judge first page payoff come exquisite prose lyrical description southwest australian coastal environment bring mind sea shift trough darkness ocean bleed crest not sea water central motif run see passage later chapters moon old bone blue sky dissolve sun rise higher gather southwest drifted meet plummet sun spread dome sky star even moon soft drizzle rain rain tear here water overt focus last line sense flow passage subterranean rhythm prose provokes sensation spontaneously dream story rather read time meaning complete physical find quality write powerful point disconcert time truly beautiful really struggle limited depth characterization portray live change formative year british colonization men several others pivotal story want sense happen head never really happen reader present omniscient narration honesty work better long achingly beautiful prose poem yet appear intention story languishes limbo zone greatly admire significant contribution indigenous literature avoids demonize glorify people page here story individual cultural odds still manage intermingle recreate perhaps greater statement future species historical past term greater vision sublimely author available", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Throughout Bobby Wabalanginy's young life, the ships have been arriving, bringing European settlers to the south coast of Western Australia, where Bobby's people, the Noongar people, have always lived. Bobby, smart, resourceful, and eager to please, has befriended the settlers, joining them as they hunt whales, till the land, and work to establish their new colony. He is welcomed into a prosperous white family and eventually finds himself falling in love with the daughter, Christine.\r\n\r\nBut slowly-by design and by hazard-things begin to change. Not everyone is so pleased with the progress of the white colonists. Livestock mysteriously starts to disappear, crops are destroyed, there are \"accidents\" and injuries on both sides. As the Europeans impose ever-stricter rules and regulations in order to keep the peace, Bobby's Elders decide they must respond in kind, and Bobby is forced to take sides, inexorably drawn into a series of events that will forever change the future of his country.\r\n\r\nThat Deadman Dance is haunted by tragedy, as most stories of first contact between European and native peoples are. But through Bobby's life, the novel exuberantly explores a moment in time when things might have been different, when black and white lived together in amazement rather than fear of the other, and when the world suddenly seemed twice as large and twice as promising.", "asin": "1608197794", "rank": "1434765", "city": "Albany", "image": "https://images-na.ssl-images-amazon.com/images/I/51AuaRnKHzL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}