{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 590, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "I truly loved this book. I had little or no knowledge of the plight of the Palestian people. The story was beautifully woven throughout and I enjoyed every minute of it."}, {"review_sentiment": 5.0, "review_text": "One of the best novels ever written about  the Middle Eastern regional conflict. A real life depiction of the Palestinian people and their lives as refugees. Real geographical and historical facts. The honesty of Life as a Palestinian refugee and the hardships and genocide these people experience everyday is truly reflected in this novel.  Life as a refuge transformed to the American Dream. This is a great read!"}, {"review_sentiment": 5.0, "review_text": "Great book, I gave it to my friend as a present."}, {"review_sentiment": 5.0, "review_text": "Powerful story. Complex issues."}, {"review_sentiment": 5.0, "review_text": "Amazing book!  Opened my eyes and mind!"}, {"review_sentiment": 5.0, "review_text": "Absolutely horrific.  It shows how resilient these people were.  Time & time again they lost loved ones, friends and their homes."}, {"review_sentiment": 5.0, "review_text": "I devoured this book. Simply could not put it down. My eyes have been opened to the Palestinian crisis in a new way. I cried at many places through the book. And I immediately ordered The Blue Between Sky and Water, Abulhawa's second novel."}, {"review_sentiment": 5.0, "review_text": "I have been up since 3 reading..... A truly heart wrenching story.  I was completely enthralled with the characters & the story."}, {"review_sentiment": 5.0, "review_text": "Beautifully written, very moving"}, {"review_sentiment": 5.0, "review_text": "Amazing view of the Palestinian story that is rarely expressed in the west.  No solution is offered, very frustrating to wonder what a two State plan could solve."}]}, "authors": ["Susan Abulhawa"], "isbn": "1608190463", "longitude": 0.0, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Mornings in Jenin", "word_cloud": "truly loved little knowledge plight palestinian people story beautifully weave enjoy minute best novel ever write regional conflict real life depiction palestinian people live refugee real geographical historical facts honesty refugee hardship genocide people experience everyday truly reflected refuge transform american great give friend present powerful story issue open eye mind absolutely horrific show resilient people time lose loved one friend home devour eye open palestinian crisis new way cry many place immediately order second read truly heart wrench story completely enthral character story beautifully write move view story rarely express west solution offer frustrating wonder plan", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Mornings in Jenin is a multi-generational story about a Palestinian family. Forcibly removed from the olive-farming village of Ein Hod by the newly formed state of Israel in 1948, the Abulhejos are displaced to live in canvas tents in the Jenin refugee camp. We follow the Abulhejo family as they live through a half century of violent history. Amidst the loss and fear, hatred and pain, as their tents are replaced by more forebodingly permanent cinderblock huts, there is always the waiting, waiting to return to a lost home.\r\n\r\nThe novel's voice is that of Amal, the granddaughter of the old village patriarch, a bright, sensitive girl who makes it out of the camps, only to return years later, to marry and bear a child. Through her eyes, with her evolving vision, we get the story of her brothers, one who is kidnapped to be raised Jewish, one who will end with bombs strapped to his middle. But of the many interwoven stories, stretching backward and forward in time, none is more important than Amal's own. Her story is one of love and loss, of childhood and marriage and parenthood, and finally the need to share her history with her daughter, to preserve the greatest love she has.\r\n\r\nSet against one of the twentieth century's most intractable political conflicts, Mornings in Jenin is a deeply human novel - a novel of history, identity, friendship, love, terrorism, surrender, courage, and hope. Its power forces us to take a fresh look at one of the defining conflicts of our lifetimes.", "asin": "1608190463", "rank": "87467", "city": "Jordan", "image": "https://images-na.ssl-images-amazon.com/images/I/51KRkhuKjrL.jpg", "country": "Palestine", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}