{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 11, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Neil Plakcy is a cut above his competition in the gay mystery genre. His work never disappoints, and regardless of the series he writes they all have a distinctly different pace, tone, characterization, etc. As long as he can churn them out at this consistently high level of quality, I'll continue to buy his work.  I have all the Mahu books, and when I read them, I really feel like I am in Hawaii. He hints at smut -- as in \"they tumbled naked into bed. The next morning, they awoke and made coffee.\"  Kind of a nice change from so many gay-themed books that seem to exist only for the description of sexcapades.  Now, if you want sexcapades, Plakcy also writes erotica, you just won't find it in the Mahu series."}, {"review_sentiment": 4.0, "review_text": "I've loved reading the Mahu Mysteries, and this is by far the best yet.  Kimo's life progreses forward with each story, and each story reflects the lives of contemporary gay and lesbians.  With Marriage Equality now the Law in Hawai'i Nei, I look forward to Kimo's wedding."}, {"review_sentiment": 4.0, "review_text": "Just what you would expect from this series and author. But, so nicely done.  You will not regret reading about these two nice guys."}, {"review_sentiment": 4.0, "review_text": "I love the series of books.  It is so much fun to see what is going to happen to the main characters, and how their lives intertwine with their careers.  Always sexy, hawaian heat."}, {"review_sentiment": 5.0, "review_text": "This is the newest in the Mahu Series and it's one of the books in the entire series that I liked the best.  Definitely worth the read!"}, {"review_sentiment": 5.0, "review_text": "Neil Plakcy consistently puts out a good story about the daily trials and tribulations of Kimo as a police detective who just happens to be gay and living in Paradise.  Having lived there for many years the descriptions are accurate, just wish I could hear the tunes he mentions throughout the book :-). If you've enjoyed his early works in the \"Mahu Series\" this will not disappoint, it's nice that he didn't use the term in the title though.  Us Mahus do not like the term!  Hana Hou!  Aloha."}, {"review_sentiment": 2.0, "review_text": "I have enjoyed following Kimo and Mike's lives on Oahu and look forward to reading their next saga.  Unfortunately, I felt let down by Zero Break.  There is little plot and no excitement.  Whatsoever.  And no Hawaiiana.  This non-story could have taken place in wherever.  There is much rumination, however, bordering on obsession, by Kimo about whether he wants to have children, is ready to have children, whether Mike wants and is ready to have children and how Mike's parents would react.  The only character with any certainty on the subject seems to be Kimo's mother who definitely wants more grandchildren.  Did I care?  I get that having kids can be a difficult decision, especially for gay men, but that is not why I buy these books. Besides it was boring."}, {"review_sentiment": 5.0, "review_text": "Posted on Romancing the Book blogReviewed by MarissaReview Copy Provided by ARC by AuthorLet me start with this: If you have not read the previous books in the Mahu series, do so. Yes, this book could be read as a stand-alone but not only will you be missing some fine mystery writing, you will be missing some of the finer points in Kimo's past that are mentioned in Zero Break.If you've read the book's synopsis, you know that Kimo is a gay police detective who solves mysteries. In this particular book, he also becomes involved in a high-speed chase through Honolulu (Hawaii Five-0 lookout!), a tragic shooting, an explosion, and everywhere he looks are children.This particular case starts with a murdered lesbian which leads him to an alternative form of power called wave energy. According to the Offshore Alternative Energy Guide, wave power devices extract energy directly from the surface motion of ocean waves or from pressure fluctuations below the surface. This is something new for me, but that's no surprise where Plakcy's writing is concerned. Living in Honolulu, I often start to notice these things around me after reading one of his books. In this case, I've found that the State of Hawaii has been experimenting with wave energy since 2008.My favorite part of the book came after a particularly traumatic day for Kimo. He handled everything great, concentrating on what he had to do in his role as a cop, but when he got home he let himself go and fell apart. And Mike took care of him. He let Kimo cry, and he held him and soothed him, and by the end of that touching scene you know that Mike will always be there for Kimo. (And if you don't at least have teary eyes by the end of that chapter, you have no romance in you at all. Me? I cried outright.)I have loved the Mahu series and Kimo right from the first book, Mahu, and judging by Zero Break I will continue to love them. Plakcy has grown Kimo into his own man, unafraid to announce his \"gaydom\" and to do what is right, no matter which road it takes him down."}, {"review_sentiment": 5.0, "review_text": "I have followed the Mahu series from the start and find the characters and the plots to be great fun.  Zero Break keeps up the tradition in fine style  If you like Hawaii, especially Honolulu, Kimo and his family and freinds are for you. I recommend the entire series of Neil's super Mahu books.  I look forward to the next Mahu book with Kimo et al."}, {"review_sentiment": 5.0, "review_text": "Neil Plakcy's latest in the series of the Honolulu murder mysteries is possibly his most effortless seeming, his most mature and his least complex. Not that the plot is simplistic - no, Neil weaves a masterful detective narrative that keeps you right there with Kimo and his partner Ray as they unravel an ugly murder. But there is none of the conflicted angst that drove Kimo in the first of these books - and that's a good thing. He's grown up over these few years - he's become a confident, proud, generous gay man. And a really good cop.OK, I'm biased. Neil Plakcy's integrity as a writer moves me as much as his books do.  But from the very first of the Mahu books, I fell in love with both Plakcy's Hawai'i and with Kimo Kanapa'aka. Plakcy's books have brought the exotic 50th state alive for me, without flattering it in the least. Honolulu in many ways is no different from Miami or Los Angeles - two other cities I know and love. He doesn't shy away from the ugliness that always lingers around the fringes of paradise.But that's just the setting. Against that vivid backdrop, Plakcy creates a raft of characters who amplify that sense of place, both good and bad. Central of course is Kimo himself, who for all his beauty and brains, defines the complex cultural and ethnic essence of the true Hawai'ian. The two things Kimo loves most are his job and his family. At the beginning of the series, it was the potential loss of both these things that drove his stories. Now, with both secure, other issues begin to weave themselves into the murder mystery; more than mere background, and always linked to the plot in intelligent ways that are thoughtful and moving.This time it's children and parenthood that provides the underlying theme. Kimo and his partner Mike have settled into a happy life together...and the issue of children (and specifically gay people having children in all sorts of ways) keeps looming before them. The definition of family, like the definition of ethnicity, is not straightforward in Kimo's Hawai'i.  You will find yourself rooting for Kimo and Mike - depending on your attitude toward children.  Ten years ago, when my kids were small, I know where I would have been on this debate. Now that they're teenagers - not so much.While this book would certainly stand alone as a good read by a superior writer, I always recommend one starts at the beginning, so as to enjoy the pleasure of watching Kimo Kanapa'aka grow up as a man. He'll become your friend, and that will just make the enjoyment of Plakcy's books all the greater."}]}, "authors": ["Neil Plakcy"], "isbn": "1608205916", "longitude": -157.8556764, "periods": ["2000s", "Recent Releases"], "title": "Zero Break", "word_cloud": "cut competition gay mystery work never disappoint regardless series write distinctly different pace tone characterization etc long churn consistently high level quality continue buy work oahu really feel hawaii hint smut tumble naked next morning awoke make coffee nice change many seem exist description escapade now want escapade also write erotica series love read far best yet life progress forward story story reflect live contemporary gay lesbian look forward wedding just series author nicely do regret read nice guy love series much fun see go main character live intertwine career always sexy hawaiian heat newest entire series like best definitely worth consistently put good story daily trial tribulation police detective happens gay live live many year description accurate wish tune mention enjoy early work disappoint nice use term title term enjoy follow live forward read next saga unfortunately felt let little plot excitement take place much rumination however border obsession want child ready child want ready child parent character certainty subject seem mother definitely want grandchild care get kid difficult decision especially gay men buy boring post romance blog reviewed previous series miss fine mystery write miss finer point past mention synopsis know gay police detective solves mystery particular also become involved chase tragic shoot explosion everywhere look particular case start murder lesbian lead alternative form power call wave energy accord wave power device extract energy directly surface motion ocean wave pressure fluctuation surface something new surprise writing concern often start notice thing read case find experiment wave energy favorite part come particularly traumatic day handle everything great concentrating role cop get home let fell apart take care let hold soothed end touch scene know always least teary eye end chapter romance cry outright love series right first judge continue grown man unafraid announce gaydom right matter road take follow series start character plot great fun keep tradition fine style especially family friends recommend entire series look forward next al latest series murder mystery possibly effortless seem mature least complex not plot simplistic weave masterful detective narrative keep right partner unravel ugly murder none conflict angst drove first good thing grow year confident proud generous gay man really good bias integrity writer move much first fell bring exotic state alive flatter least many way different city know shy away ugliness always lingers fringe set backdrop create raft character amplify sense place good bad course beauty brain define complex cultural ethnic essence true thing love job family begin series potential loss thing drive story now secure issue begin murder mystery mere background always link plot intelligent way thoughtful time child parenthood provide underlying theme partner settle happy life together issue child specifically gay people child sort way loom definition family definition ethnicity straightforward find root depend attitude child year ago kid small know now teenager certainly alone good superior writer always recommend start begin enjoy pleasure watch grow man become friend enjoyment greater", "genres": ["Fiction & Literature", "Mystery & Suspense", "LGBT"], "summary": "Book 1/10 in the Mahu Series\r\n\r\nOpenly gay Honolulu homicide detective and surfer Kimo Kanapa'aka investigates the murder of a young lesbian mother at the same time he and his partner consider having children themselves.\r\n\r\nZero break refers to the deep-water location where waves first begin, often far offshore. For Honolulu homicide detective and surfer Kimo Kanapa'aka, it means his most dangerous case yet.\r\n\r\nA young mother is murdered in what appears to be a home invasion robbery, leaving behind a complex skein of family and business relationships, and Kimo and his detective partner Ray Donne must navigate deadly waters to uncover the true motive behind her death and bring her killer to justice.\r\n\r\nKimo is also in trouble at home, as he and fire investigator Mike Riccardi consider fathering children themselves.", "asin": "1608205916", "rank": "2124738", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/51kEqS%2BJFML.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}