{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 40.8359336, "ratings": {"num_ratings": 2307, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Beautifully written - relaxing read.  Had to read all four of the Neopolitan novels and couldn't put them down."}, {"review_sentiment": 5.0, "review_text": "I love this book!  How did I not learn about this book until now?"}, {"review_sentiment": 3.0, "review_text": "good book"}, {"review_sentiment": 1.0, "review_text": "I did not find the characters interesting or likeable.  I did not enjoy the author's writing style.  There wasn't much of a plot."}, {"review_sentiment": 5.0, "review_text": "It took a while to get into the story. I’m thinking because of references to Italian which I’m not familiar with. I found the way of life of Italians in this era very interesting. Women are trapped in this world as they are in so many other cultures."}, {"review_sentiment": 5.0, "review_text": "The book instantly draws into the lives of Lina and Lenu , the spell only gets stronger as you advance through the pages leading you to the next in the series ."}, {"review_sentiment": 3.0, "review_text": "Starts out a bit confusing with too many characters introduced at once."}, {"review_sentiment": 4.0, "review_text": "Liked it very much, looking forward to the next book."}, {"review_sentiment": 4.0, "review_text": "L like the series."}, {"review_sentiment": 4.0, "review_text": "Good story of life in post war Italy, and especially the struggle women had in finding their place in the scheme of things.  It shows the richness and value of life long friendships, and the support and strengthen women get from such.  A good read."}]}, "authors": ["Elena Ferrante"], "isbn": "1609450787", "longitude": 14.2487826, "periods": ["1900s", "Recent Releases"], "title": "My Brilliant Friend: Neapolitan Novels, Book One", "word_cloud": "beautifully write relaxing novel love learn good find character interest likable enjoy author write style much plot take story think reference italian familiar find way life era interest trap world many culture instantly draw life get stronger advance page lead next series start bite confusing many character introduce like much look forward next series good story life post war especially struggle woman find place scheme thing show richness value life long friendship support strengthen woman good", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A modern masterpiece from one of Italy’s most acclaimed authors, My Brilliant Friend is a rich, intense, and generous-hearted story about two friends, Elena and Lila. Ferrante’s inimitable style lends itself perfectly to a meticulous portrait of these two women that is also the story of a nation and a touching meditation on the nature of friendship.\r\n\r\nThe story begins in the 1950s, in a poor but vibrant neighborhood on the outskirts of Naples. Growing up on these tough streets the two girls learn to rely on each other ahead of anyone or anything else. As they grow, as their paths repeatedly diverge and converge, Elena and Lila remain best friends whose respective destinies are reflected and refracted in the other. They are likewise the embodiments of a nation undergoing momentous change. Through the lives of these two women, Ferrante tells the story of a neighborhood, a city, and a country as it is transformed in ways that, in turn, also transform the relationship between her protagonists, the unforgettable Elena and Lila.\r\n\r\nFerrante is the author of three previous works of critically acclaimed fiction: The Days of Abandonment, Troubling Love, and The Lost Daughter. With this novel, the first in a tetralogy, she proves herself to be one of Italy’s great storytellers. She has given her readers a masterfully plotted page-turner, abundant and generous in its narrative details and characterizations, that is also a stylish work of literary fiction destined to delight her many fans and win new readers to her fiction.\r\n\r\n“Ferrante’s novels are intensely, violently personal, and because of this they seem to dangle bristling key chains of confession before the unsuspecting reader.” James Wood, The New Yorker", "asin": "1609450787", "rank": "2250", "city": "Naples", "image": "https://images-na.ssl-images-amazon.com/images/I/51h7vN4YtJL.jpg", "country": "Italy", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}