{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 34, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Ties,  was a powerful story of what was \"once\" a happy marriage. It's a story that's compelling yet familiar.  Aldo leaves his wife and two children for a much younger woman.  At home, Vanda, the wife he left, begins to fall apart but, eventually manages to pick up the pieces and move on.The story is more of a novella, approximately, 150 pages but, it packs a punch.  The writing is excellent: the story of a fractured family told in parts, and, how a destructive relationship affected each of them. First we hear Vanda's POV after Aldo leaves her, then Aldo's POV, many years later and the the POV of the two children (now adults).The story reminded my of Elena Ferrante's Days of Abandonment, and, I later read that this author is Ferrante's (AKA Anita Raja) husband. Powerful themes, love, betrayal and guilt and, a wonderful intro and translation from the Italian by author Jhumpa Lahari."}, {"review_sentiment": 5.0, "review_text": "Amazing book. Demise of a marriage, destruction of a family and the effects of the separation on the lives of the children."}, {"review_sentiment": 3.0, "review_text": "could not relate to any of the charactors--- not a page turner. Would not recommend it."}, {"review_sentiment": 5.0, "review_text": "The up-close life of a couple from her point of view, then his, then their children as adults. Strong on pacing, character exposition, and psychological depth.This accomplished Italian novelist is here translated into English by a favorite American writer, Jhumpa Lahiri. The result was compelling, insightful and moving."}, {"review_sentiment": 5.0, "review_text": "If you think there’s nothing new to read in a novel about marriage and family, you should read Domenico Starnone’s novel titled, Ties. Translated by Jhumpa Lahiri, this novel draws readers into the long marriage of Vanda and Aldo, at two critical times. Twelve years after their 1962 marriage, following the birth of two children, Aldo has an affair with Lidia and leaves Vanda for eight years. Starnone opens the novel with Vanda’s reaction to this betrayal. A large middle section picks up decades later following their reconciliation, and the end of the novel features the couple’s middle-aged children and the impact of the long-ago separation on their lives. I can’t comment on the prose in the original Italian, but Lahiri’s English translation was finely written and I enjoyed every page of this novel.Rating: Five-star (I love it)"}, {"review_sentiment": 4.0, "review_text": "I read Days of Abandonment by Elena Ferrante first and was bowled over by her painfully honest first person narrator's reaction to being left by her husband. In the course of recommending it to a friend, she told me that her husband had preferred Ties, so I had to read this book. I recommend that you read both. They're both by Italian writers and when read in tandem, reveal stark gender differences. Ties is from the point of view of first the wife then the husband. The wife suffers by comparison to Ferrante's —in the long letter to her husband contained in Book One, she exists by turns apologetic or hysterical — but the husband is much more interesting, though I disliked his self-obsession and dishonest decisions almost to the point where I quit reading. What happens is depressing and threatening to their children's well-being, with both descending into their worst selves. What saved the story for me was the ending, Book Three, which is from the now adult children's point of view. The twist is a laugh out loud and makes the parents a bit more sympathetic, so in the end, I do recommend this short, well written book."}, {"review_sentiment": 3.0, "review_text": "This depressing book may describe many people’s lives. After twelve years of marriage, a man falls in love with another woman (whom we hardly see or get to know) and leaves his wife and young children for her. However, he returns to the family when the children are in their early teens and suffers from there on an unfulfilled and inadequate life. I say ‘man’ because although it is told in the first person, I gained no sense of who he was, nor why he returned. We view it all from a distance as if at arm’s length - we never get close. The best thing is, it is 144 pages long so could fill a long train journey.Freak Out! My Life with Frank Zappa"}, {"review_sentiment": 5.0, "review_text": "I heard about this via word of mouth, and then when I looked it up, was surprised I'd missed the review coverage. Maybe the review coverage is riding on the Ferrante coat-tails a bit, but either way this is a slim volume that you can read in one sitting, and yet makes quite an impression. It's not loud or splashy, more like a quiet, forceful monologue from mostly just one character, who is more intriguing than likable. The 'mystery' we're chasing is fairly nominal, and yet I found it absolutely page-turning. There is an intensity of character that just makes you want to stay immersed."}, {"review_sentiment": 4.0, "review_text": "This short book is very interesting and insightful.  Those who judge family life in the light of Ossie and Harriet and their ilk will not be impressed, but those who who have not been as fortunate as the Nelson family in connubial bliss will find this book authentic and distressingly familiar.  The ending will throw most for a loop as it does go somewhat past the bell curve of the normal and the near normal.Starnone has many truthful things to say about affairs and their consequences, about vengeance and the attempt to reestablish relationships and the affect of such unhappy unions on children. Like a lot of contemporary European fiction, the portrait is stark and minimal, but not so acerbic as to be off putting.  Starnone still is able to construct some interesting characters very economically.An interesting sidelight of this edition is the lengthy introduction by the formerly Indo-American, now Italian author Jhumpa Lahiri.  It is going to be interesting to assign her a place in literary histor,y when the dust settles."}, {"review_sentiment": 2.0, "review_text": "Didn't read it, It was downloaded for my wife, who did.  \"It left me with an unpleasant feeling\"  She simply did not like the story nor did she find anything \"redeeming\" in the narrative.  Character development and prose ok."}]}, "authors": ["Domenico Starnone"], "isbn": "1609453859", "longitude": 12.4829321, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Ties", "word_cloud": "powerful story happy marriage story compel yet familiar leave wife child much younger woman home wife leave begin apart eventually manage pick piece move story novella approximately page pack punch writing excellent story fracture family tell part destructive relationship affect hear leave many year later child adult story remind later author husband theme love betrayal guilt wonderful intro translation italian author amazing marriage destruction family effect separation live child character page turner life couple point view child adult pace character exposition psychological accomplish italian novelist translate favorite american writer result compel insightful move think nothing new marriage family title draw reader long marriage critical time twelve year marriage follow birth child affair leave year open reaction betrayal large middle section pick decade later follow reconciliation end feature couple child impact separation live comment prose original italian translation finely write enjoy page love days first bowl painfully honest first person narrator reaction leave husband course recommend friend tell husband preferred recommend italian writer tandem reveal stark gender difference point view first wife husband wife suffers comparison long letter husband contain exist turn apologetic hysterical husband much interesting dislike dishonest decision almost point quit read happen depress threaten child descend worst self save story end adult child point view twist loud make parent sympathetic end recommend short well write depressing many people life year marriage man fall woman hardly get know leave wife young child however return family child early teens suffers unfulfilled inadequate life say man tell first person gain sense return view distance arm length never get close best thing page long long train hear word mouth look surprised miss review coverage maybe review coverage rid bit way slim volume sit yet make quite impression loud splashy quiet forceful monologue mostly character intrigue likable chase fairly nominal yet find absolutely intensity character make want stay immerse short interesting insightful judge family life light ilk impressed fortunate family connubial bliss find authentic distressingly familiar end throw loop go somewhat past bell curve normal many truthful thing say affair consequence vengeance attempt reestablish relationship affect unhappy union child lot contemporary european fiction portrait stark minimal acerbic put star none still able construct interest character interest sidelight edition lengthy introduction formerly italian author go interesting assign place literary history dust settle download wife leave unpleasant feeling simply story find anything redeeming narrative development prose ok", "genres": ["Fiction & Literature"], "summary": "Luminously translated by Pulitzer Prize-winning author Jhumpa Lahiri, Ties is the searing new novel by bestselling Italian novelist Domenico Starnone.\r\n\r\nTies is the story of a marriage. Like many marriages, this one has been subject to strain, to attrition, to the burden of routine. Yet it has survived intact. Or so things appear. The rupture in Vanda and Aldo's marriage lies years in the past, but if one looks closely enough, the fissures and fault lines are evident. Their marriage is a cracked vase that may shatter at the slightest touch. Or perhaps it has already shattered, and nobody is willing to acknowledge the fact. \r\n\r\nDomenico Starnone's thirteenth work of fiction is a powerful short novel about relationships, family, love, and the ineluctable consequences of one's actions. Known as a consummate stylist and beloved as a talented storyteller, Domenico Starnone is the winner of Italy's most prestigious literary award The Strega.  \r\n\r\n\r\n\"Ties is...the leanest, most understated and emotionally powerful novel by Domenico Starnone.\" The New York Times", "asin": "1609453859", "rank": "33326", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51k0QiQxuUL.jpg", "country": "Italy", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}