{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 11, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "It was interesting to read. Some info you don't read other places."}, {"review_sentiment": 5.0, "review_text": "Marvelously fun read about our haunted Capitol building."}, {"review_sentiment": 3.0, "review_text": "Thin and repetitive."}, {"review_sentiment": 3.0, "review_text": "CAPITOL HILL HAUNTS - Tim KreppFor those of you that love ghost stories or who want to investigate our Nation's Capitol, Washington, D.C. this is the book for you. The author gives a detailed description of each building he has encounter by people who have experienced them. The intriguing background history and the story of the haunt are interesting lore."}, {"review_sentiment": 5.0, "review_text": "Krepp is an excellent storyteller.  As a Capitol Hill resident I was intrigued by eerie tales of places I see all the time.  Visitors will like it as well… much better than a \"same-old-thing\" guidebook."}, {"review_sentiment": 5.0, "review_text": "Great book from a wonderful DC tour guide, very informative and funny. Can't wait to go back to DC and check these haunts out."}, {"review_sentiment": 5.0, "review_text": "Capitol Hill Haunts is a wonderful new,to me & hopefully you, way to explore our nations Capitol.  An engaging walk through our history with the people who made, and continue to make it."}, {"review_sentiment": 5.0, "review_text": "Popular Washington DC blogger and tour guide Tim Krepp has written an engaging and informative book on things that go bump on Capitol Hill. The author places each spirit in its historical context so the reader learns history and chuckles too. I recommend this book to tourists, tour guides, historians and all those who love ghosts and ghoulies."}, {"review_sentiment": 5.0, "review_text": "As someone who lived on Capitol Hill for ten years, this was a blast.  I can't wait for the sequel, presuming it's zombies or vampires, and still on Capitol Hill.  A must read for any local or tourist."}, {"review_sentiment": 5.0, "review_text": "I really enjoy this book.  I live in this neighborhood and enjoy being able to point out places and stories to friends who come for a visit.  Any tour guide would be well served by the tidbits and anyone who enjoys local color gleaned through some amazing archival research should take note.  If you buy it you will not be disappointed"}]}, "authors": ["Tim Krepp"], "isbn": "1609495861", "longitude": -77.0366456, "periods": ["1800s", "1900s", "Recent Releases"], "title": "Capitol Hill Haunts (Haunted America)", "word_cloud": "interest info place marvelously fun haunt building repetitive love ghost story want investigate author give detailed description building encounter people experience intriguing background history story haunt interest lore excellent storyteller resident intrigue eerie tale place see time visitor much better guidebook wonderful tour guide informative funny wait go back check wonderful new hopefully way nation engaging walk history people make continue popular blogger tour guide write engage informative thing go bump author place spirit historical context learn history chuckle recommend tourist tour guide historian love ghost ghoulish someone live year blast sequel presume zombie vampire still local tourist really live neighborhood able point place story friends come visit tour guide well tidbit anyone enjoy local color glean amazing archival research note buy disappoint", "genres": ["History", "Folklore & Mythology"], "summary": "From the Demon Cat that stalks the Washington crypt to the restless spirit of John Quincy Adams in Statuary Hall, it is no wonder that in 1898 the Philadelphia Press declared the Capitol to be the most thoroughly haunted building in the world. Yet there are as many ghosts in the neighborhood as there are beneath the dome.\r\n\r\nLocal writer and guide Tim Krepp intrepidly takes on the best-known haunted tales while also exploring the lesser-known specters. From the weeping lady of The Maples to Commodore Tingey, who still stands watch in the Navy Yard, to the dozens of famous ghosts hosted by Congressional Cemetery, many former residents seem bound to their old home. Join Krepp as he explores the most historic and hair-raising haunts of the Hill.", "asin": "1609495861", "rank": "820380", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51s%2BpVKO3xL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}