{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 10, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "This was great for my research and a fascinating story! Well organized and interesting reading. I will look for more on these crimes."}, {"review_sentiment": 4.0, "review_text": "Its interesting history if you are from Austin and can still go to these addresses. I have known about the moon towers for many years BUT did not know they were put up in part because of these murders."}, {"review_sentiment": 4.0, "review_text": "A good collection a newspaper articles a sense of what the establishment thought."}, {"review_sentiment": 5.0, "review_text": "The item was in great shape and the delivery time was excellent. Very pleased with this purchase!  AAA+++"}, {"review_sentiment": 4.0, "review_text": "Yes I heard about the cases on TV but the book tells you the whole story from the newspapers that the people were reading. You can feel like you are living the story getting a little more informed exchange day."}, {"review_sentiment": 5.0, "review_text": "This is very interesting book especially if you are interested in the old west and/or have an interest in Austin, Texas. This is the chronical of the ax murders of 6 women and 1 man. The story is mostly told through the newspaper accounts during the time the murders took place. The newspaper accounts are supplemented by the author's editorial comments. This comprises the first and major portion of the book. The much smaller second part of the book is the author's summary of the murders and conclusions.My only complaint is that apparently the newspaper accounts, which are now on film have portions that are illegible (during my own research at the Austin library I also discovered that the image quality of the photocopied newspapers are not of the highest quality). These illegible parts in the book are denoted by [?] which makes for difficult reading; however, there is so much data.provided in the book that it unlikely that you will miss any salient point.Bottom line, I enjoyed the book immensely."}, {"review_sentiment": 4.0, "review_text": "J.R. Galloway has done an admirable and very thorough job of compiling the source material about the unsolved serial murders that took place in Austin, Texas, in the 1880s. These are mostly newspaper stories, but there are also trial reports and other official documents. The breathless language and blatant alarmism of these old newspaper accounts certainly immerse you in another time and place, and for the armchair sleuth who wants to puzzle over all the details of the crimes, this book will provide hours of enjoyment.However, Galloway is essentially an archivist, not a historian. His concluding essay sums up the known facts, but doesn't provide the kind of framework that would help the reader make sense of the complicated timeline and all the many people involved, as well as the social history underlying the events. This is essentially a sourcebook, full of raw data, not a comprehensive and coherent work of historical reconstruction. A full-scale nonfiction work about these murder remains to be written.For readers who would like a more dramatic account, look to A TWIST AT THE END by Steven Saylor. Saylor is better known for historical novels about Rome, but his ties to Austin led him to research these murders and to write a gripping (and gruesome) fictional version, which stays very close to the known facts and also delivers a vivid, fascinating portrait of Austin in the 1880s, a city teeming with brothels, gambling dens, wily politicians, and lawmen whose only forensic solution was (literally) to unleash the bloodhounds. Saylor even brings in O. Henry as a major character (since the young O. Henry was actually living in Austin at the time)."}, {"review_sentiment": 1.0, "review_text": "The words that were left out/illegible were distracting. I hope I did not spend very much to purchase the book."}, {"review_sentiment": 5.0, "review_text": "This book is a marvelous compilation of newspaper articles from the Austin Daily Statesman  (now Austin American Statesmam) and a few others spanning a year from 1884 through 1885.  The author has removed redundant articles. The journalists in the newspaper write more like novelists than newspapermen, so the book is a good read. Bits and pieces of Austin History are speckled about leaving you to trek to the original sites to see what time has done to them. The newspapermen - not women - were particularly caring and thoughtful to not only the race of the majority of victims, but also to their position in life. It seems that Austin was a melting pot of color long before it was popular. The words that handle the last days of these women leave you to remember them as loving members of extended families.  God bless the servant girls, you are remembered!"}, {"review_sentiment": 5.0, "review_text": "This is without a doubt the most complete and accurate account of these horrific unsolved murders that took place in Austin over 100 years ago.  Likened to the murders of Jack the Ripper, the reader is led step by step through the progression of the murders, the newspaper accounts, the police reports and the trials of the charged.  Definitely a must read for any Texas historian!"}]}, "authors": ["J. R. Galloway"], "isbn": "1609101235", "longitude": -97.7436995, "periods": ["1800s", "Recent Releases"], "title": "The Servant Girl Murders: Austin, Texas 1885", "word_cloud": "great research fascinate story interest reading look crime interesting history still go address know moon tower many year but know put part murder good collection newspaper article sense establishment think item great shape delivery time excellent very pleased purchase hear case tv tell whole story newspaper people read feel live story get little informed exchange day interesting especially interested old west interest chronically ax murder woman man story mostly tell newspaper account time murder take place newspaper account supplement author editorial comment comprise first major portion much smaller second part author summary murder complaint apparently newspaper account film portion illegible research library also discover image quality photocopy newspaper highest quality illegible part denote make difficult read however much unlikely miss salient line enjoy immensely do admirable thorough job compile source material unsolved serial murder take place mostly newspaper story also trial report official document breathless language blatant alarmist old newspaper account certainly immerse time place armchair sleuth want detail crime provide hour essentially archivist historian conclude sum know fact provide kind framework sense complicate timeline many people involve well social history underlie event essentially coursebook full raw data comprehensive coherent work historical reconstruction nonfiction work murder remain reader dramatic account look twist better know historical novel tie lead research murder write grip gruesome fictional version stay close know fact also deliver vivid fascinate portrait city teem brothel gamble den wily politician lawmen forensic solution literally unleash bloodhound even bring major character young actually live time word leave distract hope spend much purchase marvelous compilation newspaper article others span year author remove redundant article journalist newspaper write novelist newspaperman good bit piece speckle leave trek original site see time do newspaperman woman particularly care thoughtful race majority victim also position life seem melt pot color long popular word handle last day woman leave love member extend family bless girl remember doubt complete accurate account horrific unsolved murder take place year ago liken murder lead step step progression murder newspaper account police report trial charge definitely historian", "genres": ["History", "True Crime"], "summary": "A collection of over 100 newspaper articles from the 1880s that document the true story of one of the greatest unsolved murder mysteries of the late 19th century. Arranged chronologically, they allow the reader to experience the story as it transpired, the gruesome details, the colorful characters, and the never-to-be explained.\r\n\r\nThe setting is Austin, Texas, 1885. During the course of that year, six women, one man, and one child were murdered in their sleep by a silent, axe-wielding killer. Many more were attacked and the police were seemingly powerless to stop the crimes. Pinkerton detectives were brought in but they too failed to solve the mystery. After the shocking murders of two women on Christmas Eve the city was on the verge of chaos awaiting the next outrage, but there were no further crimes. The murders ended as mysteriously as they began.\r\n\r\nWho was responsible for the murders? How were they able to escape detection and capture? And why did they suddenly stop? These questions are examined in the accompanying essay, Year of Outrage -- 1885 Austin, Texas.\r\n\r\nThe Servant Girl Murders is a must-read for fans of true crime, historical mysteries, and the old west.", "asin": "1609101235", "rank": "1568365", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/512oAlVWWAL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}