{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 7, "rating": 4.4, "reviews": [{"review_sentiment": 3.0, "review_text": "The writing was good, but the stories aren't scary or spooky at all. It also seems that most of the places mentioned in the book would be difficult to find, or visit. We did visit the Driskell, what an impressive place; just beautiful.  Loved the history in the stories too."}, {"review_sentiment": 5.0, "review_text": "Being from Austin I know all the ghost stories. What makes this book different is the amount of actual research put into it. A lot of time was put into this book and it shows. It wasn't the ghost stories that gave me the creeps but the real life stories behind it."}, {"review_sentiment": 5.0, "review_text": "Great book. I'd recommend it to anyone into ghost stories, or history. Jeanine Plumer caries the stories well and gives good descriptions. Look forward to reading any other books by her."}, {"review_sentiment": 5.0, "review_text": "Austin, Texas like any other historic and big, capital city has it's fair share of paranormal activity. Jeanine Plummer describes the paranormal activity of some historic buildings and places in and around the capital city of Texas. She writes interesting tales of tragic lovers, murder victims, assassins, and ordinary people. What do they have in common? Their \"spirits\" are still around Austin! Ms. Plummer in each tale also gives a great history lesson from how Austin was sacred burial grounds to the native Indian Tribes to Austin as an independent capital of Texas, Civil War Austin, and up to the present day. There are more than a few buildings in Austin that are way over a hundred years old and Lmost every one has a \"haunting\" story to tell. A lot of these haunting a in Ms Plumer's book are just mischievous spirits that like to have some fun like turning on and off lights, moving things, and making noises. Other spirits are more serious and have contact with the living...and Ms. Plumer's stories highlight these very well!The last chapter though is about a serial killer in Austin in the 1880''s and is a good true crime mystery. This is a really good little book about the paranormal in and around Austin and is recommended to anyone who wants to know more about historic Austin and it's ghosts!"}, {"review_sentiment": 5.0, "review_text": "We visit Austin each year while I am at convention.  We have not yet taken the \"Haunted Austin Ghost Tour\" but wanted to get some information about the paranormal experiences there.  This is a GREAT read!!!"}, {"review_sentiment": 5.0, "review_text": "Plumer serves the reader well in 'Haunted Austin' by not just merely \"telling ghost stories\", but by delving into the history of the events surrounding the reputed hauntings in Austin, Texas. It's a fascinating look at how history is so interwoven into a city's culture and how it still might be playing itself out in current times. From such renowned haunts as the Driskill Hotel to more off the beaten track locations 'Haunted Austin' will serve as a delightful read for those curious about one of the most haunted cities in America. The book may also assist as a sort of primer for the budding paranormal investigator looking for their next spot to stir up some past residents."}, {"review_sentiment": 5.0, "review_text": "The very premise that ghosts remain because of life and not because of the shock of sudden death is what sets Jeanine Plumer's Haunted Austin: History and Hauntings in the Capital City apart from other books of its ilk.  Rather than relying on psychic impressions of haunted sites or simply parroting urban legends one can readily find online, Ms. Plumer's well-researched work comes from exhaustive interviews, first-hand accounts and personal experiences. As founder of Austin Ghost Tours, she knows how to find the nugget of a tale and retell it in a way that rings true. Her emphasis on the importance of historical research adds useful relevance to each chapter, particularly The Confederate Women's Home and the Ghost Wagon of Westlake. While there are no ghosts associated with the crime, nevertheless, her account of the Servant Girl Annihilator walks a fine line between detached reporting and one who cries out for justice for the victims. Yes, there are the iconic Austin haunts here: The Capitol Building and The Driskill Hotel, but the author also includes lesser-known stories such as Austin Pizza Garden and Moonshines Patio Bar & Grill that involved personal experiences, those of the buildings' staff, her Austin Ghost Tour guides and tour guests. When you're ready for more substance than the usual sensational ghost stories of bigger-than-life Texans, pick up Haunted Austin: History and Hauntings in the Capital City. You'll learn that most of the ghosts in Austin are regular, everyday folk still doing their best to \"Keep Austin Weird.\""}]}, "authors": ["Jeanine Plumer"], "isbn": "1609490401", "longitude": -97.7436995, "periods": ["1800s", "1900s", "2000s", "Recent Releases"], "title": "Haunted Austin: History and Hauntings in the Capital City", "word_cloud": "write good story scary spooky also seem place mention difficult visit visit impressive place beautiful story be know ghost story make different amount actual research put lot time put show ghost story give creep real life story recommend anyone ghost story caries story well give good description look forward read historic big fair share paranormal activity describe paranormal activity historic building place write interesting tale tragic lover murder victim assassins ordinary people common spirit still tale also give great lesson sacred burial ground native indian independent present day building way year old haunt story lot haunt mischievous spirit fun turn light move thing make noise other spirit serious contact live story highlight well last chapter serial killer good true crime mystery really good little paranormal recommend anyone want know historic ghost visit austin year convention yet take want information paranormal experience great serve well merely tell ghost story delve event surround reputed fascinate look interwoven culture still play current time renowned haunt beat location serve delightful curious city also sort primer bud paranormal investigator look next spot stir resident premise ghost remain life shock sudden death set apart ilk rely psychic impression site simply parrot urban legend readily online work come exhaustive interview account personal experience founder know find nugget tale retell way ring true emphasis importance historical research add useful relevance chapter particularly ghost associate crime nevertheless account walk fine line detach report cry justice victim iconic haunt author also include story involve personal experience building staff guide tour guest ready substance usual sensational ghost story pick learn ghost regular everyday folk still best", "genres": ["History", "True Crime", "Folklore & Mythology"], "summary": "A killer lurks in the dark streets, victimizing servant girls throughout 1885, and Austin becomes the first American city to claim a serial killer. The spirits of convicts wander amidst the manicured grounds of the Texas State Capitol while inside a public servant assassinated in 1903 still haunts the corridors. These are just a few of the strange and frightening tales of Haunted Austin. Within these pages lies evidence that the frontier bravado legendary in so many Texas men and women lives on long after death. Author Jeanine Plumer explores the sinister history of the city and attempts to answer the question: why do so many ghosts linger in Austin?", "asin": "1609490401", "rank": "1033817", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/51YzcGWOhKL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}