{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 40.8359336, "ratings": {"num_ratings": 865, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Elena Ferrante is a must read for anyone.  Her style is engaging, her characters are people who live with you after the story  I've read 7 of her novels so far.  Can't get enough."}, {"review_sentiment": 5.0, "review_text": "It envelopes you until you finish it"}, {"review_sentiment": 5.0, "review_text": "Loved all four of the Neopolitan novels"}, {"review_sentiment": 4.0, "review_text": "Start with My Brilliant Friend."}, {"review_sentiment": 4.0, "review_text": "Good book."}, {"review_sentiment": 4.0, "review_text": "I like the series. A bit hard to keep everyone straight."}, {"review_sentiment": 4.0, "review_text": "The deep down ugly destructiveness of patriarchy, that wrecker of lives and dreams. The awful invidiousness of comparing oneself to others. The selfish greed that keeps the majority in poverty and the minority in lavish wealth. The raw exposure of these social ills are for what I praise the author. Not the melodramatic teenage love triangle and the steamy sexual scenes. Those I found overwrought. Yet the social issues and class struggles are serious and ongoing in every culture and the author brings them to light in the Italian culture of the last century making the novel a worthy read, although, for me, not as captivating as the first book in this series, My Brilliant Friend."}, {"review_sentiment": 4.0, "review_text": "Read the series. It takes that long to learn the characters."}, {"review_sentiment": 5.0, "review_text": "Good product, fast delivery."}, {"review_sentiment": 5.0, "review_text": "I think I got my Books Two and Three mixed up in my review, but I will say that it really doesn't matter.  As this series is amazing!  I have read each one at lightning speed because I cannot put them down once I start them.  This book, #2, is the continuation of  the two main characters' lives.  One has gotten married, and the other is continuing her studies.  Full of surprises in all of the books, Elena Ferrante does not disappoint!"}]}, "authors": ["Elena Ferrante"], "isbn": "1609451341", "longitude": 14.2487826, "periods": ["1900s", "Recent Releases"], "title": "The Story of a New Name: Neapolitan Novels, Book Two", "word_cloud": "anyone style engage character people live novels far enough envelop finish love novel good like series bit hard everyone straight deep ugly destructiveness patriarchy wrecker live dream awful invidiousness compare others selfish greed keep majority poverty minority lavish wealth raw exposure social ill praise author not melodramatic teenage love triangle steamy sexual scene find overwrought yet social issue class struggle serious ongoing culture author bring light italian culture last century make worthy captivate first series read series take long learn character good product fast delivery think get mixed review say really matter series amaze lightning speed put start continuation main character live gotten marry continue study surprise disappoint", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "The second book, following last year’s My Brilliant Friend, featuring the two friends Lila and Elena. The two protagonists are now in their twenties. Marriage appears to have imprisoned Lila. Meanwhile, Elena continues her journey of self-discovery. \r\n\r\nThe two young women share a complex and evolving bond that brings them close at times, and drives them apart at others. Each vacillates between hurtful disregard and profound love for the other. With this complicated and meticulously portrayed friendship at the center of their emotional lives, the two girls mature into women, paying the cruel price that this passage exacts.", "asin": "1609451341", "rank": "7668", "city": "Naples", "image": "https://images-na.ssl-images-amazon.com/images/I/510CxWjgMtL.jpg", "country": "Italy", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}