{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": -31.9527121, "ratings": {"num_ratings": 80, "rating": 4.3, "reviews": [{"review_sentiment": 3.0, "review_text": "The title refers to a polio rehab facility for children in Perth, Australia, that really did exist in the 1950s.  The story centers around two fictional 13-year-olds, Frank and Elsa, who become close while they are both residents of the facility.  Other than that, honestly, not much happens.  The equally poignant backstory is that Frank’s family emigrated from Hungary during WWII, and neither of his parents has been able to embrace their new homeland.  Frank seems at times to be a bit ashamed of his parents’ reduced station in life, until his mother renews her interest in music and proves that she is still a virtuoso pianist, after having abandoned the piano when Frank contracted polio.  The book certainly brings into focus the many heartbreaks associated with polio.  The physical impact is obviously huge, as Frank and Elsa endure the pain of trying to walk again.  This book also emphasizes that people reacted to the victims in the same way as they have in the past to leprosy or AIDS.  The contagious aspect of the disease causes families to speculate on how their children became exposed to it, but, more importantly, outsiders keep not only the victims at arm’s length, but also their family members as well.  This book is short on plot but long on educating us as to the devastating impact of this disease before the vaccine was introduced."}, {"review_sentiment": 5.0, "review_text": "Lovely novel on first love, friendship and nostalgia for lost worlds and families, artfully intermingled stories of loss and love."}, {"review_sentiment": 5.0, "review_text": "Wonderful character depictions. Vivid portrayal of the polio rehab hospital and the young patients who are forced to reside there. Very much worth the read."}, {"review_sentiment": 1.0, "review_text": "great"}, {"review_sentiment": 5.0, "review_text": "I loved this book. It was a real glimpse into a particular time in our history. I found it to be a positive, heartwarming story."}, {"review_sentiment": 5.0, "review_text": "Joan London is a highly regarded author in her home of Australia. She deserves to be better known everywhere else. She has a gift for depicting both character and place, and her prose style is uncluttered yet elegant. In her latest novel, The Golden Age, she examines the polio epidemic that began in 1949 and continued for a decade.Twelve-year-old Frank Gold, a recent immigrant to Perth from Hungary, is sent to the children’s hospital of the title to recover, and there he befriends another patient, Elsa Briggs. They keep up each other’s spirits through the vicissitudes of the dread disease and its various treatments, including the iron lung. The Golden Age is also the story of their parents, who cope with their children’s illness and life in Australia in varying ways. Frank’s mother was a famous pianist in Budapest and remains in denial that their life is in uncultured Western Australia now. His father, Meyer, is a hard-working delivery man who is grateful for the second chance Australia has given him and his family, and he intends to adapt and thrive, whatever the cost. Elsa’s mother, a perfectionist, struggles to accept that Elsa will not be the daughter she wants. Her attentions shift to Elsa’s siblings, making Frank’s friendship ever more valuable. The director of The Golden Age, Sister Penny, serves as a bridge between parents and their sick children, and her relationship with one parent becomes particularly important. Though dedicated to her charges, she has her own vulnerabilities.This is an absorbing and deeply compassionate novel by an author who deserves a much wider audience. When you read it, you will see why it won the Prime Minister’s Award for Fiction, The Patrick White Literary Award, The Queensland Literary Award for Fiction, and The New South Wales Premier’s People’s Choice Award.You can read more reviews about literary fiction by women at my blog, readherlikeanopenbook (dot) com."}, {"review_sentiment": 5.0, "review_text": "Wonderful historical fiction. Well written and a page turner"}, {"review_sentiment": 5.0, "review_text": "We were asked to mark some particularly poignant exerpts to share with our Book Club and I had so many stickies I couldn't possibly select  just 2 or 3. Joan London creates a lovely coming of age story set in Australia with many lovely characters created with deft emotional clarity..  A lovely read, small but mighty."}, {"review_sentiment": 5.0, "review_text": "A moving book in many ways.  First, the writing is superb and the novel has a easy flow from one chapture to the next.  It is heart-felt novel and makes you care deeply about the characters.  The novel also has transitions - from healing, moving from war to safety, growing up, going from hospital to home, and finding one's place in life.  The novel includes the sadness of the polio epidemic, the joy of friendships, the complex family relationships, and discovery of first love.  Excellent!  The book deserves an A++++++"}, {"review_sentiment": 3.0, "review_text": "I'm finding it hard to get into this book.  However, a librarian recommended it highly, so I am persevering.  Interesting subject, though."}]}, "authors": ["Joan London"], "isbn": "1609453328", "longitude": 115.8604796, "periods": ["1900s", "Recent Releases"], "title": "The Golden Age", "word_cloud": "title refers polio rehab facility child really exist story center fictional become close resident facility other honestly much happen equally poignant backstory family emigrate parent able embrace new homeland seem time bit ashamed parent reduce station life mother renews interest music prove still virtuoso pianist abandon piano contract certainly bring focus many heartbreak associate physical impact obviously huge endure pain try walk also emphasize people react victim way leprosy contagious aspect disease cause family speculate child become expose importantly outsider keep victim arm length also family member well short plot long educate devastate impact disease vaccine introduce lovely first friendship nostalgia lose world family artfully intermingled story loss love wonderful character depiction portrayal polio rehab hospital young patient force reside very much worth great love real glimpse particular time history find positive heartwarming story highly regard author home deserve better know everywhere else gift depict character place prose style uncluttered yet elegant latest examine polio epidemic begin continued recent immigrant send child hospital title recover befriend patient keep spirit vicissitude dread disease various treatment include iron lung also story parent cope child illness life varying way mother famous pianist remain denial life uncultured father delivery man grateful second chance give family intend adapt thrive cost mother perfectionist struggle daughter want attention sibling make friendship ever valuable director serve bridge parent sick child relationship parent become particularly important dedicate charge absorb deeply compassionate author deserves much wider audience see review literary fiction woman blog dot com wonderful historical fiction write page turner ask particularly poignant exerts share many stickies possibly create lovely coming story set many lovely character create deft emotional lovely small mighty move many way write superb easy flow capture make care deeply character also transition heal move war safety grow go hospital home find place life include sadness polio epidemic joy friendship complex family relationship discovery first deserves find hard get however librarian recommend highly persevere interest subject", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "A Publisher's Weekly Best Book of 2016\r\n \r\nFrank Gold’s family, Hungarian jews, flee the perils of World War II for the safety of Australia, but not long after their arrival, thirteen-year-old Frank is diagnosed with polio. He is sent to a sprawling children’s hospital called The Golden Age, where he meets Elsa, the most beautiful girl he has ever seen, a girl who radiates pure light. Frank and Elsa fall in love, fueling one another’s rehabilitation, facing the perils of illness and adolescence hand in hand, and scandalizing the prudish staff of The Golden Age.\r\n \r\nFrank and Elsa’s parents, too, must cope with their changing realities. Elsa’s mother Margaret, who has given up everything to be a perfect mother, must reconcile her hopes and dreams with her daughter’s sickness. Frank’s parents, transplants to Australia from a war-torn Europe, are isolated newcomers in a country that they do not love and that does not seem to love them. Frank’s mother Ida, a renowned pianist in Hungary, refuses to allow the western deserts of Australia to become her home. But her husband, Meyer, slowly begins to free himself from the past and integrate into a new society. \r\n \r\nWith tenderness and humor, The Golden Age tells a deeply moving story about illness, resilience and recovery. It is a book about learning to navigate the unfamiliar, about embracing music, poetry, death, and, most importantly, life.\r\n\r\n\"Fearless, graceful and deeply benevolent.\" Helen Garner, Australian novelist", "asin": "1609453328", "rank": "371591", "city": "Perth", "image": "https://images-na.ssl-images-amazon.com/images/I/51ovLlk7VWL.jpg", "country": "Australia", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}