{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 40.8359336, "ratings": {"num_ratings": 785, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Elena Ferrante is a must read for anyone.  Her style is engaging, her characters are people who live with you after the story  I've read 7 of her novels so far.  Can't get enough."}, {"review_sentiment": 5.0, "review_text": "The whole series is really good, Elena made a amazing job! Captivating history of two friends since childhood!"}, {"review_sentiment": 3.0, "review_text": "These books were fantastic, definitely start with My Brilliant Friend."}, {"review_sentiment": 4.0, "review_text": "Great book!"}, {"review_sentiment": 4.0, "review_text": "Good book."}, {"review_sentiment": 5.0, "review_text": "The book feels very true-to-life to me."}, {"review_sentiment": 4.0, "review_text": "This has been my favorite book in the series so far. Can’t wait to read the last in the series and see the mini series on HBO!"}, {"review_sentiment": 5.0, "review_text": "Dis-nous read the story of almost child yet"}, {"review_sentiment": 5.0, "review_text": "Anonymous fabulous read"}, {"review_sentiment": 5.0, "review_text": "Good product, fast delivery."}]}, "authors": ["Elena Ferrante"], "isbn": "160945233X", "longitude": 14.2487826, "periods": ["1900s", "Recent Releases"], "title": "Those Who Leave and Those Who Stay: Neapolitan Novels, Book Three", "word_cloud": "anyone style engage character people live story novels far enough whole series really good make amaze job captivate history friend childhood fantastic definitely great good feel favorite series far last series see mini series story almost child yet fabulous good product fast delivery", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "The incredible story continues in book three of the critically acclaimed Neapolitan Novels!\r\n\r\nSince the publication of My Brilliant Friend, the first of the Neapolitan novels, Elena Ferrante’s fame as one of our most compelling, insightful, and stylish contemporary authors has grown enormously. She has gained admirers among authors—Jhumpa Lahiri, Elizabeth Strout, Claire Messud, to name a few—and critics—James Wood, John Freeman, Eugenia Williamson, for example. But her most resounding success has undoubtedly been with readers, who have discovered in Ferrante a writer who speaks with great power and beauty of the mysteries of belonging, human relationships, love, family, and friendship.\r\n \r\nIn this third Neapolitan novel, Elena and Lila, the two girls whom readers first met in My Brilliant Friend, have become women. Lila married at sixteen and has a young son; she has left her husband and the comforts her marriage brought and now works as a common laborer. Elena has left the neighborhood, earned her college degree, and published a successful novel, all of which has opened the doors to a world of learned interlocutors and richly furnished salons. Both women have attempted are pushing against the walls of a prison that would have seen them living a life of misery, ignorance and submission. They are afloat on the great sea of opportunities that opened up during the nineteen-seventies. Yet they are still very much bound to each other by a strong, unbreakable bond.", "asin": "160945233X", "rank": "7913", "city": "Naples", "image": "https://images-na.ssl-images-amazon.com/images/I/51g3d3qpFAL.jpg", "country": "Italy", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}