{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 34, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "good"}, {"review_sentiment": 4.0, "review_text": "I enjoyed reading this book although it was very unusual. Very good and detailed description of life near the North Pole"}, {"review_sentiment": 4.0, "review_text": "I found this quite intriguing, worth your time."}, {"review_sentiment": 5.0, "review_text": "Poetic,romantic,melancholic and hauntingly beautiful.  A long saga of one Norwegian girl in the mid 1800s. The descriptions of land and weather were enough for me to book a trip to Norway."}, {"review_sentiment": 3.0, "review_text": "This book was very hard to read due to the fact that it does not follow any format I have ever read. It took me several chapters to even figure out what exactly was going on in the story. All in all an interesting story."}, {"review_sentiment": 5.0, "review_text": "Profound story, with changing writing styles."}, {"review_sentiment": 5.0, "review_text": "I loved this book.  I disliked this book. I will read this book again.  I wish \"Dina ' Son\" was available for Kindle.  I certainly would like to read the complete trilogy. Dina appeared to embody all the signs of mental illnesses -sociopath, manic depressive, homicidal, schizophrenia, bipolar , psychotic, self absorbed egotist, etc.  At times she was likable then again you wanted to shake her.  She was a master manipulator. I am still thinking about Dina ' Book."}, {"review_sentiment": 4.0, "review_text": "Although in some ways the character of Dina was a bit odd, the author did a great job in creating this multi-doimensional being.  I was surprised at every chapter, especially the ending.  The setting to me, was vivid and authentic."}, {"review_sentiment": 4.0, "review_text": "This was an epic read. I was drawn into the story from the first page. The characters were developed and interesting. There were constant moral dilemmas that were handled in several different ways. The supernatural piece which usually doesn't work for me worked beautifully in this novel. The end was a bit of a surprise but it left me feeling as though it may have been set up for a sequel. The translation in my edition had many typos but that wasn't too bad to read through. I recommend this book."}, {"review_sentiment": 4.0, "review_text": "I never knew what was coming in this novel. The main characters underwent major changes and remained believable, which takes some art to pull off. It's more character-centered than plot-centered, which makes it a little slow, but the main character, Dina, becomes so identified with the Nordland (about which I knew nothing) that the whole novel remains luminous and important--almost beyond its story--in my memory. Strange to say, it's a novel of magical realism, about as removed in locale as can be from Garcia-Marquez' One Hundred Years of Solitude, but oddly similar in spirit. I highly recommend it."}]}, "authors": ["Herbjorg Wassmo"], "isbn": "1611458536", "longitude": 0.0, "periods": ["1800s"], "title": "Dina's Book: A Novel", "word_cloud": "good enjoy read unusual very good detail description life find quite intriguing worth time poetic romantic melancholic hauntingly beautiful long saga norwegian girl mid description land weather enough trip hard due fact format ever take several chapter even figure exactly go story interesting story story change writing style love dislike wish available certainly complete trilogy appear embody sign mental illness manic depressive homicidal schizophrenia bipolar psychotic self absorb egotist etc time likable want shake master manipulator still think way character bit odd author great job create surprise chapter especially end setting vivid authentic epic draw story first character develop interest constant moral dilemma handle several different way supernatural piece usually work work beautifully end bit surprise leave feeling though translation edition many typo bad recommend never know come main character underwent major change remain believable take art make little slow main character become identified know nothing whole remain luminous important almost story memory say magical realism remove locale year oddly similar spirit highly recommend", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Set in Norway in the mid-nineteenth century, Dina’s Book presents a beautiful, eccentric, and tempestuous heroine who carries a terrible burden: at the age of five she accidentally caused her mother’s death. Blamed by her father and banished to a farm, she grows up untamed and untaught. No one leads the child through her grief, and the accident remains a gruesome riddle of death, with Dina left haunted by the vindictive spirit of her mother. When her father agrees to take her back after several years, his efforts to cultivate her have little lasting effect.\r\n\r\nTamed only by her tutor, who is able to reach her through music and draw out her gift for mathematics, Dina remains private and closely guarded, while her unconventional behavior and erotic power enchant and ensnare those around her. At age sixteen, she is married off  to Jacob, a wealthy fifty-year-old landowner, who later dies under odd circumstances. Wrestling with her two unappeased ghosts, Dina becomes mute and then emerges from her shock to run Jacob’s estate with an iron hand . . . until one day a mysterious stranger, the Russian wanderer Leo, enters her life and changes it forever.", "asin": "1611458536", "rank": "1075731", "city": "Nordland", "image": "https://images-na.ssl-images-amazon.com/images/I/416O-M0J2BL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}