{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 3, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "This was an odd book to me. I bought it expecting a pretty straightforward travelogue interspersed with history (and maybe some natural history) of the region of southern France known as Provence. Quickly I found it wasn’t a typical travelogue. First of all, the author made that area his home rather than specifically writing about traveling there, though it was still a travelogue in the sense that it chronicled (not in chronological order though) the author’s experiences in Provence through the years.Another odd thing was that the author didn’t simply describe the cities or the food of this part of France (though there was some of that), but rather told stories about the area that showed some special characteristic of the land or the author’s own experiences (again, as they related to Provence). These stories were as likely to feature say the Roman general Marius and his military campaign there as they were the author’s contemporary companion Aldo and their considerably less martial experiences. The stories often read as fiction, at least from the third person perspective, not always with a lot of dialogue, but were an interesting way to show Provence.  The stories really reminded me of the famous line by Faulkner, \"The past is never dead. It's not even past;” the past lives on in Provence, as I am sure it does in most lands, whether in the minds of the people of Provence, those who aren’t from Provence but journey there as tourists, or in the author’s own mind.I think the most striking stories had to do with the ancient Greco-Roman world, how even today one can see and feel the presence of them in Provence on a daily basis. Not only of course are there the famous monuments and aqueducts, but the Roman world lives on in more subtle ways, just beneath the surface, such as the name of the village of Pourrieres, which possibly traces its name to the nearby Campi Putridi or Fields of Putrefaction, a place where in about 110 BC perhaps 100,000 Teuton and Ambron opponents, slain in battle, were left where they fell. That chapter was particularly interesting, as the author helped the reader see the land as Marius and his troops (and enemies) saw the land, writing of the “limestone precipices” at Orgon that “rise as walls sheer above the plain, now crowned by a church and a couple of ruined castles,” where Marius and his men watched the invading barbarians file past, or the problems faced by both men in movement through this “land of lagoons,” as much of the region of Provence Marius fought over was a domain where “a network of interlocking lagoons and lakes scribbled the whole verdant surface.”These stories he tells, of magic and mythology and Roman conquest, to the author they seemed to be Provence itself, for “[t]o begin with, Provence seemed to be less of a geographical entity than an idea.” It was for centuries a land of “shifting contours, expanding and contracting in response to wars and migrations…” a land better defined by how the people acted, believed, and the nature of the landscape itself, a place of “cypresses and roasted tile roofs, with its ivy and honeysuckle, sycamore and serene plane trees,” with skies of “wounded blue” that are “unique to Provence,” where one might encounter peasant faces in the Saturday market with “all the poise and gravity of Roman medallions.”As you might gather, Durrell is a poet and twenty poems are included in the book. The vast majority of the book is prose but even in writing prose the author usually saw Provence (and wrote about it) with a poet’s eye. Even it its most vexingly confusing (such as the final chapter of the book) it was always a delight to read. Again and again the images were vivid, Durrell writing of “dusty, sunburnt Arles at the end of its cobweb of motorways,” of the beautiful women of Arles with “their raven hair and flashing looks,” of the site of an ancient Roman battle that is a “quiet plain [that] drowses in the burning summer heat…[where] [e]agles turn in the dazed blue of the sky,” visiting at night “the owl-haunted garden of tombs” of Alyscamps, “once the most coveted burial ground for Christians in all Europe” and Les Baux, a plateau “encrusted with white crags and scrub…its present emptiness invests it with a tremendous and indeed sinister atmosphere,” a plateau where the “whole town seems to have been carved and shaped in lump sugar; the friable whitish stone easily answers to the mason’s chisel.”He had an especially interesting and descriptive chapter describing the differences between French and Spanish bullfighting, a chapter I did not think I would like but did, taken as I was by his description of the French bulls, “spry little Camargue animals so famous for their gallantry and cunning…beautiful creatures [that] drift about like Stone Age messages – as if they had just materialized from the cave drawings of Aurignacian man.”The author, when not telling stories, seemed to ramble a lot, writing about the nature of writing a travelogue, or writing in general, the importance of enjoying a good meal and fine wine, the nature of companionship or love or whether or not modernity was destroying Provence. At first these rambling asides felt distracting, but not only were they easy to read I found I was both captured by the often beautiful imagery of many of these passages and discovered that these rambling asides were in a way telling the reader something about the lifestyle and philosophy of those who call Provence home. Very sly!I don’t think I scratched my itch so to speak to get great information about Provence. I will have to look elsewhere for that. I did come away with an appreciation of one gifted writer’s feel of the spirit of the place, perhaps something that would not be well captured in a more prosaic look at Provence’s history and architecture."}, {"review_sentiment": 5.0, "review_text": "Haven't read it but the condition received was quite fine."}, {"review_sentiment": 4.0, "review_text": "Somewhat uneven, but much of it has the Durrell magic of poetic writing andastute observation."}]}, "authors": ["Lawrence Durrell"], "isbn": "1611458668", "longitude": 0.0, "periods": ["1900s"], "title": "Provence", "word_cloud": "odd buy expect pretty straightforward travelogue intersperse history maybe natural history region southern know find typical travelogue author make area home rather specifically write travel still travelogue sense chronicle chronological order author experience odd thing author simply describe city food part rather told story area show special characteristic land author experience related story likely feature say general military campaign author contemporary companion considerably le martial experience story often fiction least third person perspective always lot dialogue interesting way show story really remind famous line past never dead even past life sure land mind people journey tourist author think strike story ancient world even today see presence daily basis not course famous monument aqueducts world live subtle way surface name village portieres possibly trace name nearby place perhaps opponent slay battle left fell chapter particularly interesting author help land troop enemy saw land write limestone precipice rise wall sheer plain crown church couple ruin castle men watch invade barbarian file past problem face men movement land lagoon much region fight domain network interlock lagoon lake scribble whole verdant story tell magic mythology conquest author seem seem le geographical entity centuries land shift contour expand contract response war land better define people act believed nature landscape place cypress roast tile roof ivy honeysuckle sycamore serene plane tree sky wound blue unique one peasant face market poise gravity twenty poem include vast majority prose even write prose author usually saw write poet eye even vexingly confuse final chapter always delight image vivid write dusty sunburn end cobweb motorway beautiful woman raven hair flash look site ancient battle quiet plain drowse burn summer e gale turn daze blue sky visit night garden tomb covet burial ground plateau encrust white crag present emptiness invests tremendous indeed sinister atmosphere plateau whole town seem carve shaped lump sugar friable whitish stone easily answer mason especially interest descriptive chapter describe difference french spanish bullfighting chapter think take description french bull spry little animal famous gallantry creature drift message materialize cave drawing aurignacian author tell story seem ramble lot write nature write travelogue write general importance enjoy good meal fine wine nature companionship modernity destroy first ramble aside felt distract easy find capture often beautiful imagery many passage discover ramble aside way tell something lifestyle philosophy call home sly think scratch itch speak great information look elsewhere come away appreciation gift writer feel spirit place perhaps something well prosaic look history architecture condition receive quite fine somewhat uneven much poetic write and astute observation", "genres": ["History", "Travel Writing"], "summary": "Lawrence Durrell, who was called “one of the [twentieth] century’s great literary pyrotechnicians” (Kenneth McLeish, London Times), was also one of its most accomplished travel writers. Durrell lived in Provence for thirty years and was its leading literary expatriate long before others discovered that magical wedge of land. \r\n\r\nIn this, his final book, he has left a dazzling testament that distills its essence and conveys its savors as no other work in the English language.\r\n\r\nDurrell’s Provence is saturated with the spirits of civilizations past. In the countryside, the marketplace, and among the people, he listens to — and conveys for us — echos of the battles of Roman generals like Caesar and Agrippa, the love of Petrarch for Laura, the debates of the medieval Courts of Love, and the lyrics of the troubadours. He relates the significance of ruins strewn across Provence, which for him is nothing less than the crucible where the European sensibility was forged, and he discusses such topics as bull worship, black magic, alchemy, the Provençal language, Buffalo Bill’s friendship with the poet Mistral, who was Provence’s Nobel laureate, the beauty of Arlesian women, and the game of boules. \r\n\r\nProvence is a monument to the author and to the region, and is essential reading for any traveler seeking to understand the spirit of the place.", "asin": "1611458668", "rank": "689841", "city": "Provence", "image": "https://images-na.ssl-images-amazon.com/images/I/51YTXbgeW%2BL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}