{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 11, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "The story telling style was both intriguing and a bit challenging for me at first but after about the fourth chapter, once I caught on  to the connections, I enjoyed it. It reads like a novel and a great history, at the same time. The story itself is excellent."}, {"review_sentiment": 4.0, "review_text": "It was a very interesting read. I especially like the time and context in history it covered. Not to long ago I was in Prague so the book captured the essence of the city;"}, {"review_sentiment": 5.0, "review_text": "Excellent book."}, {"review_sentiment": 5.0, "review_text": "Enjoyable and very well written. Many of the chapters are self contained and/or loosely connected to others, but overall very delightful, like eating a delicious melon."}, {"review_sentiment": 5.0, "review_text": "Loved this book full of short, interwoven stories - often humorous!!!"}, {"review_sentiment": 5.0, "review_text": "This collection of stories is really a single novel that gives life only to 17th century Prague, but to the mystic legends of Rabbi Loew. We tend to think of urban magic as new; these stories give us the urban magic of tomes past.  The characters are rich. Prague at the turn of the 17th century is alive.  As Mordecai and Jakele-the-fool and Rupert the Emperor walk the streets, you will share their joy and sorrow.  Magic starts it all, but it is the soulful magic of their lives gives this book it's true power.  You will put this book down after each story to feel how it filled your heart and mind.  Then you will pick it up anticipating the adventure of the next one.  Read it by a fireplace and savor the stories like the fine wine they are."}, {"review_sentiment": 5.0, "review_text": "The title story was my favorite."}, {"review_sentiment": 2.0, "review_text": "It takes a special kind of appreciation to enjoy stories like these however , it is not a bad read by any stretch"}, {"review_sentiment": 5.0, "review_text": "What a master storyteller!  The author wove his stories from Rudolph ll's time in Bohemia around the the late 1500's.  What a fascinating glimpse into mostly Jewish characters, the grind of (mostly poor) daily life, and the Jewish ghetto.  I loved how he was able to seamlessly meld together the history of the time, experiences of main characters, and the beliefs/superstitions in vogue at the time.  He is an author to remember."}, {"review_sentiment": 5.0, "review_text": "This book deserves to be much better known. I think it is one of the classics of 20th century European literature and a must for anyone who loves Prague, taking us back to the city of Rabbi Judah Loeb - the legendary creator of the mythical Golem - on the eve of the Thirty Years' War. The book might be of particular interest to fans of Ivo Andric (and similarly, fans of \"The Bridge over the Drina\" should enjoy Perutz's book). The atmosphere is somewhat similar, with the old bridge as a sort of silent witness to events related in a series of highly entertaining and - at their best - magical tales."}]}, "authors": ["Leo Perutz"], "isbn": "1611458412", "longitude": 14.4212535, "periods": ["1500s"], "title": "By Night Under the Stone Bridge", "word_cloud": "story tell style intriguing bit challenge first fourth chapter catch connection enjoy read great history time story excellent interest especially time context history cover not long ago prague captured essence city excellent enjoyable well write many chapter self contain loosely connected others overall delightful eat delicious melon love full short interwoven story often humorous collection stories really single give life century mystic legend tend think urban magic new story give urban magic tome character rich turn century alive walk street share joy sorrow start soulful magic live give true power put story feel fill heart mind then anticipate adventure next fireplace savor story fine wine title story favorite take special kind appreciation enjoy story however bad stretch master storyteller author wove story time around late fascinate glimpse mostly jewish character grind mostly poor daily life ghetto love able seamlessly meld together history time experience main character vogue time author deserve much better know think classic century european literature anyone love take back city legendary creator mythical eve particular interest fan similarly fan enjoy atmosphere somewhat similar old sort silent witness event related series highly entertaining best magical tale", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Rudolf II, king of Bohemia and Holy Roman Emperor, is paranoid, spendthrift, and wayward. In sixteenth-century Prague, seat of Christendom, he rules over an empty treasury and a court of parasites and schemers.\r\n\r\nMeanwhile in the ghetto, the Great Rabbi, mystic and seer, guides his people in the uneasy cohabitation of Jew and Christian, while the fabulously wealthy financier Mordechai Meisl has a hand in transactions across Europe and is reputed to be sustaining the treasury. His beautiful wife, Esther, forms a link of a different sort between the castle and the ghetto: by night under the stone bridge, she and the emperor entwine in their dreams under the guise of a white rosemary bush and a red rose. Only by severing the two plants can the Great Rabbi break the spell of forbidden love and deliver the city from the wrath of God.\r\n\r\nPerutz brings Old Prague to life with a cast of characters ranging from alchemists to the angel Asael, and including the likes of Johannes Kepler and the outlaw prince Wallenstein.\r\n\r\nFirst published in 1953, this magical historical novel ostensibly describes the series of events which led to Bohemia's defeat by Austria at the Battle of the White Mountain in the 16th century. But the Czech emigre author was probably inspired by the events of the Holocaust, so expertly does he re-create the uneasy alliances of Prague's Jewish and Catholic communities.", "asin": "1611458412", "rank": "1660635", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/51-zD7%2BaWOL.jpg", "country": "Czechia", "story_arc": ["Tragedy", "Things only get worse"]}