{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 280, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Tropics, danger, wordplay and sex appeal. A good book for poolside reading. Could not have expected less from sir Ian Fleming."}, {"review_sentiment": 4.0, "review_text": "If you like James Bond, this was pretty good.  Bond is superhuman, as usual, but it’s great escapist reading."}, {"review_sentiment": 4.0, "review_text": "Excellent"}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 4.0, "review_text": "Must have for Bond lovers"}, {"review_sentiment": 4.0, "review_text": "Not the first Bond book, and not the best.  Though the film producers chose it as the foundation springboard for the first 007 movie.  The books and the movies both get better."}, {"review_sentiment": 4.0, "review_text": "For those of us that are 007 fans, this is an interesting mustown tape. Not quite the same as the movie version, but more complex -explores a much more sinister side of the Dr. No character than the movie conveys. Well worth the listen."}, {"review_sentiment": 4.0, "review_text": "Along with From Russia With Love (which preceded it) this is the best of the Bond series. Everything is in here-Carribean locales, a great Bond babe (Honeychile Rider), and a smooth megalomaniacal villain. Bond, of course, endures considerable physical agony but emerges on top in a great finale."}, {"review_sentiment": 4.0, "review_text": "Excellent Bond novel."}, {"review_sentiment": 5.0, "review_text": "Great book."}]}, "authors": ["Ian Fleming"], "isbn": "1612185495", "longitude": 0.0, "periods": ["1900s"], "title": "Dr. No (James Bond)", "word_cloud": "tropic danger sex good poolside reading expect le sir like pretty good superhuman usual great escapist reading excellent excellent lover not first best film producer choose foundation springboard first movie movie get better fan interest mus town tape not quite movie version complex much sinister side character movie conveys listen precede best series locales great babe smooth megalomania cal villain course endure considerable physical agony emerge top great finale excellent bond great", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Dispatched by M to investigate the mysterious disappearance of MI6’s Jamaica station chief, Bond was expecting a holiday in the sun. But when he discovers a deadly centipede placed in his hotel room, the vacation is over.\r\n\r\nOn this island, all suspicious activity leads inexorably to Dr. Julius No, a reclusive megalomaniac with steel pincers for hands. To find out what the good doctor is hiding, 007 must enlist the aid of local fisherman Quarrel and alluring beachcomber Honeychile Rider. Together they will combat a local legend the natives call “the Dragon,” before Bond alone must face the most punishing test of all: an obstacle course—designed by the sadistic Dr. No himself—that measures the limits of the human body’s capacity for agony.", "asin": "1612185495", "rank": "37715", "city": "Jamaica", "image": "https://images-na.ssl-images-amazon.com/images/I/51ebb%2Bo00mL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}