{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 64.145981, "ratings": {"num_ratings": 0, "rating": 0.0}, "authors": ["Jon Gnarr"], "isbn": "1612194370", "longitude": -21.9422367, "periods": ["2000s", "Recent Releases"], "title": "Gnarr: How I Became the Mayor of a Large City in Iceland and Changed the World", "word_cloud": "", "genres": ["Memoir", "Politics"], "summary": "In the epicenter of the world financial crisis, a comedian launched a joke campaign that didn’t seem so funny to the country’s leading politicians . . .\r\n\r\nIt all started when Jón Gnarr founded the Best Party in 2009 to satirize his country’s political system. The financial collapse in Iceland had, after all, precipitated the world-wide meltdown, and fomented widespread protest over the country’s leadership.\r\n\r\nEntering the race for mayor of Reykjavík, Iceland’s capital, Gnarr promised to get the dinosaurs from Jurassic Park into downtown parks, free towels at public swimming pools, a “drug-free Parliament by 2020” . . . and he swore he’d break all his campaign promises.\r\n\r\nBut then something strange started happening: his campaign began to succeed. And in the party’s electoral debut, the Best Party emerged as the biggest winner. Gnarr promptly proposed a coalition government, although he ruled out partners who had not seen all five seasons of The Wire.\r\n\r\nAnd just like that, a man whose previous foreign-relations experience consisted of a radio show (in which he regularly crank-called the White House and police stations in the Bronx to see if they had found his lost wallet) was soon meeting international leaders and being taken seriously as the mayor of a European capital.\r\n\r\nHere, Gnarr recounts how it all happened and, with admirable candor, describes his vision of a more enlightened politics for the future. The point, he writes, is not to be afraid to get involved—or to take on the system.\r\n\r\n“Certainly my favorite mayor. No competition, in fact.” Noam Chomsky", "asin": "1612194370", "rank": "1568554", "city": "Reykjavik", "image": "https://images-na.ssl-images-amazon.com/images/I/51l8Vg6xngL.jpg", "country": "Iceland", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}