{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 44.0505054, "ratings": {"num_ratings": 897, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "SECRETS TO DIE FOR. by LJ Sellers  \"Detective Jackson\" # 2A domino effect, when a social worker, with attention for the child, lets go of her safety area. Which led to secrets, lies and murder, would Jackson find the common thread. How far does one go to protect their children. A thriller that has several themes that come together, of the young figuring out who they are. Characters were well defined .Readers will get a tense flowing plot to the end."}, {"review_sentiment": 5.0, "review_text": "The Detective Jackson series is my 2nd favorite mystery series. It’s well written and all the books hold your attention. This is my 2nd time reading them!"}, {"review_sentiment": 5.0, "review_text": "Excellent read loved the book"}, {"review_sentiment": 4.0, "review_text": "This is the second book in the series that I have read and I have enjoyed them both. The main character, Jackson, has flaws and makes mistakes but is generally efficient and identifiable. There is a nice twist at the end."}, {"review_sentiment": 4.0, "review_text": "The storyline definitely shows what we parents are up against when our kids are out there in the world. Glad I didn't lay the heavy religion on mine. Sellers sure has a gift for writing police stories. I'm on book 7 of the Detective Jackson series. Having fun reading them."}, {"review_sentiment": 4.0, "review_text": "This was a good read, interesting plot and the story flowed fairly well."}, {"review_sentiment": 5.0, "review_text": "I love this series so far! Det. Jackson is always on the case! Can't wait to see what's coming next!!!!"}, {"review_sentiment": 1.0, "review_text": "Really  did not care for the book.  I skipped the middle to go to the end  because I got tired of trying to keep up with all the people and plots."}, {"review_sentiment": 5.0, "review_text": "This book kept me wanting more! It's well written and I would recommend this to all who love mystery novels!"}, {"review_sentiment": 5.0, "review_text": "Awesome read!!!"}]}, "authors": ["L.J. Sellers"], "isbn": "1612186173", "longitude": -123.0950506, "periods": ["2000s", "Recent Releases"], "title": "Secrets to Die For", "word_cloud": "domino effect social worker attention child let go safety area lead lie murder common far go protect child thriller several theme come together young figure well define tense flow plot end series favorite mystery series well write hold attention time read excellent love second series enjoy main character flaw make mistake generally efficient identifiable nice twist end story line definitely show parent kid world lay heavy religion mine sure gift write police story detective series fun read good interesting plot story flow fairly well love series far always case wait see come next really skip go end get tired try keep people plot keep want well write mystery novel", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 2/6 in the Detective Jackson Mystery Series\r\n\r\nWhen young social worker Raina Hughes arrives at a ramshackle trailer outside of town, she’s on a mission to protect a small boy from abusive parents. But when Detective Wade Jackson arrives at the same location hours later, his mission is far grimmer: investigating Raina’s murder.\r\n\r\nThe victim’s vicious death is a shocking event for laid-back Eugene, Oregon—and even more chilling when one of Jackson’s fellow officers suspects an elusive rapist whose appetite is turning murderous. Jackson thinks he’s got a tight case against the meth-head dad who menaced Raina, but the evidence seems to leave his suspect in the clear—and a homicidal sex offender still on the loose. What Jackson fears is that his new love affair with nurse Kera Kollmorgan may be knocking him off his game. And what he never expects is to find an ally in savvy reporter Sophie Speranza, who may have stumbled on the killer’s shocking motive. But even as Jackson and Sophie team up to tighten the noose, their quarry zeroes in on his next victim—ready to take his twisted game to the next level.", "asin": "1612186173", "rank": "1659464", "city": "Eugene", "image": "https://images-na.ssl-images-amazon.com/images/I/41CJh7X3ePL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}