{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 44.0505054, "ratings": {"num_ratings": 330, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Another great story by Sellers, the plot flows, and you are caught, wanting answer, and just enjoying a good book. What would be the connection to a young girl, trying to decide to keep her baby or not. The other is a socialite who frequents the bars, till midnight. The detective has his hands full with investigating, the politics, keeping him from the other case. Which is connected to his new love interest. Readers will love this book, as well as the series"}, {"review_sentiment": 5.0, "review_text": "Very good! Looking forward to start reading #4"}, {"review_sentiment": 4.0, "review_text": "Another good read by Sellers, she uses the characters well and brings them along in the series; no big surprises in this edition, maybe next book."}, {"review_sentiment": 4.0, "review_text": "I don't believe anything is perfect so one would seldom see a 5-star out of me, but all of the Detective Jackson books (on book 7 now) are keeping me reading. Great storyline that never falls apart. Enough details of police process without boring me (although I am into details). Only thing that's beginning to stick in my brain is that poor Detective Jackson sure has a lot of troubles in his own family. I'll keep reading cuz I can't stop.  Good read, all of them (so far)."}, {"review_sentiment": 5.0, "review_text": "Wow wow wow 😳I love this series it's never a dull moment! Keeps me on the edge of my seat! Yes on to the next!!!!"}, {"review_sentiment": 4.0, "review_text": "Started off on a slow note but the further into the story the better it got.  Sort of figured out most of it but the ending was a bit if a surprise.  Worth the time for an easy afternoon."}, {"review_sentiment": 5.0, "review_text": "The characters are not super hero's. Just ordinary people doing their jobs of protecting and finding the bad people with extraordinary patience. Super read. Will read this again in the future"}, {"review_sentiment": 5.0, "review_text": "Love this series!!!"}, {"review_sentiment": 5.0, "review_text": "Such intense and fasinating detective JacksonStories."}, {"review_sentiment": 5.0, "review_text": "Love the Jackson series"}]}, "authors": ["L.J. Sellers"], "isbn": "1612186181", "longitude": -123.0950506, "periods": ["2000s", "Recent Releases"], "title": "Thrilled to Death", "word_cloud": "great story plot flow catch want answer enjoy good connection young girl try decide socialite frequents bar till midnight detective hand full investigate politics keep case connect new love interest love well series very good look forward reading good use character well bring series big surprise edition maybe next believe anything perfect keep read story line never fall apart detail police process bore detail only thing begin stick brain poor sure lot trouble family keep read cuss far wow wow love series never dull moment edge seat next start slow note story better get figure end bit surprise worth time easy afternoon character super hero ordinary people job protect find bad people extraordinary patience series such intense fascinate detective jackson stories series", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 3/12 in A Detective Jackson Mystery \r\n\r\nMonday morning, a young mother disappears after a doctor’s appointment.\r\n\r\nMonday evening, a young socialite leaves a risqué lounge after an evening of drinking and never makes it home. Detective Wade Jackson, of Eugene, Oregon’s Violent Crimes Unit, ends up with both cases.\r\n\r\nThe missing mother is Danette Blake, a friend of the family, and all signs indicate she may have fled the pressures of life. But Jackson’s personal search for her must be set aside when Courtney, the socialite with rich, powerful parents, turns up mysteriously dead in a public place. Pressured by the chief of police, Jackson and his team descend into Courtney’s wanton world, uncovering a handful of suspects with disturbing motives.\r\n\r\nAlthough it’s hardly the first time a case has led Jackson into dark territory, the discovery that the two disappearances are connected brings him face-to-face with the last person he expects. And leaves him wondering, where is the other missing woman?", "asin": "1612186181", "rank": "2327474", "city": "Eugene", "image": "https://images-na.ssl-images-amazon.com/images/I/41sF-CJg8yL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}