{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 130, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Good read"}, {"review_sentiment": 3.0, "review_text": "The story in the novel is a bit better than in the movie. However, there are still some issues due to its meandering method. The movie has a more singular focus, which is its strength, thrusting the viewer in the story and conflict more quickly. The novel takes some time to close the loose threads of what happened to Bond in the end of the previous book, as he was presumed dead and shows back up on the scene. However, that takes away time and pages from developing the conflict."}, {"review_sentiment": 5.0, "review_text": "Great book!"}, {"review_sentiment": 3.0, "review_text": "Anyone thinking this book will track closely with the movie of the same name will get a big surprise reading this.  The differences are so monumental that the reader will question if it's the same story.  There aren't enough characters provided by Amazon to list them all; besides I don't want to spoil the story for you, so I'll just say that the story takes place entirely in the Caribbean, not in Asia, and Scaramanga doesn't have a decked out gallery."}, {"review_sentiment": 3.0, "review_text": "The Man with the Golden Gun by Ian Fleming is the 12th novel featuring English Secret Service agent James Bond, 007.  The book was published in 1965 and became an instant best seller.James Bond’s final clash with Ernst Stavro Blofeld in Japan ended badly for both. Blofeld died, Bond was lost to the world for a year until he suddenly turned up in London. Once MI6 confirmed Bond’s identity he is interviewed by M and tries to kill his boss – and fails.MI6 de-programmed Bond and was given a chance to earn his 00 section ranking back. M gives Bond an suicide mission, to go after a Cuban assassin named Francisco “Pistols” Scaramanga, who uses a gold plated .45 Colt.I have always thought the James Bond movie franchise missed the mark with the Blofeld Trilogy (Thunderball, On Her Majesty’s Secret Service. and You Only Live Twice), especially with the third novel. On Her Majesty’s Secret Service was not only a fantastic read, but also one of the best Bond flicks. The plot focused movie followed the outline of the novel, had a marvelous script written by Richard Maibaum and a descent cast.The film has a dedicated following to this day.From some inexplicable reason, Eon Productions decided to make You Only Live Twice before On Her Majesty’s Secret Service and thus bowing out of a tremendous opportunity. Not only for Bond to exact revenge for the killing of his wife, but also to create an enduring trilogy.Instead we got Diamonds are Forever, a mediocre (at best) Bond film, Connery’s last until a few decades later.But what does this have to do with The Man with the Golden Gun by Ian Fleming?Again, the films missed the mark, going back to the age old formula of gadgets and one-liners, instead of focusing of the exciting and sophisticated plot being handed to them by the author.In this novel, Bond is back after MI6 thought he was dead, however he is not the suave spy any longer, but an automaton with different personality. Bond is emotionless, cold and non-sensical. While the film builds Francisco Scaramanga (The Man with the Golden Gun) as a first rate, stone-cold killer, the novel takes the position that he is nothing but a small time crook, who got lucky with his aim.So how do you take an established character, pair him up with a second rate villain yet still make an interesting affair out of it?First, Fleming creates a wide conspiracy where Scaramanga uses his KGB connections to destabilize a region (Jamaica) through industrial sabotage. Second, by allowing this second rate villain to use the drugs trade for political purposes to undermine the West.James Bond, brain washed by the KGB, is sent back to England to assassinate M. But Bond cannot bring himself to kill in the methods of the SS or the KGB, but to do so honorably – The English way.I could not help but feel that Mr. Fleming did not finish this book. It seemed to me half-finished and would not make any sense unless you read The Blofeld Trilogy first. The novel is not unreadable, it is enjoyable for the Bond fans, but it is far from being one of the best in the series. It is neither thrilling nor clever but is just “there”. If anything we learn more about M than any other major character in the series.And M is a small part of the story.This is a mildly entertaining novel, an escape to the Bond universe if you desire, or for the completists who want to read them all."}, {"review_sentiment": 1.0, "review_text": "Book was not as descibed. It arrived in less than good condition.  Was listed for a very good price at a very good condition.  False advertisement."}, {"review_sentiment": 3.0, "review_text": "Fleming's final full length Bond novel. I found it to be my least favorite. Never hit the point where I felt I couldn't put it down. Should have been a short story."}, {"review_sentiment": 4.0, "review_text": "The plot moved a little slow compared to other Bond stories.  It took me longer than usual to finish the book"}, {"review_sentiment": 5.0, "review_text": "love the original stories and comparing to the films"}, {"review_sentiment": 3.0, "review_text": "Typical James Bond Adventure."}]}, "authors": ["Ian Fleming"], "isbn": "1612185576", "longitude": 0.0, "periods": ["1900s"], "title": "The Man with the Golden Gun", "word_cloud": "good story bit better movie however still issue due meander method movie singular focus strength thrust viewer story conflict quickly take time close loose thread happen end previous presume dead show scene however take time page develop conflict great anyone think track closely movie name get big surprise read difference monumental question story enough character provide list want spoil story say story take place entirely deck gallery feature agent publish become instant best final clash end badly die lose world year suddenly turn confirm identity interview try kill give chance earn section rank back give suicide mission go assassin name use gold plat always think movie franchise miss mark only especially third fantastic also best bond flick plot focus movie follow outline marvelous script write descent film dedicate follow inexplicable reason decide only thus bow tremendous opportunity not exact revenge kill wife also create endure get mediocre best bond film last decade film miss mark go back age old formula gadget instead focus excite sophisticated plot hand back think dead however suave spy longer different personality emotionless cold film build first rate killer take position nothing small time crook get lucky establish character pair second rate villain yet still interesting affair create wide conspiracy use connection region industrial sabotage allow second rate villain use drug political purpose undermine brain wash send back assassinate bring method honorably fleming seem sense first unreadable enjoyable bond fan far best series thrill clever anything learn major character small part mildly entertaining escape universe desire completists want describe arrive le good condition list good price good condition advertisement fleming final full length find least favorite hit point felt short story plot move little slow compare story take longer usual finish original story compare film typical", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Bond may have a license to kill, but “Pistols” Scaramanga has a talent for it. He’s a KGB-trained assassin who’s left a trail of dead British Secret Service agents in his wake. His weapon of choice? A gold-plated Colt .45.\r\n\r\nIn the aftermath of his brainwashing by the Soviets, Bond is given one last chance to win back M’s trust: terminate Scaramanga before he strikes MI6 again. Traveling to Jamaica under an assumed name, Bond manages to infiltrate Scaramanga’s organization and soon discovers that the hit man’s criminal ambitions have expanded to include arson, drug smuggling, and industrial sabotage. Worst of all for Bond, Scaramanga has a golden bullet inscribed with the numbers 007—and he’s eager to put it to use.\r\n\r\nUnder the heat of the Caribbean sun, Bond faces a seemingly impossible task: win a duel against the Man with the Golden Gun.", "asin": "1612185576", "rank": "33590", "city": "Jamaica", "image": "https://images-na.ssl-images-amazon.com/images/I/51pX3XxIT8L.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}