{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 50.110653, "ratings": {"num_ratings": 9, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Funny, human, wonderful - and beautifully translated. Jakob Arjouni has done a grand thing - he's created a likeable hero who is uniquely himself - and who doesn't stroke our desires for how a tough private detective should be. Yet he's tremendously entertaining. He reminds me of Sonchai Jitpleecheep in the Bangkok novels of John Burdett - taking us into a world that's entirely foreign, and interesting, and sustaining our interest by being very, very real and noble, likeable, and engaging.I really have to say a special word about the translation. Translator Anthea Bell is just breathtakingly good - the story moves as if it hadn't been translated at all. And Arjouni's writing, while very smooth, isn't easy to translate. (I speak German and have translated nonfiction books - I know what a large and terrific piece of work Bell has done.) What a marvel this translation is - the book stands in English as a beautifully crafted piece of fiction. Anthea Bell perfectly captures the flow of the prose. It's a very comfortable read, with none of those bumps of tone and rhythm that we nearly always see - and feel - in translations of German novels. Brava! Give that woman a raise - better still, hire her to translate other excellent \"Krimis.\""}, {"review_sentiment": 5.0, "review_text": "I liked this one very much. The mystery as such is not overly complicated but the writing (and translation, presumably) is great, the atmosphere convincing and the jokes made by the title character made me laugh out loud a couple of times. All in all, a very enjoyable novel."}, {"review_sentiment": 5.0, "review_text": "I had previously read and enjoyed all of Arjouni's Kayankaya novels in German.  This last one was as good as e rest, even in English.  Kayanka is a wiseass private eye who would get beat up less if he sensored himself more.  But then he wouldn't be so fun to read about.  Arjouni has also written other good novels that are not mysteries.  Unfortunately, I learned from the back of the book that he died recently of cancer at the age of 48.  That's a real shame."}, {"review_sentiment": 1.0, "review_text": "A book with too much violence, too mush filthy language and description of filthy habits. Sorry, but I couldn't make it through this book and am also sorry that I purchased One Man , One Murder plus Happy Birthday Turk at the same time. They all went into the symphony book sale box. I hope some one likes them"}, {"review_sentiment": 5.0, "review_text": "I'm sure, like many crime fiction fans, the announcement of the tragically early death of Jakob Arjouni this year was a source of sadness to us all. I have derived a great deal of reading pleasure from Arjouni's wonderful Kemal Kayankaya series, featuring this unconventional, straight-talking and supremely witty Turkish private investigator, formed from the same clay as the stalwarts of the hard-boiled crime tradition. So it is now with some sadness that I now review the last of the series, Brother Kemal...Tasked with finding the errant daughter of femme fatale Valerie de Chavannes, Kayankaya is drawn into a devilish plot of murder, rape and abduction, which places our hero under the gaze of the police as a murderer himself. Kayankaya is also hired to offer protection to an author under the threat of religious fanatics at the Frankfurt Book Fair, and sure enough his two cases become entwined with dangerous results. Although a slim read, I found the linking of the plots a balanced affair, with the build-up of tension lightened by Kayankaya's involvement with the publishing fraternity and the humour this produces, a good counterbalance to the sinister and murderous abduction plot at the opening of the book. In the grand tradition of hardboiled noir, Kayankaya presents himself in the same world weary sense as some of the most recognisable protagonists from the pages of Chandler and Hammett, and I adore Arjouni's depiction of him absorbing and dealing succinctly with the casual racism that his Turkish heritage raises in others. Once again, the book is suffused with some brilliant comical interludes, and speaking as someone who is not a fan of `comic'; crime per se, I would draw comparisons with the dark sardonic wit of the late, great Pascal Garnier in some of the moments of levity which to me lost nothing in translation. Also having some personal knowledge of the publishing world myself, I found the depiction of this within the book fair setting, particularly knowing and pitch perfect in its rendition. If you have not encountered this brilliant series before, I would urge you to seek them out, and experience the wonderful world of Kayankaya for yourselves in these perfect little packages of exceptional crime writing."}, {"review_sentiment": 4.0, "review_text": "I enjoyed the characterization, and a new setting for a detective novel in my reading, but found the plot a bit unconvincing. Overall the novel was competently translated."}, {"review_sentiment": 4.0, "review_text": "This is the first I have read of this author. I assume it was originally written in German but unlike many it has been well translated and successfully maintains the characters and atmosphere.Very enjoyable."}, {"review_sentiment": 2.0, "review_text": "The writing is clunky, maybe the result of poor translation, and the characters don't come into any kind of recognizable focus."}, {"review_sentiment": 5.0, "review_text": "It is refreshing to find a crime writer that is full off surprises and not full of crime novel cliches.  Kemal is a wonderful, witty character."}]}, "authors": ["Jakob Arjouni"], "isbn": "1612192750", "longitude": 8.682093, "periods": ["2000s", "Recent Releases"], "title": "Brother Kemal", "word_cloud": "human wonderful beautifully translate do grand thing create likable hero uniquely stroke desire tough private detective tremendously entertain remind songhai novel take world entirely foreign interesting sustain interest real noble likable really say special word translation breathtakingly good story move translate write smooth easy translate speak german translate nonfiction know large terrific piece work do marvel translation stand english beautifully craft piece fiction perfectly capture flow comfortable none bump tone rhythm nearly always feel translation german novel woman better still translate excellent like much mystery overly complicate write translation presumably great atmosphere convince joke make title character make laugh loud couple time enjoyable previously enjoy novel last good e even wise ass private eye beat le censored also write good novel mystery unfortunately learn back die recently cancer age real shame much violence mush filthy language description filthy habit also sorry purchase happy time go symphony sale box hope like sure many crime fiction fan announcement tragically early death year source sadness derive great deal reading pleasure wonderful series feature unconventional supremely witty turkish private investigator form clay stalwart crime tradition sadness review last series find errant daughter lemme fatal drawn devilish plot murder rape abduction place hero gaze police murderer also hire offer protection author threat religious fanatic sure enough case become entwined dangerous result slim find link plot balance affair tension lighten involvement publishing fraternity humor produce good counterbalance sinister murderous abduction plot opening grand tradition hard boiled nor present world weary sense recognizable protagonist page adore arjuna depiction absorb deal succinctly casual racism heritage raise others once suffuse brilliant comical interlude speak someone fan crime se comparison sardonic wit late great moment levity lose nothing translation also personal knowledge publishing world find depiction fair set particularly know pitch perfect rendition encounter brilliant series seek experience wonderful world perfect little package exceptional crime writing enjoy characterization new set detective reading find plot bit unconvincing competently translate first author assume originally write many well translate successfully maintain character enjoyable write clunky maybe result poor translation character come kind recognizable focus refresh crime writer full surprise full crime cliche wonderful witty character", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 5/5 in A Kayankaya Mystery \r\n\r\nValerie de Chavannes, a financier's daughter, summons private investigator Kemal Kayankaya to her villa in Frankfurt's diplomatic quarter and commissions him to find her missing sixteen-year-old daughter Marieke. She is alleged to be with an older man who is posing as an artist. To Kayankaya, it seems like a simple case: an upper class girl with a thirst for adventure. \r\n\r\nThen another case turns up: The Maier Publishing House believes it needs to protect author Malik Rashid from attacks by religious fanatics at the Frankfurt Book Fair. \r\n\r\nRashid has written a novel about, amongst other things, attitudes towards homosexuality in an Arabic country. Kayankaya is hired to be Rashid's bodyguard for three days. The two cases seem to be straightforward, but together they lead to murder, rape and abduction, and even Kayankaya comes under suspicion of being a contract killer for hire.\r\n\r\n\"Sets a high standard for the crime novel as the best of modern literature.\" The Independent ", "asin": "1612192750", "rank": "828735", "city": "Frankfurt", "image": "https://images-na.ssl-images-amazon.com/images/I/41t8Ih5MSIL.jpg", "country": "Germany", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}