{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 44.0505054, "ratings": {"num_ratings": 835, "rating": 4.2, "reviews": [{"review_sentiment": 2.0, "review_text": "Not the best book I have read."}, {"review_sentiment": 5.0, "review_text": "A gripping thriller, and a good plot, that has you turning pages, as more involved the case gets. A teen club thru a church, yet girls are turning up murdered. Belonging to the church is a bomber, wanting to do away with the person and the clinic for an abortion. Could of done without the messages when she got on line of what these teens posted. She writes a tight compelling story and readers will definitely like this book and the series."}, {"review_sentiment": 5.0, "review_text": "fast moving with a good story."}, {"review_sentiment": 5.0, "review_text": "Love Love Detective Jackson Mysterys Fast reading"}, {"review_sentiment": 5.0, "review_text": "Intriging as usual really enjoy this author"}, {"review_sentiment": 4.0, "review_text": "I would recommend this book to people who like detective/ police stories with a twist & a little romance too....!"}, {"review_sentiment": 4.0, "review_text": "I'm on book 7 of the Detective Jackson mystery series. The fact that I'm on book 7 should tell the thinking people out there that clearly, L.J. Sellers knows how to write a good mystery. Lots of details, love, and loss. I can kind of tell the writer might be a republican...there are a couple comments she wrote in that are probably a definition of Detective Jackson's narrow-minded side, but I like him so far."}, {"review_sentiment": 4.0, "review_text": "Author L.J. Sellers would have been hard pressed to come up with a more provocative title than “The Sex Club” for the first book in her mystery series involving Detective Wade Jackson of the Eugene, OR, police department. however, despite the title and some equally provocative subject matter, the book is a solid, compelling procedural very reminiscent of the TV series “Law and Order,” on which sensational crimes were solved every week by the tried-and-true methods of solid police work.The titular club is a former Bible study group for middle-school students from strong religious backgrounds that somehow morphed into a convenient method of arranging illicit get togethers. When a 13-year-old girl’s nude body is found in a dumpster, Jackson winds up investigating the murder, and uncovers a number of suspects, including the mayor of Eugene, who kept a secret apartment close to the location where the body was discovered. In the meantime, other members of Jackson’s department investigate a related crime, a bombing at an abortion clinic that resulted in a patient’s death. The bomber is an anti-abortion zealot whose daughter happens to be a member of the club.Sellers does an excellent job of keeping several storylines going at once and alternating chapters between the points of view of several different characters. The book is never difficult to follow and by revealing the identity of one killer early while keeping the other one a mystery, the author combines the elements of the traditional whodunit with a well-written suspense tale, as the bomber plots some additional violence against some of the book’s other main characters. Jackson and his fellow detectives investigate the cases the old fashioned way, by interviewing possible suspects and gathering evidence, and, in Sellers’ hands, their work never gets boring for the reader.I especially enjoyed the setting of “The Sex Club.” Most mysteries seem to be set either in big cities with dozens of cops and lots of technical and forensic support or, on the other hand, small towns or rural settings where the main character is practically a one-man (or woman) show. Eugene (population about 150,000) is large enough to have a detective squad (and a sizable suspect pool), but small enough that Jackson can interact with the rest of the detectives. I especially enjoyed the description of the difficulties Jackson encountered in getting DNA testing, something that seems to get done in minutes on TV but, in this book, required him to drive to Portland and deliver the samples and other evidence personally.Because “The Sex Club” is the first book in the Jackson series, readers don’t know as much about him as they learn later, but he and a couple of the other characters who become series regulars are fairly well developed, with credible personal lives and problems. Jackson’s daughter is a classmate of the dead girl and some of the other members of the club and had herself been a part of the original Bible study class. After Jackson finds out, the relationship between father and daughter becomes very believably strained at times.Author Sellers does fall back on a couple of clichéd plot devices in “The Sex Club,” however. Most notably, since the investigation seems to implicate the mayor, Jackson has to wade his way through political roadblocks and his rather cartoonish superior who keeps insisting Jackson is wrong and threatens to fire him. This plot device has been beaten to death in far too many similar stories and gets rather tiresome here. In addition, Sellers makes her political views fairly obvious in this book, and “The Sex Club” comes close at times to annoying proselytizing, but she never lets the story get too bogged down in political chest thumping.“The Sex Club” isn’t quite at the same level as some of the later Jackson books I’ve read, which I think is more to the credit of Sellers’ development as a writer than an indictment of the current book. In any event, the novel is topical (even though written about five years ago) and a page turning mystery. Some readers may well find the subject matter distasteful, although the material is not graphic. For other mystery fans, however, “The Sex Club” is a good introduction to an enjoyable series."}, {"review_sentiment": 5.0, "review_text": "This was my first book by the Author! This story kept me on my toes. Pretty good and had some jaw dropping moments....on to the next Book 📚"}, {"review_sentiment": 5.0, "review_text": "This book had me hanging on every word written. It was mentally engaging and very emotional. I've started this Jackson series and can't wait to finish all of them. Well done, LJ. S!"}]}, "authors": ["L.J. Sellers"], "isbn": "1612186165", "longitude": -123.0950506, "periods": ["2000s", "Recent Releases"], "title": "The Sex Club", "word_cloud": "not best gripping thriller good plot turn page involve case get teen thru church yet girl turning murder church bomber want away person clinic abortion do message get line teen post write tight compel story reader definitely series fast move good story reading intrigue usual really author people police story twist little romance detective mystery series fact tell think people clearly know write good mystery detail love loss kind tell writer couple comment write probably definition side like far author seller pressed provocative title first mystery series involve police department however title equally provocative subject matter solid compel procedural reminiscent tv series sensational crime solve week method solid police titular former study group student strong religious background somehow morph convenient method arrange illicit get together girl nude body find dumpster wind investigate murder uncovers number suspect include mayor keep secret apartment close location body discover meantime member department investigate relate crime bomb abortion clinic result patient death bomber zealot daughter happen member excellent job keep several story lines go alternate chapter point view several different character never difficult follow revealing identity killer early keep mystery author combine element traditional whodunit suspense tale bomber plot additional violence main character fellow detective investigate case old fashioned way interview possible suspect gather evidence hand work never get boring especially enjoy set mystery seem set either big city dozens cop lot technical forensic support hand small town rural setting main character practically woman population large enough detective squad sizable suspect pool small enough interact rest detective especially enjoy description difficulty encounter get test something seem get do minute tv require drive deliver sample evidence first series reader know much learn later couple character become series regular fairly well developed credible personal life problem daughter classmate dead girl member part original study class find relationship father daughter become believably strained fall back couple cliched plot device however most notably investigation seem implicate mayor wade way political roadblock rather cartoonist superior keep insist wrong threatens fire plot device beat death far many similar story get rather tiresome addition seller make political view fairly obvious come close time annoy proselytize never let story bogged political chest quite level later think credit development writer indictment current event topical even write year ago page turn mystery reader well subject matter distasteful material graphic mystery fan however good introduction enjoyable series first author story keep toe pretty good jaw drop moment hanging word write mentally engage emotional start series finish do", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 1/12 in A Detective Jackson Mystery \r\n\r\nAs a nurse and youth counselor at Eugene, Oregon’s Planned Parenthood clinic, Kera Kollmorgan has endured her share of harassment from fanatical abortion foes. But it only strengthens her resolve. Then a bomb blast rips through the clinic and, soon after, a teenage girl Kera recently treated is found naked and murdered in a dumpster. Kera fears the bitter abortion war in her small community has reached a terrifying new level. \r\n\r\nThe sexualized killing of Jessie Davenport hits close to home for Detective Wade Jackson. Raising his teenage daughter alone, he understands better than anyone the predatory world that threatens young women. But he never expects his grim investigation will lead to a teenage Bible-study club, the dark underside of high school life, and even the halls of political power. Now he must confront two shockingly different suspects with nothing in common—except a taste for sex and violence. \r\n\r\nAs Jackson’s manhunt intensifies, Kera becomes a marked woman, stalked by a crazed crusader. And when the fates of the detective and nurse intersect, a world of righteous rage, sexual secrecy, and chilling obsession threatens to blow them apart.", "asin": "1612186165", "rank": "1578440", "city": "Eugene", "image": "https://images-na.ssl-images-amazon.com/images/I/41AO5blqUpL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}