{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 339, "rating": 4.1, "reviews": [{"review_sentiment": 3.0, "review_text": "Wold be getting five stars for spy novel were it not for the dated racist vocabulary.  So very much so to my great shock."}, {"review_sentiment": 4.0, "review_text": "This is the second James Bond Novel authored by Ian Fleming.  James Bond comes to America, Harlem, then Florida, then Jamaica.  It is a decent spy action thriller.  I have never been a very big fan of James Bond movies, but this novel seems, pretty much like a literary version of a James Bond film.The book was written by a British author in 1954.  Coincidentally, 1954 is the same year of the historic United States Supreme Court Decision \"Brown versus Board of Education\".  So what?  The modern Civil Rights movement was just gaining traction in America.  This novel is more consistent with the pre modern Civil Rights viewpoint.  James Bond, as a white person, does battle with American black organized criminals.  There is a LOT of dated ethnic nomenclature and stereotyping that could offend some readers.  I do not believe in censorship or rewriting of novels such as this.  I actually find a novel such as this provides much fuel for inner contemplation.  Just be advised there is a lot of ethnic references in this novel.Personally, the above observation aside, I think this is a somewhat better written novel than the first James Bond novel, \"Casino Royale\".  There is a lot of descriptive narrative that I felt was more sophisticated than the prior novel.  This novel can be read without having read the first novel.  There is one character, an American, Felix Leiter, who makes an appearance in this novel, who had also been in the first novel.  Obviously, \"M\" and  Miss Moneypenny are ongoing characters.When I was a youth growing up in America in the 1950s and 1960s, I was not allowed to read James Bond novels.  I had friends of my age who did read them.  All they talked about was the sexual aspects of these novels.  By today's standards, I do not find these novels are not to be particularly salacious.  But as a parent and grandparent, I would be very careful about allowing a child or grandchild to read these novels.In summary, I am glad I read this novel, I liked it, but did not love it,  I would not read it again without good cause.  Thank You..."}, {"review_sentiment": 5.0, "review_text": "the blurbs had it right, of course. You won’t want to put it down. I’m just glad I knew he’d make it through."}, {"review_sentiment": 3.0, "review_text": "Was contrived and hard to follow the storyline. Just glad that my recall of the film version was intact."}, {"review_sentiment": 5.0, "review_text": "The book was quite different than the movie. Which actually made me enjoy it more. It had some exciting parts where Bond is in imminent danger. Just think Barracuda, sharks, and blood in the water."}, {"review_sentiment": 4.0, "review_text": "Not like the live and let die movie at all excepting the main characters. More like for your eyes only at the end. good anyway."}, {"review_sentiment": 1.0, "review_text": "What did I just buy?!?!?  Sometimes Amazon is too big for it's own good. Here I am trying to buy a book and somehow I ended up with a bizzare edition of a classic spy novel.  It is called \"Live And Let Die (Spanish Edition)\", yet it's an e-book in English.  Also it seem to be an extremely edited version and not the original (some words changed either due to translation or political correctness ?).the worst part of it is Amazon is TOO LAZY to even put in a decent description.  The only good thing is it was only 99 cents, but on the other hand it's 99 cents into the trash.Buying ebooks on Amazon ... Amazon! should not be such a confusing task,"}, {"review_sentiment": 3.0, "review_text": "Lots of great scenes from other movies. I know movies , Bond especially, usually stray from their novel counterparts. The framework was there, but I was pulled into other movies while reading the book. It was hard to stay involved with this novel."}, {"review_sentiment": 5.0, "review_text": "Revisiting a James Bond novel written in the 60's, was thoroughly entertaining. A well written and suspenseful thriller that builds up to a well conceived climax. The context of the 1960's made it even more intriguing and nostalgic!"}, {"review_sentiment": 4.0, "review_text": "Enjoyed it a lot!"}]}, "authors": ["Ian Fleming"], "isbn": "1612185444", "longitude": 0.0, "periods": ["1900s"], "title": "Live and Let Die (James Bond)", "word_cloud": "get star spy date racist vocabulary so much great shock second author come decent spy action thriller never big fan movie seem pretty much literary version write author year historic modern movement gain traction consistent per modern viewpoint white person battle american black organize criminal date ethnic nomenclature stereotyping reader believe censorship rewrite novel actually find provide much fuel inner contemplation advise lot ethnic reference observation aside think somewhat better write first lot descriptive narrative felt sophisticated prior first character american make appearance also first obviously ongoing youth grow allow novel friends age talk sexual aspect novel today standard find novel particularly salacious parent grandparent allow child grandchild summary glad like love good cause blurb right course want put glad know contrive hard follow story line glad recall film version intact quite different movie actually make excite part imminent danger shark blood water not movie except main character more eye end good anyway buy sometimes big good here try somehow end bizarre edition classic spy call yet also seem extremely edited version original word change either due translation political correctness worst part even put decent description good thing cent hand cent book confuse task great scene movie know movie especially usually stray counterparts framework pull movie read hard stay involve revisit write thoroughly entertain well write suspenseful thriller build well conceive climax context make even intriguing nostalgic lot", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "James Bond is not a superstitious man, but it’s hard not to feel unnerved in the presence of Mr. Big. A ruthless Harlem gangster who uses voodoo to control his criminal empire, he’s also one of SMERSH’s top American operatives. Mr. Big has been smuggling British pirate treasure to New York from a remote Jamaican island—and funneling the proceeds to Moscow. With help from Solitaire, Mr. Big’s beautiful and enigmatic Creole fortune-teller, and his old friend Felix Leiter, 007 must locate the crime lord’s hideout, sabotage his operation, and reclaim the pirate hoard for England.\r\n\r\nFrom the jazz joints of Harlem to the shark-infested waters of the Florida Everglades, Live and Let Die sends Bond headlong into the exotic.", "asin": "1612185444", "rank": "25700", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/6116pt72K4L.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}