{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 189, "rating": 3.7, "reviews": [{"review_sentiment": 1.0, "review_text": "Horrifically depressing.  Synopsis should have stated the graphic nature of the content.  The writing however was well done."}, {"review_sentiment": 4.0, "review_text": "A sad tale that unfortunately has a great deal of truth."}, {"review_sentiment": 5.0, "review_text": "The book is written in a beautiful, flowing style. It is engagingly descriptive.  While it makes for a quick read, it also prompts the reader to reflect upon the story as a whole, to understand the symbolic relationships of present to the past.The quality of the book makes me want to look for other stories by this author."}, {"review_sentiment": 5.0, "review_text": "Very interesting being a boomer and living through the time, friends being in Nam. Was nice to see how regular people lived and went on."}, {"review_sentiment": 3.0, "review_text": "A bit better than mediocre.  Good from a historical point of view.  I. Enjoyed the book since I grew up during the Vietnam conflict era and have Vietnamese friends."}, {"review_sentiment": 4.0, "review_text": "Unusual book.  Different way to learn about another country and a cmpelling look at the u told tragdy of war."}, {"review_sentiment": 3.0, "review_text": "Interesting story."}, {"review_sentiment": 4.0, "review_text": "Interesting read leading to my travels to Vietnam."}, {"review_sentiment": 2.0, "review_text": "Not quite what I expected for an ending. Somewhat disappointing."}, {"review_sentiment": 5.0, "review_text": "I enjoyed the authors descriptions of life in Vietnam and the lives of the boat people. I would love to see her flesh out the characters and bring them to life before our eyes. I found myself yearning to read more at the end of this novella."}]}, "authors": ["Uyen Nicole Duong"], "isbn": "1612180183", "longitude": 0.0, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Postcards from Nam", "word_cloud": "horrifically depress state graphic nature content writing however well do sad tale unfortunately great deal truth write beautiful flow style engagingly descriptive make quick also prompt reflect story whole understand symbolic relationship present quality make want look story author very interesting boomer living time friend nice see regular people live go bit better mediocre good historical point view enjoy grow conflict era vietnamese friend unusual way learn country compel look u tell tragedy war interest story interest lead travel not quite expect end disappointing enjoy author description life live boat people flesh character bring life eye find yearn end novella", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Award-Winning Finalist in the Fiction: Multicultural category of the 2012 International Book Awards\r\n\r\nMimi (the protagonist of Mimi and Her Mirror) is a successful young Vietnamese immigrant practicing law in Washington, D.C. when the postcards begin to arrive. \r\n\r\nPostmarked from Thailand, each hand-drawn card is beautifully rendered and signed simply \"Nam.\" Mimi doesn't recognize the name, but Nam obviously knows her well, spurring her to launch what will become a decade-long quest to find him. As her search progresses, long-repressed memories begin to bubble to the surface: her childhood in 1970s Vietnam in a small alley in pre-Communist Saigon. \r\n\r\nBack then, who was her best friend as well as her brother's playmate, and what did art have anything to do with the alleys of her childhood? What was the dream of these children then? What happened when these children were separated by the end of the Vietnam war, their lives diverged onto different paths: one to freedom and opportunity, the other to tragedy and pain? \r\n\r\nNow Mimi must uncover the mystery of the postcards, including what might have happened to the people who where less fortunate: those who escaped the ravaged homeland by boat after the fall of Saigon. When the mystery is solved, Mimi has to make a resolution: what can possibly reunite the children from the alley of her childhood even when the alley exists no more?", "asin": "1612180183", "rank": "2375048", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/51JUNafqoCL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}