{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 107, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "This book is a classic. The only bad thing is that it's still pertinent today."}, {"review_sentiment": 5.0, "review_text": "A classic that rings as true today as when it was written.  You have to keep reminding yourself that this a work of fiction.  I recommend not only this novel but also the others in the series."}, {"review_sentiment": 3.0, "review_text": "I find it difficult to give this book a single grade. The prose is clear and well written, but not exceptional. The plotting moves along with twists and turns, but fails to convince me at key points. First, when Anderson meets his lover in Honolulu, he succumbs more quickly than I would expect of a Mormon. Second, the passage of the photograph from hand to hand in the fashion described requires too many timely coincidences. Third, Cooley’s discovery of James Morton’s identity is another stretch. It seems to me that all three of these situations could have been handled more believably with more work on the part of the author. For me, the book went dead from the half-way point to about page 500. Then it picked up again. Drury made the mistake of projecting history and technology on a short historical line when he had the Russians arriving on the moon based on the launching of Sputnik. Adding the president’s two terms to the Eisenhower administration (which Drury identifies) and the next election one year away, the book takes place in 1967. This approximates the Russians actual attempted moon landing correctly with their goals, but its projected success is, of course, completely wrong as they have never achieved a successful manned landing, ever. My final criticism is that he telegraphs the Leffingwell’s fate too soon and spoils a chance for suspense. In the end, I feel its saving grace is as a political exposé, but one that could have been done in maybe 450 pages."}, {"review_sentiment": 5.0, "review_text": "I found this book captivating but not surprising. I have always felt that our government; from the smallest city government to the nation's capitol, works on bargaining, cajoling, favors owed and paid, compromise. In the 2017 year it should be required reading for our elected officials. On to book 2!"}, {"review_sentiment": 5.0, "review_text": "So, there are good guys and bad guys.  After about 200 pages it is impossible to know which are really the good guys and the bad guys.  After 200 more the original bad guys are really the good guys.  Maybe!"}, {"review_sentiment": 5.0, "review_text": "Great Read for History Buffs, even though it is not \"history\". The mood of the era comes thru."}, {"review_sentiment": 5.0, "review_text": "Very appropriate book for now even itWas written in 1959"}, {"review_sentiment": 5.0, "review_text": "Exactly what I wanted."}, {"review_sentiment": 5.0, "review_text": "A must read."}, {"review_sentiment": 2.0, "review_text": "Full disclosure: I gave up on it simply because I did not want to devote my time to writing that read like a transcript. I recall enjoying the film so that will suffice. Too many other books on my reading list.I assume the tale provides one with a fairly accurate view as to how the sausage gets made. On the other hand, I would imagine the Senate looks a lot different today than it did in the 1950s."}]}, "authors": ["Allen Drury"], "isbn": "1614750785", "longitude": -77.0366456, "periods": ["1900s"], "title": "Advise and Consent", "word_cloud": "classic bad thing still pertinent today classic ring true today write keep remind work fiction recommend also others series find difficult give single grade prose clear well write exceptional plot move twist turn fails convince key point meet lover succumb quickly passage photograph hand hand fashion describe require many timely coincidence discovery identity stretch seem situation believably part author go dead point page then pick make mistake project history technology short historical line arrive moon base launch president term administration identifies election year away take place approximate actual attempt moon land correctly goal project success course completely wrong never achieve successful man land ever final criticism telegraph fate soon spoil chance suspense end feel save grace political expo do maybe page find captivate surprising always felt government smallest city government nation capitol work bargain cajole favor owe pay compromise year require reading elect official so good guy bad guy page impossible know really good guy bad guy original bad guy really good guy maybe great even history mood era come very appropriate even it was write exactly want disclosure give simply want devote time write transcript recall enjoy film suffice many reading assume tale provide fairly accurate view sausage get make hand look lot different today", "genres": ["Fiction & Literature", "Politics"], "summary": "The #1 New York Times bestseller and Pulitzer Prize winner\r\n\r\nAllen Drury’s Advise and Consent is one of the high points of 20th Century literature, a seminal work of political fiction—as relevant today as when it was first published. A sweeping tale of corruption and ambition cuts across the landscape of Washington, DC, with the breadth and realism that only an astute observer and insider can convey.\r\n\r\nAllen Drury has penetrated the world’s stormiest political battleground—the smoke-filled committee rooms of the United States Senate—to reveal the bitter conflicts set in motion when the President calls upon the Senate to confirm his controversial choice for Secretary of State. This novel is a true epic showing in fascinating detail the minds and motives of the statesmen, the opportunists, the idealists.\r\n\r\nFrom a Senate old-timer’s wily maneuvers, a vicious demagogue’s blistering smear campaign, the ugly personal jealousies that turn a highly qualified candidate into a public spectacle, to the tragic martyrdom of a presidential aspirant who refuses to sacrifice his principles for his career—never has there been a more revealing picture of Washington’s intricate political, diplomatic, and social worlds. Advise and Consent is a timeless story with clear echoes of today’s headlines.\r\n\r\nIncludes Allen Drury’s never-before-published original preface to Advise and Consent, his essay for the Hoover Institution on the writing of the book, as well as poignant personal memoirs from Drury’s heirs.", "asin": "1614750785", "rank": "910401", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51hub%2B%2B-QGL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}