{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 48, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Darko Dawson, the detective, is working again in Ghana. His work this time involves the brutal murder of a husband and wife, the Smith-Aidoos and a man. I congratulate Kwei Quartey for handling such a brutal incident in a gentle way. He didn't throw it all in your face until you felt sick. Murder At Cape Three Points is about environmental issues involving oil and the development of beachfront property. There are also family disputes gone haywire between brothers and sisters and perhaps, a love affair. It's not easy to discover the solution to the crime. There are too many people who have a reason to kill.The mystery does start off slowly. Then, it gathers speed. I found myself wanting to just get the answers from the people like the doctor, the servants and a pharmacist, Abraham, etc. I won't mention the name of the characters. The names in Kwei Quartey's novels are always hard for me to remember. There is a name chart at the beginning of the novel. However, I need a pronunciation chart as well.I especially liked this novel in the series because Dawson, the detective, seems more human. He spends more time with his wife, Christine and the children, Hosiah and Sly. I look forward to reading another African mystery."}, {"review_sentiment": 5.0, "review_text": "Love the writing of Kwei Quaratey and I'm looking forward to more Dark Dawson mysteries."}, {"review_sentiment": 5.0, "review_text": "My daughter and I listened to the audio book during a road trip.  We were so immersed in the story that we hardly said a word while listening to the book.  We liked learning about Ghana as well.  The story pulled us right in.  Highly recommend the book."}, {"review_sentiment": 4.0, "review_text": "I'm glad I discovered this Ghanian writer (even though he currently lives in California and is a practicing doctor.)  He brings the local flavor and ambience of Ghana alive.  It seems that I am there, and there is rich character development.  Sometimes delightful, often disturbing narrative."}, {"review_sentiment": 5.0, "review_text": "I really enjoyed the exotic setting of this book and the well-drawn character of Darko Dawson. Very well plotted and executed."}, {"review_sentiment": 4.0, "review_text": "All in all a fairly satisfying mystery set in a culture and place quite different from the developed western world. Worth the read."}, {"review_sentiment": 5.0, "review_text": "different type of locale"}, {"review_sentiment": 5.0, "review_text": "Great story.  I have read a number of his books and enjoyed them all."}, {"review_sentiment": 5.0, "review_text": "Juju is one possibility explaining why two bodies are found in a canoe, adrift by a deep-sea oil rig -- the man gruesomely decapitated. The set-up suggests ritual sacrifice. Then again, the proximity of the oil rig suggests a possible connection with Ghana's oil industry.Darko Dawson is sent to Takoradi to investigate. His junior partner is Philip Chikata, the boss's nephew, and Darko is charged with mentoring him. This bit of nepotism gives rise to some humorous moments.The Darko Dawson mysteries are delightful in many ways. Darko is an attractive character, a levelheaded and thorough investigator and a devoted family man. He plays the Ghanaian mbira for relaxation (and to help him resist marijuana). He's also a synesthete, and this weird neurological condition gives him a sensation in his left hand when someone's lying.  He keeps quiet about this so that people won't accuse him of witchcraft!The case is complicated. Dawson has to investigate both the oil industry and the members of the primary victim's family. Family relations are important in Ghana, and this particular family has a turbulent history of murder, madness, suicide, marital infidelities, and family feuds.I'll confess I never managed to keep all the family members straight, despite the family tree provided (in very small type). This is not always an easy investigation to follow, but I enjoyed trying. And Ghana, with its power cuts, water shortages, juju men, exotic foods, and strong family ties, is vividly represented.All the Darko Dawson mysteries are terrific. I just hope they keep coming."}, {"review_sentiment": 5.0, "review_text": "i look forward to each book.African mysteries are certainly an emerging genre.still the seminal one is ZULU by Carly Phillips."}]}, "authors": ["Kwei Quartey"], "isbn": "1616954833", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Murder at Cape Three Points", "word_cloud": "detective work work time involve brutal husband wife man congratulate handle brutal incident gentle way throw face felt sick environmental issue involve oil development beachfront property also family dispute go haywire brother sister perhaps love affair easy discover solution crime many people reason mystery start slowly then gather speed find want get answer people doctor servant pharmacist etc name character name novel always hard name chart begin however need pronunciation chart especially liked series detective seem human spend time wife child look forward read african mystery write look forward mystery daughter listen audio road trip immerse story hardly say word listening like learn well story pull right recommend glad discover ghanaian writer even currently live practice doctor bring local flavor ambiance alive seem rich character development sometimes delightful often disturb narrative really enjoy exotic setting character well plot execute fairly satisfying mystery set culture place quite different develop western world different type locale story number enjoy possibility explain body find canoe adrift oil rig man gruesomely decapitate suggests ritual sacrifice then proximity oil rig suggest possible connection oil send junior partner bos nephew charge mentor bit nepotism give rise humorous mystery delightful many way attractive character levelheaded thorough investigator devote family man play ghanaian mira relaxation help marijuana also synesthete weird neurological condition give sensation leave hand someone lying keep quiet people case complicate investigate oil industry member primary victim family relation important particular family turbulent history madness suicide marital infidelity family confess never manage keep family member straight family tree provide small type always easy investigation follow enjoy try power cut water shortage jujube men exotic food strong family tie vividly mystery terrific hope come forward mystery certainly emerge seminal", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Inspector Darko Dawson Mysteries\r\n\r\nAt Cape Three Points on the beautiful Ghanaian coast, a canoe washes up at an oil rig site. The two bodies in the canoe - who turn out to be a prominent, wealthy, middle-aged married couple - have obviously been murdered. DI Darko Dawson of the Accra police force is sent out to investigate. \r\n\r\nThree Points has long been inhabited by tribal villages, but real estate entrepreneurs and wealthy oil companies have been trying to bribe the tribes to move out. Dawson roots out a host of motives for murder, ranging from personal vendettas to corporate conspiracies.\r\n\r\n\"An absolute gem of a first novel and the sort of book that will delight not only hard-core mystery fans, but also those who visit the genre only casually in search of an occasional literary entertainment.... \"Wife of the Gods\" undoubtedly will be compared with Alexander McCall Smith's phenomenally successful \"No. 1 Ladies' Detective Agency\" series, but Quartey's debut is--to this reader, at least--a far richer and more sophisticated experience.\" Los Angeles Times", "asin": "1616954833", "rank": "1229331", "city": "Ghana", "image": "https://images-na.ssl-images-amazon.com/images/I/51hOBtUSwGL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}