{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 45.5202471, "ratings": {"num_ratings": 483, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "Could not relate to this novel, though I too come from a mixed background, set at a similar time. It is a deep one, nevertheless, but highly depressing. Felt that the lead character had alternate opportunities that could have been taken, but got bogged down. Too many addictions , pulling the characters down."}, {"review_sentiment": 3.0, "review_text": "This is the debut novel of Heidi W. Durrow and highlights characters who all struggle to make sense of a world they don't belong in, racially or economically. The topic of this novel is extremely pertinent to our times, particularly with Rachel's struggles with negotiating race as a biracial person and having to categorize life along racial lines.Rachel's struggles with race, upon living with her grandmother in the U.S., highlights how racialized American society is. Not that Rachel did not experience racism when she lived abroad, but it was racism with the same name and a different face. Racism is intertwined into the histories of countries in different ways and so it doesn't always look the same. Doesn't mean that it doesn't exist, just means that you have to be aware that it might manifest itself in different forms. The story within itself is very much left up to the reader to discern. There is a lot of ambiguity in the plot, and it is up to the reader to decipher it. It is a slow-paced book, the writing is not dramatized. It is a mellow style of writing that leaves a lot for the imagination. The central theme of the book is that of identity; it is a story of searching for the north star that will help you navigate in a society that sees only what is skin-deep. It is a coming of age novel, mixed in with the mysteries that life bring. What would drive a mom to throw herself and her kids off a roof?  Although this book has garnered a lot of attention, I was not enamored with the writing style or the plot. It is a good read, but the ambiguity present throughout the book did not appeal to me. In addition, I was not able to connect with Rachel (main character). The other characters of the book were much more interesting, particularly, Jamie/Brick. Nevertheless, this book is an essential biracial narrative as more and more individuals find themselves identifying as such. It is crucial that individuals like Heidi Durrow, who has such a unique upbringing and background, share her story with others for it always helps to know that you are not the only one out there. \"I'm not the color of my skin. I'm a story. One with a past and a future unwritten.” ― Heidi W. Durrow"}, {"review_sentiment": 4.0, "review_text": "A leisurely told story of a biracial girl's long journey of self re-integration after falling from a 10 story building along with her mother and two siblings. This central trauma propels the narrative by fits and starts, as the girl slowly recovers as much as she can with the help and hindrance of her remaining family and other broken people who surround her."}, {"review_sentiment": 3.0, "review_text": "I thought this book told a very thought provoking story with many different facets to it. I think especially in today's climate of racial tension, stories like this are important to read because they let you see the world from a different point of view. It was a pretty easy read but there is some heavy material that can sometimes feel quite depressing. Definitely a book to be read, but not a happy beach read."}, {"review_sentiment": 5.0, "review_text": "Easy reading, captivating. They work on birracial issues and personal struggles ppl usually go thru. Picked up expecting not much, but it turned out to be an amazing book! Highly recommend!"}, {"review_sentiment": 5.0, "review_text": "Really enjoyed. First time I had read a book by this author."}, {"review_sentiment": 5.0, "review_text": "quality merchandise, arrived as promised! thank you!"}, {"review_sentiment": 4.0, "review_text": "I wanted more from Rachel. I want her to grow up. To become a professor. To use those brains. I want her to go with Brick and make a life together. A happy life with their own babies to love."}, {"review_sentiment": 4.0, "review_text": "A good read, suspense, tragedy and redemption.  Would recommend to friends."}, {"review_sentiment": 3.0, "review_text": "Good book"}]}, "authors": ["Heidi W. Durrow"], "isbn": "1616200154", "longitude": -122.6741949, "periods": ["2000s", "Recent Releases"], "title": "The Girl Who Fell from the Sky", "word_cloud": "come mixed background set similar time deep nevertheless highly depress lead character alternate opportunity take get bogged many addiction pull character debut highlight character struggle make sense world belong racially economically topic extremely pertinent time particularly struggle negotiate race biracial person categorize life racial struggle race live grandmother highlight radicalize american society not experience racism live abroad racism name different face intertwine history country different way always look mean aware different form story much leave discern lot ambiguity plot write dramatize mellow style write leaf lot imagination central theme identity story search north star help society see come age mixed mystery life bring mom throw kid roof garner lot attention enamor write style plot good ambiguity present appeal addition able connect main character character much interest particularly nevertheless essential biracial narrative individual find identify crucial individual unique upbringing background share story others always help color skin story past future leisurely told story biracial long journey self fall story building mother sibling central trauma propels narrative fit start slowly recovers much help remain family break people surround think told think provoke story many different facet think especially today climate racial tension story important let world different point view pretty easy heavy material sometimes quite depress happy beach easy read captivate work biracial issue personal struggle pol usually go thru expect much turn amazing recommend really enjoy time author quality merchandise arrive promised thank want want grow professor brain want life together happy life baby love good suspense tragedy redemption friend good", "genres": ["Fiction & Literature"], "summary": "Rachel, the daughter of a Danish mother and a black G.I., becomes the sole survivor of a family tragedy after a fateful morning on their Chicago rooftop. \r\n\r\nForced to move to a new city, with her strict African American grandmother as her guardian, Rachel is thrust for the first time into a mostly black community, where her light brown skin, blue eyes, and beauty bring a constant stream of attention her way. It’s there, as she grows up and tries to swallow her grief, that she comes to understand how the mystery and tragedy of her mother might be connected to her own uncertain identity. \r\n\r\nThis searing and heart-wrenching portrait of a young biracial girl dealing with society’s ideas of race and class is the winner of the Bellwether Prize for best fiction manuscript addressing issues of social justice.\r\n\r\n\"The Girl Who Fell from the Sky can actually fly. . . Its energy comes from its vividly realized characters, from how they perceive one another. Durrow has a terrific ear for dialogue, an ability to summon a wealth of hopes and fears in a single line.\" The New York Times ", "asin": "1616200154", "rank": "39226", "city": "Portland", "image": "https://images-na.ssl-images-amazon.com/images/I/418sisr2g1L.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}