{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 359, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Naura11/28/2017I loved this book by Edwidge Danticat, it made me realize a lot of things that go on in Haiti that can really harm someone forever. Then make someone harm themselves. Like when Sophie's mother said \"Mwen pa kapab anko\". In english that means I couldn't do it anymore and then she killed herself."}, {"review_sentiment": 5.0, "review_text": "great product"}, {"review_sentiment": 5.0, "review_text": "Thank you for weaving together the story of generations. I knew what was going to happen and couldn't tear myself away. Anyone who struggles with a mother, sister, daughter, she should read this book. There is nothing that could be changed to make it better, nothing that takes one out of this story that flows so deeply through time."}, {"review_sentiment": 4.0, "review_text": "Beautiful yet devastating at the same time."}, {"review_sentiment": 5.0, "review_text": "The book really grabbed me from the start.  I got it because it was an Oprah Book Club book but the story really flows.  For a first book, it was a really enjoyable read.  I learned a little about Haiti and a little about the author's life which was also weaved into parts of this book.  A really enjoyable read as it flows well."}, {"review_sentiment": 5.0, "review_text": "Incredible book! Very moving."}, {"review_sentiment": 5.0, "review_text": "As an African diasporist that has dealt with many of the issues discused in this novel, this was sooo relatable.I reccommed this to everyone!!!"}, {"review_sentiment": 4.0, "review_text": "The whole while I read this book, I was taken in by the good prose and interesting story. As well, though, I was thinking to myself on many occasions that many parts could have been more smooth and parts could have been cut out completely, and that's not a very good thing while reading a book. But, on the whole, I would recommend this book for a commendable effort."}, {"review_sentiment": 3.0, "review_text": "Interesting story of a young girl born in Haiti living with her aunt but \"transplanted\" to live with her mother in New York. The background story about Haiti and its culture were interesting. The emotional story of this girl and her family relationships was sad. A strong start but it seemed to go in too many directions later in the story and thus lost focus."}, {"review_sentiment": 5.0, "review_text": "different but compiling"}]}, "authors": ["Edwidge Danticat"], "isbn": "1616955023", "longitude": 0.0, "periods": ["1900s"], "title": "Breath, Eyes, Memory", "word_cloud": "love make realize lot thing go really harm someone forever then someone harm mother say pa kappa ankh english mean anymore great product weave together story generation know go happen struggle mother sister daughter nothing better nothing take story flow deeply time yet devastate time really grabbed start get story really flow first really enjoyable learn little little author life also weave part really enjoyable flow well incredible very move african diasporist deal many issue discuses sou reccommed everyone whole take good prose interest story well think many occasion many part part completely good thing reading whole commendable effort interest story young girl bear live aunt transplant live mother background story culture interest emotional story girl family relationship sad strong start seem go many direction later story thus lose focus different compiling", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "At the age of twelve, Sophie Caco is sent from her impoverished village of Croix-des-Rosets to New York, to be reunited with a mother she barely remembers. There she discovers secrets that no child should ever know, and a legacy of shame that can be healed only when she returns to Haiti--to the women who first reared her. What ensues is a passionate journey through a landscape charged with the supernatural and scarred by political violence, in a novel that bears witness to the traditions, suffering, and wisdom of an entire people", "asin": "1616955023", "rank": "75766", "city": "Haiti", "image": "https://images-na.ssl-images-amazon.com/images/I/51bvoM9zskL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}