{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 100, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "Narrative puts one in the middle of Nazi Germany during the final days of WW2, A compelling story to the end,"}, {"review_sentiment": 5.0, "review_text": "Potsdam Station by David Downing is a fictional book taking place during the final month of the European theater in World War II. This is the fourth book in this series, named after Berlin train stations.When he realizes that the Soviets are about to take Berlin, John Russell calls in many favors to get attached as a war correspondent to the Red Army. The NKVD, however, remember John and are willing to grant his wish, but for a very high price.As a minor celebrity, Effi Koenen doesn’t find it easy to hide in Berlin, but she manages and even helps others to hide. At this point in the war, Berlin is being bombed day and night and every morning more and more of the city’s landscape gets destroyed. A heroine of film, Effi finds herself a real life heroine.Paul is fighting to defend Berlin. Being conscripted into the German army, this teenager knows that his choices are few and all of them are grim. He is on the losing side and is either going to die, get captured by the Red Army, or try to make it through the battle in one piece and away from zealots willing to throw their lives, and his, into Russian canons.Every time I pick up one of the books in the John Russell series I ask myself why am I not reading more of them. This is the same question I asked myself when I picked up Potsdam Station by David Downing.I still have no good answer.The story is told from the point of view of three people, John Russell, Effi Koenen and Paul, John’s son. John Russell is a British journalist and amateur spy, Effi Koenen an actress, and Paul who is John’s son, a member of the Hitler Jugend and a soldier fighting the Russians to defend Berlin.Mr. Downing draws a picture of Berlin on its last legs. In this torn down town, our three protagonists chase one another, or rather rumors of one another throughout the book, always taking one step forward to slide two steps back and continue their search.I thought that Effi and Paul were the real starts of this book. John Russell keeps the separate stories all connected, but both Effi and Paul show growth and encounter everyday people who make their choices, good or bad, count.The best way I can describe this novel is utter and complete organized chaos. I think this is what the author intended and he succeeded in a marvelous fashion.Even though this book is part of a series, one which I have not read in order, I feel it is an excellent standalone book. I warn you though, you’ll want more."}, {"review_sentiment": 3.0, "review_text": "This was a pretty good read. War scenes were pretty realistic. It is a great continuation of the series. Would purchase again."}, {"review_sentiment": 5.0, "review_text": "What is your favorite Berlin Bahnhof?"}, {"review_sentiment": 4.0, "review_text": "I enjoyed the book and following the characters' continuing stories."}, {"review_sentiment": 5.0, "review_text": "The entire series is an excellent review of life in Germany before and during World War II. Plenty of action and intrigue."}, {"review_sentiment": 4.0, "review_text": "This is Book #4 of the John Russell station titled series recreating Berlin during WWII.  Though the John Russell character is fictitious, fine research shows through as David Downing presents an accurate portrait of what life was like for the the citizenry of Berlin and its occupying armies."}, {"review_sentiment": 4.0, "review_text": "I will not give away any plot details however you know where the story is going after the first few chapters. Still it's a good read."}, {"review_sentiment": 5.0, "review_text": "fine continuation of an interesting series. worthwhile reading time."}, {"review_sentiment": 5.0, "review_text": "I read this entire series. Yes there are times when you will think the author is a communist, maybe he is... That aside, it is a fun read."}]}, "authors": ["David Downing"], "isbn": "1616950730", "longitude": 13.3888599, "periods": ["1900s"], "title": "Potsdam Station", "word_cloud": "put middle final day compel story end fictional take place final month european theater fourth series name train realize soviet take call many favor get attach war correspondent however remember willing grant wish high minor celebrity find easy hide manages even help others hide point war bomb day night morning city landscape get destroy heroine film find real life fight defend conscripted german army teenager know choice grim lose side go die capture battle piece away willing throw live russian time pick series ask read question ask pick still good story tell point view people son journalist amateur spy actress son member soldier fight defend down draw picture last leg torn town protagonist chase rather rumor always take step forward slide step back continue think real start keep separate story connect show growth encounter everyday people make choice good bad best way describe utter complete organize chaos think author intend succeed marvelous part series order feel excellent standalone warn want pretty good scene pretty realistic great continuation series purchase favorite enjoy follow character continue story entire series excellent review life action intrigue title series recreate character fictitious fine research show present accurate portrait life citizenry occupying army give away plot detail however know story go first chapter still good fine continuation interest series read time entire series time think author communist maybe aside fun", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "WWII"], "summary": "In April 1945, Hitler’s Reich is on the verge of extinction. Assaulted by Allied bombs and Soviet shells, ruled by Nazis with nothing to lose, Berlin has become the most dangerous place on earth.\r\n\r\nJohn Russell’s son Paul is stationed on the Eastern Front with the German Army, awaiting the Soviets’ final onslaught. In Berlin, Russell’s girlfriend Effi has been living in disguise, helping fugitives to escape from Germany. With a Jewish orphan to care for, she’s trying to outlast the Nazis.\r\n\r\nRussell hasn’t heard from either of them since fleeing Germany in 1941. He is desperate to find out if they’re alive and to protect them from the advancing Red Army. He flies to Moscow, seeking permission to enter Berlin with the Red Army as a journalist, but when the Soviet’s arrest him as a spy, things look bleak—until they find a use for him that has him parachuting into Berlin behind German lines.", "asin": "1616950730", "rank": "256982", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51w52mZ9pvL.jpg", "country": "Germany", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}