{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 18.4801972, "ratings": {"num_ratings": 137, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "An excellent and enlightening read for anyone who has ever spent time in Haiti or the Dominican or who plans to in the future"}, {"review_sentiment": 5.0, "review_text": "My son had to read for school and loved it."}, {"review_sentiment": 5.0, "review_text": "My son had it as required reading and enjoyed it. Even asked for more books from this author."}, {"review_sentiment": 4.0, "review_text": "Artistic style of story telling paints a grim picture, but leaves one with hope through remembrance of the lost souls."}, {"review_sentiment": 5.0, "review_text": "A heartbreaking story that moves a lovely pace, Danticat is truly a once in a generation talent."}, {"review_sentiment": 5.0, "review_text": "This was an amazing, well-written story. And for me very eye opening. A must read!"}, {"review_sentiment": 5.0, "review_text": "I had to read this book for my college class and I can thoroughly say that I enjoyed it. It opened my eyes on a new subject in an unfamiliar time that I never would have known existed had it not been for this book."}, {"review_sentiment": 4.0, "review_text": "Good read"}, {"review_sentiment": 4.0, "review_text": "It is difficult to read about ethnic cleansing genocide, even when the writing is as beautiful and sensitive as Danticat's."}, {"review_sentiment": 4.0, "review_text": "The book is slow in the beginning it has an important story to tell of the issues between the Dominican Republic and Haiti."}]}, "authors": ["Edwidge Danticat"], "isbn": "1616953497", "longitude": -69.942111, "periods": ["2000s", "Recent Releases"], "title": "The Farming of Bones", "word_cloud": "excellent enlighten anyone ever spend time plan future son school love son require reading enjoy even ask author artistic style story tell paint grim picture leave hope remembrance lose soul heartbreaking story move lovely pace truly generation talent amazing story eye open college class thoroughly say enjoy open eye new subject unfamiliar time never existed good difficult ethnic cleansing genocide even write beautiful sensitive danticat slow beginning important story tell issue", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "It is 1937 and Amabelle Désir, a young Haitian woman living in the Dominican Republic, has built herself a life as the servant and companion of the wife of a wealthy colonel. She and Sebastien, a cane worker, are deeply in love and plan to marry. But Amabelle's  world collapses when a wave of genocidal violence, driven by Dominican dictator Rafael Trujillo, leads to the slaughter of Haitian workers. Amabelle and Sebastien are separated, and she desperately flees the tide of violence for a Haiti she barely remembers.\r\n\r\nAlready acknowledged as a classic, this harrowing story of love and survival—from one of the most important voices of her generation—is an unforgettable memorial to the victims of the Parsley Massacre and a testimony to the power of human memory.", "asin": "1616953497", "rank": "107399", "city": "Santo Domingo", "image": "https://images-na.ssl-images-amazon.com/images/I/51PAat9IwbL.jpg", "country": "D.R.", "story_arc": ["Tragedy", "Things only get worse"]}