{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 40, "rating": 3.7, "reviews": [{"review_sentiment": 2.0, "review_text": "About a year ago I attended a meet and greet for Nina Revoyr. She went to my college to talk about her recent book, Lost Canyon, and answer any questions about her previous books. She read a small portion of Lost Canyon, and she reeled me in. I. Had. To. Have. This. Book. I ordered it and immediately started reading it. In the beginning I was a bit bored, but I knew giving an in depth background story of all four characters was essential to the rest of the reading.Then I found myself getting bored. However, I kept reading because I knew the drama would soon pop up. The intense parts were gone before they even started. I guess I wanted more of a thrill. I finished the book because I wanted closure. I'm not entirely satisfied with the ending. I feel as though I didn't get the closure I was wanting.I had a hard time finishing it because I wasn't intrigued by it. Again, I didn't get the closure that I wanted."}, {"review_sentiment": 4.0, "review_text": "Especially interesting read for Angelenos."}, {"review_sentiment": 2.0, "review_text": "I bought this with the idea of pine trees,fresh air,scenery n was taken aback to land in the slums. The author got too preachy for me at start n finish. A very unbelievable story.  Plants in the pines? If I made a list of trouble on a mountain hike n left out a cougar I would be covering the plot. Tracy gone seemed a weird turn."}, {"review_sentiment": 2.0, "review_text": "It really is not an original idea book.  It's deliverance set in another place.  I was disappointed."}, {"review_sentiment": 3.0, "review_text": "The overall concept was a great one.  I, like others, believe we didn't need everyone's backstory at the beginning.  That would have made it move a long a little faster.  Having one of the characters just disappear is very odd.  I expected to find out that she had some sort of past that made her wary of the law.  Another crazy twist is near the very end have one character suddenly decide she was attracted to women.  It didn't belong - like it was an afterthought to write that in.  As also stated in other reviews, some of the action was pretty unrealistic.  I think it would have been best to have them encounter the danger and deal with it, but not keep bringing the same character back to cause them harm.  Just trying to navigate through the Sierra's with an injured guide would have been enough.  I also believe the author could have done more (be excluding some of the backstory) with showing us how their lives changed by the event."}, {"review_sentiment": 5.0, "review_text": "Three of the characters grow from their ordeal. The fate of the fourth is left to the reader's imagination. I found it easy to identify with the three who returned to the Los Angeles area strengthened by overcoming the physical and mental challenges that they had faced while surviving both a long fast brutal hike through the Sierras and attacks by dangerous men from two rival groups bent on killing these accidental intruders and on killing each other.Although I related easily to three main characters in this book, it did not pique my interest in reading any of the author's previous books. I am a little bit familiar with LA, but not enough to feel close to the characters  based on their Angeleno roots. It was through their wilderness survival ordeal that I related to them and none of the author's other books seem to touch on a similar set of experiences. I expect that her other books are equally well written and moving, but the setting, one that the author knows well and no doubt can write about well, is not one that I can relate to. Cities are places that I prefer to avoid if possible.The author seems to know and value and understand the wilderness almost as well as the city of LA, but it does not seem to be essential to her message. So I do not expect to see another book from the author in which the wilderness plays such a large part."}, {"review_sentiment": 4.0, "review_text": "took a long time to finish"}, {"review_sentiment": 1.0, "review_text": "Got the audio for husband's commute,  so bad we quit in an hour...."}, {"review_sentiment": 4.0, "review_text": "Fast-paced,  full of action,  beautiful description,  and interesting characters.  Perhaps a bit over the top at times,  but it only lead to the overall sense of adventure.  Couldn't put it down!"}, {"review_sentiment": 3.0, "review_text": "I love to read true and fictional accounts about people surviving the wilderness.  From stories of Everest to hiking with Cheryl Strayed, if it's well written I like it.  This book suffers early on.  The lengthy introductory chapters on the characters should have been author notes to use for weaving those stories into the adventure.  I was bored, but I stuck to it.The race card seemed to be played SO heavily in a setting where it didn't fit.  A spoonfed agenda.The actual suspense part was better.  Stretched thin but got me to the end.  That got my review to 3 stars instead of 2.SPOILER ALERT:I didn't like some of the characters and Tracy was one of those but I still wanted to know what happened to her!  Weird \"twist\" like the writer was tired of writing so that character fell off a... cliff?  Became a drug dealer?  Beats me."}]}, "authors": ["Nina Revoyr"], "isbn": "1617753548", "longitude": -118.244476, "periods": ["2000s", "Recent Releases"], "title": "Lost Canyon", "word_cloud": "year ago attend meet greet go college talk recent answer question previous small portion reel have order immediately started reading begin bite bored know give depth story character essential rest find get bore however keep read know drama soon intense part go even start guess want thrill finish want closure entirely satisfy end feel get closure hard time finish intrigue get closure want especially interesting angeles buy idea pine tree fresh air scenery n take aback land slum author get preachy start n unbelievable story plant pin make list trouble mountain hike n leave cougar cover plot go seem weird turn really original idea deliverance set place disappoint overall concept great like others believe everyone backstory beginning long little faster have character disappear odd expect find sort past make wary law crazy twist end character suddenly decide attracted woman afterthought write also state review action pretty unrealistic think encounter danger deal bringing character back cause harm try navigate injure guide also believe author do exclude backstory show live change event character grow fate fourth leave imagination find easy identify return area strengthen overcome physical mental challenge face survive long fast brutal hike attack dangerous men rival group bend kill accidental intruder kill relate easily main character pique interest reading author previous little bit familiar enough feel close character base root wilderness survival ordeal relate none author seem touch similar set experience expect equally well write move set author know well write well relate city place prefer avoid author seem know value understand wilderness almost well city seem essential message so expect author wilderness play large part take long time finish audio husband commute bad quit hour full action beautiful description interest character perhaps bit top time lead overall sense adventure put love true fictional account people survive wilderness story hike well write suffers early lengthy introductory chapter character author note use weave story adventure bore stick race card seem play heavily set spooned actual suspense part better thin get end get review star instead alert character still want know happen twist writer tire write character fell cliff drug dealer", "genres": ["Fiction & Literature"], "summary": "Four people on a backpacking trip in the Sierra Nevada find more adventure than they ever imagined. Each of them is drawn to the mountains for reasons as diverse as their own lives. Gwen Foster, a counselor for at-risk youth, is struggling with burnout from the demands of her job and with the loss of one of her teens. Real estate agent Oscar Barajas is adjusting to the fall of the housing market and being a single parent. Todd Harris, an attorney, is stuck in a lucrative but unfulfilling career--and in a failing marriage. They are all brought together by their trainer, Tracy Cole, a former athlete with a taste for risky pursuits.\r\n\r\nWhen the hikers start up a pristine mountain trail that hasn't been traveled in years, all they have to guide them is a hand-drawn map of a remote, mysterious place called Lost Canyon. At first, the route past high alpine lakes and under towering, snowcapped peaks offers all the freedom and exhilaration they'd hoped for. But when they stumble onto someone who doesn't want to be found, the group finds itself faced with a series of dangerous conflicts, moral dilemmas, confrontations with nature, and an all-out struggle for survival.\r\n\r\nMoving effortlessly between city and wilderness, Lost Canyon explores the ways that race, class, and culture shape experience and perception. It examines the choices good people must face in desperate situations. Set in the grand, wild landscape of the California mountains, Lost Canyon is a story of brewing social tensions and breathtaking adventure that will keep readers on the edge of their seats.", "asin": "1617753548", "rank": "891775", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/51Dat0-H9LL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}