{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 50.8465573, "ratings": {"num_ratings": 21, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "A hard book to read, good plot and characters, but the language, and the multiple names for characters, and references made it difficultat times to read."}, {"review_sentiment": 4.0, "review_text": "I loved this book since I first saw the cover.  It arrived quickly and in perfect condition.  Just what I've been waiting for.  Thanks!"}, {"review_sentiment": 5.0, "review_text": "Hands down one of my favorite books. Beautiful, heartbreaking, harrowing, with Koja's classic elegant language and complex characters. Such a gripping and challenging read. I adore this book."}, {"review_sentiment": 1.0, "review_text": "A pitiful, wandering tale and I couldn't force myself through past the first couple of chapters.  This book is disjointed and annoying to read.  Usually, I love anything with this sort of theme or setting, but not this one."}, {"review_sentiment": 5.0, "review_text": "Kathe Koja is incredibly poetic in her writing. She has a way of stringing words together than makes you want to keep going. Under the Poppy is incredibly erotic without the (much) smut. It's tantalizing and mesmerizing to read. The characters and well developed as you walk with them into their world. I'm incredibly excited for the sequel, Mercury Waltz. I'm sure it will be just as beautiful of a read."}, {"review_sentiment": 5.0, "review_text": "Under the Poppy is a mesmerizing, dark and erotic historical novel for adults. It's almost like a decadent dream that lingers somewhere between fantasy and reality. Once you start to read this novel and surrender yourself to its world, you're instantly hooked by the story.There are several different elements in this novel. In my opinion Under the Poppy is an unforgettable story about love, unrequited love, lust, lovers, romance, friends, sex, eroticism, desire, deception, war, whores, gentlemen and naughty puppets. It's difficult to find similar novels, because it is one of a kind. It's a unique and original vision of a theatrical brothel, forbidden love and an impending war that may change everything.Here's a bit of information about the story:The events of Under the Poppy take place in a nameless town in a slightly alternate Victorian era Europe. Under the Poppy is a basically a story about a brothel called Under the Poppy and its owners, performers and customers, but it's also much more than that. The brothel is owned by Rupert and Decca. Decca loves Rupert, but Rupert loves her brother, Istvan. When Rupert and Istvan meet each other, their old passion is rekindled... But this is just the beginning, because the first part of this novel is almost like a prologue to the stunning second part, which splendidly ends the novel.Kathe Koja has created interesting and multilayered characters who have their own past. She writes beautifully about the past of the characters and what has happened to them and how they have come to the brothel. It was fascinating to read their stories.The protagonists - Rupert, Istvan and Decca - used to be orphans, but then they drifted apart. Now they have found each other again. Rupert and Istvan are richly created and complex characters that love each other. The mistress of the brothel, Decca, adds tension to their relationship, because she loves Rupert. Reading about their past was fascinating, because these scenes reminded me of Charles Dickens.The other characters range all the way from conspirators and commanders to whores, and each of them is an interesting character, because they all add a wickedly delicious flavour to the novel. I enjoyed reading about them.The dialogue between the different characters is simply fantastic. There's plenty of wittiness in the dialogues.It was especially interesting that the author used the theme of masters and puppets in this novel. When I read this novel and began to think about its contents, I noticed that the author used this theme as a tool to explore who's really the master and who's the puppet.One of the best things about Under the Poppy is that the author uses multiple points of view. Reading this kind of a novel may be a bit challenging, but experienced readers will easily be hooked by the shifting view points. In my opinion this kind of storytelling gives readers a chance to find out what different characters think about themselves and their lives, because each of them have their own stories and each of them has something to hide or reveal.Kathe Koja's prose is beautiful and deliciously nuanced. It's a real pleasure to read her prose, because the words flow effortlessly and the happenings feel wonderfully vivid. The prose is so good that it can be called poetic. To be honest, Kathe Koja writes amazingly beautiful prose that charmingly highlights the explicitness and decadent nature of the story in a seductive way.Kathe Koja has managed to bring to life an alternate reality in which rich prose makes the reader fall in love with the story and forget everything else for a few hours. Her descriptions of the places, clothes and customs are deliciously lush and vivid, so that readers can almost taste and smell what's happening on the pages. I think that she has spent quite a lot of time researching these things, because everything feels believable and authentic.The author writes fluently and boldly about sex, eroticism and sexual acts. This novel has almost everything from heterosexuality to homosexuality. All kind of sexual acts can be seen on stage in Under the Poppy, and almost anything is possible within its walls. The visitors that come to the brothel get to witness several sensual and erotic performances that won't leave anybody cold.One of the best and most intriguing things about Under the Poppy is that the author writes impressively about Istvan's puppets. Istvan has a special connection with his puppets, because he seems to think about them first and then about people. Istvan calls his puppets \"les mecs\" and they have their own names. It was fascinating to read about his puppets and how they were used in different ways on stage. They added a fantastically weird and disturbing element to the story. These puppets almost steal the whole show.Under the Poppy is a challenging novel, but it is a thoroughly rewarding reading experience. I noticed that this novel successfully breaks normal writing rules. In typical historical novels there aren't as many point of views and the happenings aren't as decadent and mysterious as in this novel. The use of multiple points of views works well and refreshes the novel, because the story opens up gradually and offers glimpses to the lives of the characters and reveals quite a lot of details about them.I noticed that the author hasn't tied the happenings to an exact period of time (although the exact time isn't mentioned directly, it's easy to figure out when the happenings take place, because there are references to the 1870s Brussels). The author also writes about a nameless war that is slowly approaching. Usually authors, who write historical fiction, are very precise about these things. I liked this kind of storytelling, because it felt refreshing.Under the Poppy may not be to everybody's liking because of its sexual contents and a bit different kind of a storytelling technique, but those readers, who are used to reading adult material, appreciate a writing style that breaks normal writing rules and want to read something different, will adore and love it. I personally liked Under the Poppy very much, because the author has done her best to write a memorable and sensual story that will linger on the reader's mind. It's one of the finest novels I've ever read.I can highly recommend this novel to everybody who likes historical fiction and wants to read a bit different kind of a story. It can also be recommended to speculative fiction readers and readers who love literary novels. This novel will appeal to everybody, who's willing to immerse himself/herself in a dark, erotic and entertaining story.Highly recommended!"}, {"review_sentiment": 3.0, "review_text": "This would have been a great book at about 400 pages. After reading 800+ pages (on the Nook) I thought the ending would be more climatic. The writing was beautiful however there were some parts I was lost. It was not a bad book but not a great book either. If you are looking for something with a different plot and story line then this would be a good book for that. If you are looking for something fast paced and a easy read, not the book for you."}, {"review_sentiment": 5.0, "review_text": "So when I like a book enough, I will usually recommend it to friends; tell them to go buy it or check it out at the library or something. Maybe I'll loan it to them. But being the cheapskate I am, I have NEVER actually liked a book enough to purchase extra copies to force on people - until I read Under the Poppy.The setting isn't strictly defined - it starts in a 19th century brothel, maybe Brussels? SOME place around there anyway, on the verge of some random 19th century war. Maybe that might bug some people, but I kind of think it works because it's a little bit like a fractured fairy tale - the exact time and place don't really matter. Two people in love, evil forces threatening that love, mysterious benefactors, mysterious villains, lush surroundings. It IS a fairy tale, just with lots more sex and I personally think that's just swell.Poppy is a very decadent book. It's fully of pretty girls and pretty boys and corsets and crazy be-wanged puppets. I'm pretty sure I've seen that word in other reviews about it before, but that's because it fits so well. It's sexy and classy and basically just makes you feel like you should be reading it while lounged on a velvet chaise, drinking champagne. Kathe Koja has a unique way of writing - almost stream-of-consciousness, laced with very vivid details. I kind of felt like I was reading it through an opium haze sometimes, because that stream-of-consciousness writing can be hard to follow. Maybe that just added to the book's appeal, haha. I don't think that's a fault in Koja's writing, rather that it's just not as easy to read as most things you'll find on the shelf.So here's the thing: I have bought two copies for two of my girlfriends, who love history and drama and the whole Belle Epoque era. I wouldn't recommend it to my ultra conservative grandma or anything, because there IS sex (with people AND puppets, crazy!), and there's cursing and there's just a general air of debauchery that is going to possibly startle people who just picked up on the 'historical romance' aspect of this book. But if you are a debauchery fan like I am, and if you like finely crafted, heartbreaking drama, then you will most likely enjoy Under the Poppy."}, {"review_sentiment": 5.0, "review_text": "I would love this book for no other reason that for the author's use of language.  You practically swim through the sentences, pausing occasionally to ruminate on her word choice and how it impacts not only the sentence but the entire story at times.  You have to pay attention and pick out hidden meanings from conversations, but it is worth the time and effort so you can better appreciate the depth of the characters and the story.  The story and characters reminded me of a Joseph Roth novel, only with a slightly more cheerful ending.  I'm definitely recommending this novel to friends."}, {"review_sentiment": 1.0, "review_text": "I am all for historical fiction novels, especially ones set in Victorian England and dealing with taboo subjects: brothels. However, this was the most horrible book that I have ever purchased and I do not recommend it to anyone. I am not giving this opinion from an uneducated viewpoint either. Yes, I have read great works such as Shakespeare and Charles Dickens, but Under the Poppy does not belong within a 1,000 mile range of those books. The book was written in a very uncomfortable and untraceable style and was very jagged-like, confusing the reader more than enough times that I was fed up with it and erased it from my Kindle. It is not worth the money or the time to buy or read this book. Please beware."}]}, "authors": ["Kathe Koja"], "isbn": "1618730274", "longitude": 4.351697, "periods": ["1800s", "Recent Releases"], "title": "Under the Poppy: A Novel", "word_cloud": "hard good plot character language multiple name character reference make difficult at time love first saw arrived quickly perfect condition wait thanks hand favorite heartbreaking harrow classic elegant language complex character such grip challenge adore pitiful wander tale first couple chapter disjoint annoy usually love anything sort theme set incredibly poetic write way string word together make want go incredibly erotic much smut tantalize mesmerize character well develop walk world incredibly excite sequel sure beautiful mesmerize dark erotic historical adult almost decadent dream lingers somewhere fantasy reality start surrender world instantly hook several different element opinion unforgettable story love unrequited love lust lover romance friend sex eroticism desire deception war whore gentlemen naughty puppet difficult similar novel kind unique original vision theatrical brothel forbidden love impend war bit information story event place nameless town slightly alternate victorian era basically story brothel call owner performer customer also much brothel own love love brother meet old passion rekindle begin first part almost prologue stun second part splendidly end create interesting multilayered character write beautifully past character happen come brothel fascinate protagonist use orphan drifted apart now find richly create complex character love mistress brothel add tension relationship love fascinate scene remind character range way conspirator commander whore interest character add wickedly delicious flavor enjoy read dialogue different character simply fantastic plenty wittiness especially interesting author use theme master puppets begin think content notice author use theme tool explore really master best thing author use multiple point view read kind challenge experienced reader easily hook shift view point opinion kind storytelling give reader chance find different character think life story something hide prose beautiful deliciously nuanced real pleasure prose word flow effortlessly happening feel wonderfully vivid prose good call poetic write amazingly beautiful prose charmingly highlight explicitness decadent nature story seductive manage bring life alternate reality rich prose make fall love story forget everything else hour description place clothes custom deliciously lush vivid reader almost taste smell happen page think spend quite lot time research thing everything feel believable author write fluently boldly sex eroticism sexual act almost everything heterosexuality homosexuality kind sexual act see stage almost anything possible wall visitor come brothel get witness several sensual erotic performance anybody best intriguing thing author write impressively puppet special connection puppet seem think first people call puppet lech me name fascinate puppet use different way stage add fantastically weird disturb element story puppet almost steal whole challenge thoroughly reward read experience notice successfully break normal writing rule typical historical novel many point view happening decadent mysterious use multiple point view work well refreshes story open gradually offer glimpse live character reveals quite lot detail notice author tie happening exact period time exact time mention directly easy figure happening take place reference author also write nameless war slowly approach author write historical fiction precise thing like kind storytelling felt like sexual content bit different kind storytelling technique reader use read adult material appreciate writing style break normal write rule want something different love personally like much author do best write memorable sensual story linger finest novel ever highly everybody like historical fiction want bit different kind story also recommend speculative fiction reader reader love literary novel appeal everybody willing immerse dark erotic entertaining recommend great page read page think end writing beautiful however part lose bad great look something different plot story line look something fast pace easy so like enough usually recommend friend tell check library something maybe loan cheapskate actually like enough purchase extra copy force people set strictly define start century brothel maybe place anyway verge random century war maybe people kind think work little bit fracture fairy tale exact time place really matter people love evil force threaten love mysterious benefactor mysterious villain lush surroundings fairy tale lot sex personally think decadent fully pretty girl pretty boy corset crazy puppet pretty sure see word review fit well sexy classy basically make feel read lounge velvet chaise drinking champagne unique way write almost lace vivid detail kind felt read opium haze sometimes write hard follow add appeal aha think fault write rather easy thing find thing buy copy girlfriend love history drama whole era ultra conservative grandma anything be sex people puppet crazy curse general air debauchery go possibly startle people pick romance aspect debauchery fan like finely craft heartbreaking drama likely enjoy reason author use language practically swim sentence pause occasionally ruminate word choice impact sentence entire story time pay attention pick hidden meaning conversation worth time effort better appreciate depth character story story character remind slightly cheerful end definitely recommend friend historical fiction novel especially one set victorian deal taboo subject brothels however horrible ever purchase recommend anyone give opinion uneducated viewpoint great work belong mile range write uncomfortable untraceable style confuse enough time feed erased money time beware", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Under the Poppy is a brothel owned by Decca and Rupert. Decca is in love with Rupert but he in turn is in love with her brother, Istvan. When Istvan comes back to town, louche puppet troupe in tow, the lines of their age-old desires intersect against a backdrop of approaching war.\r\n\r\nHearts are broken when old betrayals and new alliances—not just their own—take shape, as the townsmen seek refuge from the onslaught of history by watching the girls of the Poppy cavort onstage with Istvan’s naughty puppets.\r\n\r\nWhen the war gets too close, Istvan and Rupert abandon the Poppy and find a place in high society where they try to avoid becoming more than puppets themselves in the hands of those they have helped before and who now want to use them again.\r\n\r\nFrom its explosive beginning to the final climax, Under the Poppy is a vivid, sexy, behind-the-scenes historical novel as delicious and intoxicating as the best guilty pleasure.", "asin": "1618730274", "rank": "2524323", "city": "Brussels", "image": "https://images-na.ssl-images-amazon.com/images/I/41punffajIL.jpg", "country": "Belgium", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}