{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 64.145981, "ratings": {"num_ratings": 49, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "I read this book in preparation for a trip to Iceland. I thoroughly enjoyed it and will read it again."}, {"review_sentiment": 1.0, "review_text": "Sarah Moss is a writer and academic from the UK. She spent parts of 2009 and 2010 teaching in Reykjavík, moving there with her husband and two young sons. I was keen on reading it for I had been there at the same time. This book is full of information, although I found it presented in a somewhat skewed fashion. There are some very good interviews with interesting Icelanders (these Icelanders were, as usual, very good story-tellers) and there is a lot of detail about some of the places she visited which I found fascinating although those less interested might just see lists.Actually finishing the book became an ordeal. I couldn't quite put my finger on it at first, but after a few chapters I figured it out. It was something I'd seen before in Icelandic travel books written by UK writers:  that distortion of reality filtered through  'English Myopia\" exemplified by a sense of superiority coupled with thinly veiled condescension. There was scarcely a page without some form of put-down of Iceland or disparaging cracks about Iceland vis-á-vis the UK. I will grant that the author had walked into a very difficult situation. With Iceland still reeling from a financial meltdown while also experiencing volcanic eruptions (to say nothing of the usual problems of dealing with small children) it is understandable that she would not always be painting a pretty picture. Those circumstances would tax anyone's patience. But I found that the real turn off was her constant whining about her distastes and fears of virtually anything the slightest bit out of line with her preconceptions. After the twentieth iteration of how bad Iceland traffic is I was quite ready to throw the book in the trash. I'd give you some more examples, but the stern (neurotic?) warning on the publishers page against any such violation of her \"moral right\" and the threat of subsequent \"criminal prosecution and civil claims for damages\" prohibits my use of any quotations from the book.  If you do happen across a copy, however, just open it anywhere and read a page or two.  You'll see what I mean."}, {"review_sentiment": 5.0, "review_text": "Perfect book to read when planning to visit Iceland.  Easy, enjoyable read."}, {"review_sentiment": 5.0, "review_text": "I visited Iceland this year as a \"foreigner\" and loved it, so this lovely book about Iceland deepened my experience and taught me more about this resilient people."}, {"review_sentiment": 4.0, "review_text": "For those interested in what it might be like to live in Iceland for a person not born there, this is a good memoir.  It is the story of a British woman and her family who live in Iceland for a year while she is teaching British Literature in a college in Rykyjavik just after the crash when Iceland almost went bankrupt.  Very insightful comments about everyday life and people's attitudes toward children, food, recreation and education.  An engaging story."}, {"review_sentiment": 2.0, "review_text": "I can't believe she  didn't  love her time  in Iceland."}, {"review_sentiment": 5.0, "review_text": "Interesting insights into life and recent history of Iceland. Sarah Moss spent a whole year teaching near Reykjavik and interviewed many different local people. A great introduction before a tourist trip to Iceland."}, {"review_sentiment": 3.0, "review_text": "Wish it were possible to give 2.5 stars because I'm truly neutral about this book. On the one hand, I recognize the struggling expat trying to see adopted home as a tourist destination, in the other she seemed constantly miserable and judgmental. This always comes up as the definitive must read on Iceland and I'm glad I read it once there because otherwise I'd have been soured on a beautiful country. She saw more of Reykjavik than I did, I think I saw more of Iceland than she did. That said, good writing and good story teller and I'm glad I read the book."}, {"review_sentiment": 1.0, "review_text": "I did not enjoy reading this book infact I couldn't even finish it. Something about the way it was written just didn't work for me."}, {"review_sentiment": 4.0, "review_text": "A must read before going to Iceland to understand Icelanders."}]}, "authors": ["Sarah Moss"], "isbn": "1619021226", "longitude": -21.9422367, "periods": ["2000s", "Recent Releases"], "title": "Names for the Sea: Strangers in Iceland", "word_cloud": "preparation trip thoroughly enjoy writer academic spend part teach move husband young son keen read time full information find present somewhat skewed fashion good interview interest usual good lot detail place visit find fascinate le interested finishing become ordeal quite finger first chapter figure something see travel write writer distortion reality filter exemplify sense superiority couple thinly veiled condescension scarcely page form disparage crack grant author walk difficult situation still reel financial meltdown also experience volcanic eruption say nothing usual problem deal small child understandable always paint pretty picture circumstance tax anyone patience find real turn constant whining distastes fear virtually anything slightest bit line preconception twentieth iteration bad traffic quite ready throw trash give example stern neurotic warning publisher page violation moral right threat subsequent criminal prosecution civil claim damage prohibits use quotation happen copy however open anywhere see mean plan visit enjoyable visit year foreigner love lovely deepen experience taught resilient people interested live person bear good memoir story british woman family year teach british college crash almost go bankrupt very insightful comment everyday life people attitude child food recreation education engaging story time interest insight life recent history spend whole year teach interview many different local people great introduction tourist trip wish possible give star truly neutral hand recognize struggle expat try see adopt home tourist destination seem constantly miserable judgmental always come definitive glad otherwise sour beautiful country saw think saw say good writing good story teller glad enjoy read infarct even something way write work go understand icelander", "genres": ["Memoir", "Travel Writing"], "summary": "Sarah Moss had a childhood dream of moving to Iceland, sustained by a wild summer there when she was nineteen. In 2009, she saw an advertisement for a job at the University of Iceland and applied on a whim, despite having two young children and a comfortable life in Kent. The resulting adventure was shaped by Iceland’s economic collapse, which halved the value of her salary, by the eruption of Eyjafjallajokull and by a collection of new friends, including a poet who saw the only bombs fall on Iceland in 1943, a woman who speaks to elves and a chef who guided Sarah’s family around the intricacies of Icelandic cuisine.\r\n\r\nMoss explored hillsides of boiling mud and volcanic craters and learned to drive like an Icelander on the unsurfaced roads that link remote farms and fishing villages in the far north. She watched the northern lights and the comings and goings of migratory birds, and as the weeks and months went by, she and her family learned new ways to live.\r\n\r\nNames for the Sea is her compelling, beautiful and very funny account of living in a country poised on the edge of Europe, where modernization clashes with living folklore.", "asin": "1619021226", "rank": "69773", "city": "Reykjavik", "image": "https://images-na.ssl-images-amazon.com/images/I/5199WCzhDNL.jpg", "country": "Iceland", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}