{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 352, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "I had to readt it for my English class and I loved it"}, {"review_sentiment": 4.0, "review_text": "Carrie is a complex novel.  Talented and pretty, Carrie can navigate through hardships and ultimately triumph.  But the dark side of Carrie is evident in the many men she beguiles along the way."}, {"review_sentiment": 5.0, "review_text": "Terrific read! It's a story about a young woman from a small town who is trying to make it on her own in the big city."}, {"review_sentiment": 5.0, "review_text": "This is how a timeless period piece is done. The novel continually focuses on personal rises and falls and character strengths and weaknesses without spending undue time on manners and social norms. The result is that the conflicts always felt relevant and the story kept me intrigued until the end. This is a fantastic book by an author that I did not know particularly well."}, {"review_sentiment": 4.0, "review_text": "First saw the movie with Olivier and Jennifer Jones which was great so I decided to read the book.  I don't know of many five star books such as 'War and Peace' so I am rating this very high. I was constantly comparing the story to the movie and found the book to be true to human emotions. Money  (or the lack of money) is very important to this novel.  This is the way life is unless you have money then your fantasies can run wild (Trump?)."}, {"review_sentiment": 4.0, "review_text": "The book almost seems like it could be broken into two distinct halves. I happened to enjoy the first halfquite a bit more than the second but it's a good book overall and expertly written."}, {"review_sentiment": 5.0, "review_text": "Excellent Read!"}, {"review_sentiment": 5.0, "review_text": "Dreiser does a great job using turn-of-the-century America as the backdrop for the characters' struggles with pride, vanity,  and desire."}, {"review_sentiment": 5.0, "review_text": "Very well written. Loved it. Will probably read again"}, {"review_sentiment": 1.0, "review_text": "Boring, laborious writing, uninteresting characters, too much philisophizing"}]}, "authors": ["Theodore Dreiser"], "isbn": "1619493217", "longitude": -87.6244212, "periods": ["1900s"], "title": "Sister Carrie", "word_cloud": "ready english class love complex pretty navigate hardship ultimately triumph dark side evident many men beguiles way story young woman small town try big city timeless period piece do continually focus personal rise fall character strength weakness spending undue time manner social norm result conflict always felt relevant story keep intrigued end fantastic author know particularly well first saw movie great decide know many star peace rating high constantly compare story movie find true human emotion lack money important way life money fantasy run wild almost seem distinct half happen enjoy first half quite bit second good overall expertly write excellent great job use backdrop character struggle pride vanity desire very well write probably bore laborious write uninteresting character much philosophize", "genres": ["Fiction & Literature"], "summary": "Regarded by many critics as the greatest novel on urban life ever composed, Sister Carrie tells the story of Caroline Meeber, an 18-year-old from rural Wisconsin whose new life in Chicago takes her on an astonishing journey from the despairing depths of industrial labor to the staggering heists of fame and stardom.\r\n\r\nRepresenting the transition from the heavy moralizing of the Victorian era to the realism of modern literature, Sister Carrie remains a literary milestone that examines the human condition and all its flaws.", "asin": "1619493217", "rank": "1094705", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/51S9wHS%2BfSL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}