{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 89, "rating": 3.3, "reviews": [{"review_sentiment": 1.0, "review_text": "The vast majority of people living in Paris are not Glitterati; they go about their lives, working for the legal tender. It can be very hard and rough and yes, I lived in Paris as well. This thing sounds narcissistic to me and the name-dropping is quite silly."}, {"review_sentiment": 3.0, "review_text": "Easy to read with authors  unique style.  Brevity.. Choice adjectives.  No fluff. Snappy character depictions. A good read. Interesting material"}, {"review_sentiment": 3.0, "review_text": "Edmund White moved to Paris in 1983, wanting to leave New York City in the midst of the AIDS crisis. Michel Foucault told him that he didn’t believe there was a disease that targeted gays – but he later died of it.White was forty-three years old, couldn't speak French, and only knew two people in the entire city. But in middle age, he discovered the new anxieties and pleasures of mastering a new culture. When he left fifteen years later to take a teaching position in the U.S., he was fluent enough to broadcast on French radio and TV, and in his work as a journalist, he'd made the acquaintance of everyone from Yves Saint Laurent to Catherine Deneuve, though he admits he didn’t recognise rock stars or models at a party of Elton John’s 50th birthday. Notwithstanding, he does a lot of name dropping.He'd also developed a close friendship with an older woman, Marie-Claude, through which he'd come to understand French life and culture in a deeper way.The title evokes the Parisian landscape in the eternal mists and the half-light, the serenity of the city compared to the New York White had known (and vividly recalled in City Boy). White fell in love with the city and its culture: both intoxicated and intellectually stimulated. He became the definitive biographer of Jean Genet, wrote lives of Marcel Proust and Arthur Rimbaud and he received the French Order of Arts and Letters.This book recounts gossip and enchantment. There is some stuff about paedophiles and I’m surprised there hasn’t been any legal action.Proust gets mentioned a lot because White wrote a biography of him. There are moments, such as a sketch of the ancient Rothschilds “tottering forth for yet another dinner party – beautifully dressed, slender, on time, impeccable”, when the writing appears to be slipping into a parody of Proust.Sex laces its way through the book, until the advent of Aids. He tells the story of his lovers who fall to the disease, two of them weirdly yoked together with him as their health rapidly declines. Though he – a \"slow progressor\" – remains healthy, they die. \"Even though I'm an atheist, for a long time I lit candles in every church I visited.\"At the centre of the book is his friendship with the literary critic Marie-Claude de Brunhoff, who embodies much of what it is about the French that White loves, staying with her on the Île de Ré the epitome of French rural life. But like many of the relationships described in the book, it comes and goes rather fitfully. Promising character studies often just stop, pushed aside by someone else whose story is, for the present, more interesting.I can’t see why he thinks that chicken cooked in peanut butter is some sort of culinary faux pas.He gets things wrong: .When my born-again cousin Dorothy Jean came to Paris, I took her to a museum entirely devoted to the work of Gustave Moreau and pointed out a painting of Judith cutting off the head of Holofernes. \"It's a biblical scene,\" I said optimistically.\"That's not in my Bible,\" she scoffed.And it isn’t in the protestant canon.But there are many wonderful moments: the distinguished, discreetly gay homme de lettres Bernard Minoret meets une tante (an old queen, as White tells us), who asks \"Do you know my nephew?\" \"Yes,\" replies Minoret, \"he was my nephew last year.\" He begins to embrace the quintessentially French idea of the milieu, an attachment to the group rather than to individuals, and he knows which side he comes down on in the choice between \"healthy but bland America, deep but diseased France\". On the other hand, perhaps, as he says, \"I'm the kind of guy who's always wanted to be elsewhere.\""}, {"review_sentiment": 4.0, "review_text": "Fascinating. I did get tired of the endless litany of names and relationships, only to remind myself that when Mr White says 'famous', he isn't kidding. Once again I am struck by the hidden thread of homosexuality that runs throughout our creative and intellectual populations. I don't think it is coincidental"}, {"review_sentiment": 3.0, "review_text": "This is a book written over years, which is evident by his changes in writing style. It's full of memories of the people White has met. A bit of a gossip piece with almost no flavor of Paris. Lots of name dropping. Enjoyable reading if you know the people he's talking about already."}, {"review_sentiment": 5.0, "review_text": "Most of us who inhabit affluent western countries consider ourselves civilized because of things like eating with knives and forks, having indoor plumbing, Beethoven's 9th symphony, the paintings of Rembrandt, the films of Fellini, the discovery of penicillin, Tolstoy's Anna Karenina, the invention of the airplane, the invention of the motion picture camera, Shakespeare's Hamlet, open-heart surgery, the polio vaccine, Wagner's Tristan and Isolde, and a successful manned round-trip voyage to the moon. Of course, thousands of other items can be added to this list of astonishing human achievements. However, the truth is that what makes us civilized (or not) is something much more basic: the way we treat each other as human beings, and the way we treat persons from other countries and other cultures. This principle extends especially to the way we treat our enemies. (Euripides helped to define ancient Athenian civilization when he wrote a sympathetic play called The Persians.) To respect other cultures and individual human rights is the very essence of what it means to be civilized. The music of U-2, the paintings of Titian, and the advent of the supersonic passenger jet are mere by-products of actually being civilized.This is all a prelude to my assertion that Edmund White is just about the most civilized man I have ever met. There is abundant evidence of this in his beautiful new memoir, Inside a Pearl: My Years in Paris. Yes, he knows which fork to use for the fish and which for the salad; far more importantly, however, he is kind and generous to everyone he meets. His manner with other people is positively gallant. This book makes clear that friendship and love hold the highest value among all the many things he treasures in this life. I believe he would have given up all his literary success to have had a few more years with his wonderful friend, Marie-Claude. In many ways, the real subject of this book is the extraordinary love which was that friendship until the day of her death. This friendship between a gay man and a straight woman was an eternal bond, the kind that changes lives; I believe it meant as much to the author as any passionate love relationship he had with another man. And White is not shy about letting us know that there have been a good many of those.Inside a Pearl is the kind of memoir that quickens the reader's breath and delights the senses. It also makes us—or me, anyway—feel as if I have led an awfully dull life. It is the story of a man to whom extraordinary things just happen. It is the story of a man who treasures human experience rather than material possessions. It is also an extended glimpse into a world few of us will ever enter, for the simple reason that the things most treasured in Edmund White's world are things Americans seem to feel have little or no value.The celebrated novelist moved to Paris to live in 1983. He was forty-three years old. He had lied brazenly to the editors of American Vogue, telling them that he spoke the language fluently. He could barely say Bonjour. No matter—Vogue got more than their money's worth. He is an intensely social creature and he found himself living among an intensely social people. He made a great effort to learn the French language, spending entire days on his sofa in his first apartment on the Ile Saint-Louis, reading French novels and looking up every other word in a dictionary. This was part of a rather long and awkward learning phase. If Parisians allow an American to speak French at all—that is, without interrupting in their maddeningly good English—it is only because the American in question speaks French very, very well. Early on the author had an unpleasant experience at a dinner party: he had had three of four glasses of wine and was babbling at length about something or other in his raw and mostly incoherent French. His listeners looked bewildered. Finally, the hostess leaned toward White and said sotto voce: “You are making no sense, Edmund. No one can understand anything you are saying.”A dismal but inevitable moment for anyone trying to learn a new language. White worked unceasingly until he had mastered the French language, ultimately giving lectures and interviews on television in French.Much of the text comes at the reader in a head-long rush: this may be disconcerting to some readers; but I find it exhilarating. The pace of the narrative seems to reflect the greedy energy with which the author lived his life in Paris, always craving new books, new acquaintances, new foods—even Parisian streets that were new to him. The anecdotes told in this book are so numerous and so rich that one has to wonder when Edmund White actually slept. He attended more dinner parties than Diane von Furstenburg, and gave more dinner parties than Julia Child. If there is one homely truism to be derived from reading this book, it is surely that what we call “real life” is indeed stranger than fiction.The author offers up hilarity and great wit in a modest fashion. He will describe a casual sexual encounter in the same matter-of-fact manner that he would use in describing his introduction to Catherine Deneuve. He met and mingled with many famous people; nevertheless, he gives them no more time and attention than he gives to a chubby concierge with a bizarre-looking cat. More than once he has been a judge on the committee that determines the winner of Britain's prestigious Booker Prize for best novel of the year. He mentions it, in passing, as he launches into a description of one of his many trips to London during his sojourn on the Continent.As suggested earlier, the dominant themes of this memoir are love and friendship. White is that rarest of American novelists: a writer who is more devoted to the people he cares about than to literature and his own work. Clearly, he liked the French immediately. It is crucial to point out here, however, that his exposure to the French was almost entirely to Parisians. They are a different breed from the rest of the French. Like New Yorkers, Parisians casually assume that their city is the center of the universe. I spent a very happy year as a university student in France, from September 1973 to July 1974. My experience was very different from White's in that I arrived in France at the age of twenty, already fluent in the language. I was tall, strong, good looking, and running around in a red-white-and-blue ski parka with matching mittens dangling off of clips. My youth and my smile got me everything I wanted—almost without asking. When I opened my mouth and beautiful French came out, the Grenoblois practically swooned. (Alas, I would later learn that the insolent beauty of youth is a very fleeting gift.) Another important thing: I was not in Paris, I was in the provinces. Grenoble is a city in southeastern France, at the foot of the French Alps. It is a large, cosmopolitan city but much smaller and less socially formal than Paris. Another critical difference has to do with the fact that I mostly interacted with French students. Like university students everywhere, French kids are eager to prove themselves open and easy-going. The social situations I found myself in did not confuse me. The students at the University of Grenoble turned everyone into a copain or “comrade.” My experience was entirely wonderful—the happiest year of my life. But having a cheap midnight supper in a little Grenoble restaurant with a bunch of fellow university students after seeing Bergman's Cries and Whispers is very different from sitting down to a formal dinner for eight, in a Parisian dining room, among wealthy and professionally successful persons in their thirties, forties and fifties. The subtle social layers at that gathering can only be grasped by a foreigner through years of work: trial and error. The risk and effort needed to acquire such insight can be painful; certainly the whole project is baptism by fire. White devoted twenty years to this baptism, exploring the French psyche with unflagging fascination and great persistence: he does a better job of explaining these inscrutable people and their national genius than anyone else I have ever read. Just to give one example: White explains that it would be perfectly all right at a Parisian dinner party to discuss an extremely violent film depicting rape and pedophilia, whereas it would freeze the company with disdain if anyone brought up the subject of money. At dinner parties in Manhattan, people talk endlessly about the stock market, hedge funds, and real estate development. This is not at all the case in Paris. Why? White helps us understand. (Parisians still confuse the hell out of me.) In Paris a seemingly minor social misstep can end a friendship before it has started.Gabrielle, darling, I never want to see that American idiot at my table again. Understood?  IIWhite and his friend Marie-Claude were entirely devoted to one another. They are depicted together on the book's cover. But like nearly all persons from Latin countries, she was late for every social engagement. If White was cooking, the tardiness made him furious. Then she would show up in her drape-like garments, smoking through her elegant cigarette holder, languidly take a seat on the sofa, breathe forth a long sigh, and declare: “My God! We are all exhausted. We are all so exhausted.” And White's annoyance would dissipate instantly.Marie-Claude brings to mind another French mystery that the author briefly explores—a feminine mystery, the best kind—that of “the scarf.” French is a much more precise, logical and regular language than English. For centuries, it was the language of European diplomacy because of the exceptional clarity one can achieve while speaking it. Its overall vocabulary is much smaller than that of English; yet for some impenetrable reason the French have many words for scarves. And French women are able to transform their entire appearance with the skillful application of one silk scarf. Then again, a French woman can step out of a mud-wrestling match looking bewitching. This occult ease of transformation is a mystery that manifests constantly; and it is incredibly annoying to American women who seem to require truckloads of expensive clothing, cosmetics, and shoes to make themselves eye-catching. Keep in mind that Marie-Claude was practically made of lovely scarves.There is a short section in the book that has to do with White's five-year relationship—it was in fact a marriage—with the young French architect, Hubert Sorin. I believe White chose not to go into much detail about this highly important relationship in this memoir because the story was explored extensively in his highly autobiographical 2000 novel The Married Man. White took care of Sorin tenderly, during a four-year period of terrible sickness. It was hell.I met Edmund White in the fall of 1990, shortly after he had arrived in Providence, Rhode Island to begin a teaching stint at Brown University. Hubert Sorin arrived soon after. I remember driving down from New Hampshire one Saturday to spend the day with them. I remember, in particular, taking a walk in a nearby park with Hubert and their new Basset Hound. Hubert spoke of how hard Ed was working to finish his Jean Genet biography. (The book won the National Book Award for biography in 1993.) The beginning of their shared tragedy was that this handsome and charming young man quickly began to show symptoms of full-blown AIDS. The couple had to return to France because it was only there that Hubert could receive the expensive medical treatment he needed. At that time, the faculty insurance arrangements at Brown did not make provision for same-sex spouses. Hubert Sorin would die in 1995, during a trip to Morocco that was intended to be a pleasant distraction for Hubert from his constant physical pain.White chose to stay on in Paris for a few more years. He would eventually meet his current partner, the American fiction writer Michael Carroll, with whom he has been happily sharing his life for nineteen years. They now live in New York City, and White teaches a short distance away at Princeton.Edmund White has always been a great prose stylist, tending toward the voluptuous and the Baroque. I once told him that his prose reminded me a good deal of John Updike's; he replied that he pretty much hated Updike's work but was very flattered by my remark anyway. The writing in this memoir is more rapid, terse and straightforward than the prose in the three novels of his great autobiographical trilogy: A Boy's Own Story, The Beautiful Room is Empty, and The Farewell Symphony. This memoir is packed with little stories that come at the reader like automatic weapons fire. In fact, the way the book delivers anecdotal information reminds me very much of Robert Graves' great memoir about World War I, Goodbye to All That. The pace is varied, however, and should not trouble an intelligent and interested reader. Toward the close of one chapter near the end of the book, White slows down to describe a seemingly minor incident, but one that is very moving and significant: he is walking through a London park, alone, on a damp autumn evening. He is passed by a small crowd of handsome and beautifully-dressed young Londoners, all of them rich, tipsy, happy and giggling. Sorin's death is still a raw wound at the time. The almost-encounter with the English jeune gens makes White feel utterly invisible, not to mention old, broke, frightened, and alone. Anyone over forty will experience this anecdote like a punch in the gut.White has an unfailing gift for being in the right place at the right time: he manages to hear, see and observe things that most of the rest of us are too cosmically disconnected to catch. At some point, White was asked byVanity Fair to interview an old Mexican movie star named Maria Félix. Referring to a period in her youth when she dared to stroll about Paris alone at night, he asked her how she could venture through the Bois de Boulogne in the wee hours of the morning. Did she not fear being harmed by the big, burly, transvestite prostitutes who plied their trade in those woods? The Mexican actress replied: “Oh, Monsieur White, I admire them so! We are just biological women; they are artistic, constructed women. They are the real women.” Many would immediately dismiss this remark as crazy, and certainly not include it in their memoirs. But White's antennae are so finely adjusted as to pick up on just about every nuance of everything he might encounter in the world. He knows instinctively when a moment in time is beyond price. White also briefly and casually describes a young English boyfriend, walking naked and drunk through White's Paris apartment, simultaneously twirling and urinating, sprinkling the place with British piss. White found the episode mildly amusing. I would have thrown the moron off the balcony.To be sure, White mentions a great many persons and things in this memoir—things and persons that were parts of his life in Paris. Some early and careless reviewers have labeled this an objectionable kind of “name dropping.” I would strongly suggest to anyone who has never heard of Jean Cocteau, Susan Sontag, Michel Foucault, Simone Signoret, Eric Rohmer, Albert Camus, and le Prix Goncourt, that the problem lies not with the text of White's book but rather with that particular reader's more-than-half-empty head. In any case, the primary reason American readers rush to read the memoirs of a famous person is in the hope of finding other famous persons mentioned in some compromising scenario or other—the more salacious the better.Joyce Carol Oates, who has been for several years a teaching colleague of White's at Princeton, recently published a memoir about the aftermath of her beloved husband's death: A Widow's Story (Harper-Collins, 2011). She states repeatedly that the person who helped her the most during this period when she desperately sought solace and understanding was Edmund White. She calls him “the Mozart of friendship.”"}, {"review_sentiment": 2.0, "review_text": "It is interesting, but the constant name-dropping becomes somewhat tedious."}, {"review_sentiment": 5.0, "review_text": "Very Nice Copy . Looks NEW ! Fast delivery !!"}, {"review_sentiment": 3.0, "review_text": "big name dropper"}, {"review_sentiment": 5.0, "review_text": "If you are a fan and follower of Edmund White, then you have probably already read this book. If not, you have a wonderful future! I envy the discovery! Edmund White is sui generis. His Paris is full of outre characters and other interesting people--all of whom seem to revel in being Parisian. White lived there for 17 years, during which time he penetrated the deepest quarter of Parisian life--this is because he was already an established author who then went on to write the seminal  biography of Genet (a work that changed my life). He has also written a jewel of a biography of Proust. It's uncanny how intimate I felt I became with Proust. I couldn't help comparing White's Paris to his description of Proust's Paris. Proust's Paris reminds me more of the Upper East Side in the fifties and sixties, when money and the establishment flirted with the counter-culture and decadence was delicious to contemplate--a nonthreatening fruit of privilege--the latter day Paris is more like a refuge from our global technocracy--where people still meet, almost in secret, to exchange ideas and just plain celebrate the colorful."}]}, "authors": ["Edmund White"], "isbn": "1620406330", "longitude": 2.3514992, "periods": ["1900s"], "title": "Inside a Pearl: My Years in Paris", "word_cloud": "vast majority people live go live work legal tender hard yes live well thing sound narcissistic quite silly easy author unique style adjectives fluff character depiction good material move want leave midst crisis tell disease target gay later die old french people entire city middle age discover new anxiety pleasures master new culture leave fifteen later take teach position fluent enough broadcast radio tv work journalist make acquaintance everyone yves admits recognize rock star model party birthday lot name also develop close friendship older woman understand life culture deeper title evokes parisian landscape eternal mist serenity city compare know vividly recall fell city culture intoxicate intellectually stimulate become definitive biographer write life receive french recount gossip enchantment stuff pedophile surprise legal get mention lot write biography moment ancient totter forth yet dinner party beautifully dress slender time impeccable writing appear slip parody lace way advent tell story lover fall disease weirdly yoke together health rapidly decline slow progress or remain healthy die even atheist long time light candle church visit center friendship literary critic embodies much french love stay french rural life many relationship describe come go rather fitfully promise character study often stop push someone else story present see think chicken cooked peanut butter sort culinary faux get thing wrong cousin come take museum entirely devote work point paint cut head holofernes biblical scene say optimistically protestant many wonderful moment distinguish discreetly gay home meet rune ante old queen tell ask do reply nephew last year begin quintessentially french idea milieu attachment group rather individual know side come choice healthy bland deep diseased hand perhaps say kind guy always want elsewhere fascinate get tired endless litany name relationships remind say kidding strike hidden thread homosexuality run creative intellectual population think coincidental write evident change write style full memory people meet bit gossip piece almost flavor name drop enjoyable reading know people talk already most inhabit affluent western country consider civilized thing eat knife fork indoor plumb symphony painting film discovery penicillin invention airplane invention motion picture camera surgery polio vaccine successful man voyage moon course thousand item add list astonish human achievement however truth make civilized something much basic way treat human being way treat person country culture principle extend especially way treat enemy help ancient athenian civilization write sympathetic play call culture individual human right essence mean civilize music paint titian advent supersonic passenger jet actually prelude assertion civilize man ever meet abundant evidence beautiful new memoir know fork use fish salad far importantly however kind generous everyone meet manner people positively gallant make clear friendship love hold highest value many thing treasure life believe give literary success wonderful friend many way real subject extraordinary love friendship day death friendship gay man straight woman eternal bond kind change live believe meant much author passionate love relationship man shy let know good many kind memoir quicken breath delight sense also make lead awfully dull life story man extraordinary thing happen story man treasure human experience rather material possession also extend glimpse world ever enter simple reason thing treasure world thing seem little celebrated novelist move old lie brazenly editor tell speak language fluently barely get money intensely social creature find living intensely social people make great effort learn french language spending entire day sofa first apartment read french novel look word dictionary part rather long awkward learn phase allow american speak french interrupt maddeningly good american question speaks french well early author unpleasant experience dinner party glass wine babble length something raw mostly incoherent french listener look bewilder hostess lean say lotto cove make sense one understand anything dismal inevitable moment anyone try learn new language work unceasingly master french language ultimately give lecture interview television text come rush disconcert reader find exhilarate pace narrative seem reflect greedy energy author live life always crave new new acquaintance new streets new anecdote tell numerous rich wonder actually sleep attend dinner party give dinner party homely truism derive read surely real life indeed stranger author offer hilarity great wit modest fashion describe casual sexual encounter manner describe introduction meet mingle many famous people nevertheless give time attention give chubby concierge cat judge committee determines winner prestigious best year mention pass launch description many trip sojourn suggest earlier dominant theme memoir friendship rarest american novelist writer devote people care literature work clearly like french immediately crucial point however exposure french almost entirely different breed rest french casually assume city center universe spend happy year university student experience different arrive age twenty already fluent language tall strong good look run around ski parka match mitten dangle clip youth smile get everything ask open mouth beautiful french come practically swoon later insolent beauty youth fleet gift important thing provinces grenoble city southeastern foot large cosmopolitan city much smaller le socially formal critical difference fact mostly interact french student university student everywhere french kid eager prove open social situation find student turn everyone co pain experience entirely happiest year life cheap midnight supper little grenoble restaurant bunch fellow university student see different sit formal dinner din room wealthy professionally successful person thirty forty fifties subtle social layer gather grasped foreigner work trial error risk effort need insight painful certainly whole project baptism fire devote baptism explore french psyche unflagging fascination great persistence better job explain inscrutable people national genius anyone else ever just example explain perfectly right dinner party discus extremely violent film depict rape pedophilia whereas company anyone brought subject money dinner party people talk endlessly stock market hedge fund real estate development case help understand still hell seemingly minor social misstep end friendship darling never want see american idiot table friend entirely devote depict together cover nearly person latin country late social engagement cook tardiness make furious then garment smoke elegant cigarette holder languidly take seat sofa breathe forth long sigh declare exhaust annoyance brings french mystery author briefly feminine mystery best french much logical regular language century language european diplomacy exceptional clarity achieve speak overall vocabulary much smaller english yet impenetrable reason many word scarf french woman able transform entire appearance skillful application silk scarf then woman step match look bewitch occult ease transformation mystery manifest constantly incredibly annoy american woman seem require truckloads expensive clothing cosmetic shoe make mind practically make lovely short section fact young french architect believe choose much detail highly important relationship memoir story explore extensively highly autobiographical take care tenderly period terrible sickness meet fall shortly arrive teach stint arrive soon remember drive spend day remember particular take walk nearby park new speak hard work finish biography biography beginning share tragedy handsome charm young man quickly begin symptom couple return expensive medical treatment need time faculty insurance arrangement make provision spouse trip intend pleasant distraction constant physical choose stay eventually current partner american fiction writer happily share life nineteen live teach short distance away always great prose stylist tend voluptuous tell prose remind good deal reply pretty much hat work flatter remark anyway write memoir rapid terse straightforward prose novel great autobiographical trilogy memoir pack little story come automatic weapon fire fact way delivers anecdotal information remind much great memoir goodbye pace vary however trouble intelligent interested chapter end slow describe seemingly minor incident move significant walk park alone damp autumn even pass small crowd handsome young rich tipsy happy giggle death still wound time jejune gen make utterly invisible mention old break frightened alone forty experience anecdote punch unfailing gift right place right time manages hear see observe thing rest cosmically disconnect catch point ask by vanity interview old movie star name period youth dare stroll alone night ask venture wee hour morning fear harm big burly transvestite prostitute ply trade wood actress reply admire biological woman artistic construct woman real immediately remark crazy certainly include memoir antennae finely adjust pick nuance everything world know instinctively moment time price also briefly casually describes young boyfriend walk naked drunk apartment simultaneously twirl urinate sprinkle place british piss find episode mildly amuse moron sure mention great many person thing person part life early careless reviewer label objectionable kind name strongly anyone never hear le problem lie text rather particular head case primary reason american reader rush memoir famous person hope find famous person mention compromise scenario salacious several teach colleague recently publish memoir aftermath beloved husband death state repeatedly person help period desperately seek solace understand call friendship interest constant becomes somewhat tedious very nice delivery big name dropper fan follower probably already wonderful future envy discovery sew full outre character interest people seem revel live time penetrate deepest quarter parisian life already establish author go write seminal biography work change life also write jewel biography uncanny intimate felt become compare description remind fifty sixties money establishment flirt decadence delicious contemplate nonthreatening fruit privilege latter day refuge global technocracy people still almost secret exchange idea plain celebrate colorful", "genres": ["Memoir", "LGBT"], "summary": "When Edmund White moved to Paris in 1983, leaving New York City in the midst of the AIDS crisis, he was forty-three years old, couldn't speak French, and only knew two people in the entire city. But in middle age, he discovered the new anxieties and pleasures of mastering a new culture. When he left fifteen years later to take a teaching position in the U.S., he was fluent enough to broadcast on French radio and TV, and in his work as a journalist, he'd made the acquaintance of everyone from Yves Saint Laurent to Catherine Deneuve to Michel Foucault. He'd also developed a close friendship with an older woman, Marie-Claude, through which he'd come to understand French life and culture in a deeper way.\r\n\r\nThe book's title evokes the Parisian landscape in the eternal mists and the half-light, the serenity of the city compared to the New York White had known (and vividly recalled in City Boy). White fell headily in love with the city and its culture: both intoxicated and intellectually stimulated. He became the definitive biographer of Jean Genet; he wrote lives of Marcel Proust and Arthur Rimbaud; and he became a recipient of the French Order of Arts and Letters. Inside a Pearl recalls those fertile years for White. It's a memoir which gossips and ruminates, and offers a brilliant examination of a city and a culture eternally imbued with an aura of enchantment.", "asin": "1620406330", "rank": "1065380", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51WE4e65bUL.jpg", "country": "France", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}