{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 293, "rating": 4.3, "reviews": [{"review_sentiment": 3.0, "review_text": "It's a tough book too get through because there are so many difficult names and places involved. However, the  basic story is interesting and I think I learned a lot about the man and the period. If  you have any interest in art or about the Vatican it's worth a try."}, {"review_sentiment": 5.0, "review_text": "Excellent!!!"}, {"review_sentiment": 5.0, "review_text": "Ross King brings the work of Michelangelo and the ceiling of the Sistine Chapel back down from the scaffolding to earth where it belongs.  It is a wondrous read, with shocks and surprises galore.  I won't spoil any...Let's just say that Michelangelo showed how great an artist he really was with a project he both never wanted to do and was totally unsuited for, to boot. (And, dammit, I need to make a third trip to Rome so I can see what I missed while stating right at it all! 😉)"}, {"review_sentiment": 5.0, "review_text": "Great"}, {"review_sentiment": 3.0, "review_text": "boring"}, {"review_sentiment": 4.0, "review_text": "It was a very well researched book. It had a lot of information but I learned a lot about the Sistine Chapel, the religious bickering and politics of the time. Made a great discussion with my book group."}, {"review_sentiment": 1.0, "review_text": "I will look for something else to tell the story of the ceiling painted by the sculptor. Good to have an Art Historian as a friend."}, {"review_sentiment": 5.0, "review_text": "Fascinating history of the painting of the Sistine Chapel with many details of technique as well as Michelangelo's life and his interactions with several Popes."}, {"review_sentiment": 5.0, "review_text": "good historical reading."}, {"review_sentiment": 5.0, "review_text": "A must read before you see the chapel - detailed and an easy and interesting read.And everyone did see the chapel."}]}, "authors": ["Ross King"], "isbn": "1620408406", "longitude": 12.4829321, "periods": ["1500s"], "title": "Michelangelo and the Pope's Ceiling", "word_cloud": "tough many difficult name place involve however basic story interest think learn lot man period interest art worth try excellent bring work back scaffold earth belongs wondrous shock surprise galore show great artist really project never want totally unsuited boot dammit need make third trip see miss state right great boring well research lot information learn lot religious bicker politics time make great discussion group look something else story paint sculptor friend fascinate history paint many detail technique well life interaction several pope good historical reading detailed easy interesting everyone see chapel", "genres": ["Biography", "Art & Architecture", "History"], "summary": "In 1508, despite strong advice to the contrary, the powerful Pope Julius II commissioned Michelangelo Buonarroti to paint the ceiling of the newly restored Sistine Chapel in Rome. Despite having completed his masterful statue David four years earlier, he had little experience as a painter, even less working in the delicate medium of fresco, and none with challenging curved surfaces such as the Sistine ceiling's vaults. The temperamental Michelangelo was himself reluctant: He stormed away from Rome, incurring Julius's wrath, before he was eventually persuaded to begin.\r\n\r\nMichelangelo and the Pope's Ceiling recounts the fascinating story of the four extraordinary years he spent laboring over the twelve thousand square feet of the vast ceiling, while war and the power politics and personal rivalries that abounded in Rome swirled around him. A panorama of illustrious figures intersected during this time-the brilliant young painter Raphael, with whom Michelangelo formed a rivalry; the fiery preacher Girolamo Savonarola and the great Dutch scholar Desiderius Erasmus; a youthful Martin Luther, who made his only trip to Rome at this time and was disgusted by the corruption all around him. Ross King blends these figures into a magnificent tapestry of day-to-day life on the ingenious Sistine scaffolding and outside in the upheaval of early-sixteenth-century Italy, while also offering uncommon insight into the connection between art and history.", "asin": "1620408406", "rank": "215054", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/514Fcr2wD1L.jpg", "country": "Italy", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}