{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 17, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "OK book it does not grab u"}, {"review_sentiment": 5.0, "review_text": "Very entertaining. It is like a visit to a different place and time but very real and educational.Gloria is a strong woman and has characteristics we can admire dispite her profession. She shows love and courage and we get an inside view of life for painted ladies."}, {"review_sentiment": 5.0, "review_text": "Well written book giving insights into life in Jamaica in times past.and a very interesting look at the Jamaican Chinese community in particular. I could not put it down.."}, {"review_sentiment": 4.0, "review_text": "Charming and well written."}, {"review_sentiment": 5.0, "review_text": "Having read Kerry Young's Pao I'm pleased to have read Gloria. Kerry Young tells a believable story easy to read offering a glimpse of a Jamaica of the past and shedding  some light on present day JA"}, {"review_sentiment": 5.0, "review_text": "Loved reading this story-line from Gloria's perspective! Kerry Young is a great author. She has developed this story-line quite well and I look forward to her next book."}, {"review_sentiment": 1.0, "review_text": "Loved it."}, {"review_sentiment": 4.0, "review_text": "An excellent telling of the other side of Pao. Although very culturally specific, Young appears to have tapped Jung's theory of the 'Collective Unconscious' to create a story that is as familiar as it is foreign, as personal as it is voyeuristic.  Wonderful read."}, {"review_sentiment": 5.0, "review_text": "Connects me with the Jamaica I know and how it came about."}, {"review_sentiment": 5.0, "review_text": "This is a haunting story that draws one in to the heart of Jamaica gives enormous insights into the struggles of its people. At the same time, Gloria's life itself is absorbing and intimate. There is no trace of artifice here as one is immersed in the island patois and speech patterns. It is both a poignant tragedy and an uplifting epic."}]}, "authors": ["Kerry Young"], "isbn": "1620400758", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "Gloria", "word_cloud": "ok grab u very entertain different place time real strong woman characteristic admire dispute profession show love courage inside view life paint lady well write give insight life time interesting look community particular charm well write have please tell believable story easy offering glimpse shed light present day love reading perspective great author develop quite well look forward next love excellent tell side culturally specific appear tapped theory create story familiar foreign personal voyeuristic connects know come haunt story draw heart give enormous insight struggle people time life absorb intimate trace artifice immerse island patois speech pattern poignant tragedy uplift epic", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Jamaica, 1938. Gloria Campbell is sixteen years old when a single violent act alters the course of her life forever. Taking along her younger sister, she flees their hometown to forge a new life in Kingston. But in a capital city awash with change, a black woman is still treated as a second-class citizen. From a room in a boarding house and a job at a supply store, Gloria finds her way to a house of ill repute on the edge of the city, intrigued by the glamorous, financially independent women within.It is an unlikely place to meet the love of your life, but here she encounters Pao, a Chinatown racketeer and a loyal customer who will become something more. It is also an unlikely place to gain a passion for social justice, but it is one of the house's proprietors who instills in Gloria new ideas about the rights of women and all humankind, eventually propelling her to Cuba, where even greater change is underway, and where Gloria must choose between the life she has made for herself and the one that might be.\r\n\r\nAlive with the energy of a country at a crossroads, this is a story of love in many forms, and of Gloria's evolution-from a frightened girl on the run to a woman fully possessed of her own power.", "asin": "1620400758", "rank": "1427141", "city": "Jamaica", "image": "https://images-na.ssl-images-amazon.com/images/I/512zuColt1L.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}