{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 159, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Amazing book! With several trips to San Francisco this book has helped me understand it more. If you're about to go to SF (to visit, live or even for knowledge) this is a MUST read!"}, {"review_sentiment": 5.0, "review_text": "I'm a San Francisco native and I dip into this book whenever I need a taste of the City."}, {"review_sentiment": 4.0, "review_text": "Enjoyed reading about the various hidden treasures in San Francisco. I'll have to check many of the out during my next visit. Did not care for the history lesson that was included or the author's socio-economic views."}, {"review_sentiment": 5.0, "review_text": "I'm partial because I am a Native San Franciscan and I adore 'my city.' I grew up in the 40's when it was fabulously not crowded, rents were affordable and basically no crime. Thirty years ago I moved to a small island in Washington State which I love and for years I would dream of being in San Francisco and exploring my old neighborhoods. Now it has changed so dramatically I can't imagine living there. Gary Kamiya has written a great book and I learned so much about the early days. I have sent copies of the book to other natives and they also loved it."}, {"review_sentiment": 5.0, "review_text": "Very eclectic and fun read. At times he embellishes about the city he loves, but can you blame him? Very interesting and has given me a better understanding of not only SF, but of CA."}, {"review_sentiment": 5.0, "review_text": "Great history and trivia about the best city in the world! I have 49 things to add to my bucket list."}, {"review_sentiment": 5.0, "review_text": "I'm a Bay Area resident and recently was inspired to learn more about the history of where I live.  Since I began Cool Gray City of Love I've been sharing vignettes and raving about it to countless friends.  Gary has created a literary mix tape of San Francisco history- melding geology and prehistoric times seamlessly with the lives of the stalwart first residents of the land and his own colorful history.  He traverses the history of the Tenderloin as easily as the formation of the Farallon Islands.  He is unflinching in covering the hardships of the early gold miners and the African American workers who flocked to the area for shipbuilding during WWII.  I now see the incredibly rich history behind neighborhoods and even specific buildings as I walk through the city. This breadth of this book is an incredible gift to anyone who lives in the area or is curious about how this beautiful hotbed of innovation came to be."}, {"review_sentiment": 5.0, "review_text": "great book. a must read for anyone interested in the history of san francisco from the view of all of its nooks and crannies."}, {"review_sentiment": 5.0, "review_text": "This is the mother of Travel Books. I lived in the Bay Area and know some the places discussed -- and, learn about quite a few ones, as well."}, {"review_sentiment": 5.0, "review_text": "great shape"}]}, "authors": ["Gary Kamiya"], "isbn": "1620401266", "longitude": -122.4192363, "periods": ["1800s", "1900s", "2000s", "Recent Releases"], "title": "Cool Gray City of Love: 49 Views of San Francisco", "word_cloud": "amaze several trip help visit live even knowledge native dip need read various hidden treasure check many next visit history lesson include author partial native adore grow fabulously crowded rent affordable basically crime year ago move small island love year explore old neighborhood now change dramatically live write great learn much early day send copy native also love very eclectic fun time embellish love blame very interesting give better understand history trivia best world thing add bucket list resident recently inspire learn history live begin share vignette rave countless friend create literary mix tape meld geology prehistoric time seamlessly live stalwart first resident land colorful history traverse history easily formation islands unflinching cover hardship early gold miner african american worker flock area shipbuilding see incredibly rich history neighborhood even specific building walk breadth incredible gift anyone live area curious beautiful hotbed innovation come great anyone interested history view nook cranny mother live know place discuss learn quite one well great shape", "genres": ["History", "Travel Writing"], "summary": "A runaway San Francisco Chronicle bestseller, Cool Gray City of Love is a one-of-a-kind book for a one-of-a-kind city. It's a love song in 49 chapters to an extraordinary place, taking 49 different sites around the city as points of entry and inspiration-from a seedy intersection in the Tenderloin to the soaring sea cliffs at Lands End. \r\n\r\nEncompassing the city's Spanish missionary past, a gold rush, a couple of earthquakes, the Beats, the hippies, and the dot-com boom, this book is at once a rambling walking tour, a natural and human history, and a celebration of place itself-a guide to loving any place more faithfully and fully.\r\n\r\n“Written in a confessional first-person tone that invokes a conversation between two old friends: Kamiya and the city he has called home for over 40 years . . . impressive is the author's uncanny grasp of the bay's natural history and the way that the landscape continues to shape the lives of current San Franciscans . . . Kamiya has written a fitting ode to an exceptional city.” Publishers Weekly", "asin": "1620401266", "rank": "45116", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51SRnXMkonL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}