{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 9, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "I've not read a voice like this before. In his specificity, the author brings poetry to things that society glosses over (buffs, to use his word). The uniqueness of hip hop beats. The colors and brands and attributes of paint. The nuance of a dribble that changes the trajectory of the shooter, the defender, the ball. The cultural traditions of individual Pacific islands. The way \"Macedonian\" does not mean \"generic Eastern European\" -- but *Macedonian*. And it's not just the reader perceiving this poetry; the characters contain it, and consider it. It's all about heritage -- of music, people, art, places -- and what that heritage means to today. I think this is an auspicious first novel, and will look for his work in the future."}, {"review_sentiment": 5.0, "review_text": "A linguistic achievement."}, {"review_sentiment": 4.0, "review_text": "an entertaining novel."}, {"review_sentiment": 3.0, "review_text": "Perhaps a little too much dialogue but the story flowed and I enjoyed it and found it helpful in understanding a migrant life challengesVery good"}, {"review_sentiment": 4.0, "review_text": "Thus begins Omar Musa’s novel.  It’s written in a combination of poetry and prose, and examines the alienation, disempowerment and dislocation of three young men on the fringes of Australian urban society.  The three young men, Solomon Amosa, a Samoan, his ‘beige’ coloured half-brother Jimmy and Solomon’s best friend Aleks Janeski, a Macedonian, attend a local greyhound race meeting.  The men talk about dog racing (it will be the last race for a dog called Mercury Fire), about women, about hip-hop.  Solomon, who went to a private school on a basketball scholarship is both the most personable and the most self-aware.  Jimmy, who doesn’t know who his father is, doesn’t know where he belongs.  Aleks, married with a small daughter, is trying to improve their situation.  He does a bit of graffiti (‘graff’), but ends up in prison in association with drug trafficking.‘This has always been a land of fire.’So, what makes this story work?  Does the poetry fracture the prose, or unify it? What forms will their individual struggles for identity take?  And how does hip-hop work as a unifying force?  There’s constant movement in this novel, the rhythm of the poetry, the beat of the music underscore the activity, and the environment itself is not passive.  There’s sense of foreboding, of possibility and of danger.‘The day hot and strange and flattened, almost monochrome.’Although in many ways Solomon was the most likeable and articulate of the characters, it was Aleks I felt most sympathy for.  I could sense his loss: trying to provide for a family, lost between the Macedonian culture of his youth and the Australian culture of his adoption.  Jimmy has even less of a clear identity, and sense of belonging, and this is going to erupt somewhere.  Somehow.At times I found the blend of poetry and prose dislocating: different languages, differing ways of communicating.  But it worked well as a vehicle of telling the men’s stories and for grounding the hip-hop culture which unites them.  This, for me, is a different way of exploring alienation and dispossession.  One in which I am an outsider and have to work hard to understand.  One in which I hope for positive new beginnings.  This book is well worth reading.Omar Musa is a Malaysian-Australian rapper and writer.  He has released three albums, published two poetry books, and this is his first published novel.‘No worries.  I’ll be back.’Jennifer Cameron-Smith"}, {"review_sentiment": 5.0, "review_text": "An interesting anthropological tour of a sub culture that would be unfamiliar to anyone over the age of 30 (which I am).  The writing is lovely, almost poetic at times.  Musa creates such real characters that lie on the periphery of our vision.  These three young men are trying to make something of themselves but keep bumping into their sociodemographic boundaries which ultimately keep them from becoming something else.Their love of hip-hop culture and graffiti art is presented to the reader and we learn much about its relevance to them.  They are creative men who love these art forms which the establishment does not value.I highly recommend this book as truly fresh voice."}, {"review_sentiment": 5.0, "review_text": "A part of Australia that usually gets thrown over in literature for sheep and paddocks. We need more books like this."}, {"review_sentiment": 4.0, "review_text": "A great 1st novel, not without it's flaws but it's strong point far outweighs those flaws that exist.  I thoroughly enjoyed the book despite the book covering some decidedly difficult/unpleasant issues in part.  Definitely worth a read."}, {"review_sentiment": 5.0, "review_text": "A challenging but top shelf romp through modern australia and the alienation of ethnic minorities in the lucky country circa 2014"}]}, "authors": ["Omar Musa"], "isbn": "1620971178", "longitude": 151.2164539, "periods": ["2000s", "Recent Releases"], "title": "Here Come the Dogs: A Novel", "word_cloud": "voice specificity author bring poetry thing society gloss buff use word uniqueness hip hop beat color brand attribute paint nuance dribble change trajectory shooter defender cultural tradition individual islands way macedonian mean generic perceive poetry character contain music people art place heritage mean today think auspicious first look work future linguistic achievement entertain perhaps little much dialogue story flow enjoy find helpful understanding migrant life challenges very good thus begin write combination poetry prose examines alienation dis empowerment dislocation young men fringe australian urban society young men beige color best friend local greyhound race meet men talk dog racing last race dog call woman go private school basketball scholarship personable know father know belongs marry small daughter try situation bite graffiti gaff end prison association drug always land make story work fracture unify form individual struggle identity take work unifying force constant movement rhythm poetry beat music underscore activity environment passive sense forebode possibility day hot strange flatten almost many way likable articulate character ales felt sympathy loss try family lose macedonian culture youth australian culture adoption even le clear identity sense belong go erupt somewhere time find blend poetry prose dislocate different language differ way communicate work well vehicle tell men story ground culture unite different way explore alienation dispossession outsider hard hope positive new beginning well worth rapper writer release album publish poetry first publish worry jennifer interesting anthropological tour sub culture anyone age write lovely almost poetic time create real character lie periphery vision young men try make something bumping sociodemographic boundary ultimately keep become something love culture graffiti art present learn much relevance creative men art form establishment highly recommend truly fresh voice part usually get thrown literature sheep paddock need great flaw strong point far outweigh flaw exist thoroughly enjoy cover decidedly issue part worth challenge top shelf romp modern australia alienation ethnic minority lucky country circa", "genres": ["Fiction & Literature"], "summary": "In small-town suburban Australia, three young men from three different ethnic backgrounds—one Samoan, one Macedonian, one not sure—are ready to make their mark. Solomon is all charisma, authority, and charm, a failed basketball player down for the moment but surely not out. His half-brother, Jimmy, bounces along in his wake, underestimated, waiting for his chance to announce himself. Aleks, their childhood friend, loves his mates, his family, and his homeland and would do anything for them. The question is, does he know where to draw the line?\r\n\r\nSolomon, Jimmy, and Aleks are way out on the fringe of Australia, looking for a way in. Hip hop, basketball, and graffiti give them a voice. Booze, women, and violence pass the time while they wait for their chance. Under the oppressive summer sun, their town has turned tinder-dry. All it’ll take is a spark.\r\n\r\nAs the surrounding hills roar with flames, the change storms in. But it’s not what they were waiting for. It never is.\r\n\r\n\"At once tender, beautiful, gritty, and raw.\" The Guardian", "asin": "1620971178", "rank": "1314378", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51EURUS%2BvFL.jpg", "country": "Australia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}