{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 129, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Really insightful history of Parisian infrastructure and society! Highly recommend. Super interesting facts that otherwise I would not have come across!"}, {"review_sentiment": 5.0, "review_text": "Very convenient! No need to go shopping! Five stars! Excellent!"}, {"review_sentiment": 3.0, "review_text": "We would rate this book 3.5 instead of 3, but the Amazon review process only allows for assigning whole stars. The story of How Paris Became Paris offers some fine observations, agreed, but I have several problems with it: (i) the small print and pale ink are difficult to read; (ii) there is far too much repetition in the text (I read this book aloud to my husband and grew so weary of all the padding that I simply summarized for him when it got to be too much); (iii) there was also too much repetition in the illustrations (many are details of pictures reproduced in varying degrees of fullness all over the book - for instance, three pictures on p 28, 36 and 192 are of the same original but appear with different captions, while on p 193 we see the same picture shown on p 149, only in a different size and with different captions); (iv) when the author refers to an illustration, she simply writes \"this illustration,\" implying that the reader must search about for the one she means.To avoid this awkwardness, illustrations should have been numbered for ease of reference the way they are in art history books, with a separate numbering or lettering system for the color plates; (v) very disappointed that the author only fleetingly notes the changes made in Paris in the 19th c at the hands of Napoleon III and Baron Georges E. Haussmann; (vi) some Then & Now comparisons would have done wonders to liven the text, as many of the early constructs are still visible today, in good working order (as the Pont Neuf with its fine equestrian statue of Henri IV and the Place Royale, which is now called the Place des Vosges); (vii) the \"urb\" wasn't something entirely new that was invented by the French - the first world class city was ancient Rome - it is estimated that the population of Rome 2,000 years ago was roughly 1 million..I would suggest this book to others, but also urge them to look at (a) the small full color Skira art book from 1957 entitled \"Paris in the Past\" (b) see \"Paris Then and Now\" by Peter and Oriel Caine (Thunder Bay Press, 2003) and, (c) when in Paris, definitely visit the Musee Carnavalet which is, first of all, two splendid historic buildings now joined into one, with breathtaking paintings of Paris in former centuries - a museum not to be missed by the serious admirer of Paris."}, {"review_sentiment": 5.0, "review_text": "A wonderful combination of history and losing oneself strolling around one of the great cities of the world."}, {"review_sentiment": 5.0, "review_text": "For those planning to visit Paris, this is a great introduction to the city.  Having read it, I had a lot more appreciation for the Pont Neuf, and made a special effort to walk it.  Ditto for other landmarks written about in this book."}, {"review_sentiment": 3.0, "review_text": "It is more academic than I expected, but it was very interesting. The print was too light and too small making it more difficult to read, The points that she brought up about how Paris developed were fascinating reading and after 6 years of college history I didn't get much of that information presented in any text books."}, {"review_sentiment": 3.0, "review_text": "Fascinating topic, but needed to be edited down. Repeated itself. Would recommend it to serious fans of Paris or those writing research papers on its history."}, {"review_sentiment": 5.0, "review_text": "Fantastic book"}, {"review_sentiment": 3.0, "review_text": "It was interesting in that I learned a lot of facts that I did not know about the evolution of Paris. However, I would have preferred a story that would inform me of the same facts but more of a story with characters. For the most part it a very dry history book"}, {"review_sentiment": 5.0, "review_text": "This book is the most beautiful piece of writing about Paris. No travel guide or history book can top this! It's informative and it describes the entire history of the city of lights in a way that makes you think you are actually there. Love it!"}]}, "authors": ["Joan DeJean"], "isbn": "162040768X", "longitude": 2.3514992, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s"], "title": "How Paris Became Paris: The Invention of the Modern City", "word_cloud": "really insightful history parisian infrastructure society recommend interesting fact otherwise very convenient need go shop star excellent rate instead review process allow assign whole star story offer fine observation agree several problem small print pale ink difficult ii far much repetition text aloud husband grow weary padding simply summarize get much iii also much repetition illustration many detail picture reproduce vary degree fullness instance picture p original appear different caption p picture show p different size different caption iv author refers illustration simply write illustration imply avoid awkwardness illustration number ease reference way art history separate numbering letter system color plat v disappointed author fleetingly note change make c hand vi then now comparison do wonder liven text many early construct still visible today good work order fine equestrian statue call ed vii rub something entirely new invented french first world class ancient estimate population year ago roughly others also urge small full color art entitle b see then now c definitely visit first splendid historic building join breathtaking painting former century museum miss serious admirer wonderful combination history lose stroll great city world plan visit great introduction lot appreciation make special effort walk landmarks write academic expect interest print light small make difficult point bring develop fascinate read year college history get much information present text fascinate topic need edit recommend serious fan write research paper history fantastic interest learn lot fact know evolution however story fact story character part dry history beautiful piece write travel guide history top informative describes entire history light way make think actually", "genres": ["Memoir", "Art & Architecture", "Urbanism"], "summary": "At the beginning of the seventeenth century, Paris was known for isolated monuments but had not yet put its brand on urban space. Like other European cities, it was still emerging from its medieval past. But in a mere century Paris would be transformed into the modern and mythic city we know today.\r\n\r\nThough most people associate the signature characteristics of Paris with the public works of the nineteenth century, Joan DeJean demonstrates that the Parisian model for urban space was in fact invented two centuries earlier, when the first complete design for the French capital was drawn up and implemented. As a result, Paris saw many changes. It became the first city to tear down its fortifications, inviting people in rather than keeping them out. Parisian urban planning showcased new kinds of streets, including the original boulevard, as well as public parks and the earliest sidewalks and bridges without houses. Venues opened for urban entertainment of all kinds, from opera and ballet to a pastime invented in Paris, recreational shopping. Parisians enjoyed the earliest public transportation and street lighting, and Paris became Europe's first great walking city.\r\n\r\nA century of planned development made Paris both beautiful and exciting. It gave people reasons to be out in public as never before and as nowhere else. And it gave Paris its modern identity as a place that people dreamed of seeing. By 1700, Paris had become the capital that would revolutionize our conception of the city and of urban life.", "asin": "162040768X", "rank": "101844", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51P8xgGogOL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}