{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 22.2793278, "ratings": {"num_ratings": 1, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "Good book with high tempo and an interesting theme. Sometimes maybe to close for comfort to the real world. Set in a realistic scenery, with lot of familiar places."}]}, "authors": ["Duncan Jepson"], "isbn": "1623654319", "longitude": 114.1628131, "periods": ["2000s", "Recent Releases"], "title": "Emperors Once More", "word_cloud": "good high tempo interesting theme maybe close comfort real world realistic scenery lot familiar place", "genres": ["Fiction & Literature", "Mystery & Suspense", "Politics"], "summary": "Prior to turning to writing, Duncan Jepson made his career as an award-winning filmmaker. His debut novel, All the Flowers in Shanghai, was praised by Kirkus Reviews as being \"strong on detail and emotional intensity. In Emperors Once More, Jepson has created a thriller that captures the sights and sounds of Hong Kong and propels the reader into the world of international financial intrigue.\r\n\r\nSenior Inspector Alex Soong of the Hong Kong police is a contradictory character: a student of traditional martial arts and Chinese history, he drives an imported Mustang, loves American jazz, and is married to a beautiful, high-maintenance wife, Jun, who cannot understand why he doesn't take a more highly paid and prestigious job.\r\n\r\nOn the same day as he is drafted in to help Inspector Mike De Suza with the investigation of the motiveless murder of two Chinese Methodists in the financial district, the police are tipped off to an apparently unrelated murder in a deserted Kowloon warehouse: five people dead in a scene of horror which echoes the ritualistic killings of the Boxer Rebellion, a century before. As the first officer on the scene, Alex is shocked to be greeted by the concealed perpetrator, and invited to join him in reasserting China's global supremacy. After dismissing this and a second approach, he recruits historian Professor Elizabeth Yi to help him research the cases' parallels with the Boxer killings.\r\n\r\nWith Hong Kong about to host an economic summit between the Chinese and the faltering G8 powers who are massively in debt to them--the same Western powers who allied successfully against China in the days of the Boxers--the stage is set for an explosive rewriting of history. When Alex will not join the shadowy conspirators seeking to manipulate public opinion against the West, they seize his wife and the professor. He is forced to run a desperate race against time that will lead him into the pitiless heart of the ancient conspiracy, and pit him against the final ruthless stage of its campaign to alter the balance of power between East and West forever.\r\n\r\n“A high-octane mystery . . . an ambitious and high-minded thriller that challenges the reader to consider the impact of the past on the West’s future relationship with China.” South China Morning Post", "asin": "1623654319", "rank": "4756787", "city": "Hong Kong", "image": "https://images-na.ssl-images-amazon.com/images/I/51DnFi8-CYL.jpg", "country": "China", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}