{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 44.8178131, "ratings": {"num_ratings": 11, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Amazing fiction about a real tragedy foe the Belgrade Jewish Community. In a style that sometimes approaches David Grossman and even Saramago, David Albahari's book is a must for anyone who wants to understand what happened in a place that, until today, is not a museum or a commemorative mausoleum for those who lived and died there"}, {"review_sentiment": 5.0, "review_text": "By the numbers, the murder of the Serbian Jews in Belgrade during 1941-1942 was much closer to a tragedy than a statistic. And it is of this \"tragedy\", that Serbian author David Albahari writes his short novel, \"Gotz and Meyer\". Written in the first person by an unnamed Serbian Jew who had escaped the mass murder by going into hiding with his mother as an infant, the story proceeds at a fast pace as the man tries to understand what happened in Belgrade in that two year period.After the Germans invaded Serbia in 1941, a large majority of the male Serbian Jewish population was hauled off and shot by the SS, aided by local Serbian anti-Semites. The remaining Jews - mostly women, children, and the elderly - were put into the Semlin Judenlager, where they waited to be sent off \"somewhere else\". What really happened was that they were loaded into sealed trucks - 100 or so at a time - and driven around til gassed to death. Their bodies were then off-loaded and buried. So efficient was the gassing operation that Serbia - along with Poland and the Soviet Union - were the only Nazi-occupied country NOT to have to send off their Jewish population for extermination. They were killed \"in situ\", so to speak...David Albahari takes the facts about the camp and the gas vans and writes a story around two of the German drivers of the gas vans. He doesn't know their real names, but invents \"Gotz\" and \"Meyer\", and imagines how they viewed their job and the people they were murdering 100 at a time. The nameless teacher in today's Belgrade - the only family member left after the death of his parents long after the war - descends into a kind of madness as he tries to figure out what happened and how the two imagined - \"Gotz\" and \"Meyer\" - went about their murderous business. Albahari also introduces other characters, but the two (imagined) fair-haired monsters who he thinks gave out candy to the camps children before loading them into the gas van, along with the unnamed narrator are the main focus of the story.Because we are only talking about very small remnant of millions murdered, the horror of these murders is even more telling. Reading about today's man being driven mad while trying to deal with the murders of his relatives gives David Albahari's novel even more impact."}, {"review_sentiment": 5.0, "review_text": "This is in my top five best books ever read-- high praise considering the amount of books I have read over the years as well as the amount of books on the holocaust.  Mr. albahari's writing is phenominal and the translator's skills are masterful. I chose it for my book club and all the others rated it highly as well.  This book could easily be a movie."}, {"review_sentiment": 3.0, "review_text": "It is 1941 or 1942.Every day, Götz and Meyer drive a truck between the Fairground on the left bank of the River Sava in Belgrade and the village of Jajinci on the southern edge of Belgrade. They run a regular transport service between the two places. On each outward bound trip, they leave the Fairgrounds with about 100 passengers in the back of their window-less truck. They always return with an empty truck.Götz and Meyer, the crew operating the truck are both members of the Schutzstaffel (the `SS'). Their passengers, who board the truck ignorant of the fact that they are embarking on the last journey that they are ever going to make, are all Jewish. Somewhere, between the Fairgrounds and Jajinci, the driver of the truck, who might be either Götz or Meyer, stops the truck, and his colleague, it would be Meyer if Götz were driving, steps outside and crawls under the truck. There, he attaches the vehicle's exhaust pipe to an opening under the passenger compartment behind the driver's cab, and returns to his colleague waiting at the steering wheel. They continue their journey, and by the time they reach Jajinci, all of their 100 passengers will have died of carbon monoxide poisoning.David Albahari, the author of Götz and Meyer, is a Serbian of Jewish origin, born in Kossovo. He was born in 1948, and therefore narrowly missed experiencing the horrors of the German occupation of his native Yugoslavia. In Götz and Meyer, Albahari explores the tragedy that hit the Jews of Belgrade by trying to enter the minds of the two operators of the truck, who were, after all is said and done, merely following orders. I suppose that it would be fair to say that the author does succeed in doing this,but I did not find the resulting novel particularly satisfying."}, {"review_sentiment": 4.0, "review_text": "In 1942 the Nazis exterminated virtually all of Belgrade's 10,000 Jews and declared it the only large European city where the Jewish and Gypsy Question had been \"solved.\" This is the topic of David Albahari's Götz and Meyer (2003), a manic first-person narrative of a Jewish literature professor in modern-day Belgrade who, in exploring his obliterated family tree, becomes obsessed with the circumstances of their extermination and the two German officers tasked with carrying it out, Götz and Meyer.These two men, for which only scant archival evidence exists, are largely embellished by the narrator's imagination. The narrator imagines their wives and children, their morning hygiene rituals, dreams and everyday conversations, and in this Albahari truly excels. His penchant for palpable characters and idiosyncrasy brings to life otherwise cold historical data, a process that culminates when the narrator takes his students on a reenactment of the asphyxiation ritual performed by Götz and Meyer on Jewish passengers. As human beings we have, the narrator (and author) insists, a moral imperative to remember, even to viscerally relive, the past. Through living memory the dead live on and even the victims of senseless tragedies, such as the Holocaust, are in part redeemed.The elaborate working out of the extermination of the Belgrade Jews, and the characters of Götz and Meyer in particular, serves another important function in the novel, which distinguishes the work from much of previous Holocaust discourse. Although the narrator's tone is complex and often slips into irony and satire, it is largely a bona fide attempt to understand the psychology of these executioners, who slowly and methodically killed 5,000 people. Unsatisfied by simple condemnation and moral outrage (a viewpoint embodied in the story by the woman at the Jewish Historical Society), he envisions Götz and Meyer as complex individuals, with personality quirks, dreams, even brief flashes of compassion and humanity. While the narrator resists anathematizing the executioners, he inevitably hits upon psychological absurdities and callous acts that he categorically rejects.  Nonetheless, his novel inquiry leads to uncomfortable conclusions about universal human evil that recall Hannah Arendt's influential work on the \"banality of evil.\" The author fights against, but ultimately seems to accept, \"the realization that this is not a monstrous distortion, but the implacable order of things (107).\"  Thus the novel expresses a philosophical position, akin to that of 20th-century Existentialism, that life is incomprehensible and absurd. But like Sisyphus, the narrator continues to push his boulder up the hill.The novel engages other important strains of 20th-century philosophy. Foucault's idea of \"carceral continuum\" is central to the inner-workings of the Belgrade concentration camp. The micro-mechanisms of power and enforcement were not limited to Germans, but the Jews inside the camp were tasked with policing themselves. The author's exploration of the need of many Jews for illusions and the desire to be \"an ostrich with its head in the sand\" (80), further problematizes Holocaust discourse. This complex psychology culminates in the narrator's acceptance of chocolate from Götz and Meyer, which he eats with pleasure and shame.The novel consists of three planes of narrative that correspond to the narrator's three lives: his contemporary life as a literature professor; his vicarious experience of the lives of his relatives killed in the Holocaust; and his imagined life as Götz and Meyer. The story abruptly shifts time periods and points of view according to the his increasingly unstable consciousness. The entire novel is in fact a single stream of consciousness monolog, without chapter breaks, paragraphs or pauses. The narrator's voice becomes increasingly unstable during his research, which provides a rhythm to the story. Nonetheless, some readers will find the manic and disjointed narration exhausting. Moreover, the mediation of all events and characters through the narrator's highly subjective imagination leaves the reader without any other non-imagined voices or points of view. The uncomfortably intimate account of the narrator's thoughts draw the reader into a psychological state of instability and growing despair. While Albahari skillfully achieves this, some readers may find themselves longing for a more traditional style of narration toward the end of the story. On the other hand, the candid exposure to the narrator's mind provides a wealth of interesting psychological material. One wonders, for instance, about his preoccupation with Adam, a 13 year-old boy who was preparing for his bar mitzvah in 1942--could he be a manifestation of the narrator's own repressed memory?David Albahari's Götz and Meyer is a rich and complex postmodern account of the experience of the Belgrade Holocaust. It draws the reader into the experience of not only remembering, but reliving these tragic events, and through this act of memory attempts to find some redemption for an otherwise horrific and incomprehensible moment in history. The novel also provides a unique psychological portrait of the executioners Götz and Meyer, and in doing so explores universal questions about human frailty. The text is, furthermore, enriched by its engagement of various 20th-century philosophical strains. The formal qualities of the work--its uneven and increasingly manic voice, its internal rhythm and lack of traditional structure, its imaginative nature--mimic the act of remembrance and uncomfortably engage readers and draw them into the narrator's psychological state. Götz and Meyer is a rich and complex work and an original addition to the canon of Holocaust literature."}, {"review_sentiment": 5.0, "review_text": "This is an exceptional and different book about the Holocaust.It is written ,not by a survivor,but by someone born in Serbia a number of years later, in 1948.  Having lost a large number of his family to Hitler's Final Solution,he does a large amount of research to find out what happened to them,what it was like at the time,and what went through the minds of the perpetrators as well as the victims. Gotz and Meyer,were two SS Non-Commisioned Officers, who the author had found to be charged with the responsibility of transporting about 5,000 women and children from Belgrade's Fairground concentration camp to Jajinci for extermination.They drove the truck,which held about 50 prisoners. The victims were led to believe they were being taken to a better place and would receive decent treatment. A short time after the truck left,it stopped,and the drivers would connect a hose from the exhaust to an attachment that would direct the exhaust fumes into the enclosed truck,thus killing all the prisoners as it continued on its way. Upon arrival,other prisoners removed the corpses and dumped them into trenches already dug by other prisoners. Gotz and Meyer really met face to face to the victims. They seemed to think they were just truck drivers;despite the fact that they really were the murderers when they connected up the exhaust pipes. The author tries to get into the minds of the SS and the victims, trying to determine how they rationalized their actions.Try as he might,there are no way this evilness can be understood and he finds it is madness all around;and he almost loses his mind in attempting to make sense out of it all. I guess the only thing that comes out of all the author's effort is that there is no understanding madness."}, {"review_sentiment": 5.0, "review_text": "Describing the Holocaust, Hannah Arendt wrote of \"the banality of evil.\" In this attempt to understand the unspeakable, Albahari's unnamed narrator, a Jewish schoolteacher in Belgrade, begins not in anger but with empathy. Götz and Meyer are two noncommissioned SS officers, whose names he has turned up in the records, while researching the fate of his own forebears. He sees them as ordinary Germans, family men perhaps, fond of children, and taking pride in the efficient accomplishment of their job. That this job is to drive the sealed truck that asphyxiates 100 Jews with engine exhaust on each trip from the holding camp to the burial fields does not lessen his interest in inviting them into his mind, and talking with them in his imagination. Eventually, just as his obsession with the ordinary begins to verge on madness, he embarks on a symbolic reenactment with his own pupils, thus \"sowing the seeds of remembering\" for future generations. This short book, which flows in a single unbroken paragraph of lucid prose, is impossible to put down, and the almost genial understatement of its opening in no way diminishes its cumulative power."}, {"review_sentiment": 3.0, "review_text": "This one paragraph book is interesting in its style and in its subject matter.  The book becomes a little tedious when it is (truly) one paragraph but it is worth sticking with (it's quite short as well) for a captivating conclusion.  S."}, {"review_sentiment": 3.0, "review_text": "This addition to the lengthy bibliography of Holocaust-related fiction centers on the Final Solution's application in Nazi-occupied Serbia from November 1941 to April 1942. Specifically, the camp established at the fairgrounds outside Belgrade, where approximately 5,000 Jews were interred. The narrator is a middle-aged literature professor whose ancestors mostly perished either at the camp or in a truck repurposed as a mobile gas chamber. This truck was operated by the titular SS men, who, over the course of a few months, drove the 5,000 away -- ostensibly to a newer, better facility, but in reality to a mass grave. The book is the professor's reimagining of the two men's duties, of the final weeks of their victims, and of the city's non-Jewish bystanders. Over the course of the book, he delves deeper and deeper into archives, records, and history itself, in an attempt to understand it all -- gradually driving himself somewhat mad in the process. In attempting to put a face on the two Germans, he starts to have conversations with them, and then even visions. Along the way, themes familiar to the Holocaust are touched upon: innocence is meaningless, evil can be faceless, mechanistic, and impersonal, and above all is the question of what we would do confronted with the situation. As the professor grows more and more unstable, the author seems to be warning us that to try and understand any of this is a path to madness. It's all moderately interesting, but not 160 pages interesting. And though Albahari's decision to write the story as a single paragraph with no breaks does add to the sense of claustrophobic mania, it's not exactly reader-friendly. Probably unlikely to be of interest to anyone not already deeply interested in the Holocaust or Serbia."}, {"review_sentiment": 4.0, "review_text": "The speaker of this long monologue by Serbian author David Albahari is a teacher of Serbo-Croatian language and literature, a 50-year-old Jewish man who has been trying to fill in the spaces in his family tree after World War II in Yugoslavia.  The extermination of Jews started early in Yugoslavia, with most of the Jewish men of Serbia shot to death by the fall of 1941, and \"the Jewish Question in Serbia almost completely solved\" by April, 1942, when virtually all Jewish men, women, and children were dead.Imagining the lives of Gotz and Meyer, two SS guards who were responsible for over 5000 Jewish deaths, the speaker examines the events for which Gotz and Meyer were responsible between November, 1941, and April, 1942--the executions of one thousand Jews per month in the Belgrade Saurer truck they drove daily.  The truck, with its hermetically sealed rear compartment, had a hole in the floor into which the exhaust was pumped as prisoners were being taken from the Belgrade Fairgrounds camp, where they were housed, to \"better\" accommodations elsewhere, \"a concern of the German government for the good of the prisoners\" that the speaker finds \"touching.\"Albahari exhibits a mordant humor as his speaker imagines the inner lives of Gotz and Meyer.  Often juxtaposing horrifying atrocity against simple, folksy observation, the speaker fantasizes about \"Gotz, or was it Meyer,\" a phrase which echoes throughout the narrative.  As he puts himself into their minds, he wonders if they had nicknames, if their wives had pet names for them, and if they ever regretted what they were doing, since they were so good at their jobs.  \"Killing, too, is an art,\" the speaker says, \"and it has its own rules.\"As Albahari includes the terrible statistics, he also exhibits the dark ironies of the circumstances, setting the facts into sharp relief and increasing the shock.  He imagines reports on the load distribution of the bodies in the truck and how they might have contributed to a broken rear axle, contemplates the comforting effects of a lightbulb in the truck as the bodies start to fall, and \"worries\" about the red tape of co-ordination.Gradually, Gotz and Meyer become more human for the reader, and when the speaker takes his class on a field trip to the site of the Fairgrounds camp, he asks each to imagine himself/herself as one of his relatives.  As the horror of the events gradually register with the students, the teacher comments: \"Memory is the only way to conquer death,\" he says, \"even when the body merely goes the way of all matter and spins in an endless circle of transformations.\"  A strange novel of the Holocaust, all the more shocking because of the contrasts between the facts and the dark humor, Gotz and Meyer is a memorable short novel and worthy addition to Holocaust literature. n Mary Whipple"}]}, "authors": ["David Albahari"], "isbn": "1628970928", "longitude": 20.4568974, "periods": ["1900s", "Recent Releases"], "title": "Götz and Meyer", "word_cloud": "amaze fiction real tragedy foe style sometimes approach even anyone want understand happen place today museum commemorative mausoleum live die number murder serbian much closer tragedy statistic tragedy serbian author write short first person unnamed serbian escape mass murder go hide mother infant story proceeds fast pace man try understand happen year german invade large majority male serbian jewish population haul shot aid local remain mostly woman child elderly put wait sent somewhere else really happen load sealed truck time drive til gas death body bury so efficient gas operation country jewish population extermination kill sit speak take fact camp gas van write story around german driver gas van know real name invents imago view job people murder time nameless teacher today family member leave death parent long war descends kind madness try figure happen imagined go murderous business also introduce character imagined monster think give candy camp child load gas van unnamed narrator main focus talk small remnant million murder horror murder even tell read today man drive mad try deal murder relatives give even top best ever high praise consider amount year well holocaust kalahari write phenomenal translator skill masterful choose club others rat highly well easily movie day drive truck leave bank village southern edge run regular transport service place outward bound trip leave passenger back truck always return empty crew operate truck member schutzstaffel passenger board truck ignorant fact embark last journey ever go jewish driver truck either stop truck colleague drive step crawl truck attach vehicle exhaust pipe open passenger compartment driver cab return colleague wait steer wheel continue journey time reach passenger die carbon monoxide author origin bear bear therefore narrowly missed experience horror german occupation native explore tragedy hit try enter mind operator truck say do merely follow order suppose author find result particularly satisfy exterminate virtually declare large european city solve topic narrative jewish literature professor exploring obliterate family tree becomes obsess circumstance extermination german officer task carry men scant archival evidence exist largely embellished narrator imagination narrator imagine wife child morning hygiene ritual dream everyday conversation truly excel penchant palpable character idiosyncrasy bring life otherwise cold historical data process culminates narrator take student reenactment asphyxiation ritual perform jewish passenger human being narrator author insist moral imperative even viscerally relive past living memory dead live even victim senseless tragedy part elaborate work extermination character particular serf important function distinguishes work much previous discourse narrator tone complex often slip irony satire largely boa fife attempt understand psychology executioner slowly methodically kill people simple condemnation moral outrage viewpoint embody story woman jewish envisions complex individual personality quirk dream even brief flash compassion humanity narrator resists anathematize executioner inevitably hit upon psychological absurdity callous act categorically reject inquiry lead uncomfortable conclusion universal human evil recall influential work banality evil author fight ultimately seem accept realization monstrous distortion implacable order thing thus express philosophical position akin life incomprehensible absurd narrator continue push boulder engage important strain philosophy idea carceral continuum central concentration camp power enforcement limit camp task police author exploration need many illusion desire ostrich head sand problematizes discourse complex psychology culminates narrator acceptance chocolate eat pleasure consist plane narrative correspond narrator live contemporary life literature professor vicarious experience live relative kill imagined life story abruptly shift time period point view accord increasingly unstable consciousness entire fact single stream consciousness mono log chapter break paragraph pause narrator voice become increasingly unstable research provide rhythm story reader find manic disjoint narration exhaust moreover mediation event character narrator highly subjective imagination leave voice point view uncomfortably intimate account narrator thought draw psychological state instability grow despair skillfully achieve reader longing traditional style narration end story hand candid exposure narrator mind provide interest psychological material wonder instance preoccupation boy prepare bar mitzvah narrator repressed memory rich complex postmodern account experience draw experience remember relive tragic event act memory attempt find redemption otherwise horrific incomprehensible moment history also provide unique psychological portrait executioner explore universal question human frailty text furthermore enrich engagement various philosophical strain formal quality work uneven increasingly manic voice internal rhythm lack traditional structure imaginative nature mimic act remembrance uncomfortably engage reader draw narrator psychological state rich complex work original addition canon literature exceptional different write survivor someone bear number year later have lose large number family large amount research find happen time go mind perpetrator well victim author find charge responsibility transport woman child concentration camp drive truck hold prisoners victim lead believe take better place decent treatment short time truck leave stopped driver hose exhaust attachment exhaust fume enclose truck thus kill prisoner continue way arrival prisoner remove corps dump trench already dig prisoner really meet face face victim seem think truck driver fact really murderer connect exhaust pipe author try mind victim try determine rationalize way evilness understood find madness almost lose mind attempt make sense guess thing come author effort understand madness describe write banality evil attempt understand unspeakable unnamed narrator jewish schoolteacher begin empathy non commissioned officer name turn record research fate forebear see ordinary family men perhaps fond child take pride efficient accomplishment job job drive seal truck asphyxiates engine exhaust trip hold camp burial field lessen interest invite mind talk imagination obsession ordinary begin verge madness embarks symbolic reenactment pupil thus sow seed remember future generation short flow single unbroken paragraph lucid prose impossible put almost genial understatement open way diminishes cumulative power paragraph interesting style subject matter becomes little tedious truly paragraph worth stick quite short well captivate conclusion addition lengthy bibliography fiction center application establish fairground approximately jews inter narrator literature professor ancestor mostly perish camp truck re purposed gas chamber truck operate titular men course month away ostensibly newer better facility reality mass grave professor re imagining men duty final week victim city bystander course delf deeper deeper archive record history attempt understand gradually drive somewhat mad process attempt put face start conversation even vision way theme familiar touch innocence meaningless evil faceless mechanistic impersonal question situation professor grow unstable author seem warn understand path madness moderately interesting page interest decision write story single paragraph break add sense claustrophobic mania exactly probably unlikely interest anyone already deeply interested speaker long monologue serbian author teacher language literature man try fill space family tree extermination start early men shoot death fall jewish almost completely solved virtually jewish men woman child live guard responsible jewish death speaker examine event responsible executions thousand month truck drive daily truck hermetically seal rear compartment hole floor exhaust pump prisoner take camp house better accommodation elsewhere concern german government good prisoner speaker find touch exhibit mordant humor speaker imago inner life juxtapose horrify atrocity simple folksy observation speaker fantasize phrase echo narrative put mind wonder nickname wife pet name ever regret good job kill art speaker say rule include terrible statistic also exhibit dark irony circumstance set fact sharp relief increase shock imagine report load distribution body truck broken rear axle contemplates comfort effect light bulb truck body start worry red tape human speaker take class field trip site camp ask imagine relatives horror event gradually register student teacher comment way conquer death say even body merely go way matter spin endless circle transformation strange shocking contrast facts dark humor memorable short worthy addition literature n", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "A Jewish schoolteacher tells the story of Wilhelm Gotz and Erwin Meyer in the process of researching the deaths of his relatives during World War II. These two SS officers were assigned to drive a hermetically sealed truck in which concentration-camp prisoners were slowly asphyxiated. Soon this knowledge overwhelms day-to-day life, and the teacher comes to see past and present merge in a heartbreaking moment of remembrance. \r\n\r\nAmong the best and most haunting novels about the Holocaust to emerge in the final years of the twentieth century, G?tz and Meyer is David Albahari's masterpiece.\r\n\r\n\"At once a novel, fictional biography, history and meta-fictional commentary, Götz and Meyer, composed in a single hallucinatory paragraph without space breaks (stylistically redolent of W. G. Sebald), is simultaneously a masterful addition to the literature of the Holocaust and a fascinating philosophical meditation on that enormity.\" San Francisco Chronicle", "asin": "1628970928", "rank": "940172", "city": "Belgrade", "image": "https://images-na.ssl-images-amazon.com/images/I/51jpFbndj3L.jpg", "country": "Serbia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}