{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 14, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Wow.  This is fantastic in every sense of the word."}, {"review_sentiment": 2.0, "review_text": "Heraclix was dead and Pomp was immortal. The emphasis is on was, because now, neither is as they were. Heraclix is now alive, a reanimated man sewn together from numerous other parts, but with no memory of his former life he finds himself wondering what kind of person he could have been. And Pomp who believed herself immortal, finds herself questioning that status after being nearly killed by a rather nasty necromancer.Quite literally thrown together by the necromancer, the two set off to find new meaning in their lives. Heraclix wants to know how and why this was done to him and what kind of man he was before. With her new found mortality, Pomp tries to wrestle with the language and the meaning behind that word. As they travel across Europe, with a side trip to Hell, the two discover the necromancer they thought dead is very much alive and has plans to ensure his own immortality.Though the premise was interesting and the summary on the flap of the book drew me in; it pains me to say, dear reader, that I did not enjoy this book. It has glowing reviews on Amazon as well as other sites, but alas it does not have one from me. Perhaps it is because this is a very dense book, it became quite complex at times. Or perhaps it was because several of the characters had similar or near identical names which made it difficult to keep track of who was who.Whatever it was, I found myself slogging through this book and not liking it. Several times I wanted to put it down and not finish it, yet I persevered. I only finished the book because I wanted to know if I was correct in guessing how certain plot points would be resolved – I was correct in my thoughts and what I surmised would happen did happen.I never enjoy giving a negative review on anything, whether it be a book, music, etc. You, dear reader, might enjoy it despite my words. I however, will not be returning to this particular fictional world."}, {"review_sentiment": 5.0, "review_text": "Yesterday I finished reading+Forrest Aguirre 's book, \"Heraclix and Pomp\".  What a delightful read!  It was a really cool book about a construct and a fey and a necromancer.It was full of descriptions and colorful enumerations as well as capturing a historic and fantasy flavour. Read it!  8')﻿"}, {"review_sentiment": 4.0, "review_text": "By a good stretch, this is Aguirre's best work yet. A fantasic story and memorable characters. 4.5 stars for the novel but I'd not reccomend the narrator for the audio version."}, {"review_sentiment": 4.0, "review_text": "Together Heraclix and Pomp make quite the couple, albeit odd, but definitely a dynamic duo that brings the heart and soul to this fantastical novel!"}, {"review_sentiment": 5.0, "review_text": "Heraclix and Pomp is a rather dense novel. Shortly before finishing it I asked myself why, and I think I've got the answer. This excellent story, the first I've read by Forrest Aguirre, is  one of the most descriptive pieces I've read in quite some time. Scarcely anything Aguirre shows you in this story lacks for a description, and some of the details are strikingly imaginative. As is the plot, which starts out as a simple quest for knowledge, yet develops some beautiful twists and turns along the way, long after you've stopped pestering the air around your reading chair with enquiries like \"what, exactly, was that foul sorcerer up to and why does Heraclix want to uncover the painful secrets the sly magician left behind?\". You stop asking, and file the questions in the back of your mind, because the book is such a joy to read, and the characters so engrossing. Aguirre just sets Heraclix the golem and Pomp the fairy on their path, and keeps showing and showing until, when he suddenly answers one of the questions you'd almost forgotten you'd tucked away, that cleverly revealed bit of telling resonates like a smartly rung bell, and keeps resonating until he tells you the next thing. Aguirre so deftly turns the storytelling adage  \"show, don't tell\" into \"show and tell\" that you hardly notice. If I'm trying too hard to be a little too clever here, it's because I have a serious case of storytelling envy going. For me, that's the best kind of story there is.  Heraclix and Pomp sits firmly in one of the most difficult to define niches around: \"Wierd fiction\". The wierd is tough to describe, but easy to recognize when you see it. And this one is a fine example that simultaneously delights and unsettles the reader. While doing so, it begs to be sipped and savored. Barrel on through at your own risk."}, {"review_sentiment": 4.0, "review_text": "”He remembered nothing of what came before the womb, though he felt intimations from that pre-existent time that he wouldn’t quite form into full realizations. As the will to live slowly fused with his nascent consciousness, his heart, brain, and eyes awakened. Immediately, questions, and his awareness grew:Who am I?I am I.Where am I?I am here.What is here?It is where I am.What is where?And so forth.”Most of us after the inconvenience of being squeezed out of the womb, kicking and screaming, do find that we now have to cry (sing) for our food. We have, as a bonus though, inherited at least one rather large servant and possibly two that seem inordinately concerned about our well being. They slave away for us for many years and then slowly ease us into wiping our own arse, finding our own food, and in extreme cases they actually send us out to earn a living and to pay our own bills.This was not the case for Heraclix.He was conceived through necromancy. He is not a baby, but a massive man standing head and shoulders above the tallest man. One look in a mirror or a pool of stagnant water would show him that he is not by any stretch of the imagination going to get by on his looks. He is a golem, a stitched together creature, ”a calico quilt of flesh”.He is Mowler’s Monster.”Think that you are not yet begotten, that you are in the womb, that you are young, that you are old, that you have died, that you are in the world beyond the grave; grasp in your thought all of this at once...then you can apprehend God.” Hermes Trismegistus, HermeticaHeraclix has a lot of questions, but God never enters the equation. Now the door to Hell, well, it was wide open.”Beelzebub, Lord of Flies. Below the neck, it was dressed sharply---all frills and gaudy lace under a dark purple riding coat. ITs claws showed from under the sleeves, needle-like and dripping green venom. The insectile demonic eyes confused the onlookers, so that everyone in the room--Heraclix, Pomp, and the sorcerer--thought that the demon was looking his, her, and his way, respectively. The demon’s proboscis, however, pointed directly at the sorcerer.”For most of us when we are first born we aren’t promptly introduced to the Lord of the Underworld. Heraclix makes his acquaintance even before the blood and the other juices of the womb can be shaken from his body.Anybody ever been trying to read and had a fly buzzing in the window behind your head? Take that times a thousand and you’ll have an idea of the level of annoying noise that Beelzebub is capable of.Now as Heraclix is flopping around trying to get his bearings there is also Pomp, a fairy, whose special blood is necessary to complete whatever insidious plans Mowler has for Heraclix.”Instantaneous invisibility, dragonfly wings, and a quiver full of potent arrows--along with a charming personality--are her assurances of everlasting life.”She is gullible, and easily tricked by the nice old man into becoming part of his experiment. She has no sense of time, only the present exists, and because that is probably one of the best gifts a person can receive, especially if they are happy by nature, she doesn’t have to worry about a future because it stretches before her over hill and dale further than the eye can see. She can never possibly catch up with it.Mowler is left howling on his way to hell, after the Golem, through some spark of compassion, rescues Pomp from his clutches.It is tough, exasperating work being an Evil Genius.”Mowler, frustrated by the people’z continued willful ignorance and their lack of recognition at his genius, left Prague for Vienna, ranting and raving about how he would call up the very powerz of Hell and rule the world if he had to sacrifice every living soul in the Holy Roman Empire to do it.” The mayor paused for a moment. “They don’t have much imagination, these sorcerers. They can be a bother.”Heraclix and Pomp become unlikely travelling companions as they try to read the map of his body, the conglomeration of human parts, and discover who they once belonged to. In particular he is worried about the big blue hand that keeps trying to kill anyone that poses any level of threat to Heraclix. HANDY, but making more enemies than friends.Forrest Aguirre takes us on a journey through some of my favorite parts of the world, Vienna, Prague, Budapest, and Istanbul. He also takes us to my least favorite place to visit…HELL.”He noticed that the worms were hauntingly familiar and peculiarly abnormal--not your normal annelids. They were, he realized, Hellspawn larvae, Lumbricus Hades, the souls of the damned beginning their migration through eternal torment. He saw their visages, millions of them bearing the face of their former selves, though the condemned wouldn’t recognize themselves if held to a mirror, not at this stage. And even after they had grown back into an understanding of their past lives and sins, they would be unable to recognize their own reflections, having been so twisted and mangled by the mutations and excruciating torture inflicted on them by other souls further along in their ‘progression’ that their appearance and voices would only remain as a pathetic mockery, a caricature of the person they had chosen to become in mortality.”I’m marking HELL off my tour route. Forrest already took me there, luckily while still safely ensconced in my favorite reading chair. I was scorched around the edges, but relatively unharmed. I may have worms with the faces of the tormented in my next nightmare, but that will just give me more incentive to tread lightly in deepening my own bucket of sin.Aguirre is a lyrical writer who made a genre I rarely read into a surprisingly literate endeavor. Through the mismatched eyes of a Golem and the purity of a fairy we are able to look at the absurdity and the misguided wants and desires of what we do with our lives. The jadedness we acquire and nurture steals the innocence of others. We do this out of love, out of animosity, and the world each time loses a bit more luminous... splendor."}, {"review_sentiment": 4.0, "review_text": "a charming and swiftly-paced romp through 18th century Europe, featuring a fearsome but sweet golem and his skittish but brave fairy companion. painted with bright, vibrant colors with the not infrequent splash of darkness and blood. part picaresque and part uncertain quest. quest for a soul, quest for the meaning of existence? perhaps. and hey, they also visit Hell. yay for traveling and yay for unusual destinations!I liked the writing. Aguirre is a talented writer who is quite at home when detailing the odd and the strange in prose that is often equally odd and strange. I quite enjoyed the off-kilter directions that sentences sometimes went, the unusual phrasings, the quirky quality to the prose. the chapters from the fairy Pomp's perspective are in the present tense, which is a clever way to illustrate her unique view of the world. the writing is not perfect: there was some clumsiness here and there and a rather rushed feeling at the end - things that might have been fixed by a harsh taskmaster of an editor. but I'm not sure I would have wanted them fixed because the clumsiness blends in with the delightfulness in a way that is all of a piece. Aguirre is an idiosyncratic and stylish writer; I was pleasantly reminded of other smart, quirky, and sometimes flawed authors I've enjoyed. I admire those sorts of writers.I really liked the story. I haven't read any other books with this setting and it completely fascinated me. at times it felt like the best sort of travelogue - one from the distant past, set in places I've read about but have never actually immersed myself into when reading fiction. Aguirre has a certain way of describing places like old Prague, Vienna, and Istanbul... a light touch with the description, using just enough for me to feel like I was in the actual place. but the story is not only a travelogue - it has deeper, more emotional goals. Heraclix & Pomp is about two completely different people trying to figure out who they are and what they can be. there was such a tenderness in the depiction of Pomp and the golem Heraclix's journeys and their frequent soul-searching, their need to be good and kind and just. this is a book for adults, definitely, but there was a lovely purity to the underlying theme of the book that often made me feel like I was reading a fable for children."}, {"review_sentiment": 4.0, "review_text": "When his creator is killed, a golem named Heraclix leaves Vienna with a fairy named Pomp in tow in search of answers. Heraclix seeks the former life (or lives) of his constituent body parts and Pomp wants only to understand the human way of life. They travel to the Near East and back again with a short detour to hell. Will they ever find the answers they seek and will they like the answers they get?Heraclix and Pomp brings a lot of different elements to the table. It's part historical fiction, part fantasy, with some political intrigue thrown in. Forrest Aguirre's prose feels like a mix of Peter S. Beagle and Gene Wolfe to me, dense but with a certain poetic beauty to it.Heraclix, the dour golem, and Pomp, the curious fairy, go from one European locale to the next in their search for answers, encountering ghosts, demons, Turks, Romani, necromancers, as Heraclix slowly pieces together who his body parts used to belong to. Intrigued yet?Forrest's depiction of Hell was one of my favorite parts of the book. The Lord of the Flies and his minions were pretty grotesque. I wasn't a fan of the political intrigue at first but I was sucked in eventually.If you're looking for some beautifully-written fantasy that doesn't trod along all the familiar paths, you'll enjoy Heraclix and Pomp. Four out of five stars."}, {"review_sentiment": 4.0, "review_text": "\"...what were the origins of the many pieces of Heraclix? He was like a puzzle to himself, an unknown being or beings, self-aware, yet unaware of the individuals from whom he had been constructed.\"Where do we come from? Of what are we made? Who are we? How did we get to be who we are? Can we change? In the case of Heraclix, of the title, all the above apply. H is a big guy. Think Shrek with a bit less green. Usually the golem is a clay creature, but H is more of a group effort, being comprised of parts, a Frankenstein monster with better (than the film) motor skills, and a makeover. Heraclix is riven, as so many of us are, with a complicated nature. His is more physical in it's manifestation, though. With one arm in particular eager for action, he reminded me a bit of  Doctor Strangelove. In a nifty opening, he breaks out of a womb-like vat of liquid (not the last birth event in the book), and does what any newborn might do. He reads everything he can get his paws on. Doesn't know where the ability came from, but really, really wants to get a handle on his world, and comes across his maker's private, and very disturbing, notes.Mattatheus Mowler is not your garden variety sorcerer. Sure he's a few hundred years old, and is educated enough to animate dead parts, among other nifty tricks, but the boy has some serious ambition, not to mention an issue with aging, and is not to be messed with. That brimstone aroma that may be wrinkling your nose emanates the Faustian bargain he has made. He has a client list that would be the envy of any K Street operative. Of course, evil, connected genius or not, he is still human, more or less, and makes mistakes enough to allow for an actual contest. Not exactly your ideal re-animator, (or would that be assembler?)  as daddy dearest  rains blows and other abuse down on Heraclix's large frame with abandon. But one day MM brings a sweet young thing to the lab, in a jar.Pomp is a pixie with moxie. She encourages H to stand up for himself, and overcome the self-loathing that accompanies his beatings. Mowler has dark plans for her of the sacrificial sort, but the plan flies to pieces, the premises succumbs to fire (always a risk when dealing with hellspawn), and a dynamic dimorphic duo is made.The motive force here is Heraclix trying to find out who he actually is. With information gleaned from Mowler's premises, he and Pomp set off on a classic journey of self-discovery. They cover a fair piece of European landscape, beginning in Vienna, with stops in Prague, Istanbul, Budapest, and sundry locales in between. Along the way they pick up pieces of the puzzle, as in a video game, that lead them from place to place. The information is sometimes in the form of clues, in Mowler's papers, say, or in writing along the side of a coin. More often it is in the form of stories told by Gypsies, Cossacks, wizards, an old man in an obscure town, sundry characters they encounter in their quest. As the pair travel, together and separately, they gain knowledge.Heraclix comes across as a likeable hulk. He has a pure heart (whomever it might once have belonged to) and is an honest seeker after truth. In trying to discover his true identity he learns a thing or two\"...there was something in the quality of sorrow suffered at the hands of another that was different than the sorrow that one brought on others, whether through one's own stupidity and neglect or by intentional acts of hatred. The latter carried the sharpest stings of guilt, regret, self-berating...\"Pomp, while a very valuable partner, is not so much seeking truth herself as she is eager to help Heraclix. Hey, the big lug saved her, so she owes him. But she finds that she, as well, is challenged to consider her view of herself and the world.\"Her life isn't now about playing pranks all day every day. It isn't about not caring. All this playing pranks and not caring isn't fun any more. If she goes on like this, her life stays immortally, eternally...boring. Death is sad, but death makes life more worth living.\"In addition to H&P; there is a parallel story involving Holy Roman Empire royalty, a young lass, and a fair bit of intrigue.There are some images and themes that run throughout. Birth is addressed multiple times, in both a biological and baptismal way. Heraclix is very clearly being born by breaking out of a watery enclosure in an early scene. There is what might be seen as a baptism by fire, and later in the book, he has what seems another aqueous bursting through or two. History figures large here. Pomp, when we meet her, has no notion of it, not understanding the concept of memory. Heraclix cannot remember anything and wants to find out who he is. The tale is told in a historical context, offering a look at the feel, if not much of the detail, of tension between the Holy Roman Empire and its foreign enemies. Eternal life is addressed in the wizard's desire for it and in how Pomp, who has it, copes with and gives a lot of thought to the implications of life without end. Changing one's life is also addressed on multiple fronts. A killer becomes a healer. Pomp is faced with potentially changing her orientation as well, getting to see in person the questionable wages of all-fun-all -the-time.I am sure there are many references to folk tales I missed in here, but a visit to hell itself surely must conjure Dante. So be on the lookout for references to The Inferno.  And heading to the basement certainly seems in synch with a Campbellian structure.One of the things that most impressed me was the diversity and creativity of Aguirre's imagination. Heraclix alone is a marvelous concoction, but there are many more. Phantoms haunting the one who killed them, demonflies from Hell, a Godzilla-like Beelzebub, some carnivorous clover, fairies up to no good, a demonized crow, some magic mirrors, a telescope for seeing magic. The list is considerable and the creations quite fun. While some echo familiar elements of fantasy fiction, there is an added layer of the new that gives it all some real sparkle.Gripes were few. There are a fair number of characters, and it can be a bit tough at times keeping them straight. The ARC I read did not have a list of characters in it. I do not know if the final version might. I find it useful to make my own list as I read to help keep everyone straight. Also there was one escape I had a problem with.Aguirre has established himself as a top-drawer, award-winning editor of speculative fiction, and a seasoned writer of sci-fi as well. Heraclix and Pomp demonstrates that he is also a confident, creative and imaginative novelist.  The journey on which Heraclix and Pomp set out is a consistently interesting and engaging one, offering not only a look at a fantastical world, but adult consideration of eternal, real-world, existential issues. I am sure they would love for you to tag along.Heraclix and Pomp was sent along by the author in return for an honest review"}]}, "authors": ["Forrest Aguirre"], "isbn": "1630230014", "longitude": 28.9651646, "periods": ["1700s", "Recent Releases"], "title": "Heraclix and Pomp: A Novel of the Fabricated and the Fey", "word_cloud": "fantastic sense word dead immortal emphasis alive reanimate man sewn together numerous part memory former life find wonder kind person believe immortal find question status nearly kill rather nasty literally throw together necromancer set find new mean life want do kind man new find mortality try wrestle language meaning behind word travel side trip discover necromancer think dead much alive plan premise interest summary flap draw pain say dear enjoy glow review well sit perhaps dense become quite complex time perhaps several character similar identical name make difficult keep track find slog like several time want put finish yet persevere finish want know correct guess certain plot point correct thought surmise never enjoy give negative review anything music etc dear word however return particular fictional world yesterday finish delightful really cool construct full description colorful enumeration well capture historic fantasy flavor read good stretch best work yet fantastic story memorable character star recommend narrator audio version together make quite couple odd definitely dynamic duo brings heart soul fantastical rather dense shortly finish ask think get answer excellent story first descriptive piece quite time scarcely anything show story lack description detail strikingly imaginative plot start simple quest knowledge yet develop beautiful twist turn along way long stop pester air read chair inquiry exactly foul sorcerer want uncover painful secret sly magician leave stop ask file question back mind joy character engross set golem fairy path keep show show suddenly answer question almost forget tucked away cleverly revealed bit tell resonates smartly ring bell keep resonate tell next thing deftly turn storytelling show show tell hardly notice try hard little clever serious case storytelling envy go best kind story sit firmly difficult define niche fiction weird tough describe easy see fine example simultaneously delight unsettles begs sip savor risk remember nothing come womb felt intimation time quite form full realization live slowly fused nascent consciousness heart brain eye awaken question awareness grow most squeeze womb kick scream cry sing food bonus inherit least rather large servant possibly seem inordinately concern well slave away many year slowly ease wipe are find food extreme case actually send earn live pay case conceive necromancy baby massive man stand head shoulder tallest man look mirror pool stagnant water stretch imagination go look stitch together creature calico quilt flesh yet beget womb young old die world grave grasp think apprehend lot question never enter equation now door well wide neck dress sharply frill gaudy lace dark purple rid coat claw show sleeve drip green venom insectile demonic eye confuse onlooker everyone room sorcerer think demon look way respectively demon proboscis however point directly first bear promptly introduce make acquaintance even blood juice womb shake ever try fly buzz window head time thousand idea level annoy noise capable flop try get bearing also fairy special blood necessary complete insidious plan invisibility dragonfly wing quiver full potent arrow charm personality assurance everlasting gullible easily trick nice old man become part experiment sense time present exist probably best gift person receive especially happy nature worry future stretch hill dale eye never possibly leave howl way hell spark compassion rescue tough exasperating work frustrate people continue willful ignorance lack recognition genius leave rant rave power rule world sacrifice living soul mayor pause moment much imagination sorcerer become unlikely traveling companion try map body conglomeration human part discover belong particular worry big blue hand keep try anyone pose level threat make enemy take favorite part world also take least favorite place notice worm hauntingly familiar peculiarly abnormal normal annelid realize larva soul damn begin migration eternal torment saw visage million bear face former self condemned recognize hold mirror stage even grow understanding past life sin unable reflection twist mangled mutation excruciate torture inflict soul progression appearance voice pathetic mockery caricature person choose become mark route already take luckily still safely ensconced favorite reading chair scorch edge relatively unharmed face torment next nightmare give incentive tread lightly deepen bucket lyrical writer make genre rarely surprisingly literate endeavor mismatch eye purity fairy able look absurdity misguide want desire live jadedness nurture steal innocence others love animosity world time lose bit luminous splendor charm romp century feature fearsome sweet golem skittish brave fairy companion paint bright vibrant color infrequent splash darkness blood part picaresque part uncertain quest quest soul quest meaning existence perhaps hey also visit ya travel unusual destination like write talented writer quite home detail odd strange prose often equally odd strange quite enjoyed direction sentence sometimes go unusual phrasing quirky quality prose chapter fairy perspective present tense clever way illustrate unique view world write perfect clumsiness rather rush feel end thing fix harsh taskmaster editor sure want fixed clumsiness blend delightfulness way piece idiosyncratic stylish writer pleasantly remind smart quirky sometimes flaw author enjoy admire sort really like story set completely fascinate time felt best sort travelogue distant past set place never actually immersed read fiction certain way describe place old light touch description use enough feel actual place story travelogue emotional goal completely different people try figure tenderness depiction golem journey frequent need good kind adult definitely lovely purity underlying theme often make feel read fable child creator kill golem name leave fairy name search answer seek former life life constituent body part want understand human way life travel back short detour hell ever find answer seek answer get bring lot different element part historical fiction part political intrigue throw prose feel mix dense certain poetic beauty dour golem curious fairy go european locale next search answer encounter ghost demon necromancer slowly piece together body part use belong intrigue yet depiction favorite part minion pretty grotesque fan political intrigue first suck look fantasy trod familiar path enjoy star origin many piece puzzle unknown being yet unaware individual construct come make change case title apply big guy bit le green golem clay creature group effort comprise part monster better film motor skill makeover riven many complicate nature physical manifestation arm particular eager action remind bit nifty opening break vat liquid last birth event newborn everything paw ability come really really want handle world come maker private disturb garden variety sorcerer year old educate enough animate dead part nifty trick boy serious ambition mention issue age mess brimstone aroma nose emanates faustian bargain make client list operative course evil connect genius still human le make mistake enough allow actual contest not exactly daddy dearest rain blow large frame abandon day bring sweet young thing lab pixie moxie encourage stand overcome accompanies beating dark plan sacrificial sort plan fly piece premise succumb fire always risk deal hell spawn dynamic dimorphic duo motive force try actually information glean premise set classic journey cover fair piece european landscape begin stop sundry locale way pick piece puzzle video game lead place place information sometimes clue paper say write along side more often form story tell wizard old man obscure town sundry character encounter quest pair travel together separately gain come likable hulk pure heart whomever honest seeker truth try discover true identity learn thing something quality sorrow suffer hand different sorrow brought others stupidity neglect intentional act hatred latter carry sharpest sting guilt regret valuable partner much seek truth eager help big lug save owes find well challenge view world life play prank day day care play prank care fun go life stay immortally eternally boring sad death make life worth living addition parallel story involve royalty young lass fair bit image theme run address multiple time biological baptismal way clearly bear break watery enclosure early scene see baptism fire later seem aqueous burst figure large meet notion understand concept memory anything want find tale tell historical context offering look much detail tension foreign enemy life address wizard desire cop give lot think implication life end change life also address multiple front killer become healer face potentially change orientation well get see person questionable wage sure many reference folk tale miss visit hell surely reference head basement certainly seem sync campbellian thing impressed diversity creativity imagination alone marvelous concoction many haunt kill demon flies carnivorous clover fairy good demonized crow magic mirror telescope see list considerable creation quite fun echo familiar element fantasy fiction add layer new give real fair number character bite tough time keep straight list character know final version find useful make list help everyone straight also escape problem establish editor speculative fiction season writer well demonstrate also confident creative imaginative novelist journey set consistently interest engage offering look fantastical world adult consideration eternal existential issue sure tag send along author return honest review", "genres": ["Fiction & Literature", "Fantasy"], "summary": "Heraclix was dead and Pomp was immortal. That was before Heraclix’s reanimation (along with the sewn-together pieces and parts of many other dead people) and Pomp’s near murder at the hands of an evil necromancer. As they travel from Vienna to Prague to Istanbul and back again (with a side-trip to Hell), they struggle to understand who and what they are: Heraclix seeks to know the life he had before his death and rebirth, and Pomp wrestles with the language and meaning of mortality. As they journey across a land rife with revolution and unrest, they discover that the evil necromancer they thought dead might not be so dead after all. In fact, he might be making a pact to ensure his own immortality . .", "asin": "1630230014", "rank": "2481462", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/61nU2la4DCL.jpg", "country": "Turkey", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}