{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 18.4801972, "ratings": {"num_ratings": 114, "rating": 4.9, "reviews": [{"review_sentiment": 5.0, "review_text": "I was given this by another reviewer to read. It was enlightening to say the least.  A lot of families are dysfunctional in one way or another, but this book shows that you can overcome that dysfunctionality. Well written,  you could feel her pain, and or sadness, whatever emotion portrayed throughout."}, {"review_sentiment": 5.0, "review_text": "I was attracted to this book as it was a memoir about the Dominican Republic, where I live, and also took place during the era of the dictator Trujillo, a time in history I am also interested in.The book is well written, you are not only transported by the author back in time but also you feel you are actually there in the north east of the Dominican Republic, the sights, the smells, the food, the atmosphere all come to life. The book has many levels, reading it is like peeling an onion, each time revealing more information, about the country, about being an American in the DR with the pros and cons that brings, but also about family life and the traumas and tribulations that brings, along with the damage that family relationships can cause.There  are some shocking moments and revelations and one cannot help but think how different life might have been had the author been brought up on mainland USA surrounded by like peers, rather than on a semi deserted coconut plantation.The Coconut Latitudes also leaves one with questions, why did this happen, what happened to her or him. I enjoyed it and would recommend it to anyone interested in the Dominican Republic."}, {"review_sentiment": 5.0, "review_text": "A must read. You will feel as if you are a part of this family that is tattered by the waves of life. The descriptions are so eloquently written. This is good writing and I felt as if I were alive with the words that I read. You must read!"}, {"review_sentiment": 2.0, "review_text": "Well that was depressing."}, {"review_sentiment": 5.0, "review_text": "This is a gem of a memoir, especially for readers who often shy away from memoirs (like I do). Unassuming yet lyric prose tells a story that turns out to be moving, memorable and even uplifting. Recommended!"}, {"review_sentiment": 5.0, "review_text": "I A heartwarming story and a brave decision to share a family's secrets. Well written and difficult to put down!"}, {"review_sentiment": 5.0, "review_text": "Very interesting book.  A page turner about a young families life and the many struggles of living in a corrupt dictatorship and an abusive father."}, {"review_sentiment": 5.0, "review_text": "Wonderful to meet you on Skype.  Hope you are able to continue with your life's story soon.  Susan"}, {"review_sentiment": 5.0, "review_text": "I don't usually read memoirs as I find them too particular to the author's life experience. So I was surprised that after reading a few pages of Rita Gardner's memoir about growing up in the Caribbean, I was hooked.  Although she's telling her own coming-of-age story, her work transcends the particular to say something that speaks to all of us as we reach the stage of no longer idealizing our parents. Rita's book also made me realize how truly exposed a writer must feel when they spill their family secrets; I can see why Rita waited until the other members of her nuclear family had passed away before producing the book. That said, I applaud her for being able to talk about her unusual upbringing in such a compelling and lyrical way. She drew me into her story but did not make me feel like a voyeur. It can't be easy to achieve that balance. Bueno!"}, {"review_sentiment": 5.0, "review_text": "A book I could not stop reading.  I felt her emotions from start to end.  Ms. Gardner lead an emotional life that sculpted her as an adult.  Our book club is currently reading Ms.Gardner's book, a great choice."}]}, "authors": ["Rita M. Gardner"], "isbn": "1631529013", "longitude": -69.942111, "periods": ["2000s", "Recent Releases"], "title": "The Coconut Latitudes: Secrets, Storms, and Survival in the Caribbean", "word_cloud": "give reviewer enlighten least lot family dysfunctional way show overcome dysfunctionality write pain sadness emotion portray attract memoir live also take place era dictator time history also interest well write transport author back time also feel actually north east sight smell food atmosphere come life many level read peel onion time reveal information country pro con brings also family life trauma tribulation bring along damage family relationship shock moment revelation help different life brought mainland surround peer rather semi desert also leave question happen happen enjoy anyone interested part family tattered wave life description eloquently write good writing felt alive word well depress gem memoir especially reader often shy away memoir unassuming yet lyric prose tell story turn move memorable even uplift recommend a heartwarming story brave decision share family secret well write difficult put very interest page turner young family life many struggle live corrupt dictatorship abusive father wonderful meet able continue life story soon usually memoirs find particular author life experience surprise read page memoir grow hook tell story work transcend particular say something speaks reach stage longer idealize parent also make truly exposed writer spill family secret see wait member nuclear family pass away produce say applaud able talk unusual upbringing compel lyrical way draw story make feel voyeur achieve balance reading felt emotion start lead emotional life sculpt adult club currently read great choice", "genres": ["Memoir", "Travel Writing"], "summary": "Gold Medal Winner, Autobiography/Memoir, 2015 IBPA Benjamin Franklin Awards.\r\nRita is an infant when her father leaves a successful career in the US to live in “paradise”―a seaside village in the Dominican Republic. The Coconut Latitudes is her haunting, lyrical memoir of surviving a reality far from the envisioned Eden―and of the terrible cost of keeping secrets.", "asin": "1631529013", "rank": "1146582", "city": "Santo Domingo", "image": "https://images-na.ssl-images-amazon.com/images/I/51VVSvWruZL.jpg", "country": "D.R.", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}