{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 66, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Can a non-Jewish writer without Dutch ancestry write a novel about a Dutch-Jewish girl in World War Two? Yes, she can! To me, the initial spark, the long-lasting fascination and the wide-ranging bibliography were already signs of a profound and sustained commitment, but nonetheless the story itself took me by surprise. Mary Fillmore has managed to completely immerse herself in the situation of the Dutch Jews in Nazi-occupied Amsterdam and created an empathetic portrait of a lovable protagonist and her family. The descriptions of how a young person might be drawn into Resistance work and what it was like to be in hiding are so rich in detail, warm and sensuous that you can feel – rather than just observe - what it must have been like. The story takes an unexpected turn, making it a refreshingly different read from the books already written on this subject, and the ending leaves the reader to ponder on what happens next."}, {"review_sentiment": 5.0, "review_text": "I just finished it yesterday and I hated to have it end. As you know, once you are into a good read, you feel connected to the characters and want to continue with them, but we must move on to the next story.  This story is never over, however. Truth and history must keep writing it. I really loved the characters and found them all very real. As a 70-year-old mother myself, I identified with Rose mostly. I felt the passion in all of them, using whatever mechanisms they had to survive without losing their souls in a horrible time in Amsterdam. I loved that it did not focus on the horrors of the concentration camps and the gas chambers, which were always there, and have filled my own soul with much pain. Instead it delved deeply into the feelings and action of those human beings in Amsterdam who were caught up in the swirling events around them, with no time to process before the next. The slowly increasing awareness in the minds of the characters, and the weakening of denial were, I felt, artfully presented. The defensiveness of some, the fears of those who would help, and the hope that lies in the strong of spirit were clear to me. I truly loved the ending and the events leading up to it. I felt it was very real, relevant and appropriate to the ongoing horror that was the \"Holocaust\". What Rachel did, in all of her decisions were completely in character for the girl becoming woman in that awful time. And, the hope that grew within her father, was very true to human nature."}, {"review_sentiment": 4.0, "review_text": "Well written,touching,memorable,inspiring"}, {"review_sentiment": 5.0, "review_text": "The author boldly enters the life of Jews in Amsterdam during the Holocaust and tells the story of another young Jewish woman. Knowing how familiar Anne Frank's story is to the world, in a new way she deftly describes the city she obviously loves and presents the experiences of the Jews as the Nazis spread their terror over Amsterdam. I could not put this book down, drawn into the story of this young woman, her family and friends. It's an artful retelling of the history without being maudlin, graphic, or over-sentimental. Worth reading and sharing.We enjoyed hosting author Mary Dingee Fillmore in the spring, which enriched our understanding of this period in a very personal, yet historically accurate way.  She packed the room and kept everyone in rapt attention."}, {"review_sentiment": 1.0, "review_text": "Couldn't finish it. All the author wants to do is write about sex."}, {"review_sentiment": 5.0, "review_text": "Touching, well researched historical novel. A reminder that we must never forget the atrocities of the Holocaust. The author takes us on a journey into everyday life under Nazi rule. Well worth reading."}, {"review_sentiment": 5.0, "review_text": "This excellent novel adds a different perspective to what most of us have read about life in Europe under the burgeoning Nazi rule. We watch Rachel, a young Jewish woman who lives with her mother Rose and father Jacob, become aware of the Nazi influence in Amsterdam, a city that has welcomed and protected the Jewish population for centuries. When her lover leaves to be part of the resistance, she chooses to join the effort and deliver covert messages as part of the local resistance effort. The well-drawn family members show readers differing reactions to the threat--Rachel becomes aware of the danger for her family and begs them to leave their home. Jacob, a doctor, downplays the threat and insists on staying to care for his patients. Rose keeps the peace by following her husband's wishes. Readers will feel they are in competent hands with Fillmore's attention to detail, description and historical accuracy.  A terrific read!"}, {"review_sentiment": 5.0, "review_text": "Wonderful novel by Mary Fillmore!  I so enjoyed learning about the Dutch resistance during WWII through the eyes of Fillmore's main character, Rachel.  Though heart-wrenching at times, I enjoyed going back to this world each night, eager to find out what would happen to Rachel and her family.  A wonderful testament to so many who lost their lives, and an important novel for today.  Thoroughly enjoyed it!"}, {"review_sentiment": 5.0, "review_text": "This is a very suspenseful page-turner that successfully recreates the Amsterdam of the 1940s -- the lovely city that was invaded by the Nazis and bit by bit is crippled, looted, and tortured by them. Historically, we know what happened. What makes this story distinctive is the inner narrative -- what happens to Amsterdam, to the Netherlands, is mirrored in the fate of the Klein family.  The mother plays Chopin and tries to be oblivious to anything that is not beautiful; the father, a doctor, refuses to acknowledge the approaching horrors and stubbornly refuses to leave his patients; and their only child, Rachel, a high school student who realizes that she must start to make difficult and dangerous choices. The writing is evocative and lovely, making the reader see the shimmering beauty of the canals that wend through the city. Just as vivid is the noose readers can feel, drawing tighter and tighter around both Jewish residents and non-Jews who stand in the Nazis' way. Extremely well-researched, and a compelling story!"}, {"review_sentiment": 5.0, "review_text": "An Address in Amsterdam is a powerful tale — both gruesome and lovely — of a young Jewish woman in Amsterdam, from May of 1940 to May of 1943, during the Nazi occupation of the Netherlands. Rachel Klein, after witnessing several horrific events, becomes a courier for the Dutch resistance. During the last hundred pages this novel seldom left my hands. I could only imagine the horror of being hidden for months in a grim low-ceiling cellar with no hint of daylight, where damp walls, a dirt floor, and the need for absolute silence render dignity almost impossible. Fillmore’s years of research pay off in a novel that rings of truth, warning us of the dangers of any form of religious or ethnic prejudice."}]}, "authors": ["Mary Dingee Fillmore"], "isbn": "1631521330", "longitude": 4.8936041, "periods": ["1900s", "Recent Releases"], "title": "An Address in Amsterdam", "word_cloud": "ancestry write girl initial spark fascination bibliography already sign sustained commitment nonetheless story take surprise manage completely immerse situation create empathetic portrait lovable protagonist family description young person work hide rich detail warm sensuous feel rather observe story take unexpected turn make refreshingly different already write subject end leaf ponder happens finish yesterday hat end know good feel connect character want continue next story story never however history writing really love character find real mother identify mostly felt passion use mechanism survive lose soul horrible time love focus horror concentration camp gas chamber always fill soul much pain instead delve deeply feeling action human being catch swirl event time process slowly increase awareness mind character weaken denial felt artfully present defensiveness fear lie strong spirit clear truly love end event lead felt real relevant appropriate ongoing horror decision completely character girl become woman awful time hope grow father true human nature well write touch memorable inspiring author boldly enter life tell story young woman know familiar story world new way deftly describe city obviously love present experience spread terror story young woman family friends artful retell history maudlin graphic read enjoyed host author spring enrich understanding period personal yet historically accurate way pack room keep everyone rapt attention author want write sex touch well research reminder never atrocity author take journey everyday life rule read excellent add different perspective life burgeon nazi rule watch young woman live mother father become aware nazi influence city welcome protected jewish population century lover leave part resistance choose join effort deliver covert message part local resistance effort family member show reader differ reaction threat become aware danger family begs leave home doctor downplay threat insists stay care patient keep peace follow husband wish feel competent hand attention detail description historical accuracy terrific wonderful enjoy learn resistance eye main character time enjoy go back world night eager find family wonderful testament many lose life important today enjoy suspenseful successfully recreate lovely city invade bit bit cripple looted torture historically know happen make story distinctive inner narrative happens mirror fate family mother play try oblivious anything beautiful father doctor refuse acknowledge approach horror stubbornly refuse leave patient child high school student realize difficult dangerous choice write evocative lovely make shimmer beauty canal wend city vivid noose reader feel draw tighter tighter jewish resident stand way extremely compelling story powerful tale gruesome lovely young woman occupation witness several horrific event become courier dutch resistance last hundred page seldom leave hand horror hidden month grim cellar hint daylight damp wall dirt floor need absolute silence render dignity almost impossible year research pay ring truth warn danger form religious ethnic prejudice", "genres": ["Fiction & Literature", "WWII"], "summary": "Rachel Klein hopes she can ignore the Nazis when they roll into Amsterdam in May 1940. She’s falling in love, and her city has been the safest place in the world for Jewish people since the Spanish Inquisition. \r\n\r\nBut when Rachel’s Gentile boyfriend is forced to disappear rather than face arrest, she realizes that everything is changing, and so must she―so, although she is often tired and scared, she delivers papers for the underground under the Nazis’ noses. \r\n\r\nBut after eighteen months of ever increasing danger, she pushes her parents to go into hiding with her. The dank basement where they take refuge seems like the last place where Rachel would meet a new man―but she does.\r\n\r\nAn Address in Amsterdam shows that, even in the most hopeless situation, an ordinary young woman can make the choice to act with courage―and even love.\r\n\r\n“In her well-researched novel, Fillmore vividly portrays Amsterdam, Rachel, and her family… An intense tale that gives the tragedies of history a Dutch dwelling and a family name.” Kirkus Review", "asin": "1631521330", "rank": "162818", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/51Exqv0OEmL.jpg", "country": "The Netherlands", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}