{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 13, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "Murders take place in a famous basilica.  Group tours extend to a sleazy section of Rome.  There are dark criminal elements but the author kept the story from being too negative.  Since I discovered Ngaio Marsh, I have been reading many of her books.  This is not one of my favorites."}, {"review_sentiment": 2.0, "review_text": "I've read better things by Marsh"}, {"review_sentiment": 5.0, "review_text": "Smooth reading with engaging characters and adventures in Rome."}, {"review_sentiment": 4.0, "review_text": "I liked this book, just not as an Inspector Alleyn book. I love all the familiar characters -- Brer Fox, Troy, etc.  And they aren't in this.  But Marsh did write a very good book.  If it had been a different character, I may have given it 5 stars, but I just missed the regulars and the usual English setting.  It is much more adventure/derring-do than the slower paced Marsh books.  And as said before, very well written."}, {"review_sentiment": 5.0, "review_text": "It had a very surprise ending. Also the cast of  people in the book made for a very interesting story."}, {"review_sentiment": 4.0, "review_text": "I confess I am a R Alleyn fan  and have been for years.  This book is very entertaining in its familiarity with Rome and the different ways the \"cast\" is presented."}, {"review_sentiment": 5.0, "review_text": "Still enjoy her years later."}, {"review_sentiment": 5.0, "review_text": "If you enjoy vintage (early to mid 1900's) mysteries, this is another good one although it was written in 1970 or so.  Ngaio Marsh developed her character Inspector Allyen in the 1930 - so this is a much later book in the series.  I've read several in the series and found it odd to find words such as \"groovy\".One annoying factor is that when the book was transcribed to the electronic version, many, many spelling errors were made.  It is very annoying and a distraction.  Words ending in \"ing\" are typed \"ink\".  The word curb is misspelled as Kerb.  It's a shame that such a great work (series) is marred like this.Despite not being set or written earlier in time, I really enjoyed the plot and characters.  A very British mystery.  If you like Inspector Allyen, read this book and if you're starting the series, you can easily begin with this one."}, {"review_sentiment": 5.0, "review_text": "When in Rome by Ngiao Marsh is another wonderful gem by this great author.  Her writing is brilliant, subtle, and witty. Roderick Alleyn is one of my favorite classic Inspectors from Scotland Yard."}, {"review_sentiment": 5.0, "review_text": "Msg. Marsh always keeps things lively and interesting."}]}, "authors": ["Ngaio Marsh"], "isbn": "1631940449", "longitude": 12.4829321, "periods": ["1900s"], "title": "When in Rome: Inspector Roderick Alleyn", "word_cloud": "murder take place famous basilica tour extend sleazy section dark criminal element author kept story negative discover read many favorite better thing read engage character adventure like love familiar character etc write good different character give star miss regular usual set much slower pace say well write surprise end also cast people make interesting story confess fan year entertaining familiarity different way cast presented still year later enjoy vintage early mid mystery good write develop character much later series several series find odd find word groovy annoy factor transcribe electronic version many many spell error make annoy distraction end ing typed word curb misspell shame great work series mar set write earlier time really enjoy plot character british mystery like start series easily wonderful gem great author writing brilliant subtle witty favorite classic always keep thing lively interest", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "In 1968 Ngaio Marsh took her own Roman holiday (in part to research Italian police procedures) and the change seems to have done her good: Both her British and U.S. agents believed When in Rome to be the finest novel in her \"Inspector Alleyn\" series. \r\n\r\nAs is so often (and so satisfyingly) the case, the tale concerns a murder within a closed group—in this case, a group of tourists visiting what Marsh calls the \"Basilica di San Tommaso,\" who find themselves fumbling into a complex web of blackmail and drug-smuggling. Adding some irresistible color are depictions of both La Dolce Vita (of which Marsh took a jaundiced view) and the student radicals of the day, whom she seems to have found somewhat more persuasive. ", "asin": "1631940449", "rank": "879894", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51c1RMa%2BSyL.jpg", "country": "Italy", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}