{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 157, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "lots of information"}, {"review_sentiment": 5.0, "review_text": "Love his guided walks. Great touring guide. Buy one everywhere we go"}, {"review_sentiment": 2.0, "review_text": "Outdated, as we expected since a new version comes out next month. It's the usual Rick Steves once-over, but as an inexpensive closeout, it was worth buying to tear up into sections we could easily carry around and use. Maps are a big help."}, {"review_sentiment": 5.0, "review_text": "Rick Steves guides are perfect for me - they tell me what I need and no more, plus he has the same taste and attention span that I do, so his tours hit the right spots and for the right length of time."}, {"review_sentiment": 5.0, "review_text": "Everything you could need are want"}, {"review_sentiment": 5.0, "review_text": "Very useful. Tons of good tips and good history"}, {"review_sentiment": 5.0, "review_text": "Well laid out and informative."}, {"review_sentiment": 3.0, "review_text": "If you know the Rick Steves method of travel, you know this guidebook won't be about reading a novel with a bottle of rose.  If you follow his advice, throw any hope of relaxation out the window, as any moderately interesting sight in the area (there are hundreds) will be recommended.Rick's whirlwind style of travel is great in a major city, where sights are concentrated together.  His style was even perfect for Ireland, where the sights were separated by roads that were sights in themselves.  However, in Provence, the sights are separated surprisingly far distances by mostly-boring roads. To compound the issue, the Provencal schedule throughout the day is incompatible with an ambitious sightseeing schedule.  On a typical day, you will:9am: Leave the hotel (early breakfasts aren't really a thing here, from what I can tell)10am: Arrive to the town your visiting and have time to see one big sightNoon: Eat lunch (don't be late, the French take their lunch hours very seriously. Yes, I said hours.)2pm: See a couple more sights around town (at this time of day, your pace will be hampered by the heat)6pm: Arrive back at your hotel to get ready for 8pm dinner10 or 11pm: Go to bed and repeat the next dayThere is nothing wrong with the above schedule, and you should adapt the schedule the locals follow, but the book doesn't do enough to warn you about how little you can accomplish in a given day.  The recommended sightseeing itineraries for a given number of days is too hectic, and even worse, I feel they over-hype the marginal sights to keep you moving. I feel that almost every sight has an extra triangle than it would get in other guidebooks (A 3-triangle sight would have only gotten 2 in other books, the 2 deserve 1, 1 didn't deserve any).  I'm sure there is a caveat in the book somewhere to include rest days, but this is the first Rick Steves book where I felt rushed to meet one of the recommended itineraries in the time provided.All that being said, it is still a wealth of knowledge like any other Rick Steves guidebook.  I would recommend it to anyone going to Provence, but please consider slowing your pace down to about 75% of the speed that he recommends.  It's hard to live like a local when you're moving twice the speed as them."}, {"review_sentiment": 5.0, "review_text": "Love Rich Steven!"}, {"review_sentiment": 5.0, "review_text": "Wonderful aid - apparently comes out every 3 years, I'd advise checking publication date."}]}, "authors": ["Rick Steves", "Steve Smith"], "isbn": "1631216732", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Rick Steves Provence & the French Riviera", "word_cloud": "lot information guide walk tour guide everywhere outdated expect new version come next month usual inexpensive closeout buy tear section easily use big help guide perfect tell need taste attention span tour hit right spot right length time everything very useful ton good tip good history well lay informative know travel know guidebook bottle rise follow advice throw hope relaxation window moderately interesting sight area hundred whirlwind style travel great major city sight concentrate together style even perfect sight separate road sight however sight separate surprisingly far distance road issue schedule day incompatible ambitious sightsee schedule typical day hotel early breakfast really thing tell arrive town visiting time see big sight noon lunch late take lunch hour seriously say hour couple sight town time day pace hamper heat back hotel get ready bed repeat day there nothing wrong schedule adapt schedule local follow enough warn little accomplish give day recommend sightseeing itinerary give number day hectic even worse feel marginal sight move feel almost sight extra triangle sight deserve sure caveat somewhere include rest day first felt rush meet recommend itinerary time say still wealth knowledge guidebook anyone go please slow pace speed recommend hard live local move twice speed wonderful aid apparently come year advise check publication date", "genres": ["Travel Writing", "Guide Books"], "summary": "You can count on Rick Steves to tell you what you really need to know when traveling in Provence and the French Riviera.\r\n\r\nIn this guide, you'll find a dazzling mix of enjoyable cities, warm stone villages, Roman ruins, and breathtaking coastline. Experience Roman history with self-guided tours of the Pont du Gard aqueduct, Roman theater in Orange, and Arena in Arles. Explore sun-soaked Riviera beaches and resort towns, from cosmopolitan Nice to colorful Villefranche-sur-Mer. Get inspired by artistic masterpieces by Renoir, Matisse, Picasso, and Chagall. After a day of sightseeing, relax at a café with a view, dive into a bowl of bouillabaisse, and watch fishermen return to the harbor.\r\n\r\nRick's candid, humorous advice will guide you to good-value hotels and restaurants. You'll learn which sights are worth your time and money, and how to get around by train, bus, car, or boat. More than just reviews and directions, a Rick Steves guidebook is a tour guide in your pocket.", "asin": "1631216732", "rank": "28461", "city": "Cannes", "image": "https://images-na.ssl-images-amazon.com/images/I/51KXyDbzXLL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}