{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 18.4724603, "ratings": {"num_ratings": 125, "rating": 4.2, "reviews": [{"review_sentiment": 3.0, "review_text": "The ending was to forced! I liked her writing style. It  made look at Jamaica differently. Only get s 3 stars because of the ending."}, {"review_sentiment": 5.0, "review_text": "Good book. It takes some time to get into it but it's worth it."}, {"review_sentiment": 3.0, "review_text": "Blah reading, but okay for some."}, {"review_sentiment": 5.0, "review_text": "A difficult read at times due to the subject matter but wow! Nicole Dennis-Benn is such a talent. These characters tugged at my heartstrings from page one. Through the course of the novel, the intricately-woven plot builds to a mesmerizing conclusion that manages to feel both inevitable and shocking."}, {"review_sentiment": 5.0, "review_text": "This is a beautifully written, painful tale about a family struggling for money and status."}, {"review_sentiment": 3.0, "review_text": "I had originally given this book 1 star because it was so, so dark. Just when you think it can't get any more depressing, it pulls you down further.  But I thought more about it and that isn't a commentary on how well the book is written.  To be fair, the story was engrossing--I was rooting for (some of ) the characters but every time I did, something awful would happen.  People here have commented that they had a hard time reading the dialect but I listened to the audiobook, which is a great way around that.  I was VERY disappointed in the ending, as the author goes into some detail about what happens to one of the main characters and virtually nothing is said about the others.  Unless she's waiting for the sequel?  Lots of unanswered questions, things not wrapped up.  That said, if you don't mind depressing stories that don't have happy endings, you might like this book."}, {"review_sentiment": 2.0, "review_text": "no review"}, {"review_sentiment": 4.0, "review_text": "This book was so beautifully written (though hard to read sometimes given the nature of the story). My only \"critique\" was the ending... it felt like a non-ending. It crept up and all of the sudden it was there and it felt like it shouldn't be there yet. Otherwise, like I said, the writing was incredible and the story was heart-breakingly honest."}, {"review_sentiment": 3.0, "review_text": "I like books about life in other cultures.  This one a little depressing."}, {"review_sentiment": 5.0, "review_text": "Felt like l was in Jamaica. I could relate to the struggle of the people in that country."}]}, "authors": ["Nicole Dennis-Benn"], "isbn": "1631492942", "longitude": -77.9217357, "periods": ["2000s", "Recent Releases"], "title": "Here Comes the Sun", "word_cloud": "end force like write style make look differently only star end good take time worth reading okay difficult time due subject matter wow talent character tug heartstrings page course plot build mesmerize conclusion manages feel inevitable shocking beautifully write painful tale family struggle money status originally give star dark depressing pull think commentary well write story engross root character time something awful commented hard time read dialect listen audio book great way very disappointed end author go detail happen main character virtually nothing say others wait sequel unanswered question thing wrap say mind depress story happy ending review beautifully write hard sometimes give nature story critique end felt creep sudden felt yet say write incredible story honest like life culture little depress l struggle people country", "genres": ["Fiction & Literature", "LGBT"], "summary": "Capturing the distinct rhythms of Jamaican life and dialect, Nicole Dennis- Benn pens a tender hymn to a world hidden among pristine beaches and the wide expanse of turquoise seas. At an opulent resort in Montego Bay, Margot hustles to send her younger sister, Thandi, to school. \r\n\r\nTaught as a girl to trade her sexuality for survival, Margot is ruthlessly determined to shield Thandi from the same fate. When plans for a new hotel threaten their village, Margot sees not only an opportunity for her own financial independence but also perhaps a chance to admit a shocking secret: her forbidden love for another woman. \r\n\r\nAs they face the impending destruction of their community, each woman—fighting to balance the burdens she shoulders with the freedom she craves—must confront long-hidden scars. From a much-heralded new writer, Here Comes the Sun offers a dramatic glimpse into a vibrant, passionate world most outsiders see simply as paradise.\r\n\r\n\"[A] lithe, artfully-plotted debut....Margot is one of the reasons to read this book. She is a startling, deeply memorable character. All of Ms. Dennis-Benn’s women are. The author has a gift for creating chiaroscuro portraits, capturing both light and dark....Here Comes the Sun is deceptively well-constructed, with slow and painful reveals right through the end.\" New York Times\r\n\r\n\"One of the most stunningly beautiful novels in recent years…Dennis-Benn's writing is so assured, so gorgeous, that it's hard to believe Here Comes the Sun is a debut novel…it feels like a miracle.\" NPR", "asin": "1631492942", "rank": "136245", "city": "Montego Bay", "image": "https://images-na.ssl-images-amazon.com/images/I/51PDuwQbJnL.jpg", "country": "Jamaica", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}