{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 91, "rating": 3.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Love it. I felt like I hung out with an old pal for a weekend while I gobbled it up!"}, {"review_sentiment": 5.0, "review_text": "Terrific novel, tightly written and witty throughout. (If you prefer tons of long sentences and descriptive passages, this may not be the novel for you.) Grateful to the author for the gift copy and sorry that it took me so long to get to it."}, {"review_sentiment": 1.0, "review_text": "This is literally the biggest waste of time, money, and brain cells. At some point I was just hoping she would drive off a cliff and end my misery. There was absolutely no plot, no meaning, and no point. Let alone the editor apparently can't spell or rewrite. I told my friend who purchased the book for me and he has now suggested we light the book on fire. Might get my money's worth as kindling."}, {"review_sentiment": 4.0, "review_text": "Sharp, witty with boldly drawn characters. A story with a heart, told with soul."}, {"review_sentiment": 1.0, "review_text": "Pointless."}, {"review_sentiment": 5.0, "review_text": "A lyrical fantastical gorgeous book. Not only is the writing top notch Dermansky controls the story's ebb and flow with masterful skill. I loved this book and BAD MARIE in equal measure."}, {"review_sentiment": 2.0, "review_text": "About half way through the book and still keep waiting for the writing to get better, deeper. Lots of typos, insane amount of repetition just to fill up the pages with words.Will finish it just because I spent the money on it which I regret already.Hard to believe what can get published these days."}, {"review_sentiment": 5.0, "review_text": "The Red Car is a journey between the here and now and memories past. Leah lives in New York with her husband, Hans, and life is not really being lived. Both of them are writers but she is the only one who works. It seems like she has simply settled for it until she receives word that a former boss/mentor/friend has died and left her a red sports car. Leah is confused, to say the least, because her boss, Judy, knew how much Leah hated the car. It gave her the creeps every time she rode in it.Leah is given the flight to San Francisco where the funeral is to be but Hans is not included. In a fit of rage about it, he grabs Leah by the neck. She’s seen his anger before but not to this extreme. His reaction fuels her exit remorseful that he is.Judy was years prior both a mentor and a friend to Leah. Because of a difference of opinion, Leah quit communicating with Judy. Leah finds that she can hear Judy’s voice in her head giving her advice and opinions while she is in San Francisco. The trip redefines Leah’s life and what it is that she is really missing.There are some weird quirks in the car itself, the reasons it made Leah uneasy from the start. It will seem as if the car drives Leah instead of the opposite."}, {"review_sentiment": 2.0, "review_text": "Some gems in this book. Interesting premise, but it really goes nowhere at all. Very disappointing trajectory. Some interesting plot twists but the sense of no resolution of anything was really annoying. Felt like a waste of time."}, {"review_sentiment": 3.0, "review_text": "Leah just lets life pass by without really making any decision. She has choices but never makes any. It is a very passive book."}]}, "authors": ["Marcy Dermansky"], "isbn": "1631492330", "longitude": -122.4192363, "periods": ["2000s", "Recent Releases"], "title": "The Red Car: A Novel", "word_cloud": "felt hang old pal weekend gobble tightly write witty prefer ton long sentence descriptive passage author gift copy sorry take long literally biggest waste time money brain cell point hop cliff end misery absolutely plot mean point alone editor apparently tell friend purchase suggest light fire money kindle witty boldly draw character story heart tell soul pointless lyrical fantastical gorgeous not write top notch control story ebb flow masterful skill love equal measure way still wait write better deeper typos insane amount repetition fill page finish spend money regret believe publish day journey memory live husband life really live writer work seem simply settle receives word former die left sport car confuse least bos know much hat car give creep time give flight funeral include fit rage grab neck see anger reaction fuel exit remorseful year prior mentor friend difference opinion quit communicate find hear voice head give advice opinion trip redefines life really weird quirk car reason make uneasy start seem car drive instead opposite gem premise really go nowhere very disappointing trajectory interesting plot twist sense resolution anything really annoy waste time let life pas really make decision choices never make passive", "genres": ["Fiction & Literature", "Women's Fiction"], "summary": "A wildly imaginative, rebellious, and tender tale of independence from the critically acclaimed author of Bad Marie.\r\n\r\nWith each new novel, Marcy Dermansky deploys her \"brainy, emotionally sophisticated\" (New York Times) prose to greater and greater heights, and The Red Car is no exception.\r\n\r\nLeah is living in Queens with a possessive husband she doesn’t love and a long list of unfulfilled ambitions, when she’s jolted from a thick ennui by a call from the past. Her beloved former boss and friend, Judy, has died in a car accident and left Leah her most prized possession and, as it turns out, the instrument of Judy’s death: a red sports car.\r\n\r\nJudy was the mentor Leah never expected. She encouraged Leah’s dreams, analyzed her love life, and eased her into adulthood over long lunches away from the office. Facing the jarring disconnect between the life she expected and the one she is now actually living, Leah takes off for San Francisco to claim Judy’s car. In sprawling days defined by sex, sorrow, and unexpected delight, Leah revisits past lives and loves in search of a self she abandoned long ago. Piercing through Leah’s surreal haze is the enigmatic voice of Judy, as sharp as ever, providing wry commentary on Leah’s every move.\r\n\r\nFollowing her \"irresistible\" (Time) and \"wicked\" (Slate) novel Bad Marie, Dermansky evokes yet another edgy, capricious, and beautifully haunting heroine―one whose search for realization is as wonderfully unpredictable and hypnotic as the twists and turns of the Pacific Coast Highway. \r\n\r\nTautly wound, transgressive, and mordantly funny, The Red Car is an incisive exploration of one woman’s unusual route to self-discovery.", "asin": "1631492330", "rank": "654947", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/41y06bsQs8L.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}