{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 43.7698712, "ratings": {"num_ratings": 26, "rating": 2.6, "reviews": [{"review_sentiment": 4.0, "review_text": "well, everyone is right about this...its not really for more than maybe 10% of people who love florence or have visited or are considering goign...its rather, um, specialized....what I'm saying is, for two groups -- litterateurs interested in grandee-aestheticism, and the LGBT reader.  But those are not insignificant groups.  This is highly personalized, sometimes a bit dotty, sometimes a bit \"I read some good stuff about this interesting person, let me retail it\"....but if you like Proust or Firbank or Alan Bennett, you willl like this MUCH MUCH more than,oh, rick steves."}, {"review_sentiment": 3.0, "review_text": "The book gives a fair account of the wealthy English  that chose Florence as from late 19th century mostly as an  escape from the rigid moral constraints of England at that time. It is, in this sense, a somewhat different/unexpected approach to the history of the famous Italian city in that period."}, {"review_sentiment": 2.0, "review_text": "Except for one chapter about the foreign volunteers who helped save Florence's art treasures after the disastrous flood in 1966, the book is large a disconnected collection of gossip about expats in Florence who for the most part were obscure or unknown. The thread that connects the different people seems to be that they were all gay."}, {"review_sentiment": 1.0, "review_text": "\"Florence  A Delicate Case\" is a small book, with but 5 chapters in not much more than a half an inch of paper.  The opening is smart, and what follows engages the reader, as Leavett portrays a Florence about as different from the Forrester/Merchant Ivory version as one could imagine;  a Florence that is dark, obsessed with death and a magnet for suicides.  But, just as one is settling in for what promises to be an exquisite read (and well before the end of the first chapter) the book changes tone and becomes a chronicle of  ex-pat Anglo-American Florentine gossip, by the most undeserving bunch of back biting queens, their money-poor, titled nobility, and vacationing socialite friends, and hangers on.  And the gossip isn't even fresh!  It's a recycled, reconstituted gossip dating back for the better part of the last century, flashing a brief flicker of fame-renewed, upon people and their works that have been long since forgotten, and deservedly so.  This increasingly annoying recitation continues unabated through chapters two and three, and then (what a relief!) the reader arrives at chapter four, which details in rather dry terms, the whys and hows of the statue of David being moved from its original home in the Piazza della Signoria to its current home in the Florence Academy, and why there's a copy in the piazza today.  And then, at the beginning of chapter five, right after a curious disclaimer of sorts, the book returns to its gossip, and in the process reveals the reason for its writing...  The disclaimer is about as ostentatious as what it's trying to put aside; that David and Mark were offered introductions to everyone in the expat community that mattered, and all of the places that mattered, but they turned pretty much all of them down.  Good ol' ordinary California boys they are...  But not entirely, because as it develops, David and Mark lived in Florence just as the last three monuments (his term) of the nearly century and a half expat community passed away, including the once formidable Sir Acton, now portrayed as a prisoner of his villa and gardens.  We get a glimpse of John Pope-Hennessy's funeral, and who was there.  What gay writer, present at such a moment, could resist having the last word on people who, notoriously, spent their lives trying to have the last word on their contemporaries, and often a vicious last word at that?  Still...  I have seen smaller, even more frivolous books; usually sold in boutiques and focusing on cats, small dogs, and/or Paris.  I've learned not to buy them as they go stale almost as soon as they leave the boutique.  This book, especially given its dramatic and very interesting start, could have been so much more (and probably would have had to have been bigger).  If the expat community in Florence really was so talented, and yet became so devoted to the shallow, decadent, and backbiting pursuits, another idea would have been to contrast the expats of Florence against the much more famous, and creatively productive expats of Paris, of the same era;  a community now so legendary that Woody Allen recently produced a movie set in Paris in the 1920s, and filmed in the Paris of today, that was so devoid of the French, that a lightly educated American could be forgiven for mistaking this cinematic version of Paris as the nicer section of New York City.  But no.  I am so disappointed in this little book that I find the best summary of my experience with it, is to re-use a quip the book itself attributes to Oscar Wilde:  \"He has nothing to say, and says it\"."}, {"review_sentiment": 1.0, "review_text": "There is no story in this book. The name dropping is exasperating. Plus I thought the book was about Florence, not about English people living in Florence. I couldn't bring myself to finish this very tiny book with large prints and big indentations... I guess I won't sell it so I can have the whole Writer and the City series... otherwise it would go to the bin."}, {"review_sentiment": 3.0, "review_text": "This small book is not as bad as the the one stars say, although several of their reviews (the longer ones, not the short little jabs) have good points to make.  It's also not as good as the five stars say.  The book does present some good stories about Florence, such as the moving of the David and the flood clean up, but leaves the reader wanting.  It's like reading a UPI spot on the sidebar of the newspaper.  Those that complain about the homosexuality, well, that's also part of Florence's history, and as Leavitt himself is gay, what would you expect?  The name dropping that Leavitt indulges in is annoying and mars an otherwise fine little book.  This book needs to be expanded upon to make it truly shine, with some editing to remove the author's self-aggrandizement.  I wouldn't pay full price for it, but you might be able to get it for a penny from the used book guys."}, {"review_sentiment": 1.0, "review_text": "The Writer and the City books are supposed to be idiosyncratic, and I greatly liked Edmund White's quirky but useful volume on Paris. However, with his \"Florence, A Delicate Case,\" David Leavitt firmly crosses the line between idiosyncrasy and self-indulgence. His third chapter--40 pages of a book of only 176 pages, including notes--is devoted to mentioning seemingly every homosexual writer who has ever visited the city in the last 200 years. This exercise COULD have been fascinating--maybe, in a separate book--but Leavitt appears so anxious to squeeze the names and titles into this pocket-sized volume that we are given very little accompanying narrative which would bring this very interesting group to life.With a city that is a mass of artistic treasure, Leavitt, who has lived there--lucky fellow--for years, would have done the reader a much greater service had he applied some better organization to this book. I wanted to like it (Leavitt has a good sense of syntax and vocabulary, and he is clearly a fund of knowledge), but ended up feeling cheated of better structural choices and the advantages of his educated vision."}, {"review_sentiment": 2.0, "review_text": "boh. The italian word to express \"meh, i don't know...\" This book grabbed me from the first pages, as another reviewer noted, that Florence is a city where people go to commit suicide. However, I never really grasped the point of the book as a whole. Some chapters were concise and well done, full of intriguing facts.....other chapters literally put me to sleep. Of course the 'Grand Tour' and ex-pat population in Florence is a weighty piece of its history. However, I found myself not really caring about insignificant love rivalries involving unimportant 'historical' figures. At the end of the day, I really don't even know hoe to describe this book.....it's not a travelogue, not a guide book, not a memoir, nor is it an historical compilation. boh. I guess I will just give my opinion that I found it boring and incohesive. We go from suicide, to sexually promiscuous (...in a word: easy) female American students, to random anecdotes about sandwich shops, highbrow BS about Britons I couldn't care less about, etc etc..."}, {"review_sentiment": 1.0, "review_text": "Possibly the most boring, pointless book I've ever read (and I do read a lot) - - no flow, not interesting, and the book does a dis-service to a fascinating town, despite the un-fascinating \"celebrity\" stories that Mr. Leavitt goes on and on and on about ..."}, {"review_sentiment": 1.0, "review_text": "A slim volume on one of the world's great foreign destinations, so one would expect something elegant, insightful, witty perhaps, something evocative of the place.Unfortunately, I don't there is a paragraph in his book that evokes anything about what it is like to visit or live in Florence. It's certainly not worth reading as literature and it doesn't take you there from your arm chair.This book is just a boring rendition of sort-of famous people who lived or live in Florence, coupled with David Leavitt's intention of showing you all the famous or important people he knows. He evidently thinks people will one day be writing about his life there.This isn't about Florence -- it's about the author's evident obsession with effete men of letters and his desire to be one."}]}, "authors": ["David Leavitt"], "isbn": "1632863758", "longitude": 11.2555757, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Florence: A Delicate Case (Writer and the City)", "word_cloud": "well everyone right really maybe people love florence visit consider going rather um specialize say group litterateur interested insignificant group highly personalize sometimes bit dotty sometimes bit good stuff interest person let retail will rick sieve give fair account wealthy choose late century mostly escape rigid moral constraint time sense somewhat approach history famous italian city period chapter foreign volunteer help art treasure disastrous flood large disconnect collection gossip expat part obscure thread connects different people seem gay florence small chapter much half inch paper opening smart follow engages portray different version dark obsess death magnet suicide settling promise exquisite well first chapter change tone become chronicle gossip undeserving bunch back bite queen title nobility vacation socialite friend hanger even fresh recycle reconstitute gossip date better part last century flash brief flicker people work long forget deservedly increasingly annoy recitation continue unabated chapter relief arrive chapter detail rather dry term whys hows statue move original home della current home copy piazza today begin chapter right curious disclaimer sort return gossip process reveals reason write disclaimer ostentatious try put aside offer introduction everyone expat community matter place matter turn pretty much lo ordinary boy entirely develop live last monument term nearly century half expat community pass away include formidable portray prisoner villa garden get glimpse funeral gay writer present moment last word people notoriously spent live try last word contemporary often vicious last word still see smaller even frivolous usually sell boutique focus cat small dog learn stale almost soon leave boutique especially give dramatic interesting start much probably bigger expat community really talented yet become devoted shallow decadent backbite pursuit idea much famous creatively productive expat era community legendary recently produce movie set film today devoid lightly educate mistake cinematic version section disappoint little find best summary experience quip attribute nothing say say story name drop exasperate think people live finish tiny large print big indentation guess whole series otherwise bin small bad star say several review longer one short little jab good point make also good star say present good story move flood clean leave want read spot sidebar newspaper complain homosexuality well also part history gay name drop indulges annoy mar otherwise fine little need expanded make truly shine edit author full price able penny use guy suppose idiosyncratic greatly like quirky useful volume however firmly cross line third chapter page page include note devote mention seemingly homosexual writer ever visit city last year exercise fascinating maybe separate appear anxious squeeze name title volume give little accompanying narrative interesting group city mass artistic treasure live lucky fellow year do much greater service apply better organization want good sense syntax vocabulary clearly fund knowledge end feeling cheat better structural choice advantage educate vision italian word express meh know grab first page reviewer note city people go commit suicide however never really grasped point whole chapter concise well do full intriguing fact chapter literally put sleep course population weighty piece history however find really care insignificant love rivalry involve unimportant figure end day really even know hoe describe travelogue guide memoir historical compilation hob guess give opinion find bore in cohesive go suicide sexually promiscuous word easy female american student random anecdote sandwich shop highbrow le etc etc possibly bore pointless ever lot flow interesting fascinate town celebrity story go slim volume world great foreign destination something elegant insightful witty perhaps something evocative paragraph evokes anything visit live florence certainly worth read literature arm boring rendition famous people live live couple intention show famous important people know evidently think people day write life author evident obsession effete men letter desire", "genres": ["Memoir", "Travel Writing"], "summary": "Why has Florence always drawn so many English and American visitors? (At the turn of the century, the Anglo-American population numbered more than thirty thousand.) Why have men and women fleeing sex scandals traditionally settled here? What is it about Florence that has made it so fascinating--and so repellent--to artists and writers over the years?\r\n\r\nMoving fleetly between present and past and exploring characters both real and fictional, Leavitt's narrative limns the history of the foreign colony from its origins in the middle of the nineteenth century until its demise under Mussolini, and considers the appeal of Florence to figures as diverse as Tchaikovsky, E.M. Forster, Ronald Firbank, and Mary McCarthy. \r\n\r\nLesser-known episodes in Florentine history--the moving of Michelangelo's David, and the construction of temporary bridges by black American soldiers in the wake of the Second World War--are contrasted with images of Florence today (its vast pizza parlors and tourist culture). Leavitt also examines the city's portrayal in such novels and films as A Room with a View, The Portrait of a Lady and Tea with Mussolini.", "asin": "1632863758", "rank": "178738", "city": "Florence", "image": "https://images-na.ssl-images-amazon.com/images/I/51afn9JWHeL.jpg", "country": "Italy", "story_arc": ["Tragedy", "Things only get worse"]}