{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 46, "rating": 4.6, "reviews": [{"review_sentiment": 3.0, "review_text": "First the good news: the graphics is breathtaking. Beautiful colors and scenes and a dystopic future beautifully illustrated.  The story, though, it's disappointing.There are original ideas, Moebius would have loved the mask theme, but the central premis, intrtnet being gone, isn't sufficiently explained, what exactly caused the  \"cloud\" to explode and how it happened is not clear. Nor is the whole story particularly original or plausible. The Author is doing a much better work in SAGA. And a technology, once discovered and implemented, it's not likely to go away"}, {"review_sentiment": 4.0, "review_text": "Solid graphic novel with an intriguing story."}, {"review_sentiment": 5.0, "review_text": "Good read..."}, {"review_sentiment": 5.0, "review_text": "Brian K. Vaughn and Marcos Martin's the Private Eye is a masterpiece of the comic book medium, and not just for its story and art but for the format it was released in, as well. Originally released as a pay-what-you-want digital book released directly from the creators in multiple languages on their web site (panelsyndicate.com), the Private Eye is a story about a futuristic america where the Internet is dead and the only way people can retain a semblance of anonymity is to assume a secret identity and wear masks in public. The premise alone sold me, but the final product is fantastic to boot.Sure, this book has some hiccups here and there, such as the plot being your basic \"evil money-man wants to do this, kills people, reluctant hero stops them\" trope. However, the character interactions and world-building more than make up for this sleight. Every character is unique and carries their own voice within the story, with the exception of the scientist-type character on the antagonist's side, who sometimes devolves into the \"in over their head\" type of character that we always see in movies and comics, but is till loyal to the antagonists's cause.The art in this book is vibrant and gorgeous from start to finish, with exceptionally creative character designs, particularly the mask designs. Everything also feels highly realistic and carries a weight to it, despite the obviously stylistic approach taken. I could almost feel all the injuries dealt throughout the book, and trust me, there's a LOT of graphic imagery in this book. However, that is not to say that this book is all violence, as all of it is spaced very evenly throughout the book, and the nudity is even more sparse despite it being full-frontal (we clearly see dong and vag more than once).Overall, I would highly recommend this book to fans of either creators behind this book, or even anyone looking for a good sci-fi-styled pulp-noir story."}, {"review_sentiment": 5.0, "review_text": "This is a beast of a book, which was originally published online at panelsyndicate.com. I read the hardcover version collecting all ten issues. Rather than having the standard portrait layout, the creators used landscape. This, combined with the panel placements, gives the book a very cinematic feel. It works great with the pacing and style of the story. The illustrations themselves help set the tone of the story between the character designs and colors.The story takes place in the near future. At some point the Cloud that stored everyone's personal data, including online habits and searches, burst, making that information available to everyone. People's lives were basically ruined as a result. Now, everyone wears masks to hide their identities. The Internet has been dismantled as a failed experiment and the youth in this story have never had access to it.P.I. is hired by a woman to dig into her life to see what kind of dirt he can find. When she turns up dead it is up to P.I., his assistant, and the dead woman's sister to learn the truth about what happened. The resulting events are pretty clever and feel realistic. The futuristic world is well constructed. Each element adds to the whole without having dangling threads. The supporting characters, especially P.I.'s grandfather, add some comic relief to the story.I recommend picking it up if you are even remotely considering it. I had this on my list of books to read for quite a while, and my only disappointment is that I waited so long to check it out."}, {"review_sentiment": 5.0, "review_text": "Brian K. Vaughan never disappoints. This started as an online comic but it works in print just as well! A cool twist on the future society/sci fi genre with dynamic art!"}, {"review_sentiment": 5.0, "review_text": "Brian K Vaughn and Marcos Martin's \"The Private Eye\" is a masterpiece. Published online initially, with an \"In Rainbows\" style business model, the final printed version they released is simply dazzling. It's easily one of the best comics I've read in a long while. It's not quite the nuclear tour-de-force of \"The Sculptor\" but it retains that wonderful noir element of \"Criminal\" while also mixing in copious amounts of Blade Runner. The format itself is also fascinating, presented in a 16x9 aspect book as opposed to a standard form comic, the formatting itself lends to the thematic composition of the comic from start to finish.Overall, I cannot recommend this highly enough."}, {"review_sentiment": 4.0, "review_text": "An interesting look at a post-internet world, where people want nothing to do with social media or sharing every minute detail of their lives. Brian K Vaughan's world building is amazing, but the plot is somewhat straightforward and predictable. The art, especially the coloring by Muntsa Vicente, is amazing. The page layout is also unique, in that the pages are wider than they are tall. This makes it's inclusion on a bookshelf troublesome."}, {"review_sentiment": 5.0, "review_text": "excellent concept for the storyline and the artwork was amazing.  I will definitely be looking for more from this author."}, {"review_sentiment": 4.0, "review_text": "I was originally very excited when I heard that Brian K. Vaughn and Marcos Martin were going to be collaborating on a creator owned book.  I've very much enjoyed pretty much everything Vaughn has done and I came to really like Martin's artwork through his work on Spiderman.  My excitement diminished quite a lot when they announced the book would only be available digitally online.  I prefer physical books, especially when it comes to ones that rely heavily on their art.  Luckily a few years later they released this physical edition and here we are.Martin's artwork is again wonderful.  His work can seem minimal at times, with stark single color backgrounds but he tells the story fantastically and all the required detail is there.  The plot takes a loot at what's going on in the world today with things like Facebook, Twitter, Instagram, etc.  People are basically broadcasting their entire lives, but what if something happened that truly revealed everything.  Every search you ever did, every email, text, or photo you ever uploaded, out there for anyone to see.  That's what happened in this world and now no one leaves the house without some kind of mask or disguise on, the internet is no more, people get their information from books and libraries, and journalists are among the most important and respected people around.Our main character works on the fringe of this society, he is a paparazzi.  For a nominal fee he will do some digging to find out things would like to keep private and eventually one case goes a bit off the rails.This edition also gives you some sketches as well as a series of emails between Vaughn and Martin as they discuss the book and what it eventually becomes."}]}, "authors": ["Brian K. Vaughan"], "isbn": "1632155729", "longitude": -118.244476, "periods": ["2000s", "Recent Releases"], "title": "The Private Eye", "word_cloud": "first good news graphic breathtaking beautiful color scene dystonia future beautifully illustrate story original idea mask theme central prime intranet go sufficiently explain exactly cause cloud explode happen clear whole story particularly original plausible much better work technology discover implement likely solid graphic intriguing story good comic medium story art format release well originally release digital release directly creator multiple language web site story futuristic america dead way people retain semblance anonymity assume secret identity wear mask public premise alone sell final product fantastic hiccup plot basic evil want kill people reluctant hero stop trope however character interaction make sleight character unique carry voice story exception character antagonist side sometimes devolve head type character always movie comic till loyal antagonist art vibrant gorgeous start exceptionally creative character design particularly mask design also feel highly realistic carry weight obviously stylistic approach take almost injury deal trust graphic imagery however say violence space evenly nudity even sparse clearly dong avg highly fan creator even anyone look good story beast originally publish online hardcover version collect ten issue standard portrait layout creator use landscape combined panel placement give cinematic feel work great pace style story illustration help tone story character design story take place future point store everyone personal data include online habit search burst make information available everyone live basically ruin result now everyone wear mask hide identities dismantle fail experiment youth story never access hire woman dig life see kind dirt find turn dead assistant dead woman sister learn truth happen result event pretty clever feel realistic futuristic world well construct element add whole dangle thread support character especially grandfather add comic relief recommend pick even remotely consider list quite disappointment wait long check never disappoint started online comic work print well cool twist future phi genre dynamic art masterpiece publish online initially style business model final print version release simply dazzle easily best comic long quite nuclear retain wonderful nor element also mix copious amount format also fascinate present aspect oppose standard form comic formatting lend thematic composition comic start recommend highly enough interesting look world people want nothing social medium share minute detail live world build amaze plot somewhat straightforward predictable art especially color amaze page layout also unique page wider make inclusion troublesome excellent concept story line amaze definitely look author originally excite hear go collaborate creator own much enjoy pretty much everything do come really like artwork work excitement diminish quite lot announce available digitally online prefer physical especially come one rely heavily art year later release physical edition artwork wonderful work seem minimal time stark single color background tell story fantastically require detail plot take loot go world today thing basically broadcast entire life something happen truly revealed everything search ever email text photo ever upload anyone see happen world leave house kind mask disguise internet people get information library journalists important respect people main character work fringe society paparazzo nominal fee dig find thing eventually case go edition also give sketch well series email discuss eventually becomes", "genres": ["Comics & Graphic Novels", "Science Fiction"], "summary": "From the creator of the New York Times bestselling series SAGA, comes the three-time, Eisner nominated, PanelSyndicate.com's digital comics sensation THE PRIVATE EYE! Finally, this book is coming to print in a beautiful deluxe hardcover edition! \r\n\r\nSet in an inevitable future of where everyone has a secret identity, THE PRIVATE EYE is an eerily prescient sci-fi mystery about an unlicensed private investigator who stumbles onto the most important case of his life. \r\n\r\nThe series is set in 2076, a time after \"the cloud has burst\", revealing everyone's secrets. As a result, there is no more Internet, and people are excessively guarded about their identity, to the point of appearing only masked in public.\r\n\r\n\"Readers and retailers have been begging us for a physical version of this story ever since we first announced our hard-boiled parable about the future of privacy in America, so when the time came, Marcos and I knew that we had to go with Image Comics, the most creator-friendly publisher of print comics ever.\" Brian K. Vaughan\r\n", "asin": "1632155729", "rank": "92821", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/51NsxVIgqpL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}