{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 11, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "Wide ranging and beautifully written this short book by John Banville packs an incredible amount of anecdotal and historical information about Prague. Moving back and forth in time and combining the author's own personal  observations of the city both before and after the Communist era with historical portraits of some of the city's more notable inhabitants he manages to leave the reader with a fascinating impression of Prague through the centuries as well as the modern city with it's hordes of tourists. A remarkable achievement in just under 250 pages."}, {"review_sentiment": 4.0, "review_text": "Part memoir, part love song to Prague, John Banville entertains and charms the reader with his personal travels, his bevy of Czech friends, his unpredictable and digressive, occasionally overwritten descriptions often spiced by an undercurrent of wryness. One is not quite sure if some of these chapters are fact or fiction but that does not detract from this interesting book. His tribute to Josef Sudek, the photographer, the \"Poet of Prague,\" is beautifully descriptive of his photos of St. Vitus Cathedral as only Banville can; perhaps even drawing on the wonderful book about Sudek by Aperture called\"A Photographer's Life.\"Banville's word powers are remarkable; one woman has \"a head of one of Modigliani's less dim-seeming models . . .[with] a pale hand...[with] the chill, slack feel of a small, exquisite, fine boned creature that had recently frozen to death.\" Regrettably, he stuffs in the middle a chapter about Tycho Brahe and Johannes Kepler which may fit in his other writings about astronomy but slows the book's focus and pace. Otherwise, an entertaining read in an superb binding by Bloomsbury."}, {"review_sentiment": 1.0, "review_text": "Beautiful writing by one of my favorite novelists about my favorite city--the perfect book!  Banville includes personal anecdotes, cold war stories, the Nazi occupation, and architectural detail, thus encompassing the complicated history of this city famous for its Art Deco buildings and it Jewish golem.  A terrific read!"}, {"review_sentiment": 4.0, "review_text": "Excellent background detailing Prague.  This is not a photographic book, but you may use your imagination to develop pictures of historical events of Prague."}, {"review_sentiment": 5.0, "review_text": "This is a delightful melange of personal narrative, Prague history, and biographical snippets on historic figures associated with Prague. Banville has an ongoing love affair with the city. He recounts various visits both during and after the Cold War. Interspersed are biographical sketches of Charles IV, Rudolph II, photographer Josef Sudek, Tycho Brae and Kepler. Banville's style is warm, personal and erudite. He achieves what every travel writer strives for: hemakes the city come to life and makes you want yo go there."}, {"review_sentiment": 5.0, "review_text": "GREAT product, will buy from this seller again!"}, {"review_sentiment": 5.0, "review_text": "This book gives so much insight into Czech history and culture, anybody interested in Prague or Czech Republic will gain much from reading this.  It is beautifully written and captivating.The book itself (hardcover version) is also very beautiful with small size (4.75 x 7.25in) and cover images by Josef Sudek.I especially appreciate this book for introducing me to the photographs of Josef Sudek, one of the most beautiful things I've ever seen."}, {"review_sentiment": 4.0, "review_text": "The author knows Prague very well and writes with great affection and deep knowledge of it's history.The interested reader will find exhaustive information on Prague and it's culture. The author concentrates most on the high  baroque, the achievements of emperor Rudof's court and the architectural renewal of the city."}, {"review_sentiment": 5.0, "review_text": "This sumptuously-written book evokes Prague with so much soul and intimacy that it leaves all rival Prague portraits in the dust. Not only does the author feel everyday experiences more acutely than most of us, but he is able to maintain the depth of his poetic explorations from the beginning to the end. Having been there myself before and after the Velvet Revolution, and having also witnessed the cultural highs and lows he so perfectly describes, I almost feel like I know him. (I wish I did). This is so special a book that I almost want to tuck it into a private place on my bookshelf where no one can find it, and snobbishly, I suppose, lend it only to those I feel are perceptive enough to understand."}, {"review_sentiment": 5.0, "review_text": "John Banville, in many of his novels, conjures up the alchemical and scientific wonders of early modern Europe: Copernicus, Kepler, Newton, Dr Faustus. His prose always has daunted me from taking on his dense, serious fiction, but perhaps, after this wonderfully self-deprecating, nimbly observed, and precisely rendered collection of thoughts inspired by events and people in Prague, I will try his novels! As Banville prefaces this small but pleasingly compacted assemblage of ruminations, it is not a guidebook but (my words) a momento urbi, a reminder of this city.He avoids post-Wall sightseeing (contrast Myla Goldberg's Time's Magpie), limits his Kafka citations wisely (compare nearly any other journalist!), and steers clear from tiresome dynastic recitals (unlike Peter Demetz' City of Black & Gold). Out of his travels there, starting in 1975, he instead opts to build slightly interrelated essays. The first, \"Sudek's City,\" tells of the Professor and Marta, who show him and his companions prints by Josef Sudek, a photographer (two of which I presume grace this book's covers), who reveals tangibly yet tangentially the post-war era. Banville links the dislocation of the jet-lagged traveller in the hotel room with the wider struggle by a people to overcome alienation in their home city, yet such connections are left subtle, for us to tie together. The description in a page or so of the Professor, who himself threatens to become effaced after so many decades of having to blend in to such surroundings, is one of the most powerful depictions in print I have ever read of summing up another human in a few well-chosen words.\"Threshold,\" from which the name for Prague was derived, merges the background on the city with its monuments, even as Banville insists that they do not make Prague what it is, this essence too elusive. Fittingly, such fluidity blends into an account of Rudolf and the intellectual climate that lured some of Europe's most creative minds in the later 16th c. to study magic, astronomy, the occult, and the rational, or mixes thereof.\"The Prague Orgy\", while never mentioning Philip Roth, starts with Banville's teenaged longing for a minor Czech actress, Eva Bartok, and his longing for such dark beauties, often with (sans makeup!) pale plum-hued shadows under their eyes. He segues into his friend Phil who boasts of \"The Company,\" the Havel era, the \"putative parents\" of his hostess at a doomed dinner party, to conclude, paraphrasing another Philip (Larkin) that \"nothing, like something, can happen anywhere. Banville again evokes psychological dislocation marvellously, keeping control of his shifting scenes while hiding from we his readers his manipulative strings. He's too good a writer to let his craft show so nakedly.From one who wrote a novel called \"Kepler,\" the chapter \"Great Dane, Little Dog\" relates the long story of Tycho Brahe, his unfortunate death for the sake of royal etiquette, and his somewhat unwilling apprentice Johannes Kepler. Prague itself fades a bit even more than in the rest of the book, but Banville keeps the tale engaging. I found this segment of the volume readable, but since I do not share Banville's obvious love of this period, its comparative detachment from the city itself made it too tangential. On a related note, he incorporates references to a far more obsessive text, Angelo Maria Ripellino's \"Magic Prague,\" nicely into his volume, so you feel you get the gist of that admittedly appealing but immensely detailed study without all of its laborious asides. Their common concentration on the hermetic, the mathematical, and the malcontent does show why Prague thrived as an asylum and a laboratory for so many ambitious quacks, mad scientists, and rogues.\"Snapshots\" takes Banville out of Prague to Bratislava, but not for the sights. He conveys here being out of place as a modern intellectual at a conference where his ignorance (so he assumes, though we readers might disagree) his unmasked before the restless native audience. The tale of an old communist, Goldstucker, and the saga of the Golem and the Jewish ghetto is recounted to sum up the condition of the latter-day dreamers and thinkers in a more recent regime that reigned over the Castle.Finally, in two brief codas, \"The Deluge\" tells of the 2002 summer floods, with a marvelously apt quote from Eliot's \"Four Quartets,\" and \"After-Images\" leaves us with Banville's fading scenes from his Prague travels. A short bibliography adds to the value of this short but elegant and never predictable meditation.Pg. 83 sums up his motif for this volume, except for its covers devoid of visual \"pictures\" that rather he brings out of his mind's eye into our receptive faculty: \"These are the things we remember. It as if we were to focus our cameras on the great sights and the snaps when developed all came out with nothing in them save undistinguished but manically detailed foregrounds.\" The unreliable and capricious state of memory, then, is Banville's true souvenir that he shares with us from this city."}]}, "authors": ["John Banville"], "isbn": "163286374X", "longitude": 14.4212535, "periods": ["2000s"], "title": "Prague Pictures: Portraits of a City", "word_cloud": "range beautifully write short pack incredible amount anecdotal historical information back forth time combine author personal observation era historical notable inhabitant manages leave fascinate impression century well modern horde tourists remarkable achievement page part memoir part love song entertain charm personal travel bevy friend unpredictable digressive occasionally overwritten description often spice undercurrent wryness quite sure chapter fact fiction detract interest tribute photographer beautifully descriptive photo perhaps even draw wonderful call word power remarkable woman head le model pale hand chill slack small exquisite fine bone creature recently freeze death stuff middle chapter writing astronomy slow pace entertain superb bind beautiful write favorite novelist favorite perfect include personal anecdote cold war story occupation architectural detail thus encompass complicated history famous building golem terrific excellent background detail photographic imagination develop picture historical event delightful melange personal narrative history biographical snippet historic figure associate ongoing love affair recount various visit intersperse biographical sketch photographer style warm personal erudite achieve travel writer strive remake come life make want yo great product seller give much insight history culture anybody interested gain much read beautifully write hardcover version also beautiful small size cover image especially appreciate introduce photograph beautiful thing ever see author know well write great affection deep knowledge interested find exhaustive information culture author concentrate high baroque achievement emperor court architectural renewal evoke much soul intimacy leave rival dust not feel everyday experience acutely able maintain depth poetic exploration begin end have also witness cultural high low perfectly describe almost feel know wish special almost want tuck private place find snobbishly suppose lend feel perceptive enough understand many novel conjures chemical scientific wonder early modern prose always daunt take dense serious fiction perhaps wonderfully nimbly observe precisely render collection thought inspire event people try novel preface small pleasingly compact assemblage rumination guidebook word turbid reminder avoids sightsee contrast limit citation wisely compare nearly journalist steer clear tiresome dynastic recital travel start instead opts build slightly interrelate essay first tell show companion print photographer presume grace cover reveals tangibly yet tangentially era link dislocation traveler hotel room wider struggle people overcome alienation home yet connection leave subtle together description page threaten effaced many decade blend surroundings powerful depiction print ever sum human word name derive merges monument even insists make essence elusive fluidity blend account intellectual climate lure creative mind later study magic astronomy occult rational mix thereof never mention start teenage long minor actress long dark beauty often sans makeup pale shadow eye segue friend boast era putative parent hostess doom dinner party conclude paraphrase nothing something anywhere evoke psychological dislocation marvelously keep control shift scene hide reader manipulative string good writer let craft write call chapter relate long story unfortunate death sake royal etiquette somewhat unwilling apprentice fade bit even engage find segment volume readable share obvious love period comparative detachment make tangential related note incorporates reference far obsessive text nicely volume get gist admittedly appeal immensely detail study laborious aside common concentration hermetic mathematical malcontent show thrive asylum laboratory many ambitious quack mad scientist rogues take sight convey place modern intellectual conference ignorance assume reader unmasked restless native audience tale old communist saga ghetto recount sum condition dreamer thinker recent regime reign brief codas tell summer flood marvelously apt quote leave fade scene travel short bibliography add value short elegant never predictable sum motif volume cover devoid visual picture rather bring mind eye receptive faculty thing remember focus camera great sight snap develop come nothing save undistinguished manically detailed foreground unreliable capricious state memory true souvenir share", "genres": ["Memoir", "History", "Travel Writing"], "summary": "Prague is the magic capital of Europe. Since the days of Emperor Rudolf II, \"devotee of the stars and cultivator of the spagyric art\", who in the late 1500s summoned alchemists and magicians from all over the world to his castle on Hradèany hill, it has been a place of mystery and intrigue. Wars, revolutions, floods, the imposition of Soviet communism, and even the depredations of the tourist boom after the Velvet Revolution of 1989 could not destroy the unique atmosphere of this beautiful, proud, and melancholy city on the Vltava.\r\n\r\nJohn Banville traces Prague's often tragic history and portrays the people who made it: the emperors and princes, geniuses and charlatans, heroes and scoundrels. He also paints a portrait of the Prague of today, reveling in its newfound freedoms, eager to join the European Community and at the same time suspicious of what many Praguers see as yet another totalitarian takeover. He writes of his first visit to the city, in the depths of the Cold War, and of subsequent trips there, of the people he met, the friends he made, the places he came to know.\r\n\r\n“When he was younger, Banville notes, he believed that really to get under the skin of a city one had to fall in love there. Prague, promiscuous and secretive, appears to have offered him another possibility. To understand a little more of himself, he first had to fall in love with a city.” The Guardian", "asin": "163286374X", "rank": "625821", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/513vrmmTQxL.jpg", "country": "Czechia", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}