{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 26, "rating": 4.2, "reviews": [{"review_sentiment": 3.0, "review_text": "Expected more of  life story."}, {"review_sentiment": 5.0, "review_text": "Amazing description of the life and work of Michelangelo showing how his art and his faith grew as he worked."}, {"review_sentiment": 5.0, "review_text": "At the age of 23, I stepped into the Sistine Chapel, looked up and thought, \"So this is it?\" As I stared at the ceiling the figures seemed to come alive and I was mesmerized. 50 years later I still remember that moment. My only complaint about this book is that I would have liked for the pictures to be next to the text rather than the pictures all at one time. I recommend having a copy of the painting as you read the descriptions and interpretations. It is a good study of a one-of-a-kind work of genius."}, {"review_sentiment": 4.0, "review_text": "Useful prior to Sistine visit"}, {"review_sentiment": 5.0, "review_text": "this was a gift for my mother (a self admitted \"Mike\" fan [she hauled us off to Italy but we only visited cities where he had works exhibited....]) and she raves about it. Apparently she made notes on the first run thru and now plans to read it again just for fun"}, {"review_sentiment": 4.0, "review_text": "Really enjoyed this"}, {"review_sentiment": 4.0, "review_text": "Fascinating!"}, {"review_sentiment": 5.0, "review_text": "Great history of the magnificent Sistine Chapel ceiling, newly restored and cleaned.  Takes one's breath away in real life!"}, {"review_sentiment": 5.0, "review_text": "I love it!"}, {"review_sentiment": 3.0, "review_text": "Not what I expected.  Emphasis is on the Christian aspect of the paintings - okay - but I was hoping for a more biographical approach.  I did learn some worthwhile things, however, so, it's \"okay.\""}]}, "authors": ["Andrew Graham-Dixon"], "isbn": "1634502515", "longitude": 12.4829321, "periods": ["1600s", "Recent Releases"], "title": "Michelangelo and the Sistine Chapel", "word_cloud": "expect life story amaze description life work show art faith grow work age step look thought so star ceiling figure seem come alive mesmerize year later still moment complaint picture text rather picture time recommend copy painting description interpretation good study work genius useful prior visit gift mother self admit fan haul visit city work exhibit raf apparently make note first thru plan fun really enjoy fascinate history magnificent ceiling newly restore clean breath away real life love not expect aspect painting hop biographical approach learn worthwhile thing however okay", "genres": ["Biography", "Art & Architecture", "History"], "summary": "The true story behind one of the greatest masterpieces of all time.\r\n\r\nYou cannot stand underneath the masterwork that is the Sistine Chapel without considering the genius and painstaking work that went into its creation. Michelangelo Buonarroti never wanted to paint the Sistine Chapel, though. Appointed by the temperamental Julius II, Michelangelo believed the suspiciously large-scale project to be a plot for failure conspired by his rivals and the “Warrior Pope.” After all, Michelangelo was not a painter—he was a sculptor. The noble artist reluctantly took on the daunting task that would damage his neck, back, and eyes (if you have ever strained to admire the real thing, you know). Andrew Graham-Dixon tells the story behind the famous painted ceiling over which the great artist painfully toiled for four long years.\r\n\r\nLinking Michelangelo’s personal life to his work on the Sistine Chapel, Graham-Dixon describes Michelangelo’s unique depiction of the Book of Genesis, tackles ambiguities in the work, and details the painstaking work that went into Michelangelo’s magnificent creation. Complete with rich, full-color illustrations and Graham-Dixon’s articulate narrative, Michelangelo and the Sistine Chapel is an indispensable and significant piece of art criticism. It humanizes this heavenly masterpiece in a way that every art enthusiast, student, and professional can understand and appreciate.", "asin": "1634502515", "rank": "173162", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/61VUj1tPk9L.jpg", "country": "Italy", "story_arc": ["Tragedy", "Things only get worse"]}