{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 1, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "This is a wonderful book -- part contemporary dad-son travel story, mostly a fascinating history of the city now known as Istanbul.  Mr Fidler is Australian and has a great, wry sense of humor.  I highly recommend this to anyone who is looking to learn more about this city, and the history behind it."}]}, "authors": ["Richard Fidler"], "isbn": "1681775115", "longitude": 28.9651646, "periods": ["Recent Releases", "1500s", "500-1400s", "0-500s", "Pre Common Era"], "title": "Ghost Empire: A Journey to the Legendary Constantinople", "word_cloud": "wonderful part contemporary travel story mostly fascinating history city know great wry sense humor highly recommend anyone look learn city history", "genres": ["History", "Ancient Civilizations"], "summary": "\"A brilliant reconstruction of the saga of power, glory, and invasion that is the one-thousand year story of Constantinople. A truly marvelous book.\" Simon Winchester\r\n\r\nGhost Empire is a rare treasure―an utterly captivating blend of the historical and the contemporary, narrated by a master storyteller. The story is a revelation: a beautifully written ode to a lost civilization combined with a warmly observed father-son adventure far from home.\r\n\r\nIn 2014, Richard Fidler and his son Joe made a journey to Istanbul. Fired by Richard's passion for the rich history of the dazzling Byzantine Empire―centered around the legendary Constantinople―we are swept into some of the most extraordinary tales in history. The clash of civilizations, the fall of empires, the rise of Christianity, revenge, lust, murder. Turbulent stories from the past are brought vividly to life at the same time as a father navigates the unfolding changes in his relationship with his son. Illustrated throughout with B&W photographs and maps", "asin": "1681775115", "rank": "273609", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51jd2BPGgxL.jpg", "country": "Turkey", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}