{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 2, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "The Volcano commences with a reflection of Emilio Aquila's life, from 1943 in Sicily when, at fifteen years of age, he was kicked and hospitalized by his family's donkey. After the kick in the head he has violent inclinations. Living on a farm in the shadow of the Etna volcano, with its rumbling and roiling, smoke and fire, he is drawn to the mountain--not repulsed by it, or afraid of it. He runs away from home six months later, taking only the donkey, to live in the labyrinthine caves on the slopes of Mt. Etna. Years later, in the 1950s, he has two sea voyage tickets which took him \"five years of blood to buy.\" And so he arrives in Brisbane, Australia, with his wife Desideria (who soon leaves him), as a man with a shady past and a secretive life.Emilio, now in his seventies, lives in a groundsman's cottage on the Queensland property of a Vietnamese doctor. Dr. Thach Yen-Khe, his wife Elizabeth, and two daughters, Laura and Symantha, live in a house further up the hill. When their marriage breaks down, Elizabeth demands the departure of both Thach and Emilio. The news brings back Emilio's past to haunt him. He finds himself, one evening, with an axe in his hand.Mary Aquila, undertaking a university-level writing course, receives a telephone call informing her that \"one of your relatives has got himself in trouble.\" The front page of the local newspaper reports that two male intruders entered the home of two eighty-year-old women--one is killed with a hammer and the other is badly beaten. When the police arrive, Emilio is swinging an axe handle at the intruders. Emilio is a hero, but is hospitalized with head and eye wounds.Mary Aquila had never heard of Emilio; neither had her grandmother. Mary finds him in hospital, and meets the newly rejected Dr. Thach Yen-Khe. Mary cares for them both, nursing Emilio back to health in her own home. As a writing student completing her thesis, she decides to document Emilio's history into a story. Dr. Thach lets Mary use an office in his new home--some nights she stays with her new lover, and some nights she returns to her home to attend to Emilio.Emilio's true story unfolds. The novel is his explanation, his \"defense\" for the way he was when he arrived in Australia--\"hopeful and scared, and optimistic and suspicious\"--and \"the self-justification of an old man.\"The Volcano is a mammoth book of weight-lifting proportions--but also of magnificent scope, detail, and emotion. More than a story about escaping the past, and more than a story about assimilation into a new country, it is also a story of the memories, events, people, environment, and lifestyle that repeat, defeat, and complete a person. But, like a volcanic eruption and twenty years of lava, ash and fallout that creates perfect conditions for fruit and vegetables, \"the catastrophe of one generation is the blessing of the next.\""}, {"review_sentiment": 4.0, "review_text": "Venero Armanno, in The Volcano, bridges worlds.  A Sicilian-Australian saga of love won and lost, of the dead walking and talking, of myths moving in the present, the Volcano keeps the reader intrigued and engrossed, despite being wrung out by the pathos of a life lived tough and raw.The Volcano tells the story of Emilio Aquila, a boy growing up during the war in a poor farming coomunity in the foothills of Mt Etna in Sicily. Emilio attempts to escape his identity and fate, retreating into a hermit's cave in the hills.  But life pursues him there, in the form of friendship, infatuation and violence.Capturing his reluctant bride and seeking peace and opportunity Emilio escapes once more to Brisbane, Australia, my home town, for some time thinking he was in the United States. The author captures the mood and pace of the sub-tropical town growing slowly into a corrupt and conservative city with all the elements of crime and violence that entailed.  He is eloquent and forceful in describing the maculine world of Italian and Sicilian labourers, forced to cope with the snubs of conservative Queenslanders and the violence of those who oppose these new Australians who work and play, a little too hard for the locals. Armanno is most forceful though in giving voice to the rough passion and moral confusion of a man in search of a dream distracted by a vision and haunted by ghosts and myths.  An excellent book to read in a hospital stay I can assure you."}]}, "authors": ["Venero Armanno"], "isbn": "1740511921", "longitude": 0.0, "periods": ["1900s"], "title": "The Volcano", "word_cloud": "commences reflection life fifteen year age kick hospitalize family donkey kick head violent inclination live farm shadow rumble roil smoke fire drawn mountain repulse run away home month later take donkey live labyrinthine cave slop later sea voyage ticket take year blood buy arrive wife soon leave man shady past secretive seventy live groundsman cottage property doctor wife daughter live house hill marriage break demand departure news bring back past haunt find evening ace undertake write course receive telephone call inform relatives get trouble front page local newspaper report male intruder enter home woman kill hammer badly beat police arrive swing ace handle intruder hero hospitalize head eye never hear grandmother find hospital meet newly reject care nurse back health home write student complete thesis decides document history story let use office new home night stay new lover night return home attend true story unfold explanation defense way arrive hopeful scar optimistic suspicious old man proportion also magnificent scope detail emotion story escape past story assimilation new country also story memory event people environment lifestyle repeat defeat complete person volcanic eruption year lava ash fallout create perfect condition fruit vegetable catastrophe generation bless next bridge worlds saga love lose dead walk talk myth move present keep intrigue engrossed wrung pathos life live tough tell story grow war poor farm community foothill attempt escape identity fate retreat hermit cave hill life pursues form friendship infatuation reluctant bride seek peace opportunity escape home town time think author capture mood pace town grow slowly corrupt conservative city element crime violence entail forceful describe masculine world italian sicilian laborer force cope snub conservative queen slanders violence oppose new work little hard local forceful give voice rough passion moral confusion man search dream distract vision haunt ghost myths excellent hospital stay assure", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Sweeping from Sicily to Australia, spanning generations and very different worlds, The Volcano is a novel of power, passion and sheer blazing brilliance from one of our most talented and original writers.\r\n\r\nA fiercely original, beautifully written, multi-layered tour de force of immense power and humanity, The Volcano tells the tumultuous story of Emilio Aquila, a boy driven mad by love for a woman beyond his reach. His passion turns him into an outcast, forced to live away from his village in the labyrinthine caves high on the slopes of Sicily's Mount Etna. \r\n\r\nHis determination to right the wrongs dealt to him turns him into a kidnapper and a gangster - and compels him to seek a new life half a world away. But will he be able to escape the shadows of the past? And will Australia ever be more to him than a place of suffering and regret? An incandescent novel of abduction, passion and torment from the fiery heart of Sicily.", "asin": "1740511921", "rank": "10407230", "city": "Sicily", "image": "https://images-na.ssl-images-amazon.com/images/I/51ixxNHzd4L.jpg", "country": "Brisbane", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}