{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": -37.8142176, "ratings": {"num_ratings": 11, "rating": 3.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Fantastic insight into Australian indigenous culture"}, {"review_sentiment": 3.0, "review_text": "An interesting idea, but I found the book a bit boring - the writing style was ho-hum and not very engaging for me.  I was surprised that it had been endorsed (apparently) by authors such as Tim Winton."}, {"review_sentiment": 1.0, "review_text": "I always fine Alex Miller's writing great, exceptthatin this one he is forever mentioning the light ing & smoking of cigarettes.  it really is completely overdone & spoils the telling of another good story!!"}, {"review_sentiment": 3.0, "review_text": "Very slow. I kept waiting for something to happen. Too much repetition and although very descriptive of environment etc not enough action to keep me totally engrossed. Read this for book club. I gave it 6/10."}, {"review_sentiment": 3.0, "review_text": "Interesting subject, and sensitively written. The main female character was a bit weak in my opinion. Great description of the setting and the characters of out back Australia from mid 20th century."}, {"review_sentiment": 5.0, "review_text": "Beautifully written with such descriptiveness one can almost smell the gum leaves and the land. This author really can pull one into the story with him. His characters are so believable , what a talent."}, {"review_sentiment": 3.0, "review_text": "Does no-one else think that Alex Miller has borrowed Cormac McCarthy's distinctive voice too heavily? I thought the passages where he didn't do this were much more beautiful and not so self-conscious. There was way too much repetition in the book.  Arner remained one dimensional and I got really sick of reading the same description of him sitting in his vehicle with the thump of his music. I also got a bit annoyed at the way Annabelle seemed to strike up instant rapport with some of the characters - there seemed to be no reason for it, we are simply expected to believe it, and I wasn't convinced. Many of the landscape descriptions are wondrous, but many of them are overly long. Despite these reservations, I got swept up in the book, and loved the descriptions of the cattlemen's life and the outback, and the way Miller deals with the complexities of black-white relations, and the terrible histories behind the establishment of white farms and stations."}, {"review_sentiment": 4.0, "review_text": "Second read; this occassion on my Kindle. (Still prefer reading traditional books.) A compelling and interesting historical faction. Black man, white woman; an interesting twist. A lasting impression of country and characters."}, {"review_sentiment": 4.0, "review_text": "Winner of the 2003 Miles Franklin Award, Miller's novel, set in far North Queensland, functions as a kind of metaphor of the tenuous relationship between black and white Australians. Childhood friends Bo Renney of the Jangga tribe and Melbourne academic Annabelle Beck, recently returned to her ancestral home after a marriage bust-up, forge a new relationship based on a realistic view of their shared history. Once having stared into the face of the violence between their two families in the past they are able to set their sites on a possible shared future. The narrative drags a little in the middle section but the latter half of the book is particularly moving as both of the protagonists make discoveries about their past that force them to rearrange their present. I was attracted to the cover because I have always felt a kind of connection of some sort to monoliths. My friend Gerard tells me it's part of my dreaming. Maybe so."}, {"review_sentiment": 5.0, "review_text": "Alex Miller's latest novel begins like a conventional, large-format American romance. Forty-year-old Annabelle Kuen is abandoned by her academic husband when he falls for a big-breasted student. She flees their comfortable Melbourne existence for North Queensland where her family once owned a vast station. Not wanting to return to her cheatin' dog husband, Annabelle agrees to help an old friend conduct surveys for \"significant remains\" (evidence of past habitation) on sites proposed for mining or other developments. Of course, it isn't long before she meets up with Bo Rennie, an Aboriginal ringer from her childhood, who fondly remembers frolicking nudely with her in the waterhole when they were kids, and seems slyly confident that her return has something to do with their shared fate. The stage is set for a middle-aged \"recovery romance\" which might easily have found its way onto Oprah's dire Book Club list, and the real Bo and Annabelle (mentioned in Miller's dedication) onto her equally dire show.Thankfully, Miller isn't interested in telling that kind of story, but he does cheekily borrow its premise - no doubt roping in readers who wouldn't ordinarily pick up one of his books - to tell a story which is far more significant and compelling. Indeed, this is one of the better Australian novels of recent years, not only for its effortless style and engaging plot, but for the theme at its core: the vexed issue of black/white relations and their competing claims to large tracts of Australian land. The thing that distinguishes Miller's novel from most hand-wringing attempts at \"reconciliation literature\" is its recognition of the historical and contemporary picture in its entirety. Here, there are good whites and bad whites, good blacks and bad blacks. There is selfishness and compassion, spirituality and materialism, on both sides; just as there is the desire to reconcile, the desire to exploit, and the desire to fight the war for a thousand years more. Miller explodes the simple black/white dualism, risks the charge of racism, resists the temptation to be \"politically correct\" - and thereby creates characters that are recognisably human. The ruins of white settlement, he suggests at one point, are arguably just as significant as the ruins of black. This is a backhanded slap in the face to white Australians, and a well-deserved one. We tend to think only of the Aboriginal people as being \"dispossessed\" and we rarely think of our own culture as having ruins. But when Miller presents us with Ranna Station, destroyed in less than five generations, and compares it to the Aboriginal culture which has endured in the same place for thousands of years, white culture is the one that starts looking flimsy. At Ranna, whites are the vanished race - and may one day be so across the entire land.Ultimately, though, Miller goes beyond the issue of claiming the land, and invites us to consider the land as something in itself. What I took away from this novel is that the land does not care which particular culture infuses it with its equally contingent, equally spurious meanings. Is this piece of land a spiritual playground, a farm, a mine, or the site for a dam? None of the above, actually - for all are cultural impositions. The land will endure, though we may not - black or white. Nevertheless, Miller recognises the significance that places have in both white and black hearts, and the need for each culture to respect that. As Miller shifts the argument away from a tussle over territory and onto the more difficult ground of how we are to live together, what started as a romance becomes a metaphor for race relations. The final image of Bo and Annabelle may well be Miller's vision of the way forward for black and white Australians. \"They lay in the silence, not speaking, holding hands and listening. For the moment it was enough to be together in this place.\""}]}, "authors": ["Alex Miller"], "isbn": "174114146X", "longitude": 144.9631608, "periods": ["2000s"], "title": "Journey to the Stone Country", "word_cloud": "fantastic insight indigenous culture interesting idea find bit boring write style engage surprise endorse apparently author always fine write great exceptthatin forever mention light ing smoking cigarette really completely overdone spoil tell good story very slow keep wait something much repetition descriptive environment enough action totally engrossed club give interest subject sensitively write main female character bit weak opinion description set character back mid century beautifully write descriptiveness almost smell gum leave land author really story character believable talent do else borrow distinctive voice heavily think passage much way much repetition remain dimensional get really sick reading description sit vehicle thump music also get bit annoyed way seem strike instant rapport character seem reason simply expect believe convince many landscape description wondrous many overly long reservation get swept love description cattleman life outback way deal complexity relation terrible history establishment white farm station second occasion still prefer read traditional compelling interesting historical faction man white woman interest twist lasting impression character set far north function kind metaphor tenuous relationship black white friend tribe academic recently return ancestral home marriage forge new relationship base realistic view share history once star face violence family able set site possible share future narrative drag little middle section latter half particularly move protagonist make discovery force rearrange present attract cover always felt kind connection sort monolith friend tell part dream maybe latest begin conventional american romance abandon academic husband fall student flee comfortable existence family own vast station not want return cheating dog husband agree help old friend conduct survey significant remain evidence past habitation site propose mine development course long meet ringer childhood fondly remember frolic rudely waterhole kid seem slyly confident return something share fate stage set recovery romance easily way dire list real mention dedication equally dire interested tell kind story cheekily premise doubt rope reader ordinarily tell story far significant compel indeed better australian novel recent year effortless style engage plot theme core vexed issue relation compete claim large tract australian land thing distinguish attempt reconciliation literature recognition historical contemporary picture entirety here good white bad white good black bad black selfishness compassion spirituality materialism side desire reconcile desire exploit desire fight war year explode simple dualism risk charge racism resists temptation politically correct thereby create character recognizably human ruin white settlement suggest point arguably significant ruin black backhand slap face white tend think aboriginal people dispossess rarely think culture ruin present destroy le generation compare aboriginal culture endure place thousand year white culture start look flimsy white vanish race day entire go issue claim land invite land something take away land care particular culture infuse equally contingent equally spurious meaning be piece land spiritual playground farm mine site dam actually cultural imposition land endure black white recognize significance place white black heart need culture respect shift argument away tussle territory difficult ground live together start romance become metaphor race relation final image well vision way forward black white lay silence speak hold hand listen moment enough together place", "genres": ["Fiction & Literature", "Travel Writing"], "summary": "WINNER OF THE MILES FRANKLIN LITERARY AWARD A terrific tale of love and redemption that captivates from the first line.' Nicholas Shakespeare, author of The Dancer Upstairs Betrayed by her husband, Annabelle Beck retreats from Melbourne to her old family home in tropical North Queensland where she meets Bo Rennie, one of the Jangga tribe. Intrigued by Bo's claim that he holds the key to her future, Annabelle sets out with him on a path of recovery that leads back to her childhood and into the Jangga's ancient heartland, where their grandparents' lives begin to yield secrets that will challenge the possibility of their happiness together. \r\n\r\nWith the consummate artistry of a novelist working at the height of his powers, Miller convinces us that the stone country is not only a remote and exotic location in North Queensland, but is also an unvisited place within each of us. Journey to the Stone Country confirms Miller's reputation as one of Australia's most intelligent and uncompromising writers. Miller's fiction has a mystifying power that is always far more than the sum of its parts ...his footsteps - softly, deftly, steadily - take you places you may not have been, and their sound resonates for a long time. ' Andrea Stretton, Sydney Morning Herald row, or even survive, with the terrible knowledge that comes into their possession at the end of their journey?", "asin": "174114146X", "rank": "3385946", "city": "Melbourne", "image": "https://images-na.ssl-images-amazon.com/images/I/51LeawWdO0L.jpg", "country": "Australia", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}