{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 12, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Awesome info!"}, {"review_sentiment": 4.0, "review_text": "Informative"}, {"review_sentiment": 4.0, "review_text": "Mostly useful. Some holes but easy to guess the inserts."}, {"review_sentiment": 5.0, "review_text": "Great Book, really helped me make the best of my time in France, Well researched and well written. The Author knew how to filter out irrelevant items and help me structure my trip in the best way.Thanks to this book I found quaint cafes and off local restaurants I would not have found otherwise"}, {"review_sentiment": 5.0, "review_text": "Used it daily while in south of france. Great reccomendations for both popular and hole in the wall locations. easy to read, good maps too"}, {"review_sentiment": 2.0, "review_text": "THis books was too general and didn't give enough helpful or accurate information about the locations I visited all over Provence. Opening and closing times were wrong, entrance fees were wrong, information about how to get to various restaurants or hotels or sites was too general and not very helpful. Descriptions were too brief and there was no historical or background info, interesting cultural tips etc to enhance my experience. Pretty disappointing."}, {"review_sentiment": 4.0, "review_text": "I have not travelled yet so I can not comment on the accuracy of the ratings in the book. However, the book appears to offer a good compilation of the key attractions, places to stay, eat and enjoy. I like the small size of the book. I would like to see more color photos throughout the book."}, {"review_sentiment": 5.0, "review_text": "This book was a great resource for our recent trip. The information was accurate and up-to-date, and it was so nice to avoid lugging around a book about all of France when we were only visiting one region."}, {"review_sentiment": 5.0, "review_text": "Excellent suggestion on activities, good maps and detailed Information. One of the better books about the region. I he seen many but this one is by far the best"}, {"review_sentiment": 4.0, "review_text": "Well laid out guide with lots of good tips and recommendations. Excellent for planning to get to know an area as it is divided into smaller regions. But double check opening hours at museums - some are out of date"}]}, "authors": ["Lonely Planet", "Alexis Averbuck", "Oliver Berry", "Nicola Williams"], "isbn": "1743215665", "longitude": 0.0, "periods": null, "title": "Lonely Planet Provence & the Cote d'Azur", "word_cloud": "info informative mostly useful hole easy guess insert really help best time research well write know filter irrelevant item help structure trip best find quaint cafe local restaurant otherwise use daily south france recommendation popular hole wall location easy good map general enough helpful accurate information location visit closing time wrong entrance fee wrong information get various restaurant hotel sit general helpful brief historical background info interesting cultural tip enhance experience disappointing travel yet comment accuracy rating however appear offer good compilation key attraction place stay eat enjoy small size color photo great resource recent trip information accurate nice avoid lug visit region excellent suggestion activity good map detail better region see many far best well lay guide lot good tip recommendation plan get know area divide smaller region double check opening hour museum date", "genres": ["Guide Books"], "summary": "Lonely Planet Provence &amp; the Cote d'Azur is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Try local cheese and wine in hilltop villages overlooking lavender fields, relax on the beaches of St-Tropez, or try your luck in Monaco's famous casino; all with your trusted travel companion. Get to the heart of Provence and the Cote d'Azur and begin your journey now!\r\n\r\nInside Lonely Planet Provence &amp; the Cote d'Azur:\r\n\r\n- Colour maps and images throughout\r\n- Highlights and itineraries help you tailor your trip to your personal needs and interests\r\n- Insider tips to save time and money and get around like a local, avoiding crowds and trouble spots\r\n- Essential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices\r\n- Honest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss\r\nCultural insights give you a richer, more rewarding travel experience - including history, art, cinema, architecture, literature, politics, landscapes, cuisine, wine, and more\r\n- Over 32 local maps\r\n- Covers Marseille, Aix-en-Provence, the Camargue, Arles, Nice, Monaco, Menton, Cannes, St-Tropez, Toulon, Avignon, Hill Towns of the Luberon, Haute-Provence, Southern Alps, and more\r\n- The Perfect Choice: Lonely Planet Provence &amp; the Cote d'Azur, our most comprehensive guide to Provence and the Cote d'Azur, is perfect for both exploring top sights and taking roads less travelled.", "asin": "1743215665", "rank": "80798", "city": "Provence", "image": "https://images-na.ssl-images-amazon.com/images/I/61UbJ-pVnTL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}