{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 31.75, "ratings": {"num_ratings": 70, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "This is by far one of the best (and most accurate) illustrated narratives of life in Israel and Palestine I have read. Created by a Canadian man who lived here for a year with his wife and kids, the graphic novel dives into many topics from hilariously relatable, daily confusions, strange religious idiosyncrasies and of course, the Palestinian humanitarian rights conflict. Anyone who wants a 'peek' of what life is like as a non-native to the country should read this book."}, {"review_sentiment": 5.0, "review_text": "I've been buying all the Guy Delisle travel memoirs. They're interesting and relaxing. His experiences feel lived-in."}, {"review_sentiment": 4.0, "review_text": "(Actually, given the experience of the reporter/author/artist, let's simply surmise he's posing, for useful.literary effect, as The Naif Abroad.)Having spent a few weeks in Israel, Gaza, the Golan, and the West Bank a decade before Delisle's year-long sojourn, and having a reasonably solid familiarity with territorial issues in Arab-Israeli relations, I came away from this fascinating book with the deep impression that the Wall, erected during the 2nd Intifada (2000-2003) along the Green Line separating Israel proper from the West bank, changed not only sight lines, transportation routes, and routine mutual access but virtually everything else. Delisle is, or feigns to be, for the purpose of dramatic arc, a newly arrived naif on most things Arab and/or Jewish Israeli or on Israel in general. Even so, he naturally turns out to be a valuable  commentator on \"An Expat's Guide to Aspects of Israel.\" Of course he can't, and does not attempt to, comment on everything a traveler might need to know - if only because each visitor is different and/or has differently prepared - but he provides useful little vignette's, sometimes of just six panels (one page) of the kinds of routine  inconveniences, eccentricities, surprises, and cultural dissonances that might been encountered by the average visitor. He does this with a keen satirical eye and, occasionally, a journalist's diligence in pursuit of an answer to a nagging question.I found Delisle's repeated visits to Hebron, with its tiny Jewish enclave (c. 500 residents, who as a group are customarily labeled \"extremist\" by both liberal Israeli and Western commentators) embedded in a city of some 120,000, of particular interest. Comparing Delisle's depictions to my own experience, the ten years since I visited Hebron - and a large number of jarring events - have made a tense situation significantly more tense, have prolonged the closing of the Hebron souk and the decline of the local economy, and facilitated the aggressive misbehavior of the Jewish settlers.Delisle's drawings of Hebron streets and buildings resonate strongly in memory. In general, his illustrations of human subjects are, by the author's stylized choice, of Dilbert-like simplicity, in contrast to his depictions of architecture and landscape. These reveal a discerning eye and stunning draftsman's hand, striking a nice balance between detail and suggestion. His panels, with very few exceptions, are of uniform 6-panels-per-page size throughout the 300+ page book, and so the landscape and architectural drawings are miniatures. For anyone who's visited Israel, the walled Old City, the Temple Mount (aka the Haram esh-Sharif), Hebron, or anywhere else Delisle drops in on, the illustrations will surely evoke vivid memories, sometimes of a simple staircase ascending up a narrow opening in the Armenian Quarter of old Jerusalem, or of a vista from the Mount of Olives, or of a tomb of a legendary Biblical figure.Delisle, like Joe Sacco and many others who spend time in Israel and then write their \"I found Israel...\" memoir/report, takes hits for an essentially pro-Palestinian bias. Frankly, it's difficult for anyone of Western-Liberal disposition to come to Israel and, especially when lacking logstanding existential skin in the game, not to instinctively side with the underdog Palestinians. This is generally so for myriad complicated reasons that override the cognitively dissonant ones, which include, most prominently, historical acts of Palenstinian terrorism that cause  needless deaths and maimings of innocents. (And this, to most objective eyes, is offset by routine Israeli overreactions to provocation, as  depicted, for example, by Delisle in his segment on Israel's Gaza intervention.) Delisle lays out many of the humiliations, expropriations, bulldozings, doors-kicked-in-in-the-night, etc. Palestinians are subjected to routinely, by the force of Israeli law and the long arms of Israeli security forces. He does so more gently, and less graphically, than, say, Sacco, but  similarly without much in the way of providing an Israeli counterpoint.(And having said that, I feel I should add that I've long believed the story of the return of Jews to the Levant after the long Jewish diaspora is one of the greatest, most moving stories in the history of man. Yes, mistakes were made, and there's no circling the square of history. Or vice versa. No, I'm not Jewish, but if asked, I self-identify as a secular Zionist - if you will, more or less a Yesh Atid Zionist - who believes the land must be shared.)For what it's worth, Delisle's impressionistic account of his year in Israel corroborates my own sense of the tense state of Arab-Jewish relations in Israel (it's hard to continue to misuse the phrase \"Arab-Israeli\" when some 20 percent of Israelis are Arabs) and my own concern, unstated in Delisle, that politics and political demagoguery on all sides of the issue, both domestic and foreign, are the steepest barriers to comity and a negotiated solution. Books like this are better at raising issues, both implicitly and explicitly, than offering, or even hinting at, solutions (beyond the general \"they've got on well before...\"), which, to be fair, don't fit in very well with the nature of the simple narrative chronicle.Which we should be happy to have"}, {"review_sentiment": 3.0, "review_text": "Plainly a passerby account of this complex and complicated city/region/conflict presented in a know it all manner that is not particularly \"balanced\", objective or illuminating. This said, I enjoy Delisle's drawing style and that provided an excuse to make it through the book. Similar to his take on North Korea, seems like another missed opportunity to offer something more profound and insightful...rather than superficial treatment."}, {"review_sentiment": 5.0, "review_text": "Guy Delisle spent a year in East Jerusalem and found it nerve wracking and infuriating.Because he lived in the Muslim quarter, buses that serve Jewish communities will not go there and routes aren’t connected. Road blocks and check points add to the difficulty of getting around. Water, garbage collection and electrical services are not reliable; They are fine in other areas despite the equal taxes paid by all residents.Delise notes the unusual religious customs. For the Jews it is a sin to throw out bread, so you see it in plastic bags on dumpsters; on the Sabbath (announced by a horn blowing), elevators stop at every floor, so that (work) buttons need not be pushed; Muslim students with arts degrees are not allowed to make images of people. Samaritans, who claim to have the oldest Torah, hang fruit and vegetables from the ceiling for Sukkot.There are short pieces of the many sects of Judaism such as those who believe Jesus is the Messiah and the Samaritans who are not accepted as Jewish by the ultra- orthodox despite being a Jewish sect that never left the area hold Palestinian and Jordanian passports.The author describes his harassment upon two entries into Israel with questions such as “Why does your wife work in Gaza” and “Did you speak to any Palestinians in Norway” and long detentions. Internal interrogations are frequent. Cities, settlements, and sections have blockades. Interrogations can be long and create lines are so long that many cannot cross to other areas of their own country. When Delisle tries to sketch a wall he is told to move.The Delisle baby sitter’s family has notice that the house they have owned for a generation (or more) will be bulldozed for a settlement. They have all the paperwork, but if they hire a lawyer and lose, they will have to pay for the demolition of their house. Delisle meets another family living this nightmare and loses their home.Through all this, Delisle has a somewhat normal life. In Israel, he can blend in like a resident. He gets the kids to school, sketches for his books goes to cafes and meets interesting people. He has workshops in different areas of Israel and students have varied reactions to his very western-style material (why did he do this?). His wife does not have a normal life, working for with Doctors without Borders she has to live with the border crossings (ironic) and serve a clientele suffering the from poverty, violence and the stress of their precarious existence.The tone of the book is detached, sometimes he’s like an “as shucks” observer surprised at an all male wedding party without beer, or at Muslims with art degrees who will not make a rendering of a person. As he watches religious strife/harassment, from stone throwing to bombing and shelling, he affirms his atheism.Overall you get the feel for living in Israel . The plight of the Palestinians is clear. (less)"}, {"review_sentiment": 5.0, "review_text": "Perfect description of living in Jerusalem as an expat."}, {"review_sentiment": 5.0, "review_text": "Book is a superb accounting of one man's year-in-the-life.  The artwork is terrific, the observations interesting throughout.  Delisle isn't a historian or a political scientist.  The book in review isn't intended -- nor should it be read -- as a thorough treatment of the Israeli/Palestinian conflict.  It represents the perspective of someone who viewed elements of that conflict -- over a one-year period -- from a particular geographic and professional vantage point.  It's a memoir, not a work of social science.  As such, I found it very compelling."}, {"review_sentiment": 1.0, "review_text": "Clearly one step before \"Jews making Matzos from children's blood. \"One sided, biased, full of \"facts\" and fictional ideas on the complex situation in Israel and in particular Jerusalem."}, {"review_sentiment": 5.0, "review_text": "Guy DeLisle is the best.  I love his travel books and have learned a lot about far away places because of this excellent work."}, {"review_sentiment": 5.0, "review_text": "Succinct overview of the city and the people who live there."}]}, "authors": ["Guy Delisle"], "isbn": "1770461760", "longitude": 35.0, "periods": ["2000s", "Recent Releases"], "title": "Jerusalem: Chronicles from the Holy City", "word_cloud": "far best accurate illustrate narrative life create canadian man live year wife kid graphic dive many topic hilariously repeatable daily confusion strange religious idiosyncrasy course palestinian humanitarian right conflict anyone want life country buy travel memoir interest relax experience actually give experience let simply pose effect spent week decade sojourn reasonably solid familiarity territorial issue relation come away fascinating deep impression erect separate bank change sight line transportation route routine mutual access virtually everything else feigns purpose dramatic arc newly arrive naif thing arab jewish general naturally turn valuable commentator course comment everything traveler know visitor different differently prepared provide useful little vignette sometimes panel page kinds routine inconvenience eccentricity surprise cultural dissonance encounter average visitor keen satirical eye occasionally journalist diligence pursuit answer nag find repeat visit tiny enclave resident group customarily label extremist liberal commentator embed particular interest compare depiction experience year visit large number jar event make tense situation significantly tense prolonged closing souk decline local economy facilitate aggressive misbehavior jewish drawing street building resonate strongly memory general illustration human subject author stylize choice simplicity contrast depiction architecture reveal discerning eye stun draftsman hand strike nice balance detail suggestion panel exception uniform size page landscape architectural drawing miniature anyone visit wall aka anywhere else drop illustration surely evoke vivid memory sometimes simple staircase ascend narrow open armenian old vista tomb legendary many others spend time write find take hit essentially bias difficult anyone disposition especially lack longstanding existential skin game instinctively side underdog generally myriad complicate reason cognitively dissonant one include prominently historical act palestinian terrorism cause needle death maiming innocent objective eye offset routine overreaction provocation depict example segment intervention lay many humiliation expropriation bulldozing etc subject routinely force israeli law long arm security force gently le graphically similarly much way provide counterpoint say feel add long believe story return long jewish diaspora greatest move story history man mistake make circle square history vice jewish ask secular le believe land worth impressionistic account year corroborate sense tense state relation hard continue misuse phrase percent concern unstated politics political demagoguery side issue domestic foreign steepest barrier comity negotiate solution better raise issue implicitly explicitly offer even hint solution general get well fair fit well nature simple narrative happy plainly passerby account complex complicate present know manner particularly balance objective illuminating say enjoy del isle draw style provide excuse similar seem miss opportunity offer something profound insightful rather superficial treatment spend year find nerve wrack live quarter bus serve jewish community go route connect block check point difficulty get around garbage collection electrical service reliable fine area equal tax pay note unusual religious custom sin throw bread see plastic bag dumpster announce horn blowing elevator stop floor work button need push student arts degree allow make image people claim oldest hang fruit vegetable ceiling short piece many sect believe accept jewish jewish sect never leave area hold palestinian author describe harassment entry question wife work long detention interrogation frequent settlement section blockade interrogation long create line long many cross area country try sketch wall tell baby sitter family notice house own generation bulldoze settlement paperwork hire lawyer lose pay demolition house meet family live nightmare loses somewhat normal life blend resident get kid school sketch go cafe meet interest people workshops different area student vary reaction wife normal life work doctor live border crossing ironic serve clientele suffer poverty violence stress precarious tone detach sometimes like shuck observer surprise male wed party beer art degree make render person watch religious stone throw bomb shell affirms get live plight clear le description live expat superb account man artwork terrific observation interest historian political scientist review intend thorough treatment conflict represent perspective someone view element conflict period particular geographic professional vantage point memoir work social science find compel clearly step make child blood side bias full fact fictional idea complex situation particular best love travel learn lot far away place excellent work people live", "genres": ["Comics & Graphic Novels", "Travel Writing"], "summary": "\"Jerusalem\" is a small miracle: concise, even-handed, highly particular.\" The Guardian\r\n\r\n\"Jerusalem: Chronicles from the Holy City\" is the acclaimed graphic memoirist Guy Delisle's strongest work yet, a thoughtful and moving travelogue about life in contemporary Jerusalem. Delisle expertly lays the groundwork for a cultural road map of the Holy City, utilizing the classic \"stranger in a strange land\" point of view that made his other books required reading for understanding what daily life is like in cities few are able to travel to. \"Jerusalem\" explores the complexities of a city that represents so much to so many. It eloquently examines the impact of conflict on the lives of people on both sides of the wall while drolly recounting the quotidian: checkpoints, traffic jams, and holidays.\r\n\r\nWhen observing the Christian, Jewish, and Muslim populations that call Jerusalem home, Delisle's drawn line is both sensitive and fair, assuming nothing and drawing everything. A sixteen-page appendix to the paperback edition lets the reader behind the curtain, revealing intimate process sketches from Delisle's time in Jerusalem.\r\n\r\n\"Jerusalem\" is a masterfully hewn travelogue.\r\n\r\n“The cultural and physical barriers among the Jewish, Muslim and Christian communities become the source of dark but gentle comedy: absurdity teetering on the edge of tragedy.” The New York Times", "asin": "1770461760", "rank": "89738", "city": "Jerusalem", "image": "https://images-na.ssl-images-amazon.com/images/I/514QJ2HSwUL.jpg", "country": "Israel", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}