{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 57, "rating": 3.9, "reviews": [{"review_sentiment": 1.0, "review_text": "This book told me almost nothing about prostitution or being a john, and everything about the author's attitude toward women's bodies and toward sex.Several times, with several women, Brown self-reports that he noticed obvious signs of discomfort during sex.  He does nothing to alleviate that discomfort except \"finish up quickly\", unless he is explicitly asked by some of the more confident women.  Brown, as shown in the book, clearly views the transaction as buying access to a woman's body, and does not feel he has any responsibility to make paid-for sex a mutually pleasant activity.  This is creepy and gross.Even creepier and grosser is his behavior with a woman, Angelina, who is visibly uncomfortable being chosen, and does not respond at all physically to sex.  Brown returns for a second session, finds that she is still unresponsive and does not speak English.  Later, he goes looking for her again, but can't find her.  This is a huge failure of empathy, as detailed above, but it also raises huge red flags about sex trafficking.At the end of the book, after the comic, Brown offers an extremely weak defense of his pursuit of Angelina:  He is pretty sure she was not a sex slave, because it's not very likely, and if he, Brown, were running a sex slave brothel, he would do it differently. It totally didn't seem like a sex slave brothel!  Creepy and gross.This book is skeevy garbage, and I have no respect for the author as a cartoonist or a fellow human."}, {"review_sentiment": 4.0, "review_text": "Pretty interesting book.  It gives some good insight into prostitution in Canada.  A little more philosophy than I would like.  It's worth the read."}, {"review_sentiment": 5.0, "review_text": "pleasantly surprised by this book. it was really good and kinda fascinating."}, {"review_sentiment": 5.0, "review_text": "I love this book and have made a few of my friends read it. It feel very genuine and autobiographical. It is just the story of someone's experience with prostitution. I changed the way I feel about sex work."}, {"review_sentiment": 3.0, "review_text": "This book shows how awful it is for a man to be lonely with no options for female companionship."}, {"review_sentiment": 1.0, "review_text": "The \"intimate self-portrayal\" genre of comics is always interesting...well, usually interesting.  This was an exception.  Brown desperately needed more editing here.  The stories become repetitive and he fails to understand that him having sex with people just isn't that interesting to anyone else.I think that was supposed to be a huge part of the book - \"OMG, a john talks!\" - and maybe that would have been a big deal in the 1950s.  But is there any aspect of human sexuality that does not have dozens of first-person stories by now?  Prostitution on both sides isn't exactly a new topic.His polemics are not really suited for the comic book genre - panels that are 75% word balloons.  And then suddenly the story stops with several additional pages of pure text defending his relationship with his current prostitute and trying to make it sound like she's really a girlfriend, even though he pays her to have sex with him.The initial few chapters are interesting as he breaks up with his girlfriend, though it's one of those \"everyone in the universe reading this knows you should leave her and you refuse to admit it\" situations, and it quickly becomes \"dude, just move on already\".  Then there's the other 90% of the book where he traipses from sexual encounter to sexual encounter, interspersing his passionate defense of paying for sex.It's just not that good a read.  Just because you're willing to talk about a taboo subject or are willing to open up and reveal your internal journal does not mean that it's good comics."}, {"review_sentiment": 5.0, "review_text": "Paying for It by Chester Brown is an autobiographical graphic novel that relates Mr. Brown's sex life from 1996 to 2010, which consists of his using professional female escorts for his heterosexual encounters. He mentions using masturbation to cool his ardor prior to these encounters, but provides no further details. To protect the women he changes their names and doesn't provide locations or identifying features. For those of us not familiar with sex workers or their customers, this is a chance to get a glimpse into the workings of this trade.Brown is dispassionate but clearly happy with his decision to outsource his sexual needs, feeling that sex and girlfriends do not go together well for him. The text alternates visits to various escorts with discussions with his male friends and ex-girlfriends about the advantages of his chosen sexual lifestyle. He is well-read on the politics of sex workers and takes a Libertarian position condemning the present laws restricting or outlawing sex work.The body of the book is preceded by an Introduction by Robert Crumb who calls it Mr. Brown's best work. At the end of the book there are 50 pages of Appendices and Notes that go into much deeper detail than the narrative of the book permitted. I would say that he makes as good an argument for unregulated prostitution as you will find in the popular literature."}, {"review_sentiment": 5.0, "review_text": "Great book by a great artist."}, {"review_sentiment": 4.0, "review_text": "The subject of prostitution is so charged with gender-conflict that I was amazed to read a book that approaches the subject with cool compassion rather than -- take your pick -- moral outrage, salacious interest, pity, bitter hatred of women/men, cold calculation and all the rest of it.It is strangely melancholy; it seems searingly honest; it is unsparing in its presentation of the \"john\", the author himself; it offers many insights into the mundane realities of the trade. I found it illuminating and provocative."}, {"review_sentiment": 1.0, "review_text": "DON'T WASTE YOUR $ & TIME WITH THIS CRAP! This is the most STUPID book I ever read in my life!"}]}, "authors": ["Chester Brown"], "isbn": "1770461191", "longitude": -79.387207, "periods": ["2000s", "Recent Releases"], "title": "Paying for It", "word_cloud": "tell almost nothing prostitution john everything author attitude woman body time several woman notice obvious sign discomfort sex nothing alleviate discomfort finish quickly explicitly ask confident woman show clearly view transaction buy access woman body feel responsibility make sex mutually pleasant activity creepy creepier grosser behavior woman visibly uncomfortable choose respond physically sex return second session find still unresponsive speak go look huge failure empathy detail also raise huge red flag sex end comic offer extremely weak defense pursuit pretty sure sex slave likely run sex slave brothel totally seem sex slave brothel skeet garbage respect author cartoonist fellow human pretty interest give good insight prostitution little philosophy worth pleasantly surprise really good kinda fascinating love make friend feel genuine autobiographical story someone experience prostitution change way feel sex work show awful man lonely option female companionship intimate genre comic always interest well usually interest exception desperately need edit story become repetitive fails understand sex people interest anyone think suppose huge part john talk maybe big deal aspect human sexuality dozen story side exactly new polemic really suit comic genre panel word balloon suddenly story stop several additional page pure text defending relationship current prostitute try make sound really even pay sex initial chapter interest break girlfriend everyone universe reading know leave refuse admit situation quickly become dude move already then traipse sexual encounter sexual encounter intersperse passionate defense good willing talk taboo subject willing open reveal internal journal mean good comic autobiographical graphic relates sex life consist use professional female escort heterosexual encounter mention use masturbation cool ardor prior encounter provide detail woman change name provide location identify feature familiar sex worker customer chance get glimpse working dispassionate clearly happy decision outsource sexual need feel sex girlfriend go together well text alternate visit various escort discussion male friend advantage choose sexual lifestyle politics sex worker take libertarian position condemn present law restrict outlaw sex body precede call best work end page go much deeper detail narrative permit make good argument unregulated prostitution popular literature great artist subject prostitution charge amaze approach subject cool compassion rather pick moral outrage salacious interest pity bitter hatred cold calculation rest strangely melancholy seem searingly honest unsparing presentation john author offer many insight mundane reality trade find illuminate provocative ever life", "genres": ["Memoir", "Comics & Graphic Novels"], "summary": "The critically lauded memoir about being a john, available in paperback for the first time!\r\n\r\nPaying for It was easily the most talked-about and controversial graphic novel of 2011, a critical success so innovative and complex that it received two rave reviews in The New York Times and sold out of its first print run in just six months. Chester Brown's eloquent, spare artwork stands out in this paperback edition.\r\n\r\nPaying for It combines the personal and sexual aspects of Brown's autobiographical work (I Never Liked You, The Playboy) with the polemical drive of Louis Riel. He calmly lays out the facts of how he became not only a willing participant in but also a vocal proponent of one of the world's most hot-button topics―prostitution. While this may appear overly sensational and just plain implausible to some, Brown's story stands for itself. Paying for It offers an entirely contemporary exploration of sex work―from the timid john who rides his bike to his escorts, wonders how to tip so as not to offend, and reads Dan Savage for advice, to the modern-day transactions complete with online reviews, seemingly willing participants, and clean apartments devoid of clichéd street corners, drugs, or pimps.\r\n\r\nComplete with a surprise ending, Paying for It continues to provide endless debate and conversation about sex work.", "asin": "1770461191", "rank": "337804", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51QmY80AaeL.jpg", "country": "Canada", "story_arc": ["Tragedy", "Things only get worse"]}