{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 49.262428, "ratings": {"num_ratings": 10, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "A fascinating picture of the battle for dominance of the Northwest and Hawaiian Islands during the late 18th century. England had lost the colonies but was still active in exploring and settling the areas from southern Oregon to Vancouver and the trade routes to the Orient.  Spain was in decline and the US was adventurous but inexperienced at colonizing.George Vancouver had at the age of thirteen accompanied Captain James Cook on his epic voyage to the south seas.  Now he was the commanding officer of a ship charged with exploring and charting the west coast of the U.S.  This history recounts the grueling life at sea from long passages between ports with rotting food, to scurvy and other illnesses to cold wet sleeping conditions.  Bown says the life of a sailor in the those days was brutal and short. Vancouver's life itself was a tragedy.  After an unprecedented voyage, he returned home expecting to be famous, but was overshadowed by war and a rival who dedicated his life to destroying him,.A good read."}, {"review_sentiment": 5.0, "review_text": "Not so much of the lash, but plenty of betrayal and British Imperialism - you'll learn how Canada was fought for, not only from the French, but the Spanish as well."}, {"review_sentiment": 5.0, "review_text": "VANCOUVER - VINDICATED AFTER 200 YEARSAn appreciation by Phillip Taylor MBE and Elizabeth Taylor of Richmond Green ChambersLittle had been written about George Vancouver until Ernie Coleman's excellent and uncomplicated biography in 2000, and Stephen Bown's new, detailed and scholarly work in 2008.Bown's work is a re-evaluation of Vancouver's life and work - it's excellent in every respect. And it fills an important gap in 18th century naval history and surveying in North West America.We live where Vancouver spent his last days in Petersham, Richmond, Surrey. We celebrate his life annually at a service in the churchyard where he is buried at St Peter's Church, Petersham. We have also visited beautiful Vancouver and the island, and travelled part of the North West coast of Northern America – I am married to a Vancouverite. Therefore, we have a special interest and regard for this man and the area he explored!Let's get a few things straight about Vancouver!He was an experienced sailor, having served on the last voyage of Captain Cook as a midshipman. However, Vancouver was not an experienced diplomat, but his record as Master and Captain of HMS Discovery from 1792-5 was very good for the times. Only one person died during the voyages and we can see from Bown's work that Vancouver cared for his men although he had an inexperienced crew and some malevolent officers including Sir Joseph Banks, the aristocrat Thomas Pitt, and the ship's surgeon.You can't do much against this sort of list!Vancouver's reputation was shattered and he died alone with little money on the completion of his surveys and diaries at the age of 40. Our services in Petersham over the 25 years we have attended are often sad occasions for me as I reflect on his life during the commemorations.Bown's book is one of the best we have read for ages about this unpleasant period of British naval history when Captain Vancouver's name and contribution were smeared ... and he vindicates him.It is a well researched and referenced book with many recorded stories which give light onto the problems of the times. And one gets the feeling of the period with this book brilliantly. It has 13 chapters in four parts plus great photographs which delve into great detail with a splendid list of sources and a bibliography at the back.Bown paints Pitt, in particular, as the baddie (rightly) with few redeeming features, and he exposes the aristocratic establishment of the time hard for their unjust behaviour towards Vancouver.We would probably not liked to have served under Vancouver as we can see some of the leadership problems he had to deal with - challenging behaviour from senior officers is difficult at the best of times, and we have had my fair share of them in the past.However, we have a tremendous regard for George Vancouver which remains strengthened by Bown's biography, ending with this tribute:\"He accomplished great things and, as our historical and cultural ancestor, he deserves a greater place in our collective memory.\"He just got it here from Stephen Bown! So thank you very much Mr Bown from admirers where Vancouver now rests."}, {"review_sentiment": 5.0, "review_text": "VANCOUVER - VINDICATED AFTER 200 YEARSAn appreciation by Phillip Taylor MBE and Elizabeth Taylor of Richmond Green ChambersLittle had been written about George Vancouver until Ernie Coleman's excellent and uncomplicated biography in 2000, and Stephen Bown's new, detailed and scholarly work in 2008.Bown's work is a re-evaluation of Vancouver's life and work - it's excellent in every respect. And it fills an important gap in 18th century naval history and surveying in North West America.We live where Vancouver spent his last days in Petersham, Richmond, Surrey. We celebrate his life annually at a service in the churchyard where he is buried at St Peter's Church, Petersham. We have also visited beautiful Vancouver and the island, and travelled part of the North West coast of Northern America – I am married to a Vancouverite. Therefore, we have a special interest and regard for this man and the area he explored!Let's get a few things straight about Vancouver!He was an experienced sailor, having served on the last voyage of Captain Cook as a midshipman. However, Vancouver was not an experienced diplomat, but his record as Master and Captain of HMS Discovery from 1792-5 was very good for the times. Only one person died during the voyages and we can see from Bown's work that Vancouver cared for his men although he had an inexperienced crew and some malevolent officers including Sir Joseph Banks, the aristocrat Thomas Pitt, and the ship's surgeon.You can't do much against this sort of list!Vancouver's reputation was shattered and he died alone with little money on the completion of his surveys and diaries at the age of 40. Our services in Petersham over the 25 years we have attended are often sad occasions for me as I reflect on his life during the commemorations.Bown's book is one of the best we have read for ages about this unpleasant period of British naval history when Captain Vancouver's name and contribution were smeared ... and he vindicates him.It is a well researched and referenced book with many recorded stories which give light onto the problems of the times. And one gets the feeling of the period with this book brilliantly. It has 13 chapters in four parts plus great photographs which delve into great detail with a splendid list of sources and a bibliography at the back.Bown paints Pitt, in particular, as the baddie (rightly) with few redeeming features, and he exposes the aristocratic establishment of the time hard for their unjust behaviour towards Vancouver.We would probably not liked to have served under Vancouver as we can see some of the leadership problems he had to deal with - challenging behaviour from senior officers is difficult at the best of times, and we have had my fair share of them in the past.However, we have a tremendous regard for George Vancouver which remains strengthened by Bown's biography, ending with this tribute:\"He accomplished great things and, as our historical and cultural ancestor, he deserves a greater place in our collective memory.\"He just got it here from Stephen Bown! So thank you very much Mr Bown from admirers where Vancouver now rests."}, {"review_sentiment": 4.0, "review_text": "This is a refreshing account of a man who history has forgotten notwithstanding all the names given by him and other people encountered in the book to places on the Pacific Northwest Coast. The work also gives one a glimpse into life in the Royal Navy at the time of the American Revolution, the mutiny on the Bounty, and the commencement of the Napoleonic wars.Captain Vancouver also played a role in the British relationship across the Pacific as well, according to Brown, who clearly has researched his topic well.For the historian who prefers to look at a period of time as a slice and compare what was going on this book works well. Not everything from 1770 to 1800 is covered of course, but the reader can get a sense of the forces and knowledge that lead Vancouver to make the decisions he did during his voyages.I drop a star because the title is apparently chosen to sell the book. He could leave out the three elements mentioned; Madness et. al, and I still would have purchased the book."}, {"review_sentiment": 5.0, "review_text": "I have always enjoyed accounts of exploratory expeditions such as the Lewis and Clark expedition. This book is exactly an exploratory expedition  story! Exactly what interests me. The reason that I became particularly interested in Vancouver is because I saw a small monument citing his travels. This monument is on Maui along the south shore between a major thoroughfare and the beach .Jim"}, {"review_sentiment": 5.0, "review_text": "I am somewhat baffled by the negative reviews, but upon closer inspection it becomes apparent that many people are so woefully ignorant of history that they are unable to properly assess a book such as this. I have a history degree and I am a teacher. I am not offering this information to elevate myself, but rather to explain why \"regular\" readers may be disappointed. I would suggest that one have at least a basic understanding of the subject matter before applying a negative review.I could hardly put this book down. I read until the wee hours, wide-eyed, and with one hand reaching for the popcorn. I loved it. It is well-written, painstakingly researched, and - perhaps most important - entertaining. I have long believed that people are ignorant of history because so often it is delivered by uninspired teachers who force their students to read dry text books instead of making an effort to source better materials. It is a terrible shame as it ultimately makes for a very ill-informed populace. In the hands of a bad writer, even the most fascinating of events can put you in a coma. Therefore, history should be unapologetically entertaining; it should be thrilling as well as deeply informative. This book accomplished both criteria, in my opinion."}, {"review_sentiment": 2.0, "review_text": "George Vancouver personally is of little importance - at best footnote in history.  His surveys on the North American Pacific coast were far more powerful than he was.  Maddness, Betrayal and the Lash misses by focusing on Vancouver instead of his maps.  One chapter begins with \"Maps represented control.\" The tread about the power of maps is soon lost and the reader is returned to biographical details.I didn't find the character to be overly sensational.  As a former sailor, I found the characters consistent with behavior onboard ships at sea.  Maddness, Betrayal, and the Lash does a good job of illustrating how hard a captain's job is.  It is isolating - the captain is the only one on board who can not have friends.  The captain must constantly balance good order and discipline with the risk of mutiny.  Again, the desire to make the book a biography about Vancouver prevent a full exploration of this more interesting topic."}, {"review_sentiment": 4.0, "review_text": "I am enjoying this book. First of all to regognize that in this period navigation realy made the world open. Captain Cook circumnavigated the  earth i honest manor, tending to the crew. Following the footsteps of Vancouver is interesting. I am reader with a liking to nothern tales. As such i have enjoyed the book for now."}, {"review_sentiment": 1.0, "review_text": "Madness, Betrayal and the Lash is one of silliest books I have not managed to finish in a very long time.  Hoping for a reasonably scholarly biography of George Vancouver, I found Sunday-supplement journalism, sensationalism, sloppy writing, and a smug attitude in no way justified by Mr. Bown's own attainments.  The book breaks virtually every rule of good writing.The First Rule of good writing is Thou Shalt not Distract the Reader, and its corollary, Thou Shalt Stick to the Point.  Alas, Mr. Bown peppers us with little judgments and smug asides which not only distract the reader, but cumulatively drive him to distraction.  In one of very many examples, after quoting a perfectly clear passage from Vancouver's own writing, Bown gratuitously comments on \"the stultified formal language of the era.\"  Kenneth Clark once observed that it is one of the tragedies of Western Civilization that German never developed a good working prose.  In the 18th century, English was doing just that; if Mr. Bown finds the precise use of a larger vocabulary than is common today, and the use of courtesy and some formality \"stultifying,' why then, we must give him our sympathy, but such comments are simply not  to the point.  They only serve to distract the reader,  as do references to scurvy as \"a fashionable concern of eighteenth century physicians,\" to \"trenchers of sloppy fermenting cabbage\" (sauerkraut), \"bobbing ships\" which are \"floating north\" (apparently like rafts... ), and so on ad infinitum.A Rule of History Writing declares that Thou Shalt Not Make up Little Fictions - even to entertain the reader.  Mr. Bown however, feels that we must be constantly enlivened by bright little insertions such as this gem: \"... Balboa, who in 1513, after crossing the Isthmus of Panama, boldly strode into the surf, allowed his wandering gaze to search the horizon south and north, and promptly claimed it all for Spain.\"  This may set some quantity of barren readers on to smirk, but the judicious reader will wonder how Mr. Bown knows that Balboa had a wandering gaze, where he directed it, or how he managed to keep his footing in the surf.  Elsewhere we wonder at the King awarding Cook a \"royal [?] coat of arms,\" or know that Martinez \"drew his sword and waved it imperiously towards the trees and the hills [how does one wave a sword imperiously?] when claiming Nootka SoundLikewise, those who write history are supposed to refrain from trivial editorializing.  And yet we read about the \"whimsical Banks\"  Sir Joseph Banks was an untiring botanist who accompanied Cook on his first voyage and was for very many years an extremely useful and helpful president of the Royal Society - a body not known for its whimsy.  (Bown also refers to Sir Joseph as a lord, which he was not.)  We pass by references to Cook \"smugly answering his critics,\" or Banks as \"arrogant,\" which he wasn't, and \"rich\" which he was, as typical further editorial irrelevancies.Equally annoying, Mr. Bown constantly makes gasping reference to bad food, brutal conditions, and as the title of this little book implies, wallows in contemplation of  the lash and other popular horrors.  In fact, the Navy, at the time of Vancouver, provided many seaman with more, and more regular food than they would have received on shore, and in a period of brutal punishments everywhere, naval discipline was not outstandingly severe, though a few captains such as the repellant and probably insane Piggot, were brutal indeed.  But this was not encouraged by the Navy, which was probably the most democratic institution of its time, as shown when  Cook, in Bown's own words, \"challenged and triumphed over England's rigid caste system,\"Worst of all is Bown's habit of contradicting himself.  He observes that Cook rose in rank from obscure origins, but then stuns us with \"It was impossible for a regular, able-bodied sailor or non-commissioned officer to cross to the quarter deck\" and then refers to the ship's Master, who \"had begun his career two decades earlier as an able seaman\" (as did Cook).Bown informs us that, as a junior Lieutenant in the Caribbean Vancouver \"learned the skills of a more senior officer such as navigating, taking the wheel on watch [senior officers did not take the wheel] and striving to keep his ship in the close formation of the fleet [although Bown makes it clear that there was not a fleet in the Caribbean at the time]\".  Bown later states that \"Having sailed with Cook... Vancouver had an uncommon set of skills in navigation and hydrography.\"  Where then, did Vancouver learn his navigation skills?  Earlier, as a volunteer and midshipman with Cook? Or later in the Caribbean as a lieutenant (though no one would ever have passed for lieutenant if he had not already mastered these basic skills)?A sad, silly book, then.  A good, up-to-date, adult biography of Vancouver is badly needed, the last one being Bern Anderson's Life and Voyages of Captain George Vancouver ,published in Seattle in 1960.  Sadly, Madness, Betrayal and the Lash, as the grocery store checkout title should have warned us, is not that book.  I could not finish it.  This one goes straight to the recycle bin."}]}, "authors": ["Stephen Bown"], "isbn": "1771004258", "longitude": -123.11554, "periods": ["1700s", "Recent Releases"], "title": "Madness, Betrayal and the Lash: The Epic Voyage of Captain George Vancouver", "word_cloud": "fascinating picture battle dominance late century lose colony still active explore settle area southern trade route decline adventurous inexperienced age thirteen accompany south sea now command officer ship charge explore chart west coast history recount grueling life sea long passage port rot food scurvy illness cold wet sleeping condition say life sailor day brutal short life tragedy unprecedented return home expect famous overshadow war rival dedicated life destroy good not much lash plenty british learn fight french well appreciation write excellent uncomplicated biography new detail scholarly work work life work excellent respect fill important gap century naval history survey live spend last day celebrate life annually service churchyard bury also visit beautiful island travel part coast marry special interest regard man area explore thing straight experience sailor serve last midshipman however experience diplomat record good time only person die voyage see work care men inexperienced crew malevolent officer include aristocrat ship much list reputation shatter die alone little money completion survey diaries age service year attend often sad occasion reflect life best age unpleasant period british naval history name contribution smear vindicates well research reference many record story give light problem time get feel period chapters part great photograph delve great detail splendid list source bibliography paint particular baddie rightly redeem feature expose aristocratic establishment time hard unjust behavior towards probably serve see leadership problem deal challenge behavior senior officer difficult best time fair share tremendous regard remain strengthened biography end tribute accomplish great thing historical cultural ancestor deserves greater place collective memory get thank much admirer rest appreciation write excellent uncomplicated biography new detail scholarly work work life work excellent respect fill important gap century naval history survey live spend last day celebrate life annually service churchyard bury also visit beautiful island travel part coast marry special interest regard man area explore thing straight experience sailor serve last midshipman however experience diplomat record good time only person die voyage see work care men inexperienced crew malevolent officer include aristocrat ship much list reputation shatter die alone little money completion survey diaries age service year attend often sad occasion reflect life best age unpleasant period british naval history name contribution smear vindicates well research reference many record story give light problem time get feel period chapters part great photograph delve great detail splendid list source bibliography paint particular baddie rightly redeem feature expose aristocratic establishment time hard unjust behavior towards probably serve see leadership problem deal challenge behavior senior officer difficult best time fair share tremendous regard remain strengthened biography end tribute accomplish great thing historical cultural ancestor deserves greater place collective memory get thank much admirer rest refreshing account man history forgotten notwithstanding name give people encounter place work also give glimpse life time american commencement also play role british relationship well accord clearly research topic historian prefers look period time slice compare go work well not everything cover course get sense force knowledge lead make decision star title apparently choose sell element mention al still always enjoy account exploratory expedition expedition exactly exploratory expedition story exactly interest reason become particularly interested saw small monument cite travel monument south shore major thoroughfare beach somewhat baffle negative review closer inspection become apparent many people woefully ignorant history unable properly ass history degree teacher offer information elevate rather regular reader least basic understanding subject matter apply negative hardly wee hour hand reach popcorn love painstakingly research perhaps important entertain long believe people ignorant history often deliver uninspired teacher force student dry text instead make effort source better material terrible shame ultimately make populace hand bad writer even fascinate event put coma history unapologetic ally entertain thrill well deeply informative accomplished criterion opinion personally little importance best footnote history survey north american coast far powerful miss focus instead map chapter begin represent tread power map soon lose returned biographical find character overly sensational former sailor find character consistent behavior inboard ship sea good job illustrate hard job isolate board friends constantly good order discipline risk mutiny desire make biography prevent full exploration interest topic enjoy first recognize period navigation relay make world open circumnavigate earth honest manor tend crew follow footstep interest like northern tale enjoyed silliest manage long time reasonably scholarly biography find journalism sensationalism sloppy write smug attitude way justify attainment break virtually rule good good writing corollary pepper little judgment smug aside distract cumulatively drive distraction many example quote perfectly clear passage write gratuitously comment stultify formal language era observe tragedy western never develop good work prose century find precise use larger vocabulary common today use courtesy formality stultify sympathy comment simply serve distract reference scurvy fashionable concern eighteenth century physician trencher sloppy fermenting cabbage sauerkraut bob ship float north apparently raft ad declare not little even entertain however feel constantly bright little insertion gem cross boldly stride surf allow wander gaze search horizon south north promptly claim quantity barren reader smirk judicious wonder know wander gaze direct manage foot surf wonder award royal coat arm know draw sword wave imperiously towards tree hill wave sword imperiously claim write history suppose refrain trivial editorializing yet whimsical bank untiring botanist accompany first many year extremely useful helpful president body know whimsy also refer lord pass reference smugly answer critic arrogant rich typical editorial annoy constantly make gasp reference bad food brutal condition title little implies wallow contemplation lash popular horror fact time provide many seaman regular food shore period brutal punishment everywhere naval discipline outstandingly severe captain repellent probably insane brutal indeed encourage probably democratic institution time show word challenge triumphed rigid caste system habit contradict observe rise rank obscure origins stun impossible regular sailor officer cross quarter deck refers ship begin career decade earlier able seaman cook informs junior lieutenant learn skill senior officer navigate take wheel watch senior officer take wheel strive ship close formation fleet make clear fleet time later state have sail uncommon set skill navigation hydrography navigation skill earlier volunteer midshipman later lieutenant ever pass lieutenant already master basic skill sad silly good adult biography badly need last publish grocery store checkout title warn go straight recycle bin", "genres": ["Biography", "History"], "summary": "From 1792 to 1795, George Vancouver sailed the Pacific as the captain of his own expedition — and as an agent of imperial ambition. To map a place is to control it, and Britain had its eyes on America's Pacific coast. And map it Vancouver did. \r\n\r\nHis voyage was one of history’s greatest feats of maritime daring, discovery, and diplomacy, and his marine survey of Hawaii and the Pacific coast was at its time the most comprehensive ever undertaken. But just two years after returning to Britain, the 40-year-old Vancouver, hounded by critics, shamed by public humiliation at the fists of an aristocratic sailor he had flogged, and blacklisted because of a perceived failure to follow the Admiralty’s directives, died in poverty, nearly forgotten. \r\n\r\nIn this riveting and perceptive biography, historian Stephen Bown delves into the events that destroyed Vancouver’s reputation and restores his position as one of the greatest explorers of the Age of Discovery.", "asin": "1771004258", "rank": "1401004", "city": "Vancouver", "image": "https://images-na.ssl-images-amazon.com/images/I/513q7QrGP6L.jpg", "country": "Canada", "story_arc": ["Tragedy", "Things only get worse"]}