{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 6, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "I walked away from this book with a deeper understanding of the complex issue of cocoa farming.  Orla does a fantastic job of adding objectivity and nuance to a heated topic - and she does it in an engaging and easy-to-read way. Highly recommended read!"}, {"review_sentiment": 3.0, "review_text": "An interesting read on the west African chocolate industry and how it works.  Very interesting  I felt it dragged at points but all and all, very informative!"}, {"review_sentiment": 4.0, "review_text": "Great overview of cocoa industry in Ghana and Côte d'Ivoire, addressing both similarities and differences, achievements and challenges, with nuanced explanation of benefits and limitations of FairTrade."}, {"review_sentiment": 5.0, "review_text": "I am so glad that I read this book. In preparing to write an article for the Huffington Post about chocolate and cocoa, I was introduced to issues about which I had previously had no knowledge. A couple other reviewers have given good summaries, so I won't attempt to add, but I want to say that if you are a chocolate consumer or anyone with an interest in how this crazy world works (or doesn't), I recommend you read this. Every couple pages I found myself thinking, \"Oh! Really?\" every time I came across a new piece of information. The book is short, so not having enough time to read it is no excuse. (I don't have any time either, but I read it.) Once you've done that, you'll never buy or think about chocolate in the same way as before. You'll understand the history behind that delicious nibble. I for one will now buy only Omanhene chocolate, one of the few brands actually made in Ghana, the second largest cocoa bean producer in the world. One of the most interesting aspects of the book is Ryan's examination of the fair trade issue. Think it's simple? Yes, I thought so too. I was wrong."}, {"review_sentiment": 5.0, "review_text": "I have an unusual problem with reviewing this book: It is so intensely thought-provoking I'm having trouble just telling you what's actually in it. When I type, I start wildly drifting into my own tangents.Let me start with this, which I never knew before: Most of the world's cocoa comes from Ghana and the Ivory Coast, and nearly all of it is cultivated by hand on small, family-operated farms. It is the last of the global crops to be cultivated this way, and it represents the largest portion of each country's wealth. To buy chocolate - even those convenience-store staples from Hershey, Cadbury and Mars - is to directly connect with its harvesters in West Africa. After reading this book, I developed a respect and appreciation for the common Hershey's bar that I had until now reserved for the produce at my local farmer's market.Orla Ryan is a former Reuters reporter who covered the cocoa industry in Ghana and Ivory Coast before taking leave to publish this book. Because I feel a tangent coming on, I'll be quick: This is an exceptionally readable, comprehensive, smart and objective book that smashes any assumptions you may have been making since I told you it was about poor African farmers harvesting most of the world's chocolate with hand tools. I recommend it to anyone interested in journalism (for the way it presents information that I suspect will leave the farmers, consumers and chocolatiers feeling they have been portrayed fairly) business and commodities trading (for the way it analyzes a whole commodity market from the soil to the store) and social activism (for ideas in how to identify and implement policy changes that will actually reach the poor, as this author has tried to do). This book might even teach activists who have to communicate with business leaders (and vice versa) how to find common ground.And if you hate that guy from Coldplay, there's something in here for you, too.And now for the tangent that I cannot hold back any longer: Empowered consumers have been led to believe - especially by the coffee industry, which gets some treatment in this book - if they just buy a fairly traded product, they can be part of the solution to end poverty, child exploitation, and corrupt regimes hoarding resources from their hardworking and deeply impoverished citizens. Orla Ryan suggests the solution is not ours to purchase. Just like with sharecropping in the United States after slavery, money generated by the sale of those cocoa pods immediately gets distributed to the moneylenders, fertilizer suppliers and landowners to whom the farmer is indebted. \"Cocoa money supports millions of people, not just those who work the farm but also many who have never harvested a pod.\" Worse, this is a \"cash crop\" which (tangent!) is practically a misnomer: West Africans don't eat chocolate, so they can't sustain themselves with their own labor. Their money has to pay for all of the food they eat, since none of it comes from their own farm. No amount of money, even the $3 you just spent on that Dagoba bar at Whole Foods, is going to stay with the farmers and their families for long.The solution, Ryan suggests, is to teach farmers how to get the most out of their land by cutting down older, less fertile trees, diversifying their crops and fighting disease and pests more efficiently. The Westerners in the best position to provide farmers the resources and motivation to implement these wildly counter-intuitiive methods of wealth creation? Not the consumers - it's Mars, Cadbury and Hershey, the folks who get nearly 100% of the beans from Ghana and the Ivory coast into our mouths and whose business would collapse if something happened to the cocoa supply. The moral of the story: keep buying those Wonka bars, because Big Chocolate actually comes across in this book sounding fairly socially responsible, though not on a large-enough scale to have a positive impact on all of its farmers.But if anyone actually was able to wean the harvesters away from chocolate and into sustainable crops for their communities, there would probably be less chocolate grown overall. Prices would soar and chocolate bars would return to being a luxury rather than an essential element in my daily mental health regimen. By the end of the book, as Ryan alternated between staggering insights and brilliant suggestions for improving how chocolate is produced, I began to realize I need those chocolate farmers in Ghana more than they need me. The real price of humane chocolate may very well be one's willingness to get by with less of it."}, {"review_sentiment": 5.0, "review_text": "Orla Ryan is a Financial Times journalist who previously worked for Reuters in Ghana, where she reported on cocoa for its general and financial news service. In this book she attempts to cast a factual, dispassionate and objective eye on the cocoa trade in Africa; adopting an analytical rather than an emotional approach. There are eight chapters in this short (160 page) but heavy-hitting work. The first two look at the contrasting histories of cocoa growing in Ghana and Cote d'Ivoire. This is followed by a chapter that examines the extent to which child labour is used on cocoa farms, and the distinction between child and slave labour. The fourth chapter concentrates on corruption in Cote d'Ivoire and the fate of journalist Guy Andre, a man who asked too many questions about where cocoa money was disappearing to. The fifth chapter looks at the practical trials and tribulations of Steve Wallace, an American with a dream to produce chocolate in Ghana, including the very real physical location and structural difficulties of operating there. Chapter six seeks to separate the \"myths and reality\" of the various fair trade approaches to cocoa growing and buying, while the penultimate chapter examines how the cocoa trade really works - a complicated set of power dynamics involving global corporates, country cocoa boards and cocoa speculators, but rarely cocoa farmers themselves. The final chapter looks forward to how to create a sustainable future for a cocoa industry which is struggling to meet world demand, where cocoa farmers often struggle to survive and where, in consequence, the younger generation do not want to enter the business. The answer to the plight of the cocoa farmer is not a simple one, and consumers, chocolate companies, national governments, scientists, and cocoa farmers themselves all have a part to play. But, as in Carol Off's excellent \"Bitter Chocolate\", Orla Ryan's starting point for a better future for cocoa farmers seems to be in improved education for cocoa farmers (both fundamental and agro-business), and in stable non-corrupt government and government bodies in the main cocoa-producing countries. I highly recommend both this book and \"Bitter Chocolate\" as an introduction to the issues surrounding the cocoa industry and the plight of the cocoa farmer. This book just shades it in terms of my recommendation because of its distilled focus."}]}, "authors": ["Orla Ryan"], "isbn": "1780323093", "longitude": 0.0, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Chocolate Nations: Living and Dying for Cocoa in West Africa", "word_cloud": "walk away deeper understand complex issue farm fantastic job add objectivity nuance heat engage way recommend interesting african industry work very interesting felt dragged point informative industry address similarity difference achievement challenge nuanced explanation benefit limitation fair trade glad prepare write article introduce issue previously knowledge couple reviewer give good summary want say consumer anyone interest crazy world work recommend every couple page find think time come new piece information short enough time time once do never think way understand history delicious nibble buy brand actually make second largest bean producer world interesting aspects examination fair trade issue simple think wrong unusual problem review intensely trouble tell actually type start wildly drifting start never know most world come nearly cultivate hand small farm last global crop cultivate way represent largest portion country wealth even staple directly connect harvester read develop respect appreciation common bar reserve local farmer former reporter cover industry take leave publish feel tangent come quick exceptionally readable comprehensive smart objective smash assumption make tell poor african farmer harvest world hand tool recommend anyone interested journalism way present information suspect leave farmer consumer chocolate feel portray fairly business commodity trade way analyzes whole commodity market soil store social activism idea identify implement policy change actually reach poor author try even activist communicate business leader vice versa find common hate guy something tangent hold back longer empower consumer lead believe especially coffee industry get treatment buy fairly trade product part solution end poverty child exploitation corrupt regime hoard resource hardworking deeply impoverish citizen suggest solution purchase sharecropping slavery money generate sale pod immediately get distributed moneylender fertilizer supplier landowner farmer indebted money support million people work farm also many never harvest pod worse cash crop tangent practically misnomer eat labor money pay food eat none come farm amount money even spend bar go stay farmer family solution suggest teach farmer get land cut older le fertile tree diversify crop fight disease pest efficiently best position provide farmer resource motivation implement wildly method wealth creation not consumer folk get nearly bean coast mouth business something happen supply moral story buying bar actually come sound fairly socially responsible scale positive impact anyone actually able wean harvester away sustainable crop community probably le grown overall price bar luxury rather essential element daily mental health regimen end alternate stagger insight brilliant suggestion improve produce begin need farmer need real price humane willingness get le journalist previously work report general financial news service attempt cast factual dispassionate objective eye trade adopt analytical rather emotional approach chapter short page work first look contrast history grow follow chapter examines extent labor use farm distinction child slave labor fourth chapter concentrate corruption fate journalist man ask many question money disappear fifth chapter look practical trial tribulation steve wallace american dream produce include real physical location structural difficulty operate chapter seek separate myth reality various fair trade approach grow buy penultimate chapter examines trade really work complicate set power dynamic involve global corporate country board speculator rarely farmer final chapter look forward create sustainable future industry struggle meet world demand farmer often struggle survive consequence younger generation want enter business answer plight farmer simple consumer company national government scientist farmer part play excellent start point better future farmer seem improved education farmer fundamental stable government government body main country highly recommend introduction issue surround industry plight farmer shade term recommendation distil focus", "genres": ["Business & Finance", "History", "Food and Wine"], "summary": "Chocolate - the very word conjures up a hint of the forbidden and a taste of the decadent. Yet the story behind the chocolate bar is rarely one of luxury...\r\n\r\nFrom the thousands of children who work on plantations to the smallholders who harvest the beans, Chocolate Nations reveals the hard economic realities of our favourite sweet. This vivid and gripping exploration of the reasons behind farmer poverty includes the human stories of the producers and traders at the heart of the West African industry. Orla Ryan shows that only a tiny fraction of the cash we pay for a chocolate bar actually makes it back to the farmers, and sheds light on what Fairtrade really means on the ground.\r\n\r\nProvocative and eye-opening, Chocolate Nations exposes the true story of how the treat we love makes it on to our supermarket shelves. \r\n\r\n\"Chocolate Nations is a fascinating account of the struggles of cocoa producers in West Africa, almost all of them smallholders, and what it takes to turn a crop of cocoa into a warehouse full of Ferrero Rocher.\" The Guardian", "asin": "1780323093", "rank": "387507", "city": "Ghana", "image": "https://images-na.ssl-images-amazon.com/images/I/51E7%2BKf5oPL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}