{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 10, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Arrived quickly. Great book. Website description is accurate."}, {"review_sentiment": 5.0, "review_text": "I couldn’t put this book down, and when it did end, it left me in tears. An extremely charming novel that seamlessly toggles between a couple of years in the lives of the people who inhabit a Mexico City tenement compound. Particularly wonderful are the amaranth scholar who sets out to reconstruct his beloved wife through writing after she dies of pancreatic cancer and Luz, the five-year-old girl who drowns shortly after her narration ends (as we learn from her sister Ana—a lovely character, as well—in the book’s opening pages). Jufresa’s disarming, unabashed tone and interest in the intersection of languages and cultures reminded me of Chloe Aridjis’ wonderful Book of Clouds, while Sophie Hughes’ translation stands alongside the original as a dazzling feat in its own right. Hughes won the English PEN Award for this translation, and I can certainly see why, as the English abounds with inventive and delightful solutions to the challenges of the Spanish.A beautiful and surprising meditation on community, absent maternity and growth of all kinds."}, {"review_sentiment": 4.0, "review_text": "I started reading this book about a month ago and read it off and on in my spare time. It was not a book that you wanted to finish in one sitting, but I enjoyed getting to know the characters and learning about Spanish culture. I like the idea that people are complex and whether alive or dead, we think about them and reflect on why they did what they did. Sometimes it makes sense and sometimes we will never understand, but that's okay, these memories keep them alive, and make life more bearable after they're gone."}, {"review_sentiment": 4.0, "review_text": "Admirable effort.  Story loses steam towards the end, yet the quality of the writing is fresh through the end."}, {"review_sentiment": 5.0, "review_text": "Heard the NPR review on it and bought immediately and was not let down. Found it to be a great read. Extremely well crafted with lots of subtleties, ironies, joy and sorrow."}, {"review_sentiment": 3.0, "review_text": "A melancholy but impressive collection of thoughts on life, death and relationships. Jufresa leaves some of the heavy lifting to her readers and I enjoyed the attention required to attend to the story and to attempt to differentiate the voices of each narrator. However, I had a difficult time actually hearing those different voices, the characters often feeling quite similar. The result was a feeling of uncertainty about who was speaking and I wondered at times if the same purpose couldn't have been accomplished with fewer narrators.Of the novel's many narrators, I most enjoyed the thoughts of the retired professor, a widower whose narration mostly related to his deceased wife and the time they had spent together. His musings on time, love and purpose were at times quite profound. What never quite worked for me was the tying in of the umami theme with the overall story and characters. A good novel for pondering some of life's important questions, but the lack of differentiation between the several voices felt like a significant weakness.Note: ARC received free from publisher"}, {"review_sentiment": 2.0, "review_text": "Stream of consciousness best describes my opinion.  There was no ending and it was confusing at times.  There were a couple of amusing parts but I couldn't wait to finish the book and kept hoping that it would interest me more.  I applaud the author for her effort but couldn't see the point of much of the story."}, {"review_sentiment": 1.0, "review_text": "Akward translation and NO ending whatsoever."}, {"review_sentiment": 3.0, "review_text": "I bought this because of a discussion with the author that was run on NPR.  It sounded interesting but it turns out it was just boring, with no real point.  I felt this was a waste."}, {"review_sentiment": 5.0, "review_text": "Refreshing, lovely, surprising and fun to read!"}]}, "authors": ["Laia Jufresa"], "isbn": "1780748914", "longitude": -99.1333416, "periods": ["2000s", "Recent Releases"], "title": "Umami", "word_cloud": "quickly description accurate put end left tear extremely charm seamlessly toggle couple year live people inhabit tenement compound wonderful amaranth scholar set reconstruct beloved wife write dy pancreatic cancer girl drowns shortly narration end learn sister lovely character opening page disarm unabashed tone interest intersection languages culture remind wonderful translation stand alongside original dazzling feat right translation certainly see english abounds inventive delightful solution challenge beautiful surprising meditation community absent maternity growth kind start read month spare time want finish sit enjoy get know character learn spanish culture like idea people complex alive dead think reflect make sense sometimes never understand okay memory keep alive make life bearable go admirable effort lose steam towards end yet quality write fresh end review buy immediately let great extremely well crafted lot subtlety irony joy sorrow melancholy impressive collection thought life death relationship leave heavy lift reader enjoy attention require attend story attempt differentiate voice narrator however difficult time actually hear different voice character often feel quite similar result feel uncertainty speaking wonder time fewer many narrator enjoy thought retire professor widower narration mostly relate deceased wife time spend together musing time love purpose time quite profound never quite worked tie theme overall story character good pondering life important question lack differentiation several voice felt significant receive free publisher consciousness best describes opinion end confuse time couple amusing part finish kept hop interest applaud author effort point much story translation end whatsoever buy discussion author run sound interest turn bore real point felt waste refresh lovely surprising fun", "genres": ["Fiction & Literature"], "summary": "It started with a drowning.\r\n\r\nDeep in the heart of Mexico City, where five houses cluster around a sun-drenched courtyard, lives Ana, a precocious twelve-year-old who spends her days buried in Agatha Christie novels to forget the mysterious death of her little sister years earlier. Over the summer she decides to plant a milpa in her backyard, and as she digs the ground and plants her seeds, her neighbors in turn delve into their past. The ripple effects of grief, childlessness, illness and displacement saturate their stories, secrets seep out and questions emerge — Who was my wife? Why did my Mom leave? Can I turn back the clock? And how could a girl who knew how to swim drown?\r\n\r\nIn prose that is dazzlingly inventive, funny and tender, Laia Jufresa immerses us in the troubled lives of her narrators, deftly unpicking their stories to offer a darkly comic portrait of contemporary Mexico, as whimsical as it is heart-wrenching.", "asin": "1780748914", "rank": "520218", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/51T2BEknrML.jpg", "country": "Mexico", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}