{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 23, "rating": 4.5, "reviews": [{"review_sentiment": 4.0, "review_text": "Very readable in a journalistic style ."}, {"review_sentiment": 5.0, "review_text": "A great book on the Desert War but Moorehead also takes some fascinating excursions to India and the United States at the same time. It was particularly interesting how the Allies were offering independence to India after the war in exchange for continued support against the Japanese.Big picture analysis of second world war strategy; face to face discussions with key players like Wavell, Auchinleck, Ghandi and Nehru; electrifying descriptions of combat at the ordinary soldier level; wonderful descriptions of landscape - this book has everything!The book - written in 1943 - is so dense in information that it will be worth reading again in six months to get the stuff I missed or didn't understand the first time around."}, {"review_sentiment": 4.0, "review_text": "Very interesting book on the Desert Wat in North Africa!"}, {"review_sentiment": 5.0, "review_text": "This guy is a great writer. His personal observations of his surroudings, where he went, what he saw, what night desert warfare looked like and felt like make you feel as if you are there in 1943 with the British 8th army fighting Rommel yourself. I was sorry when the book came to an end."}, {"review_sentiment": 3.0, "review_text": "Is written from a British correspondent's perspective. Is like a long novel about his experiences, but is short on the overall meaning of the war decisions of the leaders. You can see why the British were detested before and during the war."}, {"review_sentiment": 5.0, "review_text": "VG"}, {"review_sentiment": 4.0, "review_text": "good reading"}, {"review_sentiment": 5.0, "review_text": "Many maintain that this trilogy is unique in its portrayal of the Desert War in North Africa.  Having read several histories on the subject, I would agree.  Published only a few years after WWII, it is a war correspondent's personal memoirs of his coverage of the entire struggle of Great Britain in Africa.  Moorehead takes us to little known conflicts in the former African colonies (Sudan, Abyssinia, etc) as well as the complete era of the North African campaigns from 1940 to 1943.  This is not so much a history but a journalist's story.  The detail is exceptional.  From Spartan life in the desert or rugged terrain of Ethiopia to the starkly oblivious social life in Cairo and Nairobi, his observations tell us what it was like.  Be forewarned, the text has not been scrubbed by modern editing to be politically correct nor adjusted to correct inaccurate historical details (battle casualties, etc) that many revised histories would have.  It is what was observed then, often with the biases of the men and leaders he lived with and reported on."}, {"review_sentiment": 5.0, "review_text": "Excellent book , covers a war as mysterious as the desert , and as extended as all the countries involved : Ethiopia, Sudan , Lybia, Egypt , Palestine, Iran, Irak ...Well written , first hand account by someone who was there."}, {"review_sentiment": 4.0, "review_text": "The Desert War provides an excellent account of the Second World War in North Africa from the viewpoint of a well-connected extremely gifted journalist. It is a well written account of the war, but it offers the crucial context of an observer of events in North Africa at the time. Most historical accounts are written by academics 50 years after the event. Whilst veterans are still available, the author does not have first hand experience of the events. The three books are also beautifully written."}]}, "authors": ["Alan Moorehead"], "isbn": "1781316732", "longitude": 31.243666, "periods": null, "title": "The Desert War: The classic trilogy on the North African campaign 1940-1943", "word_cloud": "very readable journalistic style great also take fascinating excursion time particularly interesting ally offer independence war exchange continue support picture analysis second world war strategy face face discussion key player electrify description combat ordinary soldier level wonderful description landscape everything write dense information read month get stuff miss understand first time very interesting guy great writer personal observation surroundings go saw night warfare look felt make feel british army fight sorry come end be write british correspondent perspective be long experience short overall meaning war decision leader see british detest war vg good reading many maintain unique portrayal several history subject year war correspondent personal memoir coverage entire struggle take little known conflict former colony well complete era campaign much history journalist story detail exceptional life rugged terrain starkly oblivious social life observation tell forewarn text scrubbed modern edit politically correct adjust correct inaccurate historical detail battle casualty etc many revise history observe often bias men leader live report excellent cover war mysterious extend country involve write first hand account someone provide excellent account viewpoint extremely gifted journalist well write account war offer crucial context event time historical account write academic year event veteran still available author first hand experience event also beautifully write", "genres": ["History", "Travel Writing", "WWII", "Journalism"], "summary": "Alan Moorehead was a peerless war correspondent who covered the entire war in North Africa from 1940-1943. The trilogy of books he wrote on the prolonged battles between Montgomery's Eighth Army and Rommel's Afrika Corps immediately drew universal acclaim, and remains and epic account as extraordinary now as it was then. \r\n\r\nThis reissue of Alan Moorehead's classic trilogy on the North Africa campaign 1940-1943 will coincide with the 75th anniversary of the Battles for El Alamein in July and October 1942.\r\n\r\nIn 1940, Alan Moorehead was sent to cover the North Africa campaign by the Daily Express, and he followed its dramatic course all the way to 1943. The three books he subsequently wrote about the Desert War – later collected as his ‘African Trilogy’ – were swiftly acclaimed as a classic account of the tussle between Montgomery’s Eighth Army and Rommel’s Afrika Corps, amidst the endless harsh wastes of the Western Desert. \r\n\r\nMoorehead was responsible for the celebrated insight that tank battles in the desert are like battles at sea, the lumbering tanks like ships lost in a vast ocean of sand. The New Statesman could not have put it better when it described his achievement with this riveting book: \r\n\r\n\"There is something of genius in the breadth and penetration of his vision, which encompasses the whole panorama of war and then narrows it down to the particular: the soldier stubbing out his cigarette before going into action, the expression on a tank commander’s face as he is hit… The story of the African campaigns will go down in history as one of the great epics of mankind, largely thanks to Mr Moorehead’s account.\"\r\n", "asin": "1781316732", "rank": "522273", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/515-sieXk8L.jpg", "country": "Egypt", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}