{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 22, "rating": 3.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Meet Fritz van Egters, the hero (?) of the Dutch  author Gerard Reve’s novel THE EVENINGS, just published in English for the first time, that the critics are writing praise songs about.  He is 23, lives with his parents, has a boring job (“I work in an office. I take cards out of a file.”) and a boring life away from work. The novel is about how our hero spends the last ten evenings of the month of December in 1946 trying to combat that boredom.  Fritz listens to the radio (he is spot-on that one should not use the radio for background music; you either listen to music or you don’t),  and eats a lot of meat-and-potatoes meals with his parents who slurp when they eat soup and his father eats meat with his fingers, to Fritz’ consternation. He goes out alone or with friends and lectures all of them on one of his many obsessions, baldness.  He has several theories on why men lose their hair (people who have children late in life will assure that their children will be bald) and says “I’d rather be dead than bald.” (This has to be the first time a character tells another how to do the infamous “comb-over” that too many U. S. politicians have raised to an art form. And there were a couple of other of, if not firsts, then very unusual occurrences: our beloved Fritz takes a mirror to check out his anus and at another time bites off the ear of his toy rabbit.)  Fritz is the master of the outrageous for he tells horrific tales (think finches) and off-color though sometimes funny jokes. And bodily functions abound.Tim Parks in his glowing review of the novel in the GUARDIAN says it “keeps the reader breathless right through to the grand finale.” I was able to breathe right up to the last page although  the book certainly got better in the last half after a slow beginning.  One of the problems of writing a novel about boredom is that you run the risk of making the reader bored. The book, however, does have its many moments. You have to smile when you read sentences like this one: “I am a small-time neurotic.” An how the character Mauritis got a new coat is delicious.  Finally,  Fritz’s mother insists that he take cod-liver oil, something that I hadn’t thought of in years. My mother used to give it to my brother and me on a regular basis. I don’t recall what it was to prevent or cure, only that it tasted bad.I liked THE EVENINGS much more after I finished it (Fritz is a real piece of work)  and probably I would like it more on a second reading. But I have too many unread novels to go before I sleep."}, {"review_sentiment": 4.0, "review_text": "I liked this book but it's odd and some of it is sort of gross..If you're curious I don't think it'll hurt you to read it but it's strange in a very organic kind of way.."}, {"review_sentiment": 3.0, "review_text": "In a city in the Netherlands in the late 40's, a male twenty-something office worker lives with his parents in a modest apartment. The book covers his thoughts about, and conversations with, family and friends over several days during the Christmas and New Years holidays. He is intelligent, sarcastic, dark, cynical, insecure; perhaps an underachiever. It seems that his running commentary is a justification for his existence, or a way to avoid facing  the banality of his life.Some have compared this to \"Catcher in the Rye.\" It is not that good. I really never came to care for the character, and skimmed through some  scenes to finish the book. But, as a literary device of sorts, it has some appeal."}, {"review_sentiment": 1.0, "review_text": "The most boring book I've read in years."}, {"review_sentiment": 5.0, "review_text": "A great read.  Too bad we had to wait so long for an English version."}, {"review_sentiment": 2.0, "review_text": "A surprisingly disappointing read. After much hype about its popularity for a half  century in Europe and ranking it beside the classics as \"Catcher In The Rye\" , readings by myself and by several friends all resulted in the same unsolicited review, \"Boring and dry\".  None  chose  to venture near 1/2 into the writing.  A point I might add is that several of these friends, reviewer's are gay men of a certain age who have endured many of the horrors of that age."}, {"review_sentiment": 4.0, "review_text": "The novel gives a glimpse into fiction of the 1940's in the style and dialogue. The structure ending with a dream each night works well for me. I think the comments about this novel being one of the best European novel of the 20th century does a disservice to the reader. Comparisons with Salinger are exaggerated--I did find the situation of a young man still living with his parents to be timely. I was glad to find a Dutch novel as not many are translated. I did feel as if I were living 80 years ago as I read and forgot about time. Interesting literary experience."}, {"review_sentiment": 5.0, "review_text": "Don't fight the narrative.  If you are waiting for something explosive to happen you will be disappointed, but this must be the original Seinfeld plot line - a book about nothing.  Dark humor, obsession with baldness, passive aggressive squabbles with parents -  I loved it."}, {"review_sentiment": 4.0, "review_text": "A very dark book but beautifully written."}, {"review_sentiment": 5.0, "review_text": "At Long LastI had been told about this novel many decades ago, about its dream sequences and the animal characters. The only thing that had been at my disposal was an illustrated version, but I don't know Dutch, so it wasn't until now that I had  the opportunity to appreciate somewhat the writers style, although through translation. Reve is funny, insightful and annoying, the last intentionally so, in my opinion at least. He only intended a few friends to read it, and it has that very personal style. I was immediately struck by his attention to time, which is treated as seriously and masterfully as it is in Proust and others of that caliber. The passage of time is a chief subject for the main character, as is the weather, as well as some supernatural being he addresses in order to imbue it all with a sense that otherwise eludes him. There also seems to be a sequence of human passions or sins that each gets a chapter devoted to it, although I didn't attempt to work that out entirely. Plus there are the immature ruminations and angry attempts at humor of the main character. The final chapter where he has sincere things to say about his parents elevates the entire book to another realm entirely. The only puzzle is why the book has never been translated until now."}]}, "authors": ["Gerard Reve"], "isbn": "1782271783", "longitude": 4.8936041, "periods": ["1900s"], "title": "The Evenings: A Winter's Tale", "word_cloud": "van hero author publish first time critic write praise song live parent bore job work office take card bore life away work hero spend last ten evening month try combat boredom listen radio use radio background music listen music eats lot meal parent slurp eat soup father eat meat finger consternation go alone friend lecture many obsession several theory men lose hair people child late life assure child bald say rather dead first time character tell infamous many politician raise art form couple first unusual occurrence beloved take mirror check time bite ear toy rabbit master outrageous tell horrific tale think finch sometimes funny joke bodily function glow review say breathless right grand able breathe right last page certainly get better last half slow begin problem write boredom run risk making bore however many moment smile sentence character get new coat delicious mother insists take oil something think year mother use give brother regular basis recall prevent cure taste like much finish real piece work probably second reading many unread novel go sleep like odd sort curious think hurt strange organic kind city late male office worker live parent modest apartment cover thoughts conversation family friends several day holiday intelligent sarcastic dark cynical insecure perhaps seem run commentary justification existence way face banality compare good really never come care character skim scene finish literary device sort appeal boring year great bad wait long english version surprisingly disappointing much hype popularity half century rank classic reading several friend result unsolicited review dry none choose venture write point several friend reviewer gay men certain age endure many horror age give glimpse fiction style dialogue structure end dream night work well think comment best european century disservice exaggerate find situation young man still live parent timely glad many translate feel live year ago forget time literary experience fight wait something explosive happen disappoint original plot line nothing humor obsession baldness passive aggressive squabble parent love dark beautifully write tell many decade dream sequence animal character thing disposal illustrated version know dutch opportunity appreciate writer style translation funny insightful annoy last intentionally opinion intend friend personal style immediately strike attention time treat seriously masterfully others caliber passage time chief subject main character weather well supernatural address order imbue sense otherwise elude also seem sequence human passion sin get chapter devote attempt work entirely immature rumination angry attempt humor main character final chapter sincere thing say parent elevate entire realm entirely puzzle never translate", "genres": ["Fiction & Literature", "Mystery & Suspense", "LGBT"], "summary": "THE FIRST ENGLISH TRANSLATION OF A POSTWAR MASTERPIECE\r\n\r\n'I work in an office. I take cards out of a file. Once I have taken them out, I put them back in again. That is it.'\r\n\r\nTwenty-three-year-old Frits - office worker, daydreamer, teller of inappropriate jokes - finds life absurd and inexplicable. He lives with his parents, who drive him mad. He has terrible, disturbing dreams of death and destruction. Sometimes he talks to a toy rabbit.\r\n\r\nThis is the story of ten evenings in Frits's life at the end of December, as he drinks, smokes, sees friends, aimlessly wanders the gloomy city street and tries to make sense of the minutes, hours and days that stretch before him.\r\n\r\nDarkly funny and mesmerising, The Evenings takes the tiny, quotidian triumphs and heartbreaks of our everyday lives and turns them into a work of brilliant wit and profound beauty.\r\n\r\n\"Reviewers have compared it favorably to J .D. Salinger’s The Catcher in the Rye, Albert Camus’s The Stranger and Karl Ove Knausgaard’s My Struggle. In The Irish Times, Eileen Battersby called it 'one of the finest studies of youthful malaise ever written,' and in The Guardian, Tim Parks described it as 'not only a masterpiece but a cornerstone manqué of modern European literature.'  The Society of Dutch Literature ranked it as the country’s best 20th-century novel and its third-best of all time.\" The New York Times", "asin": "1782271783", "rank": "78359", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/51Bj0h5%2BCRL.jpg", "country": "The Netherlands", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}