{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": -33.928992, "ratings": {"num_ratings": 18, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "This was my (late) summer beach read and I was delighted from start to finish.  The author weaves a clever and fun alternate reality and I was happy to go along for the ride.  Buy this book right now!"}, {"review_sentiment": 5.0, "review_text": "Enjoyed it immensely! Great book! Have read many, many Charlie Human's books. This has to be one of my favorites!"}, {"review_sentiment": 3.0, "review_text": "So I read it during a deployment, getting caught up in the flashy cover and the clever little title, then I dumped it when I headed back to the states. During a book store prowling, I found it and decided to pick it back up.It's interesting to say the least. There were some mistakes, one I noticed was the name change of the bird from Tony to Toni. His name is only mentioned like three or four times and one of those four times it becomes a Toni bird. Bird didn't matter too much, I'm surprised I even picked up on it. A couple other smaller things, missing paragraph break for one dialogue bit, a time our MC Baxter sits twice, and a little peeve of mine of an overuse of dialogue tags when they aren't necessary. Those are just small things.The story itself is all right. Definitely an enjoyable and creative read of a world packed with a lot of stuff. That might've been a drawback, all the package THINGS condensed into the novel. A lot, at time it seemed some of the creatures were tossed in just to make the novel more different. Most of the secondary characters lacked much growth outside our Rowan and Baxter. Many were introduced so quickly I stopped caring for who they were. The events that happened also just seemed to happen. It moved quickly. One event after another. Little pause between everything, during which we usually gained a couple more fodder characters to kill off.The connection, time warp deal was neatly done, but some of the other  twists I could see  because in a novel of so much chaos, there was actually a fine line of sanity connecting the pieces. It was easy to see a lot of things falling into place and knowing ahead of time the truth before we were given it.I would recommend it, it's not a bad story by any means."}, {"review_sentiment": 4.0, "review_text": "A fun read about bad kid Baxter who gets caught up in supernatural goings on.  Really liked the writing style & black humour."}, {"review_sentiment": 5.0, "review_text": "Baxter is in trouble. He needs to save his girlfriend and decide to either protect the world or rule it, but he is just an ordinary teen in South Africa-- if ordinary means being the leader of a rapidly growing porn ring at school and discovering you might be both a serial killer and powerful warrior seer hero in an underworld filled with mythical creatures and zombie spider prostitutes. Will his life ever be normal?Some say this book is “…Neil Gaiman meets Tarantino,” and I agree-- only I would add a bit of Rowling too. Outside of that, Charlie Human is a force of imagination that can hold his own.It is a clever, cringe-inspiring tale, filled with characters and settings that burn their weird supernatural personalities into the brain.A raw, darkly funny romp through old genre territory made new again. I thoroughly enjoyed it.Follow it up with the second book in the series, “Kill Baxter.”This review and more at annevolmering.com."}, {"review_sentiment": 2.0, "review_text": "I wasnt able to finish the book because of how unsympatetic the main protagonist is.Have you ever met a guy at a party that keeps talking about how great he is, how much money he makes, his workout regiment and how interesting his life is? once you leave the party you're like \"wow that guy is a douchebag, I hope I never have to hear about him ever again\"Why am I supposed to root for this guy? He repeatedly beats on his mentally challenged brother for no reason, decides to ignore one of his friends for not being popular enough and his girlfriend is just a random hot girl that he bangs because she's hot...I kept thinking \"well at some point that guy's gonna redeem himself and it'll be worth it\" but it took too long and I decided to read a better book."}, {"review_sentiment": 4.0, "review_text": "I liked it. Some nice twists, good characters, common theme but pretty nicely executed.Not a mind blowing innovative book, but entertaining enough that I'd like to read a sequel."}, {"review_sentiment": 5.0, "review_text": "A fun romp in urban fantasy.  If you dig Jim Butcher or Simon Green you'll enjoy this.  The prequel was good as well."}, {"review_sentiment": 5.0, "review_text": "It took a few pages for this story to get in gear. When it did I very much enjoyed it. It has a very original universe and mythology that is enriched by South African history - at least as far as I can tell, knowing next to nothing about South African history that doesn't include Nelson Mandella. I enjoyed the main character, who has a \"Catcher In The Rye\" kind of vibe, but in a much more fun and humorous way.The supporting characters are also unique and enjoyable.Is this a \"perfect book\"? No. But it is a \"perfectly enjoyable book\" with an enjoyable story that kept surprising me and fun characters. I kept wanting to pick it up when I had other things to do, and THAT is my signal for a 5 star book."}, {"review_sentiment": 5.0, "review_text": "Starts odd...but gets great! You have to get in Baxter's head first to see the world through his eyes. Very cool book!"}]}, "authors": ["Charlie Human"], "isbn": "1783294744", "longitude": 18.417396, "periods": ["2000s", "Recent Releases"], "title": "Apocalypse Now Now", "word_cloud": "late summer beach delight start author weave clever fun alternate reality happy go ride right immensely have many many favorite so deployment get catch flashy cover clever little title dump head back state store prowling find decide pick interesting say least mistake notice name change bird name mention time time becomes bird matter much surprise even pick couple smaller thing miss paragraph break dialogue bit time sit twice little peeve mine dialogue tag necessary small story right enjoyable creative world pack lot stuff package condense lot time seem creature tossed make different secondary character lack much growth introduce quickly stop care event happen also seem move quickly event pause everything usually gain couple fodder character connection time warp deal neatly do twist much chaos actually fine line sanity connect piece easy lot thing fall place know ahead time truth give bad story mean fun bad kid get caught supernatural going really like write style black humor trouble need save girlfriend decide protect world rule ordinary teen ordinary mean leader rapidly grow porn ring school discover serial killer powerful warrior seer hero underworld fill mythical creature zombie spider prostitute life ever normal say meet agree rowling force imagination hold clever tale fill character setting burn weird supernatural personality raw darkly funny romp old genre territory make new thoroughly enjoyed second series review wast able finish unsympathetic main protagonist ever meet guy party keep talk great much money make workout regiment interesting life leave party wow guy douche bag hope never hear ever suppose root guy repeatedly beat mentally challenge brother reason decide ignore friends popular enough girlfriend random hot girl bang hot keep think well guy hon worth take long decide better like nice twist good character common theme pretty nicely blow innovative entertaining enough like sequel fun romp urban fantasy dig prequel good well take page story get gear much enjoy original universe mythology enrich south african history least far tell know next nothing south african history include enjoy main character kind vibe much fun humorous support character also unique perfect perfectly enjoyable enjoyable story keep surprising fun character keep want pick thing signal star start odd get great get head first see world eye very cool", "genres": ["Fiction & Literature", "Mystery & Suspense", "Fantasy"], "summary": "Baxter Zevcenko is your average 16-year-old boy. If by average you mean kingpin of a porn-peddling schoolyard syndicate, and a possible serial killer who suffers from wierd historical dreams.\r\n\r\nBaxter is the first to admit that he’s not a nice guy. After all, high school is a gaping, icy abyss and Baxter is not about to allow anybody to drag him down. That is until his girlfriend, Esmé, is kidnapped and the clues point toward supernatural forces at work. Faced with navigating the increasingly bizarre landscape of Cape Town’s supernatural underworld, Baxter turns to the only person drunk enough to help: bearded, booze-soaked, supernatural bounty hunter Jackson ‘Jackie’ Ronin.\r\nOn a mission that takes them through the realms of impossibility, they face every conceivable nightmare to rescue Esmé, including the odd brush with the Apocalypse.\r\n\r\n\"Lauren Beukes meets Neil Gaiman.\" Wired", "asin": "1783294744", "rank": "904396", "city": "Cape Town", "image": "https://images-na.ssl-images-amazon.com/images/I/51lq%2BskyE3L.jpg", "country": "RSA", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}