{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 39, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Fully expecting this to be more or less a historical reference of this area this book proves to be so much more. As well as being a fairly thorough historical text the author also relates his experiences with the people he encounters, he is very subjective about this and at times can be quite sarcastic. Rather than a turnoff, quite to the contrary, it adds some considerable depth to his narrative. His odyssey takes place in the early nineties, and an awful lot of things have happened since then politically speaking, but his rendition of events \"up close and personal\" as it were can be quite riveting. I found myself thinking at times; gee I didn't know that!  The author provides a map of the Crimea where most of his travels occur, but anything more expansive than that one will have to look up other references."}, {"review_sentiment": 5.0, "review_text": "This transported me into an unknown past civilization and has shone a bright light into a hitherto unknown corner of the world !"}, {"review_sentiment": 3.0, "review_text": "Twenty years after its publication, Neal Ascherson's \"Black Sea\" remains an puzzle. Part travelogue, part narrative history, part contemporary reporting, the book leaves one at sea, so to speak. The author's Scots origins and his expertise on all things Polish result in an odd series of diversions, as he tracks down every instance when a Pole wandered into the Pontic steppes. Maps are few and absent from the table of contents. In such unfamiliar terrain, Ascherson does not guide us very directly. Instead, he wanders, giving more time to the northern and western boundaries of the sea instead of its southern Turkish domain. Post-USSR, this may make sense, but there is less sense of a lived presence in many pages here. A companion of Ascherson longs for a chocolate at one dusty stop and this is fulfilled, a rare moment of life.Instead, we get a blur. Many scholars are consulted, and the resurrection of the Lazi language in written form by a German scholar is a great vignette. But too often, sources are raised and then left in the dust. For instance, towards the end, Dr. Effie Voutira is cited. Her analogy to an Ottoman state resembling a \"Kokoschka painting where the plurality and diversity of the different points of colour is such that there is no clearly discernible pattern, though the picture as a whole does have one\" mirrors Ascherson's own diffuse prose style and his attempts to capture imagery. (p. 197) And like the scholar's comparison to a modern world map which \"looks more like a Modigliani painting, where all shapes and colours have clearly circumscribed boundaries and well-defined surfaces with no ambiguity or overlap.\" Ascherson follows by relating this to of the Kemalist ideology as mirrored in a Turkish state. All well done, but there is no citation for this quote in the bibliography, a frustrating instance.While this attempts to survey the ground that his father saw as the Russian revolution began in 1920, and as his son witnesses the aftermath of the Soviet impact, this book is better consulted for its summation of lore from ancient times. For its forays into present-day successor states to the empires of the Russian bear and the Turkish grey wolf are less engaging. This book fills a niche, but it does delve as far or deep as needed."}, {"review_sentiment": 4.0, "review_text": "This gives a very detailed discussion of the Black Sea in history, particularly the eastern regions.  His primary focus is on the classical and early post classical periods, although Ascherson does bring the information up to the early 1990s.  Much has changed since the early post-Soviet period, but since Ascherson was writing in the mid-90s,  that was understandable.  I learned a lot about a region I am interested in, which was the reason I ordered the book, so that was all to the good.  I would have liked more information regarding the more western reaches of the Black Sea after the classical period and more on others in the area in addition to the later Ottomans.  My main issue, however, is that the author needed more maps!!!  This should have been an integral part of the book, particularly since the material involved place names and site information not known to the general reader - or even the general 'academic' reader.  I'm glad I read it, despite this."}, {"review_sentiment": 5.0, "review_text": "Another good read for the eastern European/Caucasus region. Fast shipping and excellent quality in a used book."}, {"review_sentiment": 5.0, "review_text": "Read the book on a wild beach of Lake Huron - a kin landscape with the desolate Black Sea shores, those haunted by the old Scythians and Sarmatians. Neal Ascherson handcrafted a captivating mix of history, travel and anecdotes, mostly centered around Crimea, with some excursions to Constantinople and Trebizond. An easy but very consistent read. Recommended especially for those who see History in black and white, heroes and evils. This book may change their opinion. Starting with the Scythians and ending with Yeltsin's Russia, you are presented with a multitude of unfinished conflicts, intermingles and cultural intercourses. Scythians and Athenians, Amazons and Sarmats, Genoans, Venetians and Turks, Tatars and Kossacks, Poles and the Regiment of Jewish Hussars, The Greek dream of another Romania in forgotten Trebizond, Odessa and Constantinople, hidden treasures and pogroms. All this human bustle is dwarfed by the severe landscapes - the Black Sea, the endless steppe and the mighty mountains. This lecture may provide you a more nuanced view about contemporary events such as the War in Ukraine or the danger of unhealed wounds and unforgotten dreams for a new Byzantium."}, {"review_sentiment": 4.0, "review_text": "Very interesting and comprehensive history."}, {"review_sentiment": 5.0, "review_text": "wish I had written this, its full of wonderful detail"}, {"review_sentiment": 5.0, "review_text": "I'm only about a quarter-way through this book, but I am rating it now because there could be no better time to read it than now, during the Olympic games in Sochi! That is because Sochi is located on the Black Sea; and if you are like me, your knowledge of the peoples and historic drama of the Black Sea region is pretty thin. I think author, Neal Ascherson, does a wonderful job of bringing to life centuries of human drama in the context of the unique Black Sea habitat. You will have a much greater appreciation of the political backdrop to the 2014 Olympic games after reading Ascherson's narrative. The effect on me in reading this history is to feel a deep concern that the world will see in these Olympics a proud showcase of the Black Sea heritage. With or without the Olympics, you will not want to put this book down until you have finished it cover to cover."}, {"review_sentiment": 5.0, "review_text": "This is one of the best books I have ever read, it details the history of the region, and politely discusses the reasons for homelessness, they are called Schythians and you can read all about them and ever so much more."}]}, "authors": ["Neal Ascherson"], "isbn": "1784700916", "longitude": 28.9651646, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s", "1500s", "500-1400s", "0-500s", "Pre Common Era"], "title": "Black Sea: The Birthplace of Civilisation and Barbarism", "word_cloud": "fully expect le historical reference area prove much well fairly thorough historical text author also relate experience people encounter subjective time quite sarcastic turnoff quite contrary add considerable depth narrative odyssey take place early ninety awful lot thing happen politically speak rendition event close personal quite rivet find think time gee know author provide map travel occur anything expansive look reference transport unknown past civilization shone bright light hitherto unknown corner world year publication remain puzzle travelogue part narrative history part contemporary reporting leave sea author origins expertise thing polish result odd series diversion track instance wander steppe absent table content unfamiliar terrain guide directly instead wanders give time northern western boundary sea instead southern domain sense le sense live presence many page companion long chocolate dusty stop fulfil rare moment blur many scholar consult resurrection language write form german scholar great vignette often source raise left dust instance towards end cite analogy state resemble paint plurality diversity different point color clearly discernible pattern picture whole mirror diffuse prose style attempt capture imagery scholar comparison modern world map look paint shape color clearly circumscribed boundary surface ambiguity overlap follow relate ideology mirror turkish state well do citation quote bibliography frustrate attempt survey ground father saw russian revolution begin son witness aftermath soviet impact better consult summation lore ancient time foray successor state empire russian turkish grey wolf le engage fill niche delve far deep need give detailed discussion history particularly eastern region primary focus classical early post classical period bring information early much change early period write understandable learn lot region interested reason order good information regard western reach classical period others area addition later main issue however author need map integral part particularly material involve place name site information know general even general glad good eastern region shipping excellent quality use wild beach landscape desolate shore haunt old handcraft captivate mix history travel anecdotes mostly center excursion easy consistent recommend especially see white hero opinion start end present multitude unfinished conflict intermingle cultural intercourse dream forget hidden treasure pogroms human bustle dwarfed severe landscape endless steppe mighty mountains lecture nuanced view contemporary event danger unhealed wound unforgotten dream new very interesting comprehensive history wish write full wonderful detail rating time game locate knowledge people historic drama region pretty thin think author wonderful job bring life century human drama context unique habitat much greater appreciation political backdrop game read narrative effect read history feel deep concern world see proud showcase heritage want put finish cover cover best ever detail history region politely discuss reason homelessness call ever much", "genres": ["History"], "summary": "An acclaimed, award-winning book on a fascinating subject, recently revised and updated by the author, with a brand new jacket.\r\n\r\nThe Black Sea is at once homage to an ocean and its shores, and an amazingly readable meditation on Eurasian history from the earliest times to the present, evoking the culture, history and politics of the volatile region surrounding the Black Sea.\r\n\r\nAscherson recalls the world of Herodotus and Aeschylus; Ovid’s place of exile; the decline and fall of Byzantium; the Christian Goths; the Tatar Khanates; the growth of Russian power and the centuries of war between Ottoman and Russian empires. And, in our own century, the terrors of Stalinism and its fascist enemy, striving for control of these colourful and complex shores.\r\n\r\nIn this story of Greeks, Scythians, Samatians, Huns, Goths, Turks, Russians and Poles, we come to know and understand the sea where Europe ended and “barbarism” was born.", "asin": "1784700916", "rank": "4763908", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51eIUJYuzmL.jpg", "country": "Turkey", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}