{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 0, "rating": 0.0}, "authors": ["Lonely Planet"], "isbn": "1786579367", "longitude": 0.0, "periods": ["Recent Releases"], "title": "Best of Vietnam (Travel Guide)", "word_cloud": "", "genres": ["Travel Writing", "Guide Books"], "summary": "Lonely Planet Best of Vietnam, our easy-to-use guide, filled with inspiring and colorful photos, focuses on Vietnam’s most popular attractions for those looking for the best of the best.\r\n\r\nIt's  your passport to the most relevant, up-to-date advice on Vietnam’s top experiences. Float through misty Halong Bay, hike around Sapa Valley, or bike through Hoi An; all with your trusted travel companion. Discover the best of Vietnam and begin your journey now!\r\n\r\nInside Lonely Planet Best of Vietnam:\r\n\r\nFull-colour maps and images throughout Highlights and itineraries help you tailor your trip to your personal needs and interests\r\n\r\nInsider tips to save time and money and get around like a local, avoiding crowds and trouble spots\r\nEssential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices\r\n\r\nHonest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss.\r\n\r\nCultural insights give you a richer, more rewarding travel experience - history, festivals, cuisine, architecture, religion, environment, wildlife, painting, literature, film\r\n\r\nFree, convenient pull-out Hanoi and Ho Chi Minh City maps (included in print version), plus over 60 colour maps.\r\n\r\nCoverage includes: Hanoi, Halong Bay, Sapa, Hue, Hoi An, Mui Ne, Dalat, Con Dao Islands, Ho Chi Minh City, Mekong Delta and more", "asin": "1786579367", "rank": "219508", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/51cq1ztYiwL.jpg", "country": "Hanoi", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}