{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 41, "rating": 4.1, "reviews": [{"review_sentiment": 3.0, "review_text": "ok"}, {"review_sentiment": 5.0, "review_text": "Classic book for all the bookworms out there"}, {"review_sentiment": 5.0, "review_text": "This book was an assigned reading for an English class that I had. I have to admit, I was concerned given that it is the oldest book I've ever read. I'm surprised at how much I loved this book. There are tons of articles online that go in depth on the imperialism, and having read it in depth, I learned a lot about that perspective. I would encourage anyone who likes to read, to read this book. It is an easy read, and the characters are not too complex."}, {"review_sentiment": 5.0, "review_text": "Excellent reading"}, {"review_sentiment": 2.0, "review_text": "Boring and a slow read"}, {"review_sentiment": 3.0, "review_text": "Somewhat creepy and depressing."}, {"review_sentiment": 4.0, "review_text": "Quite a good read."}, {"review_sentiment": 5.0, "review_text": "Awesome Victorian gothic/sensational fiction!"}, {"review_sentiment": 4.0, "review_text": "Wow!  A must-read for any Victorian horror fan.This novel does have that particular British xenophobic \"Oriental mysticism\" thing going on that Wilkie Collins and Rudyard Kipling are also guilty of.  It's a bit fainter than in the works of those other two authors and pretty level-headed for having been written 3 or 4 decades into the English occupation of India.There are some pretty shocking and disturbing details that surface toward the end of the book, more like what you might expect from a 70's pulp novel.  I haven't looked up the history of The Beetle's publication, but it seems really surprising that it made it to print at all.  Or maybe people were openly discussing sex way before I thought they were.The style of the horror in this book is totally different from anything I can think of from the 1800's.  It has some Kafka-like \"speculative\" horror about it (I don't just mean because of the man-beetle) and then will abruptly snap back to polite, sane Victorian society in the next chapter."}, {"review_sentiment": 5.0, "review_text": "It's a classic!  What a treat to receive such an enjoyable book at no charge from Amazon for Kindle readers.  I'd like to thank the publisher for generously providing the material free of charge."}]}, "authors": ["Richard Marsh"], "isbn": "1840226099", "longitude": 31.243666, "periods": ["1800s"], "title": "The Beetle", "word_cloud": "ok classic bookworm assign read english class admit concern give oldest ever surprise much love ton article online depth imperialism depth learn lot perspective anyone like easy character complex excellent reading somewhat creepy depress quite good victorian fiction victorian horror particular british mysticism thing go also guilty bite fainter work author pretty write decade english occupation pretty shock disturb detail surface end pulp look history publication seem really surprising make print maybe people openly discuss sex way think style horror totally different anything think speculative horror mean abruptly snap polite sane victorian society chapter classic treat receive enjoyable charge reader like thank publisher generously provide material free charge", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "'I saw him take a different shape before my eyes. His loose draperies fell about him...and there issued out of them a monstrous creature of the beetle tribe...'\r\n\r\nFrom out of the dark and mystic Egypt come The Beetle, a creature of horror, 'born of neither God nor man', which can change its form at will. It is bent on revenge for a crime committed against the devotees of an ancient religion. At large in London, it pursues its victims without mercy and no one, it seems, is safe from its gruesome clutches.\r\n\r\nRichard Marsh's weird, compelling and highly original novel, which once outsold Dracula, is both a horror masterpiece and a fin de siecle melodrama embracing the fears and concerns of late Victorian society. Long out of print, The Beetle is now available in this Wordsworth edition, ready to chill you to the marrow and give you nightmares.", "asin": "1840226099", "rank": "1425656", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/41qBc1Yuq2L.jpg", "country": "Egypt", "story_arc": ["Tragedy", "Things only get worse"]}