{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 1175, "rating": 3.7, "reviews": [{"review_sentiment": 4.0, "review_text": "Incredible condition! Now I finally have the classic I always planned to read."}, {"review_sentiment": 1.0, "review_text": "I saw other reviews warning me about the format and I should have followed them. A single page is enormous and just reading to the end of one line feels exhausting compared to other books. It is not thick and not compact and quite flimsy and bulky. I should return it but I'll probably give it away and go to a physical store to try again."}, {"review_sentiment": 5.0, "review_text": "Good read."}, {"review_sentiment": 1.0, "review_text": "Should be illegal for someone to sell such books!!! No publisher and the first page starts when you open the book. Extremely poor quality... black market type book. Amazon should not allow this."}, {"review_sentiment": 2.0, "review_text": "The Kindle edition doesn't have page, or even line, breaks for each episode, and the footnotes and scans are often misaligned, i.e. the link to a footnote for something at the top of page leads to a footnote for something from the previous page. Some of the footnote stars aren't even hyperlinks, just a character added to the end of the sentence, which seems strange for an edition that aims to preserve the original print run's text. I'm assuming in the print edition they don't add footnotes at the start of each episode, but it would be useful if they added them in this edition if they're not going to show where each section starts."}, {"review_sentiment": 1.0, "review_text": "Very difficult to read it and didn't make very much sense to be total waste of my time"}, {"review_sentiment": 1.0, "review_text": "An illiterate, underbred book it seems to me, the book of a self-taught working man, and we all know how depressing they are."}, {"review_sentiment": 5.0, "review_text": "This book is a classic for good reason, but you have to understand Joyce a little before reading it.  Start with something simple like Dubliners (collection of short stories plus a novella  (The Dead)) to get used to his cadence and weirdness.  Only them should you attempt Ulysses, but get a friend to read it to you, taking turns at every subheading.  That way you can both hear the music, which is a lot like acid rock."}, {"review_sentiment": 3.0, "review_text": "didnt realize it was condensed....but it worked out"}, {"review_sentiment": 1.0, "review_text": "Do not purchase this book new from Amazon. The print is microscopic. I have 20/20 vision and was squinting to read it. It's a new book printed by Amazon with a small type to minimize page count. I get that. Maximize profit. But please don't render the book unreadable in the process."}]}, "authors": ["James Joyce"], "isbn": "1840226358", "longitude": -6.2602732, "periods": ["1900s"], "title": "Ulysses", "word_cloud": "incredible condition now finally classic always plan saw review warn format follow single page enormous read end line feel exhaust compare thick compact quite flimsy bulky return probably physical store try good someone publisher first page start open extremely poor quality black market type allow edition page even line break episode footnote scan often misalign link footnote something top page lead footnote something previous page footnote star even hyperlinks character added end sentence seem strange edition aim preserve original print run text assume print edition footnote start episode added edition go show section start very difficult much sense total waste time illiterate under bred seem work man know depress classic good reason understand little read something simple collection short story novella dead get use cadence weirdness only attempt get friend taking turn subheading way hear music lot acid rock dint realize condense worked new print microscopic vision squint new print small type minimize page count get maximize profit please render unreadable process", "genres": ["Fiction & Literature"], "summary": "One of the most important works of modernist literature, James Joyce’s \"Ulysses\" was originally published in serial format from 1918 to 1920 and then published in a single edition in 1922, which this edition is drawn from. \"Ulysses\" chronicles the passage of Leopold Bloom through Dublin during an ordinary day, June 16, 1904. \r\n\r\nWhile the novel appears largely unstructured at first glance it is in fact very closely paralleled to Homer’s \"Odyssey\", containing eighteen episodes that correspond to various parts of Homer’s work. Filled with experimental forms of prose, stream of consciousness, puns, parodies, and allusions that Joyce himself hoped would “keep the professors busy for centuries arguing over what I meant”. \r\n\r\nThis expansive work is considered one of the great works of English literature and a must read for fans of the modernist genre. Annotated by critical introduction about the author.", "asin": "1840226358", "rank": "185270", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/51izRew5cqL.jpg", "country": "Ireland", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}