{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 29, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "Nothing else to say, it's good."}, {"review_sentiment": 5.0, "review_text": "Leonardo Padura tells superb stories.  Saw “Four Seasons” on netflix and was hooked.  Have read everything he has written and is “after Ernest Hemingway” in his telling."}, {"review_sentiment": 5.0, "review_text": "The best advice when setting out on a career is to follow your passions and Leonardo Padura, together with his literary alter ego Mario Conde, has done this to spectacular effect in \"Adios Hemingway\".  Conde is a well established figure in the Padura canon with four previous outings, but here he appears as an ex cop and would be writer.  What better challenge than to be asked by his former police colleague to solve the mystery of a corpse unearthed at the Hemingway Museum at the great man's Cuban home.  The murder dates to the late 50s when an aging Hemingway was struggling with his health, his legacy and his relationships.  Padura / Conde have their own love / hate relationship with Papa and the investigation plays out into a deeply researched and heartfelt reflection on the flawed literary icon.  I know this is a book I will return to in time, to soak up the atmosphere and emotion that necessarily fall victim in a first read of what is also a tense and well paced thriller."}, {"review_sentiment": 5.0, "review_text": "This was a very good read, especially as I was just in Cuba and went to Hemingway\"s home. Well written and I book I did not want to put down."}, {"review_sentiment": 5.0, "review_text": "Wonderful book for Hemingway lovers"}, {"review_sentiment": 4.0, "review_text": "Excellent! Interesting on the myth of the murdered person on Hemingways Casa."}, {"review_sentiment": 5.0, "review_text": "Leonardo is a great writer."}, {"review_sentiment": 4.0, "review_text": "Good reading, well developed plot.  Reviews lots of Hemingway's work and life. Some humorous dialogue between the detective and his friends.  Leonardo Padura is a very good Cuban writer."}, {"review_sentiment": 4.0, "review_text": "Just visited Hemingway's Havana home which made this book more alive. The author wrote as though he were Hemingway. I have not read any of his other books, but I will to see if it was just done on purpose for this book."}, {"review_sentiment": 5.0, "review_text": "I was required to read this book for a trip to Cuba and before I read it I thought it wasn't going to be that good but it was very enjoyable. I ended up flying through it in a few hours. This is a good book for those who love Hemingway and particularly for those who are going to have a chance to visit Hemingway's home in Havana. It's description of the house is extremely accurate and vivid. Even if you are not familiar with Cuba, this is a very enjoyable and unique mystery novel focused on a famous American novelist. Padura is one of the most popular if not the most popular novelist in Cuba right now."}]}, "authors": ["Leonardo Padura"], "isbn": "184195795X", "longitude": -82.3658671, "periods": ["1900s", "Recent Releases"], "title": "Adios Hemingway", "word_cloud": "nothing else say good tell superb story netflix hook everything write tell best advice set career follow passion together literary alter ego do spectacular effect well establish figure canon previous outing appear ex cop better challenge ask former police colleague solve mystery corpse unearthed great man home murder date late age struggle health legacy relationship hate relationship investigation play deeply research heartfelt reflection flaw literary icon know return time soak atmosphere emotion necessarily victim first also tense well pace thriller good especially go home write want put wonderful lover excellent myth murder person great writer good reading well develop plot lot work life humorous dialogue detective friend good writer just visit home make alive author write see do purpose require trip think go good enjoyable end fly hour good particularly go chance visit home description house extremely accurate vivid even familiar enjoyable unique mystery focus famous american novelist popular popular novelist right", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "Padura Fuentes — one of Cuba's best-known and most widely acclaimed writers — has written a first-rate detective story set against the backdrop of Hemingway's Cuba. Part fascinating examination of Hemingway the man in his trying final years and part nifty postmodern procedural, Adios Hemingway will engross Hemingway fans while keeping them in suspense until the final pages.", "asin": "184195795X", "rank": "797987", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/517au1cJVfL.jpg", "country": "Cuba", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}