{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 13, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "As noted by several other readers, this is not an easy read.  If you are looking for pulp fiction, look elsewhere.  As with most things in life, if it is easy, it is probably not worth doing.  That being said, once you get used to the somewhat stilted and awkward voice of the protagonist (some of this is perhaps intentional for historical and character-building effect, but I have a feeling the translation contributes another layer of awkwardness), you will not be sorry you stuck with this eye-opening read to the very end.  Carefully recreated details and the perspective of the protagonist really recreate not only the historical stage and physical setting, but also the inner psyche of the characters and their time and place.  Historical books rarely give such a palpable impression of what daily life was like in the past, and this book addresses that gap at the level of all five senses.SPOILER PLOT WARNING:The final chapter of the book, including all the elements of suspense leading up to it, portray the ravages of the plague and its final death throes in perhaps the most imaginative and poetic language I have yet to come across.  Bravo to Ms. Matton for having the mindfulness and empathy necessary to bear witness to so much suffering, and the eloquence with which to convey it so successfully to her readers."}, {"review_sentiment": 5.0, "review_text": "My wife loved the book's detailed tale of life in 16th century Amsterdam"}, {"review_sentiment": 5.0, "review_text": "This is a wonderful account of what it must have been like to live in Rembrandt's time as well as what itwas to live with him. It's fact driven but beautifully described. A treasure!"}, {"review_sentiment": 5.0, "review_text": "I had read a little about Rembrandt and was very curious to learn more. This book fit the bill perfectly. Well researched and nicely written. May be slightly biased towards Rembrandt ... but that's okay ... He was a very nice person who created many paintings in order to stay financially afloat (barely). Now when I go to a museum and see a \"Rembrandt,\" I will have the back-story in my head and that will be enlightening."}, {"review_sentiment": 3.0, "review_text": "This book is written in a way that is hard to follow - but worth the time to do so. It gave me a picture of Amsterdam and how people lived in Rembrandt's time.  We will be traveling there soon and that is why I ordered it.  It will give my trip more meaning."}, {"review_sentiment": 5.0, "review_text": "I was fascinated by the title of the book and it took a while to find it. It was worth the search.  Based on numerous sources, the author,  Sylvie Matton, has produced a fascinating tale of the lives of Rembrandt and his mistress Hendrickje Stoffels, as related through Stoffels eyes and thoughts. Stoffels left no traces of her life because she could neither, read nor write because girls weren't allowed the privilege.  For the last years of Rembrandt's life he loved, painted and fathered a child, Cornelia,  with his twenty-year-old house maid, Hendrickje Stoffels. He was 43-years old and widowed with a son, Titus. Titus was born in 1642, but Rembrandt's wife Saskia died a few months later. Geetje Dircx was hired as Titus' drynurse, but after Saskia's death, become Rembrandt's model and lover. She and Rembrandt apparently ceased to be lovers, however she stayed to become head of his household staff.  Hendrickje had left her family, over her mother's protests and journeyed to Amsterdam to  become one of his housekeepers.  But, in just a matter weeks she become his model, lover and pregnant.  Their affair is complicated when Geetie becomes livid and storms out of the house. But Rembrandt refuses a demand of the church council to marry Stoffels. The refusal turns their lives into a turmoil. The story takes the reader through an inside look at the painter's life, the morals of the period and life and death in a city stricken by the Black Plague, all through the voice of Hendrickje.  It makes for a fascinating story. I don't think you'll be disappointed."}, {"review_sentiment": 3.0, "review_text": "Sylvie Matton presents an unusual story, fictional in all its moment to moment detail, but true and exquisitely researched throughout. The \"whore\" is Hendrickje Stoffels, the woman who lived with Rembrandt during the hardest years of his life, modeled for him, and bore a child with him. Today, no one would think much of the live-in arrangement. Then, the couple and Hendrickje in particular came in for censure from civil and church authorities, and from the art-buying public. Matton's story presents a sensitive, if speculative rendering of Rembrandt's slide in bankruptcy after the death of his first wife. That slide ended in his possessions being auctioned off by his debtors. For all practical purposes, he was stripped of the legal right to property, and lived in Hendrickje's receivership.Matton's writing gives two different impressions. As a whole, the book presents a clear progression through late years of Rembrandt's life. The story is well informed by the body of primary documents and scholarship about the artist's life, down to minutiae of how the painting oils would be prepared. The story seems solid and all of a piece. At the finer level, though, the writing style has a pointillist character. For pages at a time, no two conescutive paragraphs relate directly to each other. Instead of a clear image plane, the isolated elements act like facets of a jewel, each with a different orientation but fitted together into some larger whole.Although interesting and well researched, I have reservations about Matton's attempt to channel Hendrickje's spirit. Perhaps the author has done an good job of reconstructing the protagonist's inner life. Perhaps not - Hendrickje lived in such a distant time and social milieu that her personal experience of her daily life can never be recovered in its entirety. Still, it makes for an interesting excercise in research and conjecture.-- wiredweird"}, {"review_sentiment": 5.0, "review_text": "This is a great little book. I enjoyed it tremendously.  It brings the artist to life and shows how life with the Rembrandt felt like for Hendrickje, a country girl who became Rembrandt's common law wife.  The book shows how it was to live in Amsterdam back in the mid-1600s, in all the little details.  It is also a study of the intricate social structures which dominate small communities everywhere.  The book is thick with atmosphere and envelopes the reader in another age showing what it must have felt like to live with a genius, at the time of the Plague, and submerged in religious bigotry.  It also artfully weaves into the story the feelings of a good woman as she copes with her love, her passions, people, misunderstanding, prayer and fears.  A great read for those interested in Rembrandt and Holland during the 1600s.  I read the book in the silence of my room, alone, so nobody could lurch me out of that atmosphere and that age !"}, {"review_sentiment": 2.0, "review_text": "REMBRANDT'S WHORE takes place during the second half of Rembrandt's life, in Amsterdam.  It tells the story of Hendrickje Stoffels, a 20 year old girl who moves in from the country, in order to serve as maid in Rembrandt's household.Rembrandt has her pose for his paintings, and soon falls in love with her.  Because of a contract he has signed, regarding not being able to marry after his former wife's death, at the expense of having to pay a sum which he does not posses, he is not able to marry her, and thus she becomes his \"whore\".From a historical perspective, we are exposed to war, the plague, religious intolerance, and politics.  All of these factors play important roles as they compose the background of the story.The second half of Rembrandt's life was characterized by bankruptcy, illness, and his downfall from Amsterdam's best known painter to his being exploited by various political figures, who took advantage of his precarious situation. Hendrickje stands by him and provides him with care, emotional support, and a child, Cornelia.It is because of her that Rembrandt is able to live, having lost his wife Saskia and children in a tragic manner.The plot is well conceived and interesting.I was unpleasantly surprised by the book's form.  REMBRANDT'S WHORE is basically a monologue by Hendrickje, sometimes in first person, and others in second, as she talks directly to Rembrandt.  Quite franky, the novel is often confusing.Also, due to the fact that  a 20 year old, practically illiterate, peasant girl narrates the story, the novel's flow is absolutely nonexistent.  This makes it difficult to read and quite franky boring.I have read quite a few biographical novels regarding the lives and times of famous painters, and this one rank's pretty low, and cannot be compare this to other books of the same genre.  A specific example is Irving Stone's LUST FOR LIFE, about Vincent VanGogh.  Now, that's a masterpiece....."}, {"review_sentiment": 3.0, "review_text": "Told from the point of view of Hendrickje Stoffels, Rembrandt's mistress, paragraphs in dark and darker colors, like Rembrandt's own brush strokes paint a picture of mid 17th century Amsterdam and the second half of the life of Rembrandt. It's a time of plauge, war, floods, superstition and religious intolerance.Suffering after the deaths of his three small children and wife Saskia, Rembrandt finds solace in the arms of Hendrickje, a beautiful servant in his household, 23 years his junior. He never marries her (thus the name given to her by the towns people, \"Rembrandt's whore\") but clearly loves her, as he loves the child they have together as well as his beloved Titus, son of Saskia.Written in a deliberately obtuse style with shifting points of view we are told of an endless succession of visitors to the Rembrandt household, as well as providing laborious information on his bankcruptcy and the loss of  his house, his paintings and other possessions. Interspersed with this are amorphous descriptions of his paintings that can only be deciphered by those completely familiar with the Rembrandt oeuvre. This book is essentially boring and confusing."}]}, "authors": ["Sylvie Matton"], "isbn": "1841953229", "longitude": 4.8936041, "periods": ["Recent Releases", "1500s"], "title": "Rembrandt's Whore", "word_cloud": "noted several reader easy look pulp fiction look elsewhere thing life easy probably say get use somewhat stilted awkward voice protagonist perhaps intentional historical effect feel translation contribute layer awkwardness sorry stuck end recreate detail perspective protagonist really recreate historical stage physical setting also inner psyche character time place rarely give palpable impression daily life past address gap level warn final chapter include element suspense lead portray ravage plague final death throe perhaps imaginative poetic language yet come mindfulness empathy necessary bear witness much suffer eloquence convey successfully reader wife love detailed tale life century wonderful account live time well twas live fact drive beautifully describe treasure little rembrandt curious learn fit bill perfectly well research nicely write slightly bias towards nice person create many painting order stay financially afloat barely now go museum see head enlighten write way hard follow worth time give picture people live rembrandt time travel soon order trip meaning fascinate title take worth search base numerous source author produce fascinate tale life mistress relate eye thought leave trace life write girl allow privilege last year life love paint fathered child house maid old widow son bear wife die month later hire dry nurse death become model lover apparently cease lover however stay become head household staff leave family mother protest journey housekeeper matter week become model lover pregnant affair complicate become livid storm house refuse demand church council marry refusal turn live story take inside look painter life moral period life death city stricken voice make fascinate story think disappointed present unusual story fictional moment moment detail true exquisitely research woman live hardest year life model bore child much arrangement then couple particular come censure civil church authority public story present sensitive speculative render slide bankruptcy death first wife slide end possession auctioned debtor practical purpose strip legal right property live write give different impression whole present clear progression late year life story well inform body primary document scholarship artist life minutia paint oil story seem solid piece finer level write style pointillist character page time consecutive paragraph relate directly instead clear image plane isolate element facet jewel different orientation fit together larger interest well research reservations attempt channel spirit perhaps do good job reconstruct protagonist inner life perhaps live distant time social milieu personal experience daily life never recover entirety still make interesting exercise research wired weird great little enjoy tremendously bring artist life show life felt country girl become common law wife show live back little detail also study intricate social structure dominate small community everywhere thick atmosphere envelop age show live genius time submerge religious bigotry also artfully weave story feeling good woman cope love passion people misunderstand prayer fear great interested silence room alone nobody atmosphere age take place second half life tell story year old girl move country order serve maid pose painting soon fall love contract sign regard able marry former wife death expense pay sum posses able marry thus become historical perspective expose war plague religious intolerance politics factor play important role compose second half life characterize bankruptcy illness downfall best know painter exploit various political figure take advantage precarious situation stand provide care emotional support child able live lose wife child tragic plot well conceive unpleasantly surprised form basically monologue sometimes first person others second talk directly frank often due fact year old practically illiterate peasant girl narrate story flow absolutely nonexistent make difficult quite frank quite biographical novel regard life time famous painter rank pretty low compare genre specific example now masterpiece tell point view mistress paragraph dark darker color brush stroke paint picture mid century second half life time plague war flood superstition religious death small child wife find solace arm beautiful servant household year junior never marry thus name give town people clearly love love together well beloved son deliberately style shift point view tell endless succession visitor household well provide laborious information bankruptcy loss house painting possession intersperse amorphous description painting decipher completely familiar oeuvre essentially boring confuse", "genres": ["Fiction & Literature", "Romance", "Historical Fiction"], "summary": "This internationally acclaimed novel is the fictional monologue of Hendrickje Stoffels, Rembrandt's mistress, with whom he spent the last twenty years of his life. This is her story.\r\n\r\nA sensitive innocent, Hendrickje escapes the harsh realities of her garrison hometown to become a servant in Rembrandt's household. She soon becomes his lover and closest confidante, filling the void in his life resulting from the death of his wife and two of their children. \"Reborn at twenty\" in Rembrandt's studio as his model and lover, and enlightened by the positive values of beauty, truth, love, and art, Hendrickje is fated to discover the hypocrisy and fickleness of Amsterdam society, which ostracizes her and precipitates Rembrandt's final collapse.\r\n\r\n\"A work of unobtrusive beauty, unforgettably true and poignant.\" Le Figaro", "asin": "B0046GZ4PK", "rank": "9252283", "city": "Amsterdam", "image": "", "country": "The Netherlands", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}