{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 27, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Ignore the reviews which mistake this book for one written by Sarah Bradford - this one is by a completely different author, Maria Bellonci."}, {"review_sentiment": 5.0, "review_text": "This ,and the Erlanger book are the best biographies of Lucrezia Borgia that I have read. Fair-minded,and less familiar in tone,than Erlanger,both deny the bad reputation Lucrezia  has had for years. Highly recommended."}, {"review_sentiment": 3.0, "review_text": "Not nearly as interesting as the Showtime series"}, {"review_sentiment": 4.0, "review_text": "This book is filled with all kinds of interesting and factual information about the Borgia Family.  The first half of the book is mostly about the Pope Alexander VI and the Borgia boys and men but it does explain a lot about Lucrezias' early life and background. The second half of the book is about Lucrezia and Ceasera  The book has been throughly researched and is very impressive in its facts.  That being said it's kind of a hard read, like a college book that would be useful if you were writing a paper on the Borgias.  It was a little dry but I found that was so interesting that I wanted to keep reading.  I did find that many times I wasn't sure who  Ms. Bradford was talking about because there are so many important characters and she doesn't always make it clear who the actor is she's talking about.  This isn't the easiest book to read but if you are interested in the Borgia family this is probably one of the most researched and factually accurate books you will find.  It was a little slow going but very informative and interesting.  I recommend it."}, {"review_sentiment": 4.0, "review_text": "A disclosure of Lucrezia Borgia as a very intelligent woman thrust into the political and religious period of the 16th century. It was a book of beautiful and brutal history and sadness, opulence and deprivation, justice and betrayal. Most of all it was the history of human beings love affairs and the lives of true spirited peoples."}, {"review_sentiment": 3.0, "review_text": "The book is more of a textbook, it isn't very easy to read. I have made the horrible mistake of picking this book for a school project and this was the worst possible book I could pick. it is great if you like to analyze stuff but other than that it is really sort of a horrible book. I guess it is that way since it was written in 1939, just a heads up."}, {"review_sentiment": 3.0, "review_text": "Written in a very chatty, gossipy style which is often rather intrusive. Bellonci uses a lot of imagination to decide what Lucrezia \"must\" have been thinking, or doing, or feeling. In large part this is because there obviously isn't a lot of first person writings that she left behind to draw from, therefore imagination is about all there is to work with. There just isn't much in the way of facts, so aside from her imagination, she also makes a lot of assumptions (such as the idea that Lucrezia had an illegitimate child, possibly fathered by her brother or her father - yet Bellonci admits that there's no proof as to who the father might have been, if the child even existed). One of the big problems I had is that she included a lot of sentences, quotes from poems, papal bulls, etc. in their original languages - and I neither read nor speak Spanish or Italian, and my high school Latin and French is simply not adequate for translating. (Some things did get a translation, but there was enough that was not to be VERY irritating!)One is left feeling rather bad for poor Lucrezia, however -  she seemed a nice enough person who was slandered by history because the rest of her relatives were nuts."}, {"review_sentiment": 2.0, "review_text": "This was not written in a compelling style. It read like a textbook to me. Facts and data but did not delve into character very deeply."}, {"review_sentiment": 5.0, "review_text": "Since I'm mad about the series The Borgias with Jeremy Irons, I bought this book.  So far, haven't even finished half of it yet, I'm loving it!  It's an interesting read, without being boring!  Wish it had pics though!"}, {"review_sentiment": 5.0, "review_text": "This book took a little while to get here, but I knew that it would and that was O.K.  It is in good shape and the price was wonderful.  I just received it, so I haven`t read it yet.  I know it is highly recommended and reading through it to check the writing style, it looks wonderful!  I recommend the seller."}]}, "authors": ["Maria Bellonci"], "isbn": "184212059X", "longitude": 12.4829321, "periods": ["1500s", "500-1400s"], "title": "Lucrezia Borgia", "word_cloud": "review mistake write completely different author best biography le familiar tone deny bad reputation year recommend not nearly interesting series filled kind interest factual information first half mostly boys men lot early life second half thoroughly research impressive fact say kind hard college useful write paper little dry find interest want keep reading find many time sure talk many important character always make clear actor talk easiest interested family probably research factually accurate little slow go informative interesting recommend disclosure intelligent woman political religious period century beautiful brutal history sadness opulence deprivation justice betrayal most history human being love affair live true spirit people textbook easy make horrible mistake pick school project possible great analyze stuff really sort horrible guess way write head chatty gossipy style often rather intrusive use lot imagination think feeling large part obviously lot first person writing leave draw therefore imagination work much way fact aside imagination also make lot assumption idea illegitimate child possibly father brother father yet admit proof father even existed big problem include lot sentence quote poem papal bull etc original language neither speak spanish italian high school simply translate thing get translation enough very irritate leave feeling rather bad poor however seem nice enough person slander history rest relatives nut write compelling style textbook data delve character deeply mad series buy so far even finish half yet love interest bore wish pic take little get know good shape price wonderful receive yet know highly recommended reading check write style look wonderful recommend seller", "genres": ["Biography", "History"], "summary": "Although she was a daughter of Pope Alexander VI and chiefly remembered as a raven-haired poisoner, Bellonci depicts a passionate woman moving uncertainly through the Papal court and the intrigues, ambitions and political chicanery that swirled about her. Winner of the Viareggio Literary Award and the Galante Prize in Italy in 1953.", "asin": "184212059X", "rank": "2499179", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/5197K94DY6L.jpg", "country": "Italy", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}