{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 11, "rating": 3.5, "reviews": [{"review_sentiment": 4.0, "review_text": "I’ve checked off another Muriel Spark novel from my list.  The word novel is problematic when discussing her fiction.  Much of it is short and this book is no exception clocking in at 144 pages.  I prefer to think of her work as essayistic and employing the fictional form.  We don’t inhabit complex characters who grow over the journey of her novels.  Nor do we inhabit clearly delineated worlds full of smells and ambiance.Many like ‘The Public Image’ take a theme and explore it through a fictional lens.  Here the theme is the tension between a person and their projection.  Annabel is a journeyman actress whose career takes off unexpectedly when she plays a character called the ‘English Tiger-Lady.’She is married to Frederick whose own acting career languishes and he subsequently finds work as a screen writer but is jealous of his wife’s fabulous career. He and his louche best friend Billy O’Brien make cruel fun of Annabel’s intelligence and acting while neither of them amount to much of anything.  They posit the question of whether Annabel’s acting amounts to more than a native charisma that she doesn’t interfere with.Throughout the novel the sense of Annabel both as a person and as a public persona flip back and forth in terms of emphasis and focus.  It isn’t clear how many people in her life care about her as a person or vice a versa.  And Annabel only becomes something other than a public image when it comes to her baby who she clings to as a buffer and finally an escape.Is “The Public Image” a good novel?  Not really but then I don’t think it is meant to be that.  Instead it is an exploration of personality, image and projections.  What do we really know about a person, even someone we think we know well?  People are like quicksilver and behavior you think means one thing means something entirely different to the person in question.The key to understand Spark I believe is her authorial voice.  It is ever assured and in command.  It tells you that no nonsense will be allow in terms of what we know about the plot, the characters and the meaning.  Sure there will be ambiguity and fun but don’t expect hand holding or plaudits for understanding the story.  There is more to her fiction but she will make the reader find it."}, {"review_sentiment": 4.0, "review_text": "The fairly short novella The Public Image (1968) about the difficulties faced by the modestly talented actress Annabel Christopher to maintain her public image in the face of her husband’s malicious attempt to bring her down as part of his suicide, is fairly readable, especially toward the end, where it really takes off. The whole story takes place in Italy amidst its virulent paparazzi culture that kept reminding me of La Dolce Vita: Annabel even gets her first burst of on-screen fame by cavorting in a Roman fountain a la Anita Ekberg.I liked that author Muriel Spark doesn’t simply default to the cheap and easy “everyone’s corrupt” tack, which tends to color many chronicles of show biz life. In fact, one fairly minor but critical character who you’d think would act—very understandably—in an acquisitive way, doesn’t, catalyzing a wonderful dramatic climax. I was going to give this a basic three-star review as a mildly entertaining portrayal of image manipulation games in the mass media world, but the last few chapters bumped it up by giving it a totally unexpected and satisfying twist."}, {"review_sentiment": 1.0, "review_text": "God, what a boring, awful book. John Lydon, in a second rubbish book credited to him but undoubtedly written by somebody else, says he borrowed the title of Spark's thumb-sucker for the name of his post-Pistols band. Big deal. Sparks strong-arms the phrase \"public image\" into almost every third paragraph here, trying hard to make some sort of point. The main character, a Brit actress stuck in Rome with a husband who ends up offing his damn fool self by jumping from a tourist site, is a predictably repressed tea-swilling bore. I hated this book."}, {"review_sentiment": 5.0, "review_text": "The Public Image by Muriel Spark (1969; Virago edition 1979) is a compact story about an actress and her public image. The men in her life – her husband, her producer, and her husband’s friend – spend much of their time managing her public image. The story is set in Rome."}, {"review_sentiment": 5.0, "review_text": "The noted academic & novelist Pamela Hansford Johnston wrote The Unspeakable Skipton in 1959, when the world was a very different place. I first read the book about 20 years ago, and again this week. I enjoyed it greatly both times.Although it is part of a loose trilogy, it is complete in itself.The novel certainly doesn't appear anti-feminist to me. Indeed, most of the male characters are shown to be more or less incompetent rogues completely without awareness of any kind - especially self-awareness. The ladies are treated relatively generously, to my mind. And if the Australian woman poet is based on the person that I suspect, then she has got off very lightly indeed!"}, {"review_sentiment": 4.0, "review_text": "The late Muriel Spark's 'The Public Image' (1968) was the author's second attempt, after the cumbersome 'The Mandelbaum Gate' (1965), to write a successful novel in a radically different mode from that of the highly satirical comic style which made her career.Though Spark's early novels, including 'The Comforters' (1957), 'Memento Mori' (1959), 'The Prime of Miss Jean Brodie' (1961), and 'The Girls of Slender Means' (1963) were both critically and commercially popular, some reviewers came to perceive those novels--and Spark's literary talent--as both \"miniaturist\" and \"twee.\" After 'The Girls of Slender Means,' Spark embarked on a long series of experimental works, not completely returning to her former high style until 'Loitering with Intent' (1981) thirteen long years later.Set in Rome, where Spark was then living, 'The Public Image' is the comparatively simple story of Annabel Christopher, a young actress of average appearance and apparently minor talent who, by some strange cinemagraphic alchemy, transforms into an object of mystery and allure when photographed through the camera of rising Italian film director Luigi Leopardi. Promoted first as a \"Cat-Tiger\" and then as \"the English Lady-Tiger,\" Annabel eventually becomes internationally famous as \"the Lady Tiger\" solely on the basis of her unexpected and newly-manifested screen persona.Spark is ruthless in her early depiction of Annabel: not only is Annabel \"a puny little thing,\" \"a little slip of a thing,\" \"a little chit of a thing,\" and \"mousy,\" she is also \"stupid,\" and openly mocked as such by her lazy, frustrated, and pretentious husband, Frederick, who resents her sudden success, and his best friend, perpetual lay-about Billy O'Brien, both of whom continually taunt Annabel even while allowing her to financially support them in high style.Annabel, who completely lacks the maliciousness of those in her immediate circle, realizes and accepts that she is neither inherently intelligent nor well-educated. However, the hard-working actress carefully maintains her public image not because she is vain, but because she clearly understands that the deception is essential to her continued success in films. Increasingly practical and imbued with the kind of common sense Frederick and Billy lack, at no time does Annabel come to believe the publicity aggressively put forward by the studio.After giving birth to her first child, Annabel slowly comes to realize what is authentically important in her life, even as the destructive forces around her marshal to precipitate her public humiliation and ruin. Though the meaning of the book's climax and final paragraph have been disputed its publication, Annabel's fate is essentially a positive one. Annabel, a kind of slimmer, prettier Mary McGregor and a thus very unlikely Spark heroine, grows and evolves.Spark maintained meticulous control over her own occasionally glamorous public image throughout her lifetime, and thus it's no wonder that she chose to essay the theme in a full-length work.After the enormous success of her first seven novels, Spark suffered through a fairly notorious episode of professional envy at the hands of one-time friend and coauthor Derek Stanford, an episode that provided creative fuel for her last great novel, 'A Far Cry From Kensington' (1988), and which she addressed autobiographically in 'Curriculum Vitae' (1992).At the time of the writing of 'The Public Image,' Stanford's initial published salvos were no doubt still fresh in Spark's mind, which perhaps explain the novel's steely preoccupation with commercial personae, ambition and a professional envy so personally devastating that it erupts into rage, hatred, and both literal and figurative self-destruction."}, {"review_sentiment": 4.0, "review_text": "Daniel Skipton, a British writer of limited talent and possibly even more limited success, pretends to himself and the world that he is a great writer.  He is, in fact, a liar, a chiseler, a boor, and a swindler, as his conduct over the week or so covered in this novel demonstrates.Skipton is ruined in the end, of course.  I do think that the novel had been better had any of the major characters been at all sympathetic; as it is, only Lotte, Skipton's landlady's daughter, who knits socks for him and brings his meals to his room is at all appealing."}, {"review_sentiment": 5.0, "review_text": "I am a bit reluctant to express an opinion about this short but deeply satisfying novel, first published in 1968, because it does not seem to me to be a satire. I can see that perhaps _The Prime of Miss Jean Brodie_ is a  satire, and _The Abbess of Crewe_ surely is. Most of Spark's work is short  and has considerable bit. She herself labeled _The Public Image_ \"an  ethical shocker,\" but I'm even less sure of what that means than I am  whether the book is intended to satirize or portray a rising film star  whose public image is threatened. I also don't agree with the  cover description of Annabel having \"made the fatal mistake of  believing her public image.\" It seems to me that she knows what that  image is and how to maintain it and recognizes the rewards she reaps from  it, but that she has not confused her self with her image/typical role. The two main adult female characters are admirably poised and  fully ethical. The two main male characters are needy, greedy heels jealous  of Annabel's success. There is a harridan female child and some  professionally supportive males (a director and a lawyer), so it's not  entirely women good men bad, but the bad men are very destructive indeed. The local (Roman) color is amusing and the ending is very  satisfying. Also I read the book from cover-to-cover in less time than a  recording of Puccini's \"Turandot.\""}, {"review_sentiment": 4.0, "review_text": "I can understand why this book is not particularly popular; it is certainly not the first book one should read of Johnson. But it does have its moments, and could reasonably compare to humorous genre fiction and  light romance. But if you can get into it, it's not so bad, and I for one  was not offended by it."}, {"review_sentiment": 2.0, "review_text": "As a feminist I found this book troubling. Ms Johnson's humor is unimpressive, and her narrative will prove offensive to most women who believe that males are making women's writing somehow secondary and unimportant. It is very frustrating indeed."}]}, "authors": ["Muriel Spark"], "isbn": "1844089673", "longitude": 12.4829321, "periods": ["1900s"], "title": "The Public Image", "word_cloud": "check list word problematic discuss fiction much short exception clock page prefer think work essayist employ fictional form inhabit complex character grow journey novel inhabit clearly delineate world full smell theme fictional lens here theme tension person projection journeyman actress career take unexpectedly play character call marry act career languishes subsequently find work screen writer jealous wife fabulous career louche best friend make cruel fun intelligence act amount much anything posit question act amount native charisma interfere sense person persona flip back forth term emphasis focus clear many people life care person vice versa become something come baby cling buffer finally good not really think mean instead exploration personality projection really know person even someone think know well people quicksilver behavior think mean thing mean something entirely different person key understand believe authorial voice ever assure command tell nonsense term know plot character mean sure ambiguity fun expect hand hold plaudit understand story fiction make find fairly short difficulty face modestly talented actress maintain face husband malicious attempt bring part suicide fairly readable especially end really take whole story take place midst virulent paparazzo culture keep remind even get first burst fame cavort fountain la like author simply default cheap easy everyone corrupt tack tend color many chronicle show biz life fact fairly minor critical character think way catalyze wonderful dramatic climax go give basic review mildly entertaining portrayal manipulation game mass medium world last chapter bump give totally unexpected satisfy twist bore awful second rubbish credit undoubtedly write somebody else say borrow title name band deal spark phrase almost third paragraph try hard make sort point main character actress stick husband end off damn fool self jump tourist site predictably repress bore hat edition compact story actress men life husband producer husband friend much time manage story set noted academic novelist write world different place first year week enjoy greatly part loose trilogy complete certainly appear indeed male character show le incompetent rogue completely awareness kind especially lady treat relatively generously mind australian woman poet base person suspect get lightly indeed late author second attempt cumbersome write successful radically different mode highly satirical comic style make early novel include critically commercially popular reviewer come perceive novel literary talent miniaturist twee embark long series experimental work completely return former high style thirteen long year live comparatively simple story young actress average appearance apparently minor talent strange cinema graphic alchemy transforms object mystery allure photograph camera rise italian film director first eventually become internationally famous solely basis unexpected screen ruthless early depiction puny little thing little slip thing little chit thing mousy also stupid openly mock lazy frustrate pretentious husband resents sudden success best friend perpetual continually taunt even allow financially high completely lack maliciousness immediate circle realize accept inherently intelligent however actress carefully maintain vain clearly understands deception essential continue success film increasingly practical imbue kind common sense lack time come believe publicity aggressively put forward give birth first child slowly come authentically important life even destructive force marshal precipitate humiliation ruin mean climax final paragraph dispute publication fate essentially positive kind slimmer prettier thus unlikely heroine grows maintain meticulous control occasionally glamorous lifetime thus wonder chose essay theme enormous success first novel suffer fairly notorious episode professional envy hand friend coauthor episode provide creative fuel last great address autobiographically time write initial publish salvo doubt still fresh mind perhaps steely preoccupation commercial persona ambition professional envy personally devastate erupts rage hatred literal figurative writer limit talent possibly even limited success pretend world great writer fact liar chiseler boor swindler conduct week cover ruined end course think better major character sympathetic landlady daughter knit sock bring meal room appeal bite reluctant express opinion short deeply satisfy first publish seem satire see perhaps satire surely most work short considerable bit label ethical shocker even le sure mean intend satirize portray rise film star threaten also agree cover description make fatal mistake believe seem know maintain recognize reward reaps confuse role main adult female character admirably poise fully ethical main male character needy greedy heel jealous success harridan female child professionally supportive male director lawyer entirely woman good men bad bad men destructive indeed local color amuse end satisfy also le time record understand particularly popular certainly first moment reasonably humorous genre fiction light romance bad offend feminist find trouble humor unimpressive narrative prove offensive woman believe male make woman write somehow secondary unimportant frustrate indeed", "genres": ["Fiction & Literature"], "summary": "The Public Image is a novel published in 1968 by Scottish author Muriel Spark and shortlisted for the Booker Prize the following year.\r\n\r\nIt is set in Rome and concerns Annabel Christopher, an up-and-coming film actress. Annabel carefully cultivates her image to keep her career on course, managing to mask her lack of talent. But she reckons without her husband Frederick's loathing of his wife's manipulations and inexplicable success for which he plans his final revenge.\r\n\r\nThe novel inspired the name of the band Public Image Ltd., which John Lydon formed in 1978 following the breakup of the Sex Pistols.", "asin": "1844089673", "rank": "19632883", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51Kwg-PpO3L.jpg", "country": "Italy", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}