{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 72, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "a very dense book BUT if there is a certain topic you want to know more about then this is the book for you"}, {"review_sentiment": 5.0, "review_text": "Great read before going to Los Angeles"}, {"review_sentiment": 3.0, "review_text": "To be honest, this one is kind of a snooze."}, {"review_sentiment": 5.0, "review_text": "Essential for anyone living in Los Angeles. This book is your history. You need to read this and you need to realize how far the city has come."}, {"review_sentiment": 4.0, "review_text": "Great read the if you are into the counter-culture of southern California. Long read so you must be dedicated to reading it."}, {"review_sentiment": 2.0, "review_text": "Ugggh."}, {"review_sentiment": 5.0, "review_text": "You'll love it after you get it but in the mean time check out rollingbaby.com for all your baby stroller info!"}, {"review_sentiment": 5.0, "review_text": "Amazing!"}, {"review_sentiment": 5.0, "review_text": "Item arrived as described. Great book!"}, {"review_sentiment": 5.0, "review_text": "Recommend. Great read!"}]}, "authors": ["Mike Davis"], "isbn": "1844675688", "longitude": -118.244476, "periods": ["1900s", "2000s"], "title": "City of Quartz: Excavating the Future in Los Angeles", "word_cloud": "dense certain topic want know go kind snooze essential anyone live history need far southern dedicate reading ugh love mean time baby stroller info amaze arrive described", "genres": ["History", "Urbanism"], "summary": "No metropolis has been more loved or more hated. To its official boosters, “Los Angeles brings it all together.” To detractors, LA is a sunlit mortuary where “you can rot without feeling it.” To Mike Davis, the author of this fiercely elegant and wide- ranging work of social history, Los Angeles is both utopia and dystopia, a place where the last Joshua trees are being plowed under to make room for model communities in the desert, where the rich have hired their own police to fend off street gangs, as well as armed Beirut militias. \r\n\r\nIn City of Quartz, Davis reconstructs LA’s shadow history and dissects its ethereal economy. He tells us who has the power and how they hold on to it. He gives us a city of Dickensian extremes, Pynchonesque conspiracies, and a desperation straight out of Nathaniel West a city in which we may glimpse our own future mirrored with terrifying clarity.\r\n\r\nIn this new edition, Davis provides a dazzling update on the city’s current status.", "asin": "1844675688", "rank": "99169", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/511YBouSJJL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}