{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 22.2793278, "ratings": {"num_ratings": 20, "rating": 4.2, "reviews": [{"review_sentiment": 2.0, "review_text": "Facts are covered and interesting perspective but not well written."}, {"review_sentiment": 5.0, "review_text": "As a Hongkonger, I have never imagined the history of my birth place is so rich and vibrant.  This book gave me an insight to why I think, feel and act the way I do.  It makes up for the omission of such vibrant history in my early education.  A must read for Hongkonger."}, {"review_sentiment": 3.0, "review_text": "Decent overview of Hong Kong history. If you don't know anything about Hong Kong, this would be a good book to start with. I was hoping for a lot more though--I would skip it if you're already familiar with the broad strokes. It never goes into any real detail."}, {"review_sentiment": 4.0, "review_text": "This is an extremely thorough history of Hong Kong which can make the reading a bit tedious at times, but always informative.  Not only is the book well researched, but I believe that the narrative is very well woven on top of the details.  Tsang does a good job of explaining the rise of Hong Kong in the context of a weak China, especially in the run up to WWII without burdening the reader with an excessive amount of Chinese history (which, although fascinating, would dilute the story of Hong Kong)."}, {"review_sentiment": 4.0, "review_text": "Interesting."}, {"review_sentiment": 5.0, "review_text": "I like it because I like history and this book is writen specifically."}, {"review_sentiment": 5.0, "review_text": "Tsang weaves together a story of Hong Kong that is both easy to read and deeply informed by historical scholarship.  A must for individuals hoping to understand the happenings in Hong Kong today."}, {"review_sentiment": 4.0, "review_text": "Slow reading but very authoratative.  British guy, very detail knowledge about HK.  Answered some questions I had, when I was growing up there."}, {"review_sentiment": 4.0, "review_text": "This does have a odd timeline where it jumps from different times back and forth a bit. I would have preferred a more straight line. It was a good read and I learned a lot of interesting things. It is very much written in a textbook like style and has some other odd writing quirks. Overall it was very enjoyable to learn more about the city and its crazy history."}, {"review_sentiment": 5.0, "review_text": "As a born in HK Chinese shortly after WWII, and lived there for 17 years, this book gave me tremendous insight into my history and heritage. This is a factual, balanced, and well written book which I read with a lot of nostalgia. Thank you professor Tsang."}]}, "authors": ["Steve Tsang"], "isbn": "1845114191", "longitude": 114.1628131, "periods": ["1800s", "1900s", "2000s"], "title": "A Modern History of Hong Kong", "word_cloud": "fact cover interesting perspective well write never imagine birth place rich vibrant give insight think act way make omission vibrant early education overview know anything good hop lot already familiar broad stroke never go real detail extremely thorough make read bit tedious time always informative not well research believe narrative well woven detail good job explain context weak especially run burden excessive amount fascinate story interest like like write specifically weave together story easy deeply informed historical scholarship individual hop understand happening today slow reading authoritative british guy detail knowledge question grow odd timeline jump different time back forth bit straight line good learn lot interesting thing much write textbook style write quirk enjoyable learn city crazy born shortly live year give tremendous insight heritage factual balance well write lot nostalgia professor", "genres": ["History"], "summary": "From a little-known fishing community at the periphery of China, Hong Kong developed into one of the world's most spectacular and cosmopolitan cities after a century and a half of British imperial rule. \r\n\r\nThe history of Hong Kong, from its occupation by the British in 1841 to its return to Chinese sovereignty in 1997, is a fascinating story of East meeting West. This book addresses the changing relations between the local Chinese and expatriate communities in 156 years of British rule, and the emergence of a local identity. \r\n\r\nIt explains the importance of China as a factor in its development and the origins of the so-called \"1997 problems,\" thus analyzing the underlying reasons for the rise of a liberal society committed to the rule of law without democracy.", "asin": "1845114191", "rank": "1026003", "city": "Hong Kong", "image": "https://images-na.ssl-images-amazon.com/images/I/512FGdGjRYL.jpg", "country": "China", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}