{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 4, "rating": 2.9, "reviews": [{"review_sentiment": 1.0, "review_text": "Unless you are a die-hard Selçuk Atun fan, this book is to be avoided."}, {"review_sentiment": 5.0, "review_text": "I like reading different styles from different authors and usually meet with the author through their fiction. In fact in this book author did put himself in it as a side character; not really liked by the protagonist but hey everyone has an alter ego that hates themselves, finds impossible to live with.There is more than one reason why you wouldn't like this book. Too many references, too many name droppings and the two main characters does not even meet till the end and for some people that meeting is short (at least for my father it was). In order to be perfectly objective, if you take out the fact that I am Turkish, I might have not enjoyed this book. If one must give an example, the references were made to the old Istanbul requires at least some faint knowledge of them.However the story line grabs the reader without much effort, and in a way all these references makes the reader feel like an observer rather than connecting with the characters. Probably that will draw more audience in US, since you cannot expect someone to feel connected with any one of the main characters, who live in Turkey and have distinctively different backgrounds than your average Joe."}, {"review_sentiment": 3.0, "review_text": "I read a lot of translated fiction and a lot of crime fiction from around the world, and I regret to report that this semi-thriller from Turkey failed to connect with me. The story unfolds in chapters alternating between the first-person narrations of two very different characters. We meet a 27-year-old heir of a wealthy Turkish family leading s a meandering unfulfilled life of the mind until the death of his overbearing mother is the catalyst for him to dump his fiance and look into the murder of his father a decade and a half earlier.  Meanwhile, the second is a poor orphan who grows up to be a moralistic contract killer. It's revealed in the early pages that the latter happens to be the killer of the former's father, and it's clear that the alternating chapters will eventually climax in a face to face meeting between the two.However, before that happens, there is quite a bit of meandering around the forgotten landmarks, monuments,  gravestones, and neighborhoods of old Istanbul, introspection, literary references galore, and even the postmodern appearance of the author as a fairly significant character in the story. The walking tour of Istanbul is likely to be of limited interest to readers who've not been to the city themselves. The introspection of the various characters is suffused with a kind of melancholy heaviness of spirit known in Turkish as \"huzun\" which weights the whole book down. The literary references (book titles, poems, authors, aphorisms, oh my!) accumulate in such profusion that they become rather obtrusive and overbearing. As for the author's appearance as a character in the story, well, that's either to your taste or isn't. In the end though, while bits and pieces are certainly interesting, there's nothing particularly thrilling about any of it. The author has written several other books, and at least one of these (Many and Many A Year Ago) is now available in English, but my appetite for more certainly wasn't whetted with this one."}, {"review_sentiment": 5.0, "review_text": "In 2003 in Istanbul, fifty three years old widow Dr. Ada Ergenekon dies from cancer.  Her husband renowned mathematician Mursel had been murdered twelve years ago.  Their twenty-seven years old only child Arda feels relief to no longer be under the thumb of his powerful mother; one week after her death he pronounces his freedom by ending his engagement to Jale, who was more acceptable by his late mom than him.On his thirty-seventh birthday, Bedirhan Ozturk gives himself the ultimate present.  He decides to retire from his vocation of twelve yeas as a hired killer.  He is proud of his accomplishments of only taking out those who committed deadly crimes especially against his religion but managed to remain free due to the political cracks.  Bedirhan feels strongly he can quit as he has not taken more than two hits a year.Arda feels a need to track down his father's unknown killer protected by the religious groups.  Bedirhan feels a sense of urgency to track down his unknown handler protected by the religious groups.  Their goals will collide.Several fascinating twists starting with Arda meeting and gaining assistance from novelist Selcuk Altun turn what looks to be a revenge thriller into much more as the audience anticipates the confrontation, but is not sure where the collision will lead to.  Rotating perspective between A for Arda and B for Bedirhan, fans learn of each lead character's back-story with further references to literary and musical multicultural Turkey.  With each chapter the reader feels increasingly a sense of a surrealistic tour of Istanbul inside a colliding universe that represents modern Turkey's struggle to balance religion and secularism.Harriet Klausner"}]}, "authors": ["Selcuk Altun"], "isbn": "1846590531", "longitude": 28.9651646, "periods": ["2000s", "Recent Releases"], "title": "Songs My Mother Never Taught Me", "word_cloud": "fan avoid like read different style different author usually meet author fiction fact author put side character really liked protagonist hey everyone alter ego hat find impossible live reason many reference many name droppings main character even meet till end people meet short least father order perfectly objective take fact turkish example reference make old require least faint knowledge story line grab much effort way reference make feel rather connect character probably draw audience expect someone feel connect main character live distinctively different background average lot translate fiction lot crime fiction world regret report fail story unfold chapter alternate narration different character meet heir wealthy family lead meandering unfulfilled life mind death overbear catalyst dump fiance look murder father decade half earlier meanwhile second poor orphan grow moralistic contract reveal early page latter happen killer former father clear alternate chapter eventually climax face face meeting happen quite bit meander around forget landmarks monument gravestone neighborhood old introspection literary reference galore even postmodern appearance author fairly significant character story walk tour likely limit interest reader city introspection various character suffuse kind melancholy heaviness spirit know huzun weight whole literary reference title poems author aphorisms oh accumulate profusion become rather obtrusive overbearing author appearance character story well either taste end bit piece certainly interest nothing particularly thrill author write several least available appetite certainly whet fifty year old widow die cancer husband renowned mathematician murder year year old child feel relief longer thumb powerful week death pronounces freedom end engagement acceptable late mom birthday give ultimate present decide retire vocation twelve yea hire killer proud accomplishment take committed deadly crime especially religion manage remain free due political crack feel strongly quit take hit feel need unknown killer protect religious group feel sense urgency track unknown handler protect religious group goal fascinate twist start meeting gain assistance novelist turn look thriller much audience anticipate confrontation sure collision lead perspective fan learn lead character reference literary musical multicultural chapter feel increasingly sense surrealistic tour collide universe represent modern struggle balance religion", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "“Altun offers us three delights for the price of one: a brilliantly edgy, witty thriller that rivals Highsmith; a metaphysical puzzle that Borges would be proud to call his own; and a tale of two assassins that conveys, better than any other novel I have read, the way that money talks in Istanbul.”—Maureen Freely\r\n\r\n\"A deft, zinging whodunnit which is also a metaphysical puzzle worthy of the Oulipo group. Altun’s prose has a dreamlike urgency; his novel is a major achievement.\"—John Ashbery\r\n\r\nAfter the death of his overbearing mother, the privileged Arda reclines in his wealth, reflecting on his young life and on the life of his father, the famous mathematician Mürsel Ergenekon, who was murdered on Arda’s fourteenth birthday. While on the other side of the city, “your humble servant” Bedirhan has decided to pack in his ten-year career as an assassin.\r\n\r\nTheir two lives become intrinsically bound in this remarkable thriller that takes us through the streets of Istanbul. We learn that Bedirhan in fact killed Arda’s father, and that they share more in common than he or we could imagine.\r\n\r\nMeanwhile, Selçuk Altun, a former family friend, is playing a deadly game, providing Arda with clues to track down his father’s killer.\r\n\r\nSelçuk Altun was born in Artvin, Turkey, in 1950. He lives in Istanbul, and Songs My Mother Never Taught Me is his fourth novel to be published in Turkish. He is a retired banking executive and a bibliophile.", "asin": "1846590531", "rank": "2513247", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/511ZWFB2UDL.jpg", "country": "Turkey", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}