{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 219, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "I would recommend this book for anyone who wants to learn more about the Roman Empire from beginning to end without having to dive too deep. This book is very accessible, easy to read, and conveys excitement about the topic at hand. If you want a basic overview of the history of Rome, this is a great place to start."}, {"review_sentiment": 5.0, "review_text": "Great for people who love history but not textbooks! Tells some really interesting stories, not the entire history of the empire."}, {"review_sentiment": 5.0, "review_text": "Really interesting book about Roman history. Reads like a novel and really pulls you in."}, {"review_sentiment": 2.0, "review_text": "This author has taken a lot of liberty and judgement. Pretty sure the term conservative is not remotely appropriate here. He has a political agenda. Mr, Baker this is history there is no side to take. Read your bibliography, are you sure you read some of the original documents?  Great interpretive read, but no perspective on reality. Very one sided bent."}, {"review_sentiment": 1.0, "review_text": "Boeing.  Just never got anywhere. I still can't figure out the intent of the author.  Got about 50 pages in and couldn't take anymore."}, {"review_sentiment": 5.0, "review_text": "Great book for a someone unfamiliar with Roman history. The political structure of the republic is wonderfully explained, as are its shortcomings, setting us up for the inevitable run of military dictatorships culminating with the Principate. The best chapter is that which details the Jewish rebellion from the point of view of Josephus and the unlikely yet opportunistic rise of Vespasian and Titus. If there is something missing in the narrative of the book it's the gap between the run of the so-called \"good\" emperors (after Hadrian) up until Diocletian, this period is glossed over rather quickly and it's not completely clear to the reader why the crisis of the mid-3rd century AD occurred. Still, a great read for the newbie."}, {"review_sentiment": 5.0, "review_text": "Great book. I'd known bits and pieces of the history of the Roman Empire, but this book gave me a much fuller picture. If the Pax Romana quelled wars in the greater Mediterranean region, the Romans themselves enjoyed very little of it. There was such a struggle for power between the emperors, the wannabes, the generals, that the internal history of Rome seems to be a history of assassination, rebellion, and revolution.Baker demonstrated that one of the chief causes of turbulence--something that the political powers and usurpers used to their advantage--was the disparity of income between the senatorial class and the plebs. At first I wondered if he was simply importing modern frustrations into an ancient history. But he soon proved his point by his frequent quotation of first sources.Well-worth reading. Baker's writing is crisp, at times dryly humorous, well-paced, always engaging and heavily documented. Highly, highly recommended."}, {"review_sentiment": 5.0, "review_text": "Son is enjoying it."}, {"review_sentiment": 4.0, "review_text": "The best primer on Rome and very readable...which is not very common for true histories like this. Bravo! It was a page Turner!"}, {"review_sentiment": 5.0, "review_text": "Just what I needed. A history of Rome that wouldn't take me a year to complete. Excellent, although it focuses mainly in the military aspect of the Empire. A little more about social policy, habits, natural disasters like Pompey, sexual habits, society and life in general would be appreciated."}]}, "authors": ["Simon Baker"], "isbn": "1846072840", "longitude": 12.4829321, "periods": ["Recent Releases", "0-500s", "Pre Common Era"], "title": "Ancient Rome: The Rise and Fall of An Empire", "word_cloud": "anyone want learn begin end dive deep accessible easy conveys excitement topic hand want basic overview history great place start great people love history textbook really interesting story entire history really interesting history really pull author take lot liberty judgment sure term conservative remotely appropriate political agenda history side bibliography sure original document interpretive perspective reality side bent never get anywhere still intent author page someone unfamiliar history political structure republic wonderfully explain shortcoming set inevitable run military dictatorship culminate best chapter detail jewish rebellion point view unlikely yet opportunistic something miss narrative gap good emperor hadrian diocletian period gloss rather quickly completely clear crisis century occur still great newbie know bit piece history give much fuller picture quell war greater region enjoy little struggle power emperor wannabes general internal history seem history assassination rebellion demonstrate chief cause turbulence something political power usurper use advantage disparity income senatorial class pleb first wonder simply import modern frustration history soon prove point frequent quotation first read write crisp time dryly humorous always engage heavily document highly recommend enjoy best primer readable common true history page just need history year complete focus mainly military aspect little social policy habit natural disaster sexual habit society life general", "genres": ["History", "Ancient Rome"], "summary": "Ancient Rome is the story of the greatest empire the world has ever known. Focusing on six turning points in Roman history, Simon Baker's absorbing narrative charts the rise and fall of a political machine unmatched in its brutality, genius, and lust for power. \r\n\r\nFrom the conquest of the Mediterranean in the 3rd century BC to the destruction of the empire at the hands of barbarian invaders 700 years later, we discover the pivotal episodes in Roman history. At the heart of this account are some of the most powerful rulers in history—men like Julius Caesar, Augustus, Nero, and Constantine. \r\n\r\nPutting flesh on the bones of these legendary figures, Baker looks beyond the dusty caricatures to explore their real motivations, ambitions, intrigues, and rivalries. The superb narrative, full of energy and imagination, is a brilliant distillation of the latest scholarship and a wonderfully evocative account of ancient Rome.", "asin": "1846072840", "rank": "27489", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51-6sS-4g3L.jpg", "country": "Italy", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}