{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 2, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "A very well-written book. A classic for all those who love Istanbul-Constantinople. Many of the places described in the book are still there; however the cosmopolitan atmosphere, the different races living together and the way they lived and interrelated with one another during the second half of the XIXth century already belong to the past. It's better to read it after you have visited Istanbul and are familiar with it; if not you might miss something.My score for De Amicis's thorough lively account of XIXth century Constantinople is clearly 5 out of 5; I cannot think of  a better book on this city, and you can feel that he adored Istanbul. However I finally scored four because the notes at the end are not always totally helpful and some of them are outright wrong. But the actual book is amazing!"}, {"review_sentiment": 4.0, "review_text": "Sometimes those who read too much and have a vivid imagination can conjure up something that smacks of the truth. I was swayed and tossed about by Edmondo's hyperbolic prose, but the awareness that this book represents a mere two or three weeks he spent in the city left me puzzled? Where did he get so many impressions? Where do all these stories come from? As you read the various references throughout this book to previous literature you realize that this book is as much about the literary phenomenon of Constantinople as it is the city he touristed in for a couple weeks. Edmondo is a pastiche artist of genius (think Pinterest: his site would have been awesome!)The anthology of literary references (although the notes indicate these were sometimes wrongly quoted) are nevertheless germane). But there is no question that the mystique of Istanbul/Stamboul/Constantinople is as much about the mood that this city evokes, and above all the phantasmagoric silhouette against the crepuscular or dawn light as it is on any crisp diurnal reality. It's worth reading the book if only for the descriptive verbal symphony as he describes his initial entry into the misted city, and especially the climb up the mountain above Skutari, and watching the city once again manifest itself as a heavy fog lifts.The chapter late in the book where he summons up the history and intrigue of the Topkapi is at once horrendous and enormously alluring. This final set piece of the book that limns Constantinople's dark side in the Seraglio: A sort of Civic Mr. Hyde for the dazzling Doctor Jekyll of her sunlit face.I too have spent less than a few weeks in Constantinople, and it has haunted me all my life.I ought to give it five stars: it's a classic. But really he cribbed a tad too much. And made up more than a little I suspect.Nevertheless,  I have no doubt I will re-read it before I return to The City the next time: perhaps even this summer!"}]}, "authors": ["Edmondo De Amicis"], "isbn": "1847492665", "longitude": 28.9651646, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s", "1500s", "500-1400s", "0-500s", "Pre Common Era"], "title": "Constantinople", "word_cloud": "classic love place describe still however cosmopolitan atmosphere different race live together way live interrelated second half xixth century already belong better visit familiar score lively account xixth century clearly think better city feel adore however finally score note end always totally helpful outright wrong actual amazing sometimes much vivid imagination conjure something smack truth sway toss hyperbolic prose awareness represent mere week spend city left puzzle many impression story come various reference previous literature much literary phenomenon city tourist ed couple week pastiche artist genius think site anthology literary reference note indicate sometimes wrongly quoted nevertheless germane question mystique much mood city evokes phantasmagoria silhouette crepuscular dawn light crisp diurnal reality read descriptive verbal symphony describe initial entry mist city especially climb mountain watch city manifest heavy fog chapter late summons history intrigue horrendous enormously allure final set piece limns dark side sort dazzle sunlit spend le week haunt star classic really crib tad much make little doubt return next time perhaps even summer", "genres": ["History", "Travel Writing", "Ancient Civilizations"], "summary": "One of the most enjoyable accounts of the city ever written, full of teeming life and startling contrasts. Yes, times have changed since 1877, but this complex and vibrant portrait of the city remains recognizable.\r\n\r\nA remarkable 19th-century account of Constantinople that expertly combines personal anecdote, breathtaking visual observation, and entertaining historical information\r\n \r\nEdmondo de Amicis's brilliant look into an integral facet of world history begins with a dazzling description of the city gradually appearing through the fog as the author's ship approaches it through the harbor. His narrative further goes on to provide an invaluable record of Constantinople as it used to be—a fascinating crossroads between Eastern and Western civilization and one of the most cosmopolitan cities of its time—as well as a vivid example of a European tourists' reaction to it—part delight, part incomprehension. This book will provide an enriching read for lovers of history or those planning to visit Istanbul themselves.", "asin": "1847492665", "rank": "2015663", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51wQWtbl4AL.jpg", "country": "Turkey", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}