{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 25, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "5+"}, {"review_sentiment": 5.0, "review_text": "Some great recipes!  I can't pronounce half them, but there are a couple go-to dishes in here that are fantastic.  My favorite is spicy ground lamb mixed with sautéed onions and walnuts, then topped with a fried egg.  Delicious."}, {"review_sentiment": 4.0, "review_text": "Lovely book, though I personally prefer the Greek versions of the same dishes.  But the recipes are clear and still tasty."}, {"review_sentiment": 5.0, "review_text": "I ordered this for my wife, and she cannot submit a review on her account, so I will submit what she wrote about the book. The book was promised a week and more away, but it arrived in three days. Also, it was described as  \"Very Good Condition\", with \"signs of light shelf wear\". It arrived, in fact, in excellent condition, with nothing to differentiate it from a brand new book on a shelf at the store.Here is my wife's review:-----Please Reprint Classic Turkish CookingAlthough few Americans are acquainted with it, Turkish cuisine deserves a reputation as one of the world's finest.  As the French and the Chinese do, the Turks use seasonal ingredients to create imaginative contrasts in flavors and textures.Quite the contrast to the pretentious \"Plenty\" by Ottolenghi (which I have also reviewed) Classic Turkish Cooking offers the following practical tips to ensure good results: Table of Imperial and American Measures Table of English and American Ingredient Terms (courgette vs. zucchini, for example) Many explanatory paragraphs for ingredients commonly used in Turkish cuisine (Charcuterie, Cheese, Fruit, Herbs, Nuts, Olives, etc), listing regional origins and uses.The section on ingredients helpfully suggests how to thicken yogurt into a soft cheese, how to choose the type of oil best for the cooking process as well as to complement the other ingredients, and how to choose the best fruit and vegetables.  I heartily agree with the authors' suggestion that when cooking with tomatoes, it is better to use good canned tomatoes rather than pale out-of season tomatoes.The recipes indicate whether the dish is served for special occasions or for everyday fare, whether the preparation is easy or complicated, time-consuming or quick, and they are listed under the traditional Turkish name as well as the English translation.  The instructions are well-planned and well-explained.  The photographs are as beautiful as they are helpful.I wish I had this book thirty years ago!-----Excellent service with an excellent product!"}, {"review_sentiment": 5.0, "review_text": "Great recipes and easy to find ingredients.  Very pleased with this cookbook."}, {"review_sentiment": 5.0, "review_text": "An outstanding cookbook!  It is a rare recipe that is not absolutely delicious.  The directions are easy to follow.  The pictures make one hungry just to look at them.  We have a number of Turkish and Middle Eastern cookbooks and  this one is definitely a favorite."}, {"review_sentiment": 5.0, "review_text": "good forexperimenting"}, {"review_sentiment": 5.0, "review_text": "Just returned from a trip to Turkey.  Loved the food ! Classic Turkish Cooking is an excellent example of the cuisine of Turkey. Great recipes. Well illustrated. I will use & reuse this cookbook for years to come."}, {"review_sentiment": 5.0, "review_text": "Can't wait to try all the pickled recipes.  Ghillie Basan does lovely books; I also have her Turkish mezze book and cook from it frequently."}, {"review_sentiment": 5.0, "review_text": "Even though it cost the same to get this book delivered home as it would have cost us to buy it in Canada and bring it home. The convenience of buying it from Amazon on line means that we will no longer buy a book overseas and drag it home. What great service."}]}, "authors": ["Ghillie Basan", "Jonathan Basan"], "isbn": "1848859848", "longitude": 28.9651646, "periods": ["1900s"], "title": "Classic Turkish Cooking", "word_cloud": "great recipe half couple dish fantastic favorite spicy ground lamb mixed sauteed onion walnut top fried egg lovely personally prefer greek version dish recipe clear still tasty order wife submit review account submit write promised week away arrive day also describe very good sign light wear arrive fact excellent condition nothing differentiate brand new shelf wife review acquaint cuisine deserve reputation world finest french use seasonal ingredient create imaginative contrast flavor contrast pretentious also review offer follow practical tip good result table imperial american english term courgette example explanatory paragraph ingredient commonly use cuisine list regional origin section ingredient helpfully suggest thicken yogurt soft cheese choose type oil best process well complement ingredient choose best fruit vegetable heartily agree author suggestion tomato better use good can tomato rather pale season recipe indicate dish serve special occasion everyday fare preparation easy complicate quick list traditional name well translation instruction photograph beautiful wish thirty year ago service excellent product recipes easy find ingredient very pleased cookbook outstanding cookbook rare recipe absolutely delicious direction easy picture make hungry look number cookbooks definitely favorite good for experimenting just return trip food excellent example cuisine recipes illustrate use reuse cookbook year come wait try pickle recipe lovely also mezzo cook frequently even cost get deliver home bring home convenience buying line mean longer overseas drag home great service", "genres": ["Food and Wine"], "summary": "Classic Turkish cooking ranks among the greatest cuisines of the world. It has a long and colorful history, from its nomadic Central Asian routes to the refined recipes of the Ottoman empire that influenced culinary traditions throughout the Middle East and Mediterranean. \r\n\r\nIn this classic and much-loved work - shortlisted for the Glenfiddich Cookery Award and the Guild of Food Writers Award—Ghillie Basan presents a unique collection of delicious traditional dishes from the Anatolian heartlands and sophisticated and classical recipes from the palace kitchens of the Ottoman sultans.", "asin": "1848859848", "rank": "692762", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/517U9rHtf6L.jpg", "country": "Turkey", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}