{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 30, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "As advertised, this book is a great guide for those who want to stroll through this beautiful city. The book is fun to read. The authors expertly weave together the geography, culture and history that make Istanbul such a fascinating place."}, {"review_sentiment": 3.0, "review_text": "I actually never read this large book.  I stayed over a month in Istanbul in the middle of the Gezi park area during the protests and it cast a very horrible light on the country.  This is also not a country for a single female.  The best thing about Turkey is the music, and the Taksim area is amazing for that.  But the experience overall was so difficult, filled with heavily armed police forces at all times that I never felt inspired to read this book.  Why stay you might ask - the apt was already paid for.  And the music was amazing, though not worth dodging tear gas canisters for.  I am not kidding.  I was almost hit, and they gassed my building, along with the whole area and numerous expensive hotels, fortunately not the Hyatt where I went to swim."}, {"review_sentiment": 5.0, "review_text": "The descriptions of neighborhood walks are deeply informative but not pedantic.  It is helpful for the traveler to have a working knowledge of Istanbul's layout before following the walks.  Although it is obvious that the new edition has been updated for current conditions, the writers seem to effortlessly evoke the charm of the past."}, {"review_sentiment": 5.0, "review_text": "Much more than a city guide. Like strolling through this unique city with a unique friend."}, {"review_sentiment": 4.0, "review_text": "Have just returned from a week in Istanbul using this book- the history/architectural route information is excellent- but so maddening to find that some places recommended are still closed or only open for unpredictable  hours either  due to restoration works that seem to have been stopped in their tracks/pending/ paused that in many cases mean that the Byzantine features we wanted to see were unavailable, or Churches converted into mosques that were museums had scaffolding covering the one thing we wanted to see.  Couldnt help wondering if the Turkish authorities dont want us to see our Christian heritage .!!!!! Forgive me for these ungracious thoughts as we should be grateful for what we could see!! Book needs an additional update addendum/edition saying when those places we couldnt see planned to have the works completed!"}, {"review_sentiment": 4.0, "review_text": "Enjoyed reading the book, and followed a few of the strolls. It is not as clear at the similar book on Venice, and the maps are not very good at all."}, {"review_sentiment": 5.0, "review_text": "I just spent nine days in Istanbul and was so glad to have come across this book. It is informative, interesting, and a wonderful guide to old Istanbul, one of the most exiting cities in the world."}, {"review_sentiment": 1.0, "review_text": "Fell Asleep. First two introductions with absolutely no relevance for anyone but the authors .First chapters a good summary af history. Then the individual descriptive chapter are simply missing nerve."}, {"review_sentiment": 5.0, "review_text": "Still one of the very best guide to Istanbul!"}, {"review_sentiment": 5.0, "review_text": "The classic guide to Istanbul, a must read prior to arrival"}]}, "authors": ["Hilary Sumner-Boyd", "John Freely"], "isbn": "1848851545", "longitude": 28.9651646, "periods": ["1600s", "1700s", "1800s", "1900s", "1500s", "500-1400s", "0-500s", "Pre Common Era"], "title": "Strolling Through Istanbul: The Classic Guide to the City", "word_cloud": "advertised great want stroll beautiful fun author expertly weave together geography culture history make fascinating place actually never large stay month park area protest cast horrible light country also country single female best thing music area amaze experience overall difficult fill heavily arm police force time never felt inspired stay apt already pay music amazing worth dodge tear gas canister kid almost hit gassed building whole area numerous expensive hotel fortunately go swim description neighborhood walk deeply informative pedantic helpful traveler work knowledge layout follow walk obvious new edition update current condition writer seem effortlessly evoke charm past much unique unique friend return week use route information madden find place recommend still close open unpredictable hour due restoration work seem stop pause many case mean feature want see unavailable convert mosque museum scaffold cover thing want see help wonder turkish authority font want christian heritage ungracious thought grateful need additional update say place couldn't see plan work complete reading follow stroll clear similar map good spend day glad come informative interesting wonderful old exit city world introduction absolutely relevance anyone author chapter good summary af history then individual descriptive chapter simply miss nerve still best arrival", "genres": ["History", "Travel Writing"], "summary": "This classic guide to Istanbul by Hilary Sumner-Boyd and John Freely takes the reader on foot through Istanbul. The authors describe the historic monuments and sites of what was once Constantinople and the capital, in turn, of the Byzantine and Ottoman Empires, in the context of the great living city. \r\n\r\nWoven throughout are anecdotes, secret histories, hidden gems, and every major place of interest the traveler will want to see. Practical and informative, readable and vividly described, this is the definitive guide to and story of Istanbul, by those who know it best.", "asin": "1848851545", "rank": "579765", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51-fJqvLuhL.jpg", "country": "Turkey", "story_arc": ["Tragedy", "Things only get worse"]}