{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 19, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "It was a gift for a friend. I talked to her today and she is enjoying the book very much.  M. Ross"}, {"review_sentiment": 4.0, "review_text": "Interesting review of the political situation in Egypt during WW II."}, {"review_sentiment": 4.0, "review_text": "Reveals a great deal of information about a little explored area of the world-wide conflict.  A good read."}, {"review_sentiment": 5.0, "review_text": "Cairo In the War is a fascinating look behind the battle lines in the fight for North Africa. The city already an exotic cosmopolitan place with Greeks, Lebanese, Copts and Syrians is flooded with thousands of British charged with protecting the Suez Canal and the oil fields or the Middle East. They bring with them a ponderous but party loving military and civilian organization intent on maintaining British Culture and Class System. Polo and Tennis at the Gezira Sporting Club is followed by drinks at Shepheard's Hotel. The War goes badly due to passive command , low morale and awe of Rommel and the German army. In the background Egyptian Nationalism led by Nasser and Sadat threaten the defense, as many see the Germans as liberators. The British have to surround King Farouk's palace to force him to install a favorable government. The social scene is further excited by the arrival of artists writers and deposed royalty from the Balkans. When things are looking darkest the British turn to Montgomery who declares \"no more retreats\". This book is a great read and key to understanding the Mideast of today."}, {"review_sentiment": 5.0, "review_text": "Engaging account of a critical place and time in World War II.  Cairo doesn't disappoint as a place of confusion and intrigue."}, {"review_sentiment": 5.0, "review_text": "In many ways, Cairo was the alternate capitol of the British Empire from June 10, 1940 (Italy entered the war on the side of  the axis) and November 11, 1942 (the second battle of el-Alamein). Throughout the war Cairo had a role in the war in the Balkans, Greece, Crete, Iraq, Syria, Ethiopia, and saharan Africa. Among those en scene were Noel Coward, Bea Lillie, Lawrence Durrell, and Olivia Manning, Ms Cooper reports this well and in depth. Recommended."}, {"review_sentiment": 2.0, "review_text": "didn't really give a consistent sense of life for expats or Cairenes.Very heavy on information of British Commissioned Officers."}, {"review_sentiment": 4.0, "review_text": "Fascinating portrait of the last years of the monarchy and the British imperium, which acquires an urgency when Cairo was under threat from Rommel's Afrika Corps. For a brief time, Cairo was one of the most colorful cities in the world for fortunate expatriates"}, {"review_sentiment": 2.0, "review_text": "Their book was moderately interesting. As someone whose father spent part. Of the  war inCairo I expected. Something that would reflect the atmosphere for all engaged in the place. However the book focused on the elite. Much a of it  was just gossip."}, {"review_sentiment": 4.0, "review_text": "During WWII Cairo was neither the capital of an Allied country nor an occupied neutral. The Egyptians expelled the diplomats of the Axis and interned Italians and Germans but did nothing to actively fight the enemy even when they crossed onto Egyptian soil. Artemis Cooper looks at this strange dichotomy, discussing the type of experience the average Tommy would have had in Cairo, the refugees from the Balkans as southern Europe fell under the heel of the conquerer, the intrigue and morale as back-and-forth fighting raged across North Africa. Well-told and illustrated with photos."}]}, "authors": ["Artemis Cooper"], "isbn": "1848548842", "longitude": 31.243666, "periods": ["1900s"], "title": "Cairo in the War: 1939-45", "word_cloud": "gift friend talk today enjoy much interest political situation reveals great deal information little explored area conflict good fascinate look battle line fight city already exotic cosmopolitan place flood thousand british charge protect oil field bring ponderous party love military civilian organization intent maintain british follow drink go badly due passive command low morale awe rommel german army background egyptian lead threaten defense many see liberators british surround palace force install favorable government social scene excite arrival artist writer depose royalty thing look darkest british turn declare retreat great key understand today engage account critical place time disappoint place confusion intrigue many way alternate capitol british enter war side second battle war role war saharan en scene report well depth recommend really consistent sense life expats heavy information commission officer fascinate portrait last year monarchy british imperil acquire urgency threat brief time colorful city world fortunate expatriate moderately interest someone father spend part war in cairo expect something atmosphere engage place however focus elite much gossip capital country occupy neutral expel diplomat intern nothing actively fight enemy even cross egyptian soil look strange dichotomy discuss type experience average refugee southern fell conqueror intrigue morale fight rag illustrate photo", "genres": ["History", "WWII"], "summary": "For troops in the desert, Cairo meant fleshpots or brass hats. For well-connected officers, it meant polo at the Gezira Club and drinks at Shepheard's. For the irregular warriors, Cairo was a city to throw legendary parties before the next mission behind enemy lines. For countless refugees, it was a stopping place in the long struggle home.\r\n\r\nThe political scene was dominated by the British Ambassador Sir Miles Lampson. In February 1942 he surrounded the Abdin Palace with tanks and attempted to depose King Farouk. Five months later it looked as if the British would be thrown out of Egypt for good. Rommel's forces were only sixty miles from Alexandria - but the Germans were pushed back and Cairo life went on.\r\n\r\nMeanwhile, in the Egyptian Army, a handful of young officers were thinking dangerous thoughts.\r\n\r\n\"As hard to put down as good fiction. The research is wide, detailed and scrupulous. It is hard to think, on finishing, how this demanding book could have been handled better, more lucidly or more entertaining.\" Patrick Leigh Fermor, Times Literary Supplement .", "asin": "1848548842", "rank": "311684", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/516C67HLGLL.jpg", "country": "Egypt", "story_arc": ["Tragedy", "Things only get worse"]}