{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 22.2793278, "ratings": {"num_ratings": 13, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "awesome"}, {"review_sentiment": 5.0, "review_text": "Everything Bey Logan writes or narrates about Kung fu is excellent. Bey includes the great martial artists of the past and the stuntman that make Kung fu movies so fantastically good."}, {"review_sentiment": 5.0, "review_text": "Well written and the content is great. It's a great book for filmmakers who aren't even interested in martial arts or Asian action films. Lots of interesting things to learn, bot the kind that really makes you think and the \"OH NEATO I DIDN'T KNOW THAT!!!\" kind.You won't necessarily filmmaking skills, but you gain an appreciation for the history of HK cinema. It's a very easy to read book and fairly short."}, {"review_sentiment": 5.0, "review_text": "I've had this book since it came out in 1996, and I STILL go back to it a lot.  It's  a fantastic overview of HK action movies, and it covers the early origins of HK cinema, 60's movies, Bruce Lee, Shaw Brothers, Golden Harvest, Jackie and Sammo, Horror, fighting women, new wave wuxia, gunplay movies, etc., and it goes right up to about 1995.  There's lots of various \"top 10\" lists of movies and fight scenes, and it gives a smattering of the historical context of some of these films and their subject matter.  Since this book was published, we've seen the advent of DVD, and a greatly increased availability of these films.  When this book came out, it was almost impossible to find decent quality versions of many Shaw Brothers films, but since the Celestial remastering in the early 2000's, there are now literally hundreds of Shaw movies available in pristine widescreen prints with original language.  Similarly, there are many more Golden Harvest movies, and independents available as well.  Given the luxury of choices we have now, Logan's book may not seem too in-depth; it's not, and it wasn't meant to be.  But still (pun intended), this book really puts the whole HK movie tradition in perspective, and gives you the context for appreciating many of the films that are out now.  I've found it very useful when I want to explore a subgenre that I wasn't too familiar with, like Hong Kong horror:  this book gives you a nice background, as well as a listing of the classics of the genre for you to seek out.  In a nutshell, this book doesn't cover slightly more obscure movies, themes or actors, but if you're looking for a solid baseline reference that covers the most important and influential movies, stars, directors and trends of HK action cinema, this is a valuable addition to your library."}, {"review_sentiment": 5.0, "review_text": "This book is a treasure trove.  It is a must-read for any fan of the genre.  Bey Logan is truly an expert on HK cinema, and martial arts, as well.  His enthusiasm for the material is infectious, and his insights are spot-on.  Not to mention the wealth of inside detail--this isn't a Westerner's view from the outside- Bey is actually an insider who knows well and has worked on films with many of the actors and creators he writes about.  It is too bad this book is so old- he should put out an expanded, encyclopedic work.  Scoop this book up used before it becomes impossible to find.PS. Don't miss his commentary tracks on all of the Dragon Dynasty DVDs--they are fantastic!"}, {"review_sentiment": 5.0, "review_text": "Realizing (again) that i don't have to settle for american crud, i dug this book out and marveled again. Color, b/w photos, comprehensive listings (to '95), good taste, smooth and infectiously enthusiastic writing - A+!"}, {"review_sentiment": 4.0, "review_text": "This is easily one of the better books out there on this particular subject.Written by a westerner,the author has a fairly impressive amount of information here that doesn't usually get mentioned in books like this.It is obvious that he really loves the material,this isn't a dry scholarly read - a fun book!  My only complaint is not enough space devoted to the Shaw Brothers - entire chapters on Bruce Lee (yawn...),Jackie Chan,Sammo Hung,etc.. Otherwise,worth your time"}, {"review_sentiment": 4.0, "review_text": "Hong Kong Action Cinema by Bey Logan is another good guide to one of the most innovative film corporations.  The films that have come out of Hong Kong are a lot of fun and a lot more creative than the cookie cutter homogenized celluloid clones that Hollywood continues to crank out ad nasuem.  Although Bey Logan doesn't go too deep into the history of the cinema (he's very opinionated) he gives the reader enough to go out and seek out the movies and other information themselves.The book doesn't capture the wealth of information and humor that he showcases on his audio commentaries for D.V.D.s (such as The Fist of Fury and the Celestial releases).  A world a difference compared to the crappy books that have been released about the same subject matter (i.e. Asian Cult Cinema).  I would also grab a copy of Hong Kong Babylon as a supplement.If you're looking into this genre, I would strongly recommend this book."}, {"review_sentiment": 5.0, "review_text": "I would like more information on shaw brothers martial arts films from 1970-1999.Starting with the actors,directors and shaw brothers them self.A brief biogarphy about each one."}, {"review_sentiment": 3.0, "review_text": "An insight into HK flicks with occasional errors."}]}, "authors": ["BEY LOGAN"], "isbn": "1852865407", "longitude": 114.1628131, "periods": ["1900s"], "title": "Hong Kong Action Cinema", "word_cloud": "awesome everything write narrates few excellent include great martial artist stuntman make few movie fantastically good well write content great great filmmaker even interested martial art asian film interesting thing learn bot kind really make think necessarily film making skill gain appreciation history easy fairly short come go back lot fantastic overview movie cover early origin movie fight woman new wave auxin gun play movie go right lot various top list movie fight scene give smatter historical context film subject matter publish see advent greatly increase availability film come almost impossible find decent quality version many film remastering early literally hundred movie available pristine widescreen print original language similarly many movie independent available well luxury choice meant still intend really put whole movie tradition perspective give context appreciate many film find useful want sub genre familiar horror give nice background well list classic genre seek nutshell cover slightly obscure movie theme actor look solid baseline reference cover important influential movie star director trend valuable addition library treasure fan genre truly expert martial art well enthusiasm material infectious insight not wealth detail view actually insider know well work film many actor creator write bad put expanded encyclopedic work use becomes impossible commentary track fantastic realize settle american crud dug marvel photo comprehensive listing good taste infectiously enthusiastic writing easily better particular westerner author fairly impressive amount information usually get mention obvious really love material dry scholarly fun complaint enough space devote entire chapter bruce worth time good guide innovative film corporation film come lot fun lot creative cookie cutter homogenize celluloid clone continue crank ad nasuem go deep history opinionated give enough seek movie information capture wealth information humor showcases audio commentary release world difference compare crappy release subject matter also copy look genre strongly information shaw brother martial art film actor director shaw brother brief biography insight flick occasional error", "genres": ["History", "Film"], "summary": "From the dazzling choreography of martial arts movies to the gore of the \"heroic bloodshed\" genre, Hong Kong action films are masterpieces of style and fury, and a prime source of inspiration for Hollywood. \r\n\r\nTracing the background of this enticing film genre from the influences of Chinese opera to the mixture of fantasy and fast-paced action of the present day style, this is essential reading for both the intrigued layman and the die-hard Hong Kong fan. Photos, 95 in color.", "asin": "1852865407", "rank": "4054373", "city": "Hong Kong", "image": "https://images-na.ssl-images-amazon.com/images/I/41gYuetFJnL.jpg", "country": "China", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}