{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 6.2443382, "ratings": {"num_ratings": 6, "rating": 3.2, "reviews": [{"review_sentiment": 3.0, "review_text": "Watch the movie version on YouTube instead. The book is just depressing and morbid from start to finish with flashes of insane gun violence. It depicts the worst of times in Colombia's beautiful Medellin back in the 1980's. I would describe the story as dark, sour, melancholy, emotionally sclerotic. Vallejo was a compelling writer and here captures the poignancy of the twisted world of young gunmen who pray and go to confession regularly - but not to confess the crime of murder."}, {"review_sentiment": 1.0, "review_text": "In Rio de Janeiro, gringos can take a \"favela tour,\" giving well-off white people the opportunity to gawk at the mostly hard-working, law-abiding residents of Rocinha as if they were animals in a zoo. Vallejo's Our Lady of the Assassins is a literary favela tour of Medellin, Colombia, and the tour guide is a third-rate imitator of Jean Genet, without any of the latter's imaginative brilliance or intellectual depth. The narrator specifically addresses the reader as an outsider, and he seeks to impress the curious tourist with ever more extravagantly staged episodes of mindless, nihilistic violence, each more spectacular than the last. One problem is that when it comes to absolutely pointless killing (of taxi-drivers, kids, by-standers, shop-keepers, etc.), one murder is just as good or bad as another, so the attempt to escalate the level of one's shock doesn't really work; it quickly becomes just boring, sort of like the sex scenes in Sade's 120 Days of Sodom. Another problem is that Genet was a literary genius. Thus, his work is sui generis, and no attempt to emulate (e.g., in Vallejo's case, by punctuating the descriptions of bullets penetrating skulls with florid Catholic imagery) can avoid coming off as a pale, anemic, stale imitation of the master. The writing is pretentious, self-indulgent, narcissistic and almost completely devoid of beauty or interest."}, {"review_sentiment": 4.0, "review_text": "It was an interesting book and I was pleased to see how the movie included so much of the text, maybe not in the same locations, but helped the flow.  It was a first for me in reading Spanish speaking authors and a view to a life unknown to me.  Latin America is suffering so badly and English speakers are not aware of it.  It could be very depressing if one did not hold on to some hope."}, {"review_sentiment": 4.0, "review_text": "Needless to say, Fernando Vallejo is one of the best writers of all times. Unfortunately, his writing force and power can only be admire if your read his art in the original version. I know translator did his best to write this edition, but it just does not make you feel the same than when you read it in Spanish."}, {"review_sentiment": 5.0, "review_text": "After having read Lolita just a few days ago, I have to say that La Virgen de Los Sicarios is much more understandable to me now.  The movie was flat and too caricature-like in comparison to the rich and lyrical Spanish that Vallejo utilizes throughout this marvelous book.  It tried to capture in a very clumsy and insipid manner the surrealistic touches that give this short novella an undeniably acrid and aching texture.  He does with Spanish what Nabokov did with English in Lolita, giving you heaps of a deranged poetic genius obsessed with the sexual power of minors living on the peripheries of proper society.  And like Lolita, Fernando, the protagonist of this book, is as unreliable a narrator as Humbert Humbert.  Only that in La Virgen de los Sicarios the pathos is much more tinged with a hideous cynicism that is kept thoroughly, but not wholly, veiled in Lolita by an unhinged comical repartee.  There was no laughter in La Virgen de los Sicarios.  I guess Vallejo wanted it that way, as a commentary on the sad nature of contemporary Colombia.  And here youth isn't violated and infiltrated by a rogue and hideously selfish pedophile but is instead robbed of innocence by an uncaring and hypocritical society.  In other words, Fernando exploits these boys after the fact of their \"spiritual rape\" while in Lolita Humbert Humbert is the very instrument of the \"spiritual rape\" of little Dolores Haze.  This significant difference makes Fernando on the surface less culpable for the moral depravity of children, but he deludes himself, like Humbert Humbert, into thinking that he's somehow above it all.  He's not.  In fact, he actively participates in it, which makes him as debased as Humbert Humbert, or even worse since he so maliciously criticizes the very thing he indulges in.  The author definitely imbibed deeply from the Nabokovian fountain of untruthful narrations, youth mercilessly exploited, and the terrible consequences of sexual monomania and spiritual emptiness masked by sophistry.  There is more here than meets the eye.  The two novels should be sold in one set, so as to allow readers to savor the wonders of two impressionistic novels written in two very different languages that are so alike and unalike in tenor, but that speak to powerful truths about the human condition."}, {"review_sentiment": 4.0, "review_text": "Whereas once, say around the time of the Monroe Doctrine, the Western Hemisphere was more or less similar in development region to region due to its common background of having been colonized by European powers, there has ever since been an ever-widening gap due to the differing influences of the colonizers of the north contrasted with the south.  The north, primarily colonized by the British and the French, was viewed as place where individual colonists and their families could create a new homeland and work toward self-sufficiency, exporting valuable natural resources back to the home countries in Europe and provide, in return, a market for what Europe could produce. The southern regions, on the other hand, were primarily colonized by the Spanish and the Portuguese, who sought only to extract natural and agricultural resources for themselves (they wanted gold, mostly), and pay the native inhabitants back by converting them to their brand of Christianity.  So now that all the countries of the Western Hemisphere are nations independent of Europe, the gap between the north and the south has expanded to its ulimate polarity: the United States and Canada are global economic powerhouses with high standards of living for the majority of their people, whereas in Latin America the people groan under the yoke of their own exploitative governments, an impractical and hypocritical rule of the church, and by imposed agricultural economies that do not, on the whole, raise sustaining food for the people, but superfluous, non-food-items for wealthy nations elsewhere--chocolate, coffee, sugar, rubber, tropical woods, and, the most lucrative of all, coca, that is processed into cocaine.The country of Columbia (interestingly, one whose name is the closest to \"Columbus\") is almost archetypal in this concept...coffee, cocaine, and Catholicism (the kind of Catholicism that, for example, continues to forbid contraception in a country where the population has completely overrun its viable economic opportunities), and \"Our Lady of the Assassins\" is a desperate, but powerfully human cry from deep in the heart of that situation in a country still struggling for survival and meaning.  Fernando Vallejo, in presenting this tragedy, seems to offer no obvious hope of solution out of the misery, but only torturously writhes around and around within it, reporting rampant gang killing after gang killing like the city of Medellin's (idiomatically renamed \"Medallo\" in reference to a sub-machine gun) own news media in a never-ending cycle of ever-avenging death and despair while eternally on its knees supplicating \"Santa Maria Auxiliadora\" or whatever other Saint also bled and suffered, unable to really provide much help beyond solace through sympathy and maybe a hope of spiritual liberation after death.  Yet, as long as there is humanity, there still can be hope in THIS world, and where there are tears and laughter, there is humanity. The book is actually very funny in parts, and certainly ironic, as if, better than even crying, all one can do is laugh and attempt to enliven the otherwise-too-horrendous-to-fully-contemplate journey to Only God Knows Where. I found it fascinating that in the prayers requesting a \"blessing\" of the assassin's bullets, their requests were that the bullets wouldn't miss and in their deaths, the victims WOULDN'T SUFFER...as if even in their killing the assassins retained some germ of love. In fact, in the distortions of their slang, to \"be in love with\" somebody is to be out to kill them. They're all angels...avenging angels.  Most importantly, this book is a love story, a love story between a youth whose fellow gang members had all been destroyed, and an older man whose family had all died, that in their aloneness and solitude, they found a place for each other in their lives. I cannot fail to see that this, too, is a metaphor for hidden forces on the side of survival, for when the departing elders and the emerging youth love each other, there is a knitting together of life's circle and the wheel will somehow find a way to keep spinning. Vallejo may see that wheel like a Buddhist wheel of karma, where the only hope of escape is to be individually snuffed out into nirvana, or else maybe like an ancient inquistion torture wheel upon which the bones of humanity are broken and put on elevated display to engender a fear of God, but I think in a culture that did not, industriously, invent the wheel, THIS wheel, an engine of love and humanity, will be, instead of industrialism, its strength and ultimate salvation. And the best expression of that is through the arts such as this one, now in translation made accessible to those of us who reside in the northern hemisphere and may have heretofore remained ignorant of just what was going on in the cultures of a people with whom we once shared a common beginning. This is either a dire warning or a prayer for assistance...either way, we can no longer practically or philosophically afford to remain so isolated."}]}, "authors": ["Fernando Vallejo"], "isbn": "1852426470", "longitude": -75.573553, "periods": ["1900s"], "title": "Our Lady of the Assassins", "word_cloud": "movie version instead depressing morbid start finish flash insane gun violence depict worst time beautiful back story dark sour melancholy emotionally sclerotic compelling writer capture poignancy twist world young gunman pray confession regularly confess crime murder gringo take fa vela tour give white people opportunity gawk mostly resident animal zoo literary fa vela tour tour guide imitator latter imaginative brilliance intellectual depth narrator specifically address outsider seek impress curious tourist ever extravagantly stag episode mindless nihilistic violence spectacular last problem come absolutely pointless kill kid murder good bad attempt escalate level shock really quickly becomes bore sort sex scene problem literary genius work sew generic attempt emulate case punctuate description bullet penetrate skull florid imagery avoid come pale anemic stale imitation master write pretentious narcissistic almost completely devoid beauty interest interest pleased see movie include much maybe location help first read spanish speaking author view life unknown suffer badly english speaker aware depress hold hope say best writer time unfortunately write force power art original version know translator best write edition make feel spanish day say much understandable movie flat comparison rich lyrical spanish utilize marvelous try capture clumsy insipid manner surrealistic touch give short novella undeniably acrid ache texture spanish give heap derange poetic genius obsess sexual power minor live periphery proper society protagonist unreliable narrator pathos much ting hideous cynicism keep thoroughly wholly veiled unhinge comical repartee laughter guess want way commentary sad nature contemporary youth violate infiltrated rogue hideously selfish pedophile instead rob innocence uncaring hypocritical society word exploit boy fact spiritual rape instrument spiritual rape little significant difference make surface le culpable moral depravity child deludes think somehow fact actively participate make debase even worse maliciously criticize thing indulge author definitely imbibe deeply nabokovian fountain untruthful narration youth mercilessly exploit terrible consequence sexual monomania spiritual emptiness mask sophistry meet eye novel sell set allow reader savor wonder impressionistic novel write different language alike tenor speak powerful truth human condition whereas say time le similar development region region due common background colonize european power ever gap due differ influence colonizer north contrast south north primarily colonize british french view place individual colonist family new homeland work export valuable natural resource back home country provide return market southern region hand primarily colonize spanish seek extract natural agricultural resource want gold mostly pay native inhabitant back convert brand country nation independent gap north south expand ultimate polarity global economic powerhouse high standard live majority people whereas people groan yoke exploitative government impractical hypocritical rule church impose agricultural economy whole raise sustain food people superfluous wealthy nation elsewhere chocolate coffee sugar tropical wood lucrative coca process country interestingly name closest almost archetypal concept coffee cocaine kind example continue forbid contraception country population completely viable economic opportunity powerfully human cry deep heart situation country still struggle survival mean present tragedy seem offer obvious hope solution misery tortuously writhe report rampant gang kill gang kill city idiomatically rename reference gun news medium cycle death despair eternally knees supplicate also bleed suffer unable really much solace sympathy maybe hope spiritual liberation death yet long humanity still world tear laughter humanity actually funny part certainly ironic better even cry laugh attempt enliven journey only find fascinate prayer request bless assassin bullet request bullet death victim even kill retain germ love fact distortion slang somebody kill angels avenge angel most importantly love story love story youth fellow gang member destroy older man family die aloneness solitude find place life fail metaphor hidden force side survival depart elder emerge youth love knit together life circle wheel somehow way spin wheel wheel karma hope escape individually snuff nirvana else maybe ancient inquisition torture wheel bone humanity break put elevate display engender fear think culture industriously invent wheel wheel engine love humanity instead industrialism strength ultimate salvation best expression arts translation make accessible northern hemisphere remain ignorant go culture people share common beginning warn prayer assistance way longer practically philosophically afford remain isolate", "genres": ["Fiction & Literature"], "summary": "\"A point in case is his Our Lady of the Assassins, based on the autobiographical novel of one of Colombia's best writers, Fernando Vallejo, whose work has yet to be translated into English and published in the United States. One of the most important new Latin American writers, Vallejo is famous in Colombia and Mexico, of course, and in France as well (where his writing has been compared to the best of Jean Genet's), but is unknown in America.\r\n\r\n\"Schroeder's [film] Our Lady of the Assassins takes place in Medellin, Colombia, where Schroeder spent four years of his childhood, from age 6 to 10. It's the story of a homosexual writer, possessed of a saturnine temperament, who, after living most of his life abroad, returns to his hometown to revisit the places of his youth. He falls in love with a young boy who packs a pistol but who would sooner kill a stranger than an injured dog. It's a courageous picture about the pathology of indifference, set against the backdrop of the narco-violence of the murder capital of South America.\" Los Angeles Times.", "asin": "1852426470", "rank": "873311", "city": "Medellin", "image": "https://images-na.ssl-images-amazon.com/images/I/51T%2BSR7YrVL.jpg", "country": "Colombia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}