{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 251, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "Hmmm, I didn't like the main characters, at the end ."}, {"review_sentiment": 5.0, "review_text": "D.H. Lawrence can so masterfully capture a setting, that one must equate his skill set to that of a careful, meticulous engineer whom has created the ability to transmit you there. His characters are so honest and relatable beyond  mere archetypes that you would swear that they are part of a repressed memory.  Sons and Lovers had me mourning for them, and for myself."}, {"review_sentiment": 1.0, "review_text": "I'll never get back the time I spent reading this book--even if it was free. Main character is narcissistic and uninteresting, female characters are one dimensional stereotypes."}, {"review_sentiment": 5.0, "review_text": "D. H. Lawrence is one the greatest writer of nineteen century."}, {"review_sentiment": 5.0, "review_text": "His stories and characters hold true to today.  Families and people and relationships never change.  Highly recommend.  It's one of authors best."}, {"review_sentiment": 4.0, "review_text": "Not as good as either Lawrence's Women in Love or Lady Chatterley's Lover, Sons and Lovers is a rather odd story that leaves you asking if the hero is a miscreant, a mother lover, or just an over-age, helpless toddler. That aside, the book's biggest problem is that Lawrence didn't seem to learn that he didn't have to tell the story on a practically day-by-day basis at the beginning of the book, if he was later going to tell it on a first weekly basis, then monthly, then just bordering yearly basis. I got the distinct impression that his publisher must have put him on a minimum word count basis, because so much of it seems to duplicate itself, as if Lawrence was counting the words until he'd met his targeted quota then abruptly ended it."}, {"review_sentiment": 4.0, "review_text": "It's a classic for a reason- great writing, story and characters that stand the test of time. I preferred the first three-quarters of the book, but was compelled enough to keep reading. I'll admit I thought the son-mother relationship was very strange, but knowing it was semi-autobiographical I accepted it; I would have thought it unbelievable otherwise."}, {"review_sentiment": 5.0, "review_text": "He's  the best. Another little known erotic novel by him penned anonymously is Take Her to the Dark Side the things a woman's body was made for. Great stuff."}, {"review_sentiment": 5.0, "review_text": "A classic novel, published in 1913, so it may take a wee bit of reading to pick up on the vernacular of the time."}, {"review_sentiment": 1.0, "review_text": "If you are interested in actually reading this novel DO NOT buy this particular edition.  This edition of \"Sons and Lovers\" by D.H. Lawrence is a photographic reproduction of an early edition of the work. This does not mean that it is lacking in value per se.  But since the goal of the publisher was to reproduce the look and feel of the early edition (including imperfections and missing content) it is not suitable for a customer who simply wants to read the novel. This edition has missing pages, clipped margins where text is cut off, and heavy black marks obscuring text on the corners and edges on many of the pages.  In short much of the novel's content is simply missing or illegible.  Unless you are a literary historian or interested in the the publication history of \"Sons and Lovers\"  including the quality of published texts as a concept in general, this is not the book for you."}]}, "authors": ["D. H. Lawrence"], "isbn": "1853260479", "longitude": -0.12574, "periods": ["1900s"], "title": "Sons and Lovers (Wordsworth Classics)", "word_cloud": "like main character end masterfully capture set skill set careful meticulous engineer create ability transmit character honest repeatable mere archetype part repressed memory mourn never back time spend read even free character narcissistic uninteresting female character dimensional stereotype greatest writer nineteen century story character hold true today people relationships never change author best not good rather odd story leave ask hero miscreant mother lover helpless toddler aside biggest problem seem learn tell story practically basis beginning later go first weekly basis monthly border yearly basis get distinct impression publisher minimum word count basis much seem duplicate counting word meet targeted quota abruptly end classic great write story character stand test time prefer first compel enough keep reading admit think relationship strange knowing accept unbelievable otherwise best little know erotic pen anonymously thing woman body make stuff classic publish wee bit read pick vernacular time interested actually read particular edition edition photographic reproduction early edition work mean lack value se goal publisher reproduce look feel early edition include imperfection miss content suitable customer simply want edition miss page clip margin text cut heavy black mark obscure text corner edge many page short much content simply miss illegible literary historian interested publication history include quality publish text concept general", "genres": ["Fiction & Literature"], "summary": "While the novel initially incited a lukewarm critical reception, along with allegations of obscenity, it is today regarded as a masterpiece by many critics and is often regarded as Lawrence's finest achievement.\r\n\r\nThe autobiographical novel, published in 1913, tells the story of Paul Morel, sensitive and talented son of an English coal miner in Nottinghamshire. His mother, Gertrude, the educated daughter of Puritanical middle-class parents, has married the miner in the heat of physical attraction. The marriage soon disintegrates; Walter Morel takes to drink and beats his wife and children, and Mrs. Morel pours all her possessive love upon her sons, especially Paul.\r\n\r\nThe novel is concerned with Paul’s painful introduction to the commercial world, his discovery of books and art, his growing discontent with his background of poverty and gloom, and his developing talent for painting. It records his lover affairs with Miriam and with Clara Dawes. Because of the strong bond of love between him and his mother, he is never able to give his affection wholly to either of the women.\r\n\r\n'Sons and Lovers,' which was attacked on its publication because of its frankness in dealing with sexual matters, is more naturalistic than Lawrence’s later work. It is remarkable for its portrayal of English mining life, its vivid characterizations, and its poetic descriptions of nature.", "asin": "1853260479", "rank": "515284", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51jU%2B3XL2hL.jpg", "country": "England", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}