{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 8, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Wonderful insights into both Turkish and English societies, by an excellent writer. Montagu spent two years in Turkey while her husband served as an ambassador. After returning to England, she published adaptations of works by Virgil, as well as an attack on Jonathan Swift. Her fifty-two Turkish letters were published to wide acclaim in 1763, one year after her death.1717 | AdrianopleThe Corset StaysI was here convinced of the truth of a reflection I had often made—that if it was the fashion to go naked, the face would be hardly observed. I perceived that the ladies with the finest skins and most delicate shapes had the greatest share of my admiration, though their faces were sometimes less beautiful than those of their companions.In short, it is the women’s coffee house, where all the news of the town is told, scandal invented, etc. They generally take this diversion once a week and stay there at least four or five hours, without getting cold by immediately coming out of the hot bath into the cold room, which was very surprising to me.The lady that seemed the most considerable among them entreated me to sit by her and would fain have undressed me for the bath. I excused myself with some difficulty. They being all so earnest in persuading me, I was at last forced to open my shirt and show them my stays, which satisfied them very well—for they believed I was so locked up in that machine, that it was not in my own power to open it, which contrivance they attributed to my husband. I was charmed with their civility and beauty and should have been very glad to pass more time with them.Robert C. RossJune 2015"}, {"review_sentiment": 4.0, "review_text": "What a very clever and interesting book - that is, for those who are interested in early eighteenth century English customs and the Ottoman empire. Lady Mary was an English aristocrat who travelled to Constantinople in 1716 with her husband, Edward, who had been appointed Ambassador to the Turkish court in order to try to broker a peace deal between it and the Viennese court of the Habsburgs.  He failed in this mission but, as a result of it, later generations of readers were treated to his wife’s observations of a culture that was so foreign to her own. In her letters to her friends and family back home, she enlightened them on subjects such as the treatment of Jews in the Turkish empire (they were a very powerful element in it); the brutal attitude shown by the Turkish army to the common people, who were often left destitute after soldiers had been through their lands; the position of women in Turkish society; and the wonders of Turkish architecture, so utterly different from that in her own country. She chose her topics according to whom she was writing to.  When communicating with the poet, Alexander Pope, she regaled him with lengthy quotes from Arabian poetry.  When writing to a clergyman, she explained to him the religious beliefs and rituals practiced in Turkey.  And, when writing to her female friends, she took great pains to describe the clothes and hair styles of the local women.  In fact, one of the subjects she dwells on the most in the Letters is the women she met.  She gives lengthy descriptions of the public baths that women used as meeting places, of her visits to various harems, and her attendance at an all-women pre-marriage ceremony conducted in a public bath.  She describes her meetings with the wives of sultans and other great Turkish leaders, and is positively glowing with praise for their great beauty and poise.  The male readers’ imaginations will be set alight by her narratives!  What makes the book so interesting, though, is that Lady Mary also gives her thoughtful opinions on what it is she is observing, whether it is the wearing of the veil, or her view of the practice of war, regularly indulged in by the Turks.  In places, the lengthy sentences indulged in by eighteenth century writers can seem grossly overstated to our modern eye, but that is the only jarring note in what was, after all, penned three hundred years ago.It is obvious, reading the book, that Lady Mary was, at heart, an ardent romanticist.  It is no wonder, then, that some years after her return to stuffy old England, she left again and spent most of the rest of her life in Italy and France. Just under two years spent under the Turkish sun had a profound effect on her.  I would venture to say she was never the same woman again, and it’s a great pleasure to read about the influences which shaped that process."}, {"review_sentiment": 5.0, "review_text": "Thank you for your prompt service and well represented product."}, {"review_sentiment": 5.0, "review_text": "Smooth transaction, on-time delivery, nice book. I recommend this book highly to everyone who would like to learn about Istanbul, Turks, Turkish culture and Ottoman Empire and its culture."}, {"review_sentiment": 5.0, "review_text": "Lady M.W.M. was a great letter writer, and though it's not fashionable to say so, I much prefer her to Mme de Sevigne, whose letters are in essence one long hysterical cry to her daughter, You never write, you never call. Per contra, Lady MWM is common-sensical, less needlessly poetic, but with the sharp, discerning eye of a spy. That is, she is a real writer. I only wish I could read her letters that were burnt, thrown away, locked up, and otherwise held away from us, because they were too much of a muchness. Were they explicit? Or were they merely telling 300 y/old secrets? No one knows, and those who do, aren't telling. But even the letters that survived are a dilly. You feel you are almost there. Good stuff, this."}, {"review_sentiment": 4.0, "review_text": "A fantastic read. Lady Mary's letters illustrate the middle-east of the past through the lens of the west and highlights the differences between the cultures."}, {"review_sentiment": 5.0, "review_text": "It's a mind blowing book. How beautiful is to get to know the life style of Ottoman Turks in Istanbul via the famous letters of an English woman..."}, {"review_sentiment": 4.0, "review_text": "I read this novel for a class in British Orientalist literature.  It's a series of letters written by a woman who travels to the East.  Read it in conjunction with _Arabian Nights_, _Vathek_, _Rasselas_, and some other  Orientalist tales, and you can get some interesting insights in eighteenth  century England and the exotic/erotic elements of the East."}]}, "authors": ["Lady Mary Wortley Montagu"], "isbn": "1853816795", "longitude": 28.9651646, "periods": ["1700s"], "title": "Turkish Embassy Letters", "word_cloud": "wonderful insight society excellent writer spend year husband serve ambassador return publish adaptation work well attack publish wide acclaim year convince truth reflection often fashion go naked face hardly perceived lady finest skin delicate shape greatest share admiration face sometimes le beautiful short woman coffee house news town tell scandal invent generally take diversion week stay least hour get cold immediately come hot bath cold room surprise lady seem considerable entreated sit undressed bath excuse difficulty earnest persuade last force open shirt show stay satisfied believe lock machine power open contrivance attribute husband charm civility beauty glad pas time clever interesting interested early eighteenth century custom empire aristocrat travel husband appoint court order try broker peace deal viennese court fail mission result later generation reader treat wife observation culture foreign friend family back home enlighten subject treatment empire powerful element brutal attitude show army common people often leave destitute soldier land position woman society wonder architecture utterly different country choose topic accord write communicate poet regale lengthy quote arabian poetry write clergyman explain religious belief ritual practice write female friend take great pain describe clothes hair style local woman fact subject dwell woman meet give lengthy description public bath woman use meeting place visit various harem attendance ceremony conduct public bath describe meeting wife sultan great leader positively glow praise great beauty male reader imagination set alight narrative make interest also give thoughtful opinion observe wear veil view practice war regularly indulge place lengthy sentence indulge eighteenth century writer seem grossly overstate modern eye jar note pen year obvious read heart ardent romanticist wonder year return stuffy old leave spent rest life year spend sun effect venture never woman great pleasure influence shape process prompt service well represent product transaction delivery nice recommend highly everyone culture culture lady great letter writer fashionable say much prefer essence long hysterical cry daughter never write never call contract le needlessly poetic sharp discerning eye spy real writer wish throw away locked otherwise hold much muteness explicit merely tell secret one know tell even survive dilly feel almost good stuff fantastic lady illustrate lens west highlight difference culture mind blow beautiful get know life style famous woman class british literature series write woman travel conjunction tale get interesting insight eighteenth century element", "genres": ["Essay", "History", "Travel Writing"], "summary": "Though written in the 18nth century, the lively, incredibly modern voice of Lady Mary keeps us entertained throughout.\r\n\r\nThe critical and biographical introduction tells of Lady Wortley Montagu's travels through Europe to Turkey in 1716, where her husband had been appointed Ambassador. Her lively letters offer insights into the paradoxical freedoms conferred on Muslim women by the veil, the value of experimental work by Turkish doctors on inoculation, and the beauty of Arab poetry and culture.\r\n\r\nThe ability to study another culture according to its own values and to see herself through the eyes of others makes Lady Mary one of the most fascinating of early travel writers and commentators", "asin": "1853816795", "rank": "315889", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51nzB-HfhbL.jpg", "country": "Turkey", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}