{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 47.3723957, "ratings": {"num_ratings": 1, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "The Gilded Chalet: Off-Piste in Literary Switzerland by Padraig Rooney is a non-fiction book where the author writes interesting anecdotes about famous writers who have lived, and were inspired by Switzerland. The author, a teacher at an international school and has won awards for his poetry.The Gilded Chalet: Off-Piste in Literary Switzerland by Padraig Rooney is an interesting and well written book. Not only does the author delve on literary greats, but also about Swiss culture, their affinity for order, espionage, money laundering and, of course, neutrality.Mr. Rooney, an adopted child of Switzerland, likes his country very much. He writes about places and people in an easy to understand language, and paints a vivid pictures in the reader’s mind. The author uses contemporary culture icons (and pop-culture as well) to help the reader envision those he writes about (Jean-Jacques Rousseau is written of as the Salman Rushdie of the 18th Century).The book was written in English, but if I didn’t know better I could have sworn it was a translation. There is just some exotic about translated books, the language which tries to capture the original but no sound foreign, which this book has.For any lover of literature and trivia, this book is a gem. Not only about literary greats, but also about Switzerland and the morose atmosphere so conducive to espionage and financial shenanigans. As a fan of James Bond, I found the chapter about Ian Fleming fascinating, but to my surprise not necessarily my favorite, that was kept for the wonderful section about Isabelle Eberhardt, whom I never read but certainly want to now."}]}, "authors": ["Padraig Rooney"], "isbn": "1857886364", "longitude": 8.5423216, "periods": ["1800s", "1900s", "Recent Releases"], "title": "The Gilded Chalet: Off-piste in Literary Switzerland", "word_cloud": "author write interesting anecdote famous writer live inspired author international school award interest well write not author delve great also swiss culture affinity order espionage money launder course adopt child like country much write place people easy understand language paint vivid picture mind author use contemporary culture icon well envision write write write know better translation exotic translate language try capture original sound foreign lover literature trivia gem not great also morose atmosphere conducive espionage financial shenanigan fan find chapter fascinate surprise necessarily favorite keep wonderful section never certainly want", "genres": ["Biography", "History", "Travel Writing", "Literary Theory & Criticism"], "summary": "In the summer of 1816 paparazzi trained their telescopes on Byron and the Shelleys across Lake Geneva. Mary Shelley babysat and wrote Frankenstein. Byron dieted and penned The Prisoner of Chillon. His doctor, Polidori, was dreaming up The Vampyre. Together they put Switzerland on the map.\r\n\r\nFrom Rousseau to Nabokov, le Carre to Conan Doyle, Hemingway to Hesse to Highsmith, Switzerland has always provided a refuge for writers as an escape from world wars, oppression, tuberculosis... or marriage. For Swiss writers from the country was like a gilded prison. The Romantics, the utopians and other spiritual seekers viewed Switzerland as a land of milk and honey, as nature's paradise. In the twentieth century, spying in neutral Switzerland spawned the finest espionage and crime fiction.\r\n\r\nPart detective work, part treasure chest, The Gilded Chalet takes you on a grand tour of the birthplace of our best-loved stories, revealing how Switzerland became the landscape of our imagination.\r\n\r\n\"Rooney's thoroughly absorbing book bundles up all of Switzerland's \"gilded ambiguities\" into a dazzling package that is part road trip, part reading list, part memoir, and part historical expose. [It] makes one want to pick up old favourites and seek out new literary discoveries. It is a book for those who love to travel, whether in the mind or on the road. It [is] easy to tear through the volume in a few voracious sittings.\" Times Literary Supplement", "asin": "1857886364", "rank": "801103", "city": "Zurich", "image": "https://images-na.ssl-images-amazon.com/images/I/51sbH4Wp0zL.jpg", "country": "Switzerland", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}