{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 6, "rating": 3.4, "reviews": [{"review_sentiment": 1.0, "review_text": "poor quality binding. Little useful information. Big disappointment!"}, {"review_sentiment": 5.0, "review_text": "Powerful, frightening paintings of Francisco Goya who was the first person ever to document state torture."}, {"review_sentiment": 5.0, "review_text": "Excellent book, Geat price, and fast shipping. Nice, full-color paintings pictured. I great insite into Goya's colorful (and often violent) feelings about Frannce's occupation of Spain in the 1800's."}, {"review_sentiment": 3.0, "review_text": "If forced, by the proverbial gun to the head, to name the highlight of my two visits to the Prado, I would say Goya's \"Black Paintings.\"  By no means do I have an extensive background in the fine arts, either through second-hand study or first-hand experience at museums, but the Black Paintings is the most awesome (in the old sense of the word) set of art works I have ever encountered, and \"Saturn\" and \"The Dog\" are among the most powerful single images I have seen.  To think that they were painted on the walls of Goya's private residence with, apparently, no intent that they be displayed publicly is mind-boggling.Alas, this book, apparently the only book in English devoted solely to the Black Paintings currently available, is a major disappointment.  The quality of the reproductions is only average (in particular, the colors seem to be somewhat washed out), and the precious little accompanying commentary is mediocre at best and appears to have been given a translation of comparably middling quality.The Black Paintings are a monumental achievement of art and human genius; they deserve better than this."}, {"review_sentiment": 4.0, "review_text": "I haven't bought this book, but I saw the paintings this week. Really affected me. So...black. Most of the subjects in the paintings have grotesque faces that are merely smudges of black, grey and silver, as if they were gargoyles that had been burned alive. With subjects sometimes grouped together, they composed \"the mob\" which Goya detested so much--from seeing mob atrocities from the Napoleonic-Spanish war. As disturbing as they are, they are painted in such a powerful manner that it was hard to turn away from them. Several of them lack real focus, as if Goya had grown so disgusted with humankind that it wasn't worth the effort to have his subjects actually doing anything. But he is at least painting for himself, not indulging the vanity of the Catholic Church or rich members and patrons of the Royal Family. So much artistic talent wasted during this period on overweight Dukes on horseback..."}, {"review_sentiment": 4.0, "review_text": "So it may not be the most alternative book of the great Spanish artist Francisco Goya (1746-1828), but stile, for the while a very important one. This because he is the only book in the catalogue dedicated too the Black Paintings. Written by Spanish art historian  Juan Jose Junquera, who recently claim that actually Goya did not paint the black paintings, but his own son. So it is an interesting saying, and also a refresh one. Still I believe that Goya and not any one else paint that madness exhibition.In any way the present book by Jose Junquera is a fascinating one, and any one finding Goya late works interesting will be reworded to read at him. The book publisher, Scala made an excellent production. The front cover has I received (and not how it show in Amazon.Com) present the painting of Saturn, eating his child. An impressive way to start a journey into Goya mind. Eight chapters filled the book and through out the book there are many close up to the paintings. The book runs out at about 96 pages, not like Robert Houges well filled edition, for many the best certainly available on Goya. Still the book contains many details on Goya life and the paintings themselves so you will probably wouldn't fill there is something missing. Although the close details are very well presented there are still points I fill to disagree with them. Like the way Jose Junquera say to give meanings to couple of the paintings. To much pretentious for me but sourly not for all. Another important mention is the book size, and I would really wish the plates of every complete painting could be larger, maybe like the big close ups.Still, an interesting study on Goya masterpiece exhibition, and at his low cost I believe you will be more then satisfied to having him."}]}, "authors": ["Juan Jose Junquera"], "isbn": "1857592735", "longitude": -3.7035825, "periods": ["1700s", "1800s"], "title": "Black Paintings of Goya", "word_cloud": "poor quality bind useful information disappointment powerful frightening first person ever document state torture excellent price fast shipping picture great onsite colorful often violent feeling occupation force proverbial gun head name highlight visit mean extensive background fine arts experience museum awesome old sense word set art work ever encounter powerful single image see painted wall private residence apparently intent display publicly apparently english devote solely currently available major disappointment quality reproduction average particular color seem somewhat washed precious little accompany commentary mediocre best appear give translation comparably middle monumental achievement art human genius deserve better buy saw week really affect subject grotesque face merely smudge grey silver gargoyle burn alive subject sometimes group together compose mob detest much seeing mob atrocity war disturb paint powerful manner hard turn several lack real focus grown disgust humankind worth effort subject actually anything least painting indulge vanity rich member patron so much artistic talent waste period horseback so great spanish artist stile important catalogue dedicate art historian recently claim actually paint son so interesting say also refresh still believe else paint madness way present fascinate finding late work interest reword publisher make excellent production front cover receive show present paint eat child impressive way journey mind chapter fill many close run page well fill edition many best certainly available still contain many detail life probably something miss close detail well present still point fill disagree way say give meaning couple much pretentious sourly important mention size really plate complete painting larger maybe big close interesting study masterpiece exhibition low cost believe satisfied", "genres": ["Art & Architecture", "History"], "summary": "The Spanish master-painter Francisco de Goya (1746-1828) is revered not only for the delicate and sensitive treatment of his subjects but also for his radical political stance and modern sensibility. Towards the end of his life, embittered by the appalling cruelty of the Napoleonic Wars in Spain, Goya decorated the walls of his house outside Madrid with a series of 14 terrifying murals that depicted the underbelly of life and the remorselessness of human existence. \r\n\r\nKnown as the Black Paintings, this series of murals is recognized as one of Goya's greatest masterpieces and now hangs in the Prado. Fully illustrated, this is the only book on the Black Paintings currently in print in English. \r\n\r\nA controversial narrative gives new interpretations of the artist's intention behind these grotesque works and shows how this period of Goya's work anticipated Surrealism and other aspects of 20th century artistic vision.", "asin": "1857592735", "rank": "2018057", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/2192z5Y47XL.jpg", "country": "Spain", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}