{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 2, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "I have to give it five stars because it is deep and poetic and makes you feel like you are in another place and time, yet one that reflects your own in the present day.  This is a real gritty look at life, not the polished up version of Rome in the tourist magazines or the over sentimentalized one in the Italian American pop culture.  This is what many Italians came from, poverty and a hard life that was yet filled with joy, spirit, and humanity.  There is ugliness and cruelty and yet a rhythm and sense to it all, like there is a reason to live amidst the squalor.  I think you come out being a deeper and better person after reading this book.  It makes you think and feel and identify with people who maybe you would rather shun and look down on.  It makes you feel there is nobility to them as well, even as you marvel at the horror of their existence.  If you are honest you will realize that your own life isn't as pristine as you would like to make it to be either, and you can see eye to eye with the characters."}, {"review_sentiment": 4.0, "review_text": "As a \"devout\" fan of Pasolini,  the atheist (though he loved Christianity), openly gay, and Communist(though he was scorned by the party) in 60-70's Italy was constantly surrounded by controversy. In 'The Ragazzi', the filmmaker-poet novelizes his experiences in the slums of Rome. The story follows a group of young teens as they cause mischief and exercise malicious entertainment on innocent bystanders. In the finale, Pasolini illustrates a destructive perpetual mindset running through Italy at the time; a theme that would continue through the rest of his work.My more in-depth of the novel is at Living with Literature:[...]-Daniel"}]}, "authors": ["Pier Paolo Pasolini"], "isbn": "1857549724", "longitude": 12.4829321, "periods": ["1900s"], "title": "The Ragazzi", "word_cloud": "give star deep poetic make feel place time yet reflect present day real gritty look life polish version tourist magazine sentimentalize italian american pop culture many come poverty hard life yet fill joy spirit humanity ugliness cruelty yet rhythm sense reason live midst squalor think come better person read make think identify people maybe rather make feel nobility well even marvel horror existence honest realize life pristine eye eye character devout fan atheist loved openly gay scorn party constantly surround controversy novelizes experience slum story follow group young teen cause mischief exercise malicious entertainment innocent bystander finale illustrate destructive perpetual mindset run time theme", "genres": ["Fiction & Literature"], "summary": "An unsentimental depiction of the poverty and chaos of life in the slums of 1950s postwar Rome, this novel follows Ricetto, an Italian youth, and his gang who survive by their wits, their cruelty, and their instincts for survival. \r\n\r\nTheir lives are shaped by hunger, theft, betrayal, and prostitution, and they celebrate their triumphs with brutal abandon and die bleak deaths. This harsh world is portrayed with an understanding that humanity and even humor can exist amidst a hard and amoral society. \r\n\r\nA novel that caused a scandal upon its first publication more than 50 years ago, this new translation eloquently captures the gritty Roman slang of the Italian original and tells a story that still resonates powerfully to this day.", "asin": "1857549724", "rank": "2334736", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51oyj6l45KL.jpg", "country": "Italy", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}