{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 9, "rating": 3.8, "reviews": [{"review_sentiment": 3.0, "review_text": "Some selections in the collection interesting; many not so much. Not of much use before a trip to Prague."}, {"review_sentiment": 4.0, "review_text": "Charming tales of a Prague neighbourhood in these short stories. I found this book as a result of staying in the Mala Strana neighbourhood in Prague, and enjoying hot chocolate in a cafe directly across the road from where Neruda lived. These stories are bite sized glimpses into life in the mid 1800's. Most enjoyable."}, {"review_sentiment": 4.0, "review_text": "I now understand perfectly why Jan Neruda is called The Czech Charles Dickens. His storyteller is like a moviecamera describing the life in the Mala Strana district of Prague."}, {"review_sentiment": 5.0, "review_text": "A series of short stories. The story of the old man with the stone collection is a must for anyone who collects.The man thought the collection was important because it was worth money , but his children tell him that it was important because of the time they spent together and the facts they learnt.AmazingDavid"}, {"review_sentiment": 5.0, "review_text": "My wife & I had a wonderful 2 week apartment stay in Prague Sept 2012 Part of my prep is to read  some literature .After struggling thru 4Kafka works & the Forrest Gump like Good Soldier Svejk books I thought I was immersed in the culture.While practicing my Czech the more English fluent Czechs admired pronunciation proceeded to conversations in colloquial English.One of them suggested reading Neruda.While familiar with the name his works were not mentioned in guidebook sections of Czech literature..My interest peeked I ordered 2 books which were home on return . Very interesting reading mostly 8-10 page vignettes of mid 19th century life in Prague mostly  Mala Strana.Having just returned from our magical trip his writing brought back very vivid memories of our trip.Especially after the mind throbbing experience of Kafka & the Soldier Svejk always landing on his feet Neruda was very refreshing.Leave the Czech psyche to Culture Shock Czeck Republic  & enjoy Neruda's  every day life writings ."}, {"review_sentiment": 5.0, "review_text": "Neruda (the original one, from whom Pablo took his nom-de-plume) is an astounding writer.  His \"tales\" all take place on the street that he grew up on, and they're funny/sad/touching and highly evocative.  The sense of place is strong, and wonderful, and I felt reading it that I too was a nineteenth century resident of this small commnity in Prague.  Whether it's a middle-aged man smitten with a pretty young neighbor, or a little boy hiding in the cathedral so he can see the ghost of Saint Vitus who supposedly says mass every midnight at his shrine, Neruda gives us people at once foreign and familiar.  In a very different way, his tales remind me of Sarah Ann Jewitt's stories of life in a 19th century New England town.  They share the ability to depict their communities with a quiet, intimate passion devoid of sentimentality yet full of love."}, {"review_sentiment": 4.0, "review_text": "Great book about an interesting city.  I got it whilst I was studying at Charles University.  This book gives a great look into the lives of Praguers.  If you are like Eastern/ Central European history you should read this book."}, {"review_sentiment": 1.0, "review_text": "I have read this book in Czech and it's great, unfortunately, the translation is really bad. It almost feels like someone sat down with a dictionary and just looked up all the words. This really doesn't work when you are going from Czech to English. The structure of sentences is often all wrong. It is gathering dust on my shelf and I have only read about ten pages."}, {"review_sentiment": 4.0, "review_text": "I really enjoyed reading this book.  For me Prague is an amazing and beautiful place.  Reading this book makes me feel like I'm right back in the city again.  I also like the fact that the book is fairly upbeat and  easy to read.  I definitely recommend reading this book over a Pivo in a  Pivovar in Mala Stana."}]}, "authors": ["Jan Neruda"], "isbn": "1858660580", "longitude": 14.4212535, "periods": ["1800s"], "title": "Prague Tales", "word_cloud": "selection collection interest many much not much use trip charm neighborhood short story find result stay neighborhood enjoy hot chocolate cafe directly road live story bite size glimpse life mid most enjoyable understand perfectly call storyteller movie camera describe life district series short stories story old man stone collection anyone man think collection important worth money child tell important time spend together fact wife wonderful week apartment stay prep literature struggle thru work think immerse practice fluent admire pronunciation proceed conversation colloquial suggest reading familiar name work mention guidebook section interest peek order home return very interesting reading mostly page vignette mid century life mostly return magical trip write bring back vivid memory mind throb experience always land foot psyche enjoy day life writing original take astound writer take place street grow highly evocative sense place strong wonderful felt read nineteenth century resident small community man smite pretty young neighbor little boy hide cathedral see ghost supposedly say mass midnight shrine give people foreign familiar different way remind stories life century town share ability depict community quiet intimate passion devoid sentimentality yet full love interesting city get whilst study give great look live central european history czech great unfortunately translation really bad almost feel someone sit dictionary look word really work go structure sentence often wrong gather dust shelf ten page really enjoy reading amaze beautiful place make feel right back city also fact fairly upbeat easy definitely recommend read", "genres": ["Fiction & Literature", "Humour"], "summary": "Central European Classics\r\n\r\nCollection of Jan Neruda's intimate, wry, bitter-sweet stories of life among the inhabitants of Mala Strana, the Little Quarter of nineteenth century Prague. \r\n\r\nThese finely tuned and varied vignettes established Neruda as the quintessential Czech nineteenth century realist, the Charles Dickens of a Prague becoming ever more aware of itself as a Czech, rather than an Austrian city. \r\n\r\nPrague Tales is a classic story whose influence has been acknowledged by generations of Czech writers, including Ivan Klima, who has contributed an introduction to this new translation.", "asin": "1858660580", "rank": "2294603", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/417R6DA35CL.jpg", "country": "Czechia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}