{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 26, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Easy to follow. Good information."}, {"review_sentiment": 5.0, "review_text": "I like this book. It's interesting and full of facts. I'll recommend it to my friends."}, {"review_sentiment": 1.0, "review_text": "Pretty boring book"}, {"review_sentiment": 4.0, "review_text": "Literate and interesting. It spans the long history of the city. I got lost at times in all the names but overall it paints a thorough picture of the city as it evolved."}, {"review_sentiment": 5.0, "review_text": "From earliest times to the late 1990s, a great introduction to a fascinating city for tourists or anyone interested in history."}, {"review_sentiment": 5.0, "review_text": "Mak is able to weave together history and contemporary sights with the clear and engaging style of a journalist. I read it while I was in Amsterdam, and it was more interesting than a guidebook, for sure. I ended up getting his \"In Europe,\" after I got home and found the same blend."}, {"review_sentiment": 3.0, "review_text": "Easy read. VERY detailed. I don't think I ever made it out of the 16th century before my trip over there."}, {"review_sentiment": 4.0, "review_text": "This book follows the development of Amsterdam from the 13th century to the present. Very thorough information on Holocaust and current living conditions."}, {"review_sentiment": 4.0, "review_text": "Interesting and good overview of Amsterdam. For anybody interested in a readable history of this city this functions as a good primer."}, {"review_sentiment": 4.0, "review_text": "I'd recommend this honest history of Amsterdam to anyone planning a visit.Very well done and informative. Much of history one wouldn't normally hear from travel agencies."}]}, "authors": ["Geert Mak"], "isbn": "186046789X", "longitude": 4.8936041, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s", "Recent Releases", "1500s", "500-1400s"], "title": "Amsterdam: A Brief Life of the City", "word_cloud": "good information like interesting full fact recommend friend pretty bore interest span long history get lose time name overall paint picture evolve earliest time late great introduction fascinate tourist anyone interested history able weave together history contemporary sight clear engage style journalist amsterdam interest guidebook sure end get get home find blend easy detail think ever make century trip follow development century present thorough information current living condition interest good overview anybody interested readable history function good primer recommend honest history anyone planning well do informative much history normally travel agency", "genres": ["History"], "summary": "A magnet for trade and travelers from all over the world, stylish, cosmopolitan Amsterdam is a city of dreams and nightmares, of grand civic architecture and legendary beauty, but also of civil wars, bloody religious purges, and the tragedy of Anne Frank. \r\n\r\nIn this fascinating examination of the city's soul, part history, part travel guide, Geert Mak imaginatively recreates the lives of the early Amsterdammers, and traces Amsterdam's progress from waterlogged settlement to a major financial center and thriving modern metropolis.\r\n\r\n\"Lovers of Amsterdam will revel in the exhaustive reconstruction of everyday life in the medieval city.\" —Independent on Sunday", "asin": "186046789X", "rank": "594149", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/513jz6BBCDL.jpg", "country": "The Netherlands", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}