{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 10, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Wonderful and insightful view from a brilliant lady."}, {"review_sentiment": 5.0, "review_text": "enjoyed whenever moving to next chapters."}, {"review_sentiment": 5.0, "review_text": "I lived in Cairo, Egypt for three years in the early 1990s...and since then in Jordan, where I found this book on sale in a local shop. I didn't know the author and didn't expect anything special. Reading this book was a kind of revelation - it's the first time I've recognized the Cairo I knew and loved described with such affection, honesty and authenticity. In hindsight from the events of Jan - Feb 2011, Golia made many prescient observations and predictions. Her book and its understanding of how Cairo works because of Cairenes and their insistence on hanging in there together reminds me of the beautiful film by Yusef Chahin - \"Cairo Illuminated by Her People\" - which was received with much embarassment and criticism among well-heeled Egyptians because it showed some of the poorest and most neglected parts of the city without apology. What they missed is the enormous love with which people and neighborhoods were shot by the film maker and their solidarity which illluminates the film. Same can be said for Golia's book. I looked up her more recent articles from Cairo - printed in The New Internationalist and its website....worth reading. This goes on my \"precious books\" shelf. Highly recommended."}, {"review_sentiment": 5.0, "review_text": "I am a very fussy reader.  I ordered several books about Egyptian history in preparation for a trip to Cairo.  I made it about half way through Amitav Gosh's In an Antique Land with interested starts and long lapses between readings until I gave up.  I looked through Traveling Through Egypt from 450 BC to the Twentieth Century, an interesting collection of short excerpts of travel writing across gender, time and culture; however the print was too small and the excerpts too choppy to really grab me and pull me in.  I was desperate to find a book which would capture a sense of Cairo as a place.I was saved by Maria Golia and her exquisitely written book Cairo: City of Sand.  From the first paragraph which describes an apocalyptic scene which turns out to be a sandstorm to the last paragraph which praises the enduring quality of all great cities, especially Cairo.Reading along with Golia allows one to peer into corners of the city known only to native Cairenes from a women's day at a spa, to ordering a MacFalafel at an Egyptian MacDonalds, to attempting to cross a busy street in deafening traffic so close that it brushes one's clothing as it passes, to rooftop gardens and livestock pens, and to a wedding celebration.  Through Golia's pen one can hear the cacophony of Cairo, smell the myriad aromas of a host of ethic cuisines,  see the dingy squatters settlement and the Mamluk mosque, and feel the scorching blast of a sandstorm.  The book is organized in an interesting way beginning with a chapter called \"Vanishing Point\" which explores daily life in Cairo by looking at diminishing resources such as housing and water as well as growth in population and pollution. The next chapter, \"Artifice and Edifice,\"  examines Cairene's history through buildings from its days as a tent encampment through the modern age and its satellite communities.  The chapter titled \"Guests\" explores Cairo's relationship with its visitors from Napoleonic French to Saudi princes who behave badly and the impact of these guests on Cairene culture.  The love of language and relationship building is featured in \"Listening\" and \"Ensemble\" probes the mazag - the cultural melange that is Cairo.The treasure of intimate glimpses into this city of  17 million is only surpassed by Golia's gift of language.  Golia manages to capture the complexities of Cairo through the juxtaposition of images: \"Bats gorge on Nile mosquitoes, which are languorous and menacing, an airbourne version of the Portuguese men o'war\" (43). She uses metaphors to capture the reader's attention and to create humor: \"Blackouts are lapses in the municipal attention span\" ( 39).  Using vivid imagery and lyrical language Golia brings Cairo alive.I must say that prior to reading this book, my feelings about going to Cairo were an blend of 80% anxiety with 20% excited anticipation. Now that I have vicariously been to Cairo, I now feel mostly excited anticipation."}, {"review_sentiment": 5.0, "review_text": "I was a tourist in Egypt as a teenager (I'm from Boston/NYC) for the pyramids and ancient Egypt. During that trip, I really fell in love with Cairo, but it was the first time I had been anywhere. Was it just the thrill? 30 years later, at 50, I re-visited Egypt with my husband and two teenage children.  I thought - is Cairo how I remember?  I searched books, and this was the best!  It captures the spirit of Cairenes, the commeraderie, the poverty, the richness, the history, the spirit.  I read it right before I went and I'm glad I did.I recommend this book for anyone who wants to feel the pulse of Cairo before they visit, or if they will never visit at all.  Cairo and this author are wonderful. Thank you Maria."}, {"review_sentiment": 5.0, "review_text": "This is a lovely and highly informative book. Maria Golia's prose is very readable and equally delightful, her knowledge of Cairo, its people and its history is comprehensive. She loves the city. She doesn't patronize it.Minor corrections, to an otherwise very accurate book, are onPage 35, the name of the Egyptian actor Adel IMAM is given as Adel IMAN, twice.Page 85, the words for 'cemeteries' (plural) and 'dust' (single) in colloquial Egyptian dialect are 'TOE-rub' (the stress on the first syllable) and 'tor-AAb' (the stress is on the second), respectively. It's tempting to argue that they derive from the same three-letter semetic root, but as they stand, they are pronounced differently.Finally, I want to point out that there is a number of short \"Letters from Cairo\" (published in 'The New Internationalist') by, and an NPR interview (from early 2003) with M Golia available on the web. All highly recommended."}, {"review_sentiment": 5.0, "review_text": "I learned more from reading this book, over a recent visit, than from living in Cairo for five years and then visiting over a period of twenty.  While Max Rodenbeck and others have written decent histories of the city, this is a truly amazing work -- both history and remarkably detailed and with rich philosophical insights not only about the thinking of latter day Cairenes but even about the motivations of the Western tourists who visit Egypt.  Golia's writing is funny, her style sweeping, and her conclusions inevitably sensible.  Even the photos are good.  Buy this book!"}, {"review_sentiment": 5.0, "review_text": "You don't have to love Cairo like I do to love Maria Golia's writing. She writes with engaging warmth, humor, and irony about the city and its remarkable, warm, funny, and ironic inhabitants. I was fortunate to spend an hour chatting with Maria about her book and her life in Egypt on a recent Cairo visit. She's as attractive and engaging in person as her writing is on the page.Own this book and you'll read it once for its insights into Cairene life and you'll read it again for the lovely writing."}, {"review_sentiment": 5.0, "review_text": "If you know Cairo at all, whether glancingly or in depth, you will be grateful for the richness and detail of Maria Golia's book. No other work on the city captures so much of its unimaginably crowded present. Its past is skillfully woven in, but as Golia notes in her introduction, others have written about Cairo's past. Few outsiders can report so well on the day to day life of this incomprehensibly vast city. True, it's not a tourist's guide, but anyone who loves cities and their history will find this a rewarding text."}, {"review_sentiment": 5.0, "review_text": "I grow up in Cairo. I was suprised how the author learned all of that information that she put in the book. The book provides information that one cannot know unless he/she lives long enough with the Cairenes. The book is very interesting. It descibes many aspects of social life in Cairo. The book discusses details about events, such as marriage, Islam, dating, etc. An early, interesting chapter discusses a brief introduction to the history of Cairo.I think that this book is for a reader who wanna know some information about the behavior and beliefs of Cairnes. The book is easy-to-read and non-academic.This book may not be very informative for someone who just get information about traveling in Cairo."}]}, "authors": ["Maria Golia"], "isbn": "1861891873", "longitude": 31.243666, "periods": ["2000s", "Recent Releases"], "title": "Cairo: City of Sand", "word_cloud": "wonderful insightful view brilliant lady enjoy move next chapter live year early find sale local shop know author expect anything special kind revelation first time recognize know love described affection honesty authenticity hindsight event make many prescient observation prediction understanding work insistence hang together remind beautiful film illuminate people receive much embarrassment criticism show poorest neglected part apology miss enormous love people neighborhood shot film maker solidarity illuminate film say look recent article print website reading go precious shelf recommend fussy order several egyptian history preparation trip make way interested start long lapse reading give look travel interest collection short excerpt travel write gender time culture however print small excerpt choppy really grab pull desperate find sense save exquisitely write first paragraph describes apocalyptic scene turn sandstorm last paragraph praise endure quality great city especially allow peer corner know native cairene woman day spa order egyptian attempt cross busy street deafen traffic close brush clothing pass rooftop garden livestock pen wed celebration pen hear cacophony smell myriad aromas host ethic cuisine see dingy squatter settlement mosque feel scorch blast sandstorm organize interesting way begin chapter call explore daily life look diminish resource housing water well growth population pollution next chapter examines history building day tent encampment modern age satellite communities chapter title guests explores relationship visitor prince behave badly impact guest culture love language relationship building feature probe mazag cultural melange treasure intimate glimpse surpass gift language manage capture complexity juxtaposition image gorge mosquito languorous menace airborne version portuguese men use metaphor capture attention create humor lapse municipal attention span vivid imagery lyrical language bring prior reading feeling go anxiety excited anticipation now vicariously feel mostly excite anticipation tourist teenager pyramid ancient trip really fell first time anywhere thrill year later egypt husband teenage child think remember search best capture spirit commeraderie poverty richness history spirit right go glad recommend anyone want pulse visit never visit author wonderful lovely highly informative prose readable equally delightful knowledge people history comprehensive love patronize correction otherwise accurate on page name actor give word plural single colloquial egyptian dialect stress first syllable stress second respectively tempt argue derive emetic root stand pronounce want point number short publish interview early available web highly recommend learn read recent visit living year visit period twenty others write decent history truly amazing work history remarkably detail rich philosophical insight think latter day even motivation western tourist visit write funny style sweeping conclusion inevitably sensible even photos good love love write write engage warmth humor irony remarkable warm funny ironic inhabitant fortunate spend hour chat life recent visit attractive engage person write insight life lovely write know prancingly depth grateful richness detail work capture much unimaginably crowd present past skillfully woven note introduction others write outsider report well day day life incomprehensibly vast tourist guide anyone love city history find reward text grow surprise author learn information put provide information know life long enough interest describe many aspect social life discus detail event marriage date early interesting chapter discuss brief introduction history think an know information behavior belief someone get information travel", "genres": ["Biography", "History", "Urbanism"], "summary": "Cairo is a 1,400-year-old metropolis whose streets are inscribed with sagas, a place where the pressures of life test people's equanimity to the very limit. Virtually surrounded by desert, sixteen million Cairenes cling to the Nile and each other, proximities that color and shape lives. Packed with incident and anecdote Cairo: City of Sand describes the city's given circumstances and people's attitudes of response. Apart from a brisk historical overview, this book focuses on the present moment of one of the world's most illustrious and irreducible cities.\r\n\r\nCairo steps inside the interactions between Cairenes, examining the roles of family, tradition and bureaucracy in everyday life. The book explores Cairo's relationship with its \"others\", from the French and British occupations to modern influences like tourism and consumerism. Cairo also discusses characteristic styles of communication, and linguistic mêmes, including slang, grandiloquence, curses and jokes.\r\n\r\nCairo exists by virtue of these interactions, synergies of necessity, creativity and the presence or absence of power. Cairo: City of Sand reveals a peerless balancing act, and transmits the city's overriding message: the breadth of the human capacity for loss, astonishment and delight.", "asin": "1861891873", "rank": "1669671", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51GAZJB22RL.jpg", "country": "Egypt", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}