{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": -27.4689682, "ratings": {"num_ratings": 12, "rating": 3.1, "reviews": [{"review_sentiment": 3.0, "review_text": "Realistic account of a youths life in the 90's. I am not generally a fan of fiction. Not sure if this was a real account of Gordon/Andrews life or not but seemed believable."}, {"review_sentiment": 3.0, "review_text": "I read Praise just after reading Candy by Luke Davies. Candy is far superior in terms of writing style, content, and intelligence. By contrast, the writing in Praise is frequently flat as if there's no attempt to write in a sophisticated manner. The love interest is larger in Praise and there are some good insights into relationships as a 23-year-old Australian. Largely forgettable and has the feel of a highly autobiographical novel."}, {"review_sentiment": 3.0, "review_text": "This novel is about a year in the life of 23 year-old Gordon. At the beginning of the novel he resigns from his part time job in a Brisbane hotel's bottle shop. The reason is Gordon had to suddenly start working full-time, and after a few days just couldn't be bothered anymore. It is only after you've read Praise; you realize this is a signal of the detached, melancholic cynicism that is the undercurrent of the remainder of the novel.Although in a recent interview McGahan denies Praise was autobiographical, I don't think its coincidental the life story of Gordon almost exactly mirrors his own when it was written in 1992. Helen Garner admits her first novel Monkey Grip was a dramatization of her diaries detailing a great deal of drugs, sex and debauchery. McGahan could be telling the truth, but it is also likely that in the 12 years since his novel was published, he wants to now distance himself from its scathing honesty.Much of the book is a portrayal of life as an endless ritual of parties, alcohol, lots of drugs and even more sex. Gordon doesn't enjoy any of this, but goes on like its expected of him. The only time he can see is the here and now. The future is how many days it is until his next dole payment, and instead of a calendar Gordon reads the TV guide.In my early 20s, almost every person I knew had the same attitude. Even many years later, I still now men who live just like Gordon does. McGahan could of made more of his story then this, but I think this recognition from the reader is what he was trying to achieve.Like the 19th Russian writer Anton Chekhov wrote about his own work, \"All I wanted way to say honestly to people: `Have a look at yourselves and see how bad and dreary your lives are!'\""}, {"review_sentiment": 4.0, "review_text": "Gordon, having recently quit his job at a pub, has nothing to do and no-one to do it with. At 23, he is as aimless as he was when he left high school, with no future, no money, hardly any friends. He doesn't really have any ambition for changing this, either. He is, however, cynical and contemplative, melancholy and detached, able to view his life as though looking at it from afar, through a telescope, a tiny little Gordon running around in a great jar.He lives in Brisbane, near the city, and knows the area well. For me, also living in Brisbane, it was refreshing and interesting to trainspot places and events, times and people. A few things have changed since 1992, but a lot of things have not. While Gordon, the narrator - or more accurately, McGahan, the author - never spends all that much time describing places or scenes, there is a general feel of things which, to me, seems quite right.A few days after losing his job, an ex-workmate, Cynthia, calls him on the phone and invites him over to her place. They begin a relationship, almost entirely sexual, revolving around both explicit, meaningless sex and a cornucopia of drugs and alcohol, most of the drugs being a new experience for Gordon. At first, the story seemed like it was going to plunge into the now-familiar abyss of drug addiction and redemption, as Gordon tried heroin, acid, marijuana, and more. Happily though, this did not happen. Instead, we are invited to observe the deepening relationship between Cynthia and Gordon, as well as the growing frustration that the two experience. Cynthia, perhaps due to her past - which involved heroin addiction, mindless sex with many partners, homelessness and so on - is in the relationship almost purely for the sex, considering that she loves Gordon while he gives it to her, and not while he doesn't. Gordon has his own problems: he is too removed from himself and his emotions to offer her anything more than what she asks, something which is initially enticing but begins to bore them both.The first hundred and fifty pages are little more than party after party, pub after pub, drug after drug. It does become tiresome, and the point is driven home a long time before McGahan stops giving it to us. Soon though, the couple has to face a few tough experiences, including an abortion and genital warts. Through this, Gordon stays mostly emotional, which is unfortunate. What worked as a narrative tool in the beginning begins to fail in the middle and the end as we demand some sort of response from Gordon beyond simple acceptance. This never happens, and unfortunately, the story degenerates from there. The ending is expected, and while there is a sub-plot involving the previous love-of-his-life Rachel, this feels tacked on and the handling of it is fairly trite. By the end, Gordon has not changed, but we have: We've come to see the meaningless life he leads and wish something better for him. He, however, does not see this, or if he does, he doesn't care. This is frustrating, which perhaps shows that McGahan has successfully achieved his goal - if I am frustrated with a character, then I have emotionally connected with him.The story ends with a whimper, something to be expected of Gordon. The writing style was, at all times, the perfect voice for the character. Sentences were short and sharp, and never flowery. 'Big' words were never used, as they would not have fit the character. There is a sense that the author could do more if he wanted, but wisely chose not to so as to better personify the character in words. For a first novel, this is a great achievement, even though I can't help wonder if a lot of my emotional attachment to the novel comes from place-recognition. Either way, it is worth picking up and having a read, at just below 300-pages, this book is able to make its message without bogging the reader down."}, {"review_sentiment": 4.0, "review_text": "Has to be one of the more important pieces of Australian literature of the last ten years. McGahan's simple, but gripping prose sets the scene of a place where people have no dreams to realise, where sex,alcohol,drugs and cigarettes are thrown in together to create a recipe of despair, sadness, humor and loss. Definetely not for the faint hearted, this is unputdownable. A modern masterpiece."}, {"review_sentiment": 4.0, "review_text": "A well written and engaging novel that is a fast read. I enjoyed this book very much.The tone of the book does get a little dark at times but McGahan keeps it moving along so that it doesn't become oppressive.I  loved the first person narration and also that the narrator wasn't totally  reliable; you had to second guess him some of the time.I definitely  would recommend it to anyone who can handle their prose somewhat raw but  very engaging."}, {"review_sentiment": 5.0, "review_text": "I'll keep it short- I'm still basking in the afterglow.  Brilliant, honest and extremely addictive.  An absolute must."}, {"review_sentiment": 1.0, "review_text": "I agree with a previous reviewer; it must have been a slow year to have \"Praise\" win so many awards and  shortlisted for others. If you took out all the sections about sex, there would be very little left. The  main character, is irritating at best. One of his girlfriends calls him  'mild', but this is too kind. He is very unconcerned about anything  signifigant. A few of his comments are almost funny, but often so  outlandish, I wondered how he he came up with any of them. McGahan creates  some interest  between what Gordon says, what he does, and the different  responses he gives to other characters depending on who they are. Think  unreliable narrator, if you will. I read this novel quickly, due more to  lack of anything to slow me down on or really have to ponder than interest  or readibility. It's like watching a TV movie, perhaps this is why it was  made into a movie. I expect to get something, anything from a novel, and  this novel failed to deliver. I continued to hope Gordon would do something  but he never does, happy to get his welfare checks and destroy himself and  anyone else that comes along for the ride."}, {"review_sentiment": 5.0, "review_text": "Praise is about being young in Australia. About living in a world where drugs and alcohol dominate, where sex scalds and soothes, where Social Security is easier to get than a job. Where survival means taking nothing  and no one too seriously. This does not mean that it stereotypes all  Australians as yobs who have nothing better to do. For all those people who  disagree, don't read it. Praise is not about all Australians but one,  Gordon. A 23 year old average guy who doesn't really care much about a  great deal. Everything he does he doesn't let get to him, that includes his  job, his friends, his life. Gordon tells his story of living in New Farm in  an old man's complex, sometimes with his friend Cynthia, sometimes with his  girlfriend Cynthia. He can't differentiate between the two. He tells us his  love of Brisbane. He speaks to us about growing up. He tells us about his  whole new world. About the sex, about the drugs, about the eczema.  Really  it is like following the life of a typical aussie bloke. This does not make  him or any other Australian's lower class, this book is excellent well  worth reading for people who have an open mind and half a brain."}, {"review_sentiment": 2.0, "review_text": "THE BOOK ALLEGEDLY won the award for best Australian book of 1991-it must have been a slow year... No matter how you try and dress it up with meaning and hyperbole, this is a book about an unemployed slacker having lots and lots of graphic loveless sex and getting drunk/high a lot. It gets pretty old pretty quick, and there's little to take from it. The subject of lost youth in the modern world has been vividly and effectively portrayed in Scotland by writers like Irvine Welsh and Alan Warner, and in England and America in countless novels, McGahan seems to be striving for the same effect here, but it's not nearly as well written or interesting. The loser slacker protagonist (Gordon) is introduced in 1988, which has a lot less sex, and is slightly more interesting as a whole."}]}, "authors": ["Andrew Mcgahan"], "isbn": "1864480114", "longitude": 153.0234991, "periods": ["1900s"], "title": "Praise", "word_cloud": "realistic account youth life generally fan fiction not sure real account life seem believable read far superior term write style content intelligence contrast writing frequently flat attempt write sophisticated manner love interest larger good insight relationship australian largely forgettable feel highly autobiographical year life begin resigns part time job hotel bottle shop reason suddenly start work day realize signal detached melancholic cynicism undercurrent remainder recent interview deny autobiographical think coincidental life story almost exactly mirror write admit first dramatization diary detail great deal drug sex debauchery tell truth also likely year publish want distance scathing portrayal life endless ritual party alcohol lot drug even sex enjoy go expect time future many day dole payment instead calendar read tv early almost person know attitude even many year later still men live story think recognition try russian writer write want way say honestly people look bad dreary life recently quit job pub nothing aimless leave high school future money hardly friends really ambition change however cynical contemplative melancholy detach able view life look afar telescope tiny little run around great life city know area well also live refresh interesting train spot place event time people thing change lot thing narrator accurately author never spend much time describe place scene general feel thing seem quite day lose job call phone invite place begin relationship almost entirely sexual revolve explicit meaningless sex cornucopia drug alcohol drug new experience first story seem go plunge abyss drug addiction redemption try heroin acid marijuana happen instead invite deepen relationship well grow frustration experience perhaps due past involved heroin addiction mindless sex many partner homelessness relationship almost purely sex consider love give problem remove emotion offer anything asks something initially entice begin first hundred fifty page little party party pub pub drug drug become tiresome point drive home long time stop give couple face tough experience include abortion genital wart stay mostly emotional unfortunate work narrative tool begin begin fail middle end demand sort response simple acceptance never happen unfortunately story degenerate end expect involve previous feel tack handle fairly trite end change come meaningless life lead wish something better however care frustrating perhaps show successfully achieve goal frustrate character emotionally connect story end whimper something expect writing style time perfect voice character short sharp never flowery word never use character sense author wisely chose better character word first great achievement even lot emotional attachment come way pick able make message bogging important piece australian literature last ten year simple grip prose set scene place people dream sex alcohol drug cigarettes together create recipe despair sadness humor loss faint heat unputdownable modern masterpiece well write engage fast enjoy tone little dark time keep move along become love first person narration also narrator totally reliable second guess definitely anyone handle prose raw engage keep still bask afterglow honest extremely addictive absolute agree previous reviewer year win many award shortlist others take section sex leave main character irritate best girlfriends call kind unconcerned anything comment almost funny often outlandish wonder come create interest say different response give character depend unreliable narrator quickly due lack anything slow really ponder interest readability watch tv movie perhaps make movie expect something anything fail deliver continue hope something never happy get welfare check destroy anyone else come ride young living world drug alcohol dominate sex scald soothes easier get job survival mean take nothing seriously mean stereotype yobs nothing better people disagree year old average guy really much great deal let include job friend life tell story live old man complex sometimes friend sometimes girlfriend tell speak grow tell whole new world sex drug eczema really follow life typical aussie bloke make australian lower class excellent well worth read people open mind half brain award best australian year no matter dress mean hyperbole unemployed slacker lot lot graphic loveless sex get lot get pretty old pretty quick little subject lose youth modern world vividly effectively portray writer countless novel seem strive effect nearly well write interest loser slacker protagonist introduce lot le sex slightly interesting whole", "genres": ["Fiction & Literature"], "summary": "The Bukowski-inspired first novel that made McGahan a cult bestseller Down Under, \"Praise\" is urgent, raw, and piercingly truthful, as it explores the ground between dreams and the self-destruction of an entire generation. \r\n\r\nAn utterly frank and darkly humorous novel about being young in the Australia of the 1990s. A time when the dole was easier to get than a job, when heroin was better known than ecstasy, and when ambition was the dirtiest of words. A time when, for two hopeless souls, sex and dependence were the only lifelines.", "asin": "1864480114", "rank": "14097685", "city": "Brisbane", "image": "https://images-na.ssl-images-amazon.com/images/I/41KAR7E7MML.jpg", "country": "Australia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}