{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 19, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Oh Vienna!"}, {"review_sentiment": 3.0, "review_text": "started out well.....suspense but became boring......too long"}, {"review_sentiment": 5.0, "review_text": "Dark and weirdly unsettling, like a dream where you know something isn't quite right but you don't know what or why. Who or what is the Golem? What is actually happening to the narrator? Is he insane? Always searching for something barely glimpsed or just out of sight, perhaps never to be found.What was the significance of that hat, and what are the real motives of the other characters, each of whom, though real and fully realised, yet seems to be wandering  in and out of the narrator's delirium?It's fevered, classic horror related as a Gothic, mystical enigma, referencing Jewish and European myth, taking place in a vividly realized Prague of the imagination. Esoteric symbolism abounds, not always readily grasped. There are echoes of Gogol, Kafka, Dostoevsky, Shelley and others, but Meyrink's tale stands starkly and magnificently unique.Existential angst and profound psychological torment formed into an uncomfortably compelling read that can be interpreted on many levels. Wonderful. Should be recognized for the classic it is."}, {"review_sentiment": 5.0, "review_text": "Yes"}, {"review_sentiment": 5.0, "review_text": "The Golem by Gustav MeyrinkThis book was suggested to me by someone from Trotsdale in Second Life. I can no longer remember if it was DC, someone else in the intersim team, or whom exactly. I definitely greatly enjoyed the read and was very happy to find a copy in English since, if memory serves, it had originally been written in German.The book is part romance, part mystery, part thriller, and all spiritual. There are several plots all at once. One is the growth of the soul, one is the main character's involvement in protecting a Countess, one is the eventual union of the main character with another, far better, love interest. We then discover at the end that it could be said there were actually two main characters. Your understanding of the various levels of this book will vary depending on your grounding of knowledge of the Kabbalah (there are several alternate spellings, all of which are correct). You don't really need any as it gives you what you need as you read along, but it you are already familiar with the symbols you unlock so much more. This is one definitely worth rereading.I particularly liked how the spiritual quests intertwined with the challenges of the mundane world. Part of me would have liked more description of characters and surroundings, but the way the story is structured it is good that the surroundings can be forgotten about. This makes it easy for the reader to imagine this sort of adventure happening to them, which, on some level it happens to us all. I also very much liked how the book pointed out the three paths available, instead of fixating on just the main two."}, {"review_sentiment": 5.0, "review_text": "Love"}, {"review_sentiment": 4.0, "review_text": "The Golem’ by Gustav Meyrink, is an early 20th-century literary gothic (published in 1915). However, instead of the horror or monster drama that we, gentle reader, may be expecting, he explores the meaning of identity, mystically speaking, in the form of a highbrow 19th-century book written in the style of a psychological gothic of the time.The word golem is a word used once in the Bible, specifically in Psalm 139:16, although we English speakers never see it because of translation issues. The KJV version of the Psalm: “Thine eyes did see my substance, yet being unperfect; And in thy book all my members were written, Which in continuance were fashioned, when as yet there was none of them.” The word golem actually meant originally “my unshaped form’. The word is used sometimes today to describe someone who appears to be an obedient, but thick-witted, cretin.A fairy-tale golem monster is made traditionally by writing the word ‘truth’ somewhere, sometimes on a paper, which is placed into the mouth of a man-like statue made from clay or mud, or sometimes by writing the word on the statue’s forehead. The statue becomes animated by this magical process, but it is an enslaved being, and it must obey the commands of whoever started its animation. The golem is deactivated by changing the inscription from \"Truth\" to \"Death\". The oldest versions of the story of making a golem have been traced back to Jewish fairy tales, primarily the story of Adam being created from mud by a god.The author Gustav Meyrink was fascinated by mysticism, so much so that his book, ‘The Golem,’ is loaded with references to his researches; but he seems to explore primarily in this novel the idea of identity in terms of mysticism.  Meyrink weaves into his plot a vague outline of the original golem story to illustrate his ideas with a great deal of playful (intellectually, not comic) literary inventiveness.Athanasius Pernath, our protagonist, lives a life of much mental confusion. He cannot remember very much of his past, and his present often appears to recede from reality into a waking dream. We learn from the events on the first page that Pernath has just finished reading about the life of Buddha, and shortly after he wakes up he immediately begins to experience a vision of a rock which is more like a lump of fat - a shapeless, formless stone of fat, like unformed mud.Pernath is a gem cutter, by trade, but we never see him at work. Instead, he frequents a neighborhood (a Jewish enclave) of housing, restaurants, pubs and shops where he meets his friends and acquaintances (by the way, every character is bleak, mysterious and peculiar, except for one - and it isn’t Pernath). He picks up local gossip and doings, some of which interests him a great deal.A junk dealer, Aaron Wassertrum, is one who particularly interests him because he appears to be a force of negativity or evil, and his daughter (maybe), Rosina, is perhaps a teenage prostitute, a possible victim of Wassertrum’s depravity, whatever it may have been. She certainly is an uninhibited force of unconstrained sexuality in Pernath’s mind.Pernath is attracted to another woman, Miriam, who is moral and responsible, who he met while visiting her father, Shemaiah Hillel. Pernath himself had a nervous breakdown after a previous unhappy love affair, and he is being treated by Shemaiah Hillel with hypnotism to be calm and to forget. Remembering his past (he gets flashbacks) causes Pernath extreme anxiety. He also sees ghostly visions and haunted houses. It may or may not be true he is being haunted by a golem. Pernath is the most undependable narrator I have come across in my reading to date! A lot takes place in Meyrink’s story; but since we see everything through Pernath’s eyes, it is impossible to know how much of what happens is from his real life and what is occurring in a waking dream state. Frankly, most of the book appears to be a dream vision."}, {"review_sentiment": 4.0, "review_text": "This is NOT a horror story and nothing like the silent film version of the animated man of clay. Rather, this is a superbly written \"dream within a dream\", with Kafkaesque overtones.The reading is easy and the story moves forward quickly. Pretty good for a book written in 1915 and translated from German to English in 1995. And there is a mind boggling ending that Rod Sterling would have envied.When you read this book be prepared for a trip into \"The Twilight Zone\"."}, {"review_sentiment": 5.0, "review_text": "I bought this book because I wanted to read his \"Green Face\" book and the reviews said this one was better. I'm about half way into it now and not disappointed. In many ways Mr. Meyrink is a poet. It's fun to read him just to enjoy his words. Mike Mitchell did a fine job translating."}, {"review_sentiment": 4.0, "review_text": "This is a very interesting book. I fear my review is not going to be overly insightful. There is a lot that remains opaque about the novel for me, but, I will say, that is part of the reason I enjoyed it so much. There is a lot of occult symbolism in the novel and it is always bad when symbolism becomes too transparent. Meyrink avoids becoming too transparent with his symbolism which is what lends the novel its mystical aura and the feeling of limitless depth. There is always the feeling that there is a hidden meaning lying just beyond the grasp of the conscious mind. The novel is mostly the story of an old gem engraver named Athanasius Pernath, but, his story intertwines with a number of interesting stories. There is the revenge story of Charousek and Wassertrum, the tale of adultery between Angelina and Dr. Savioli, and the poverty stricken, but deeply religious, Hillel and Miriam. Athanasius Pernath experiences many hallucinatory visions throughout the novel, some of them involving the figure of the Golem which gives the novel its title. The novel really succeeds in creating the atmosphere of early twentieth-century Prague and the Jewish ghettos.There are a lot of interesting ideas in the book. I believe the book works out what I would call a religion of the Self. I am using the term \"the Self\" in the sense that Ralph Waldo Emerson and the psychologist Carl Jung used it. There is a character who expresses this creed late in the book when he says \"For me, the most sacred thing imaginable is to allow my steps to be guided by the spirit within me, blindly, wholly trusting in it wherever the path may lead, to poverty or riches, to the gallows or to a throne\" (236). Following the inner spirit in this sense can be difficult. As another character mentions in a letter \"We humans are an impure race, often it takes weeks of fasting and waking until we can understand the whisperings of the soul\" (222). This is not, therefore, mere hedonism. It is not a matter of following our every superficial whim, but, of following the deepest urges within us. This is, according to Pernath himself, \"the most religious devotion to duty in the most profound, most arcane sense of the word\" (224).Another theme of the novel is that the ordinary, sensory world is merely a veil for a hidden, spiritual world, with its own laws. This world resides within the depths of the soul and there is a hidden knowledge contained in the soul. After leafing through a book and having visions Pernath feels \"as if I had been searching through my brain...Everything the voice had said to me I had carried within myself all my life, only it had been obscured and forgotten\" (37). We can see a kind of Platonic epistemology working here (knowledge is recollection) in opposition to the dominant empiricist epistemologies of our times. For Meyrink the senses are just another kind of dreaming. He writes \"When men arise from their beds, they think they have shaken off sleep and they know not that they have fallen victim to their senses and are in the grip of a much deeper sleep than the one they have just left\" (82-83). Clearly, we cannot expect any spiritual knowledge to come through the senses.Meyrink has one of his characters give a beautiful analogy which, I think, expresses the limitations of the senses, and the hidden efficacy of the spiritual world. The character describes the way that inanimate objects are blown about by the wind. He says that scraps of paper whirl around \"chasing one another as if each had sworn to kill the others\" (54). Because the wind is invisible we have a tendency to ascribe emotions, will, volition, etc. to the inanimate objects. We do not really see what moves them. We are in the same position in relation to our fellow human beings and ourselves. Meyrink has written an interesting and compelling story which, I think, expresses the mystery that we are to ourselves quite well. We do not know who we are, what motivates us, or where we are going. We follow our own deep, inner urges, not sure whether they are dragging us towards paradise or perdition. We know we are clay, and feel chained to this world, but also feel, at times, as if we belonged to another world, but, we are not sure whether our vision of the \"other world\" is a reality, or merely a dream in a fog. This novel, to me, manages to capture all of that, and entertain the reader at the same time. I would definitely recommend it."}]}, "authors": ["Gustav Meyrink"], "isbn": "1873982917", "longitude": 14.4212535, "periods": ["1900s"], "title": "The Golem", "word_cloud": "start well become boring long weirdly unsettle dream know something quite right know actually happen narrator be insane search something barely glimpse sight perhaps never significance real motives character real fully realize yet seem wander narrator delirium fevered classic horror relate mystical enigma reference jewish european myth take place vividly realize imagination symbolism abound always readily grasp echo others tale stand starkly magnificently angst profound psychological torment form uncomfortably compel interpret many level classic suggest someone longer someone else interim team exactly definitely greatly enjoy happy find copy memory serf originally write part romance part mystery part thriller spiritual several plot growth soul main character involvement protect union main character far better love interest discover end say actually main character your understand various level vary depend ground knowledge several alternate spelling correct really need give need already familiar symbol unlock much definitely worth particularly liked spiritual quest intertwine challenge mundane world description character surround way story structure good surroundings forget make easy imagine sort adventure happen level happen also much like point path available instead fixate main early literary gothic publish however instead horror monster drama gentle explores mean identity mystically speak form highbrow write style psychological gothic word word use specifically speaker never see translation issue version eye see substance yet unperfect thy member write continuance fashion yet none word actually mean originally unshaped word use sometimes today someone appear obedient monster make traditionally write word truth somewhere sometimes paper place mouth statue make clay mud sometimes write word statue forehead statue become animated magical process enslave command start animation deactivate change inscription oldest version story make trace back jewish fairy tale primarily story create mud author fascinate mysticism much load reference research seem explore primarily idea identity term mysticism weave plot vague outline original story illustrate idea great deal playful intellectually comic literary protagonist live life much mental confusion much present often appear recede reality wake dream learn event first page finish read life shortly wake immediately begin experience vision rock lump fat shapeless formless stone fat unformed gem cutter trade never see work instead frequents neighborhood jewish enclave housing restaurant pubs shop meet friend acquaintance way character bleak mysterious peculiar pernath pick local gossip doings interest great junk dealer particularly interest appear force negativity evil daughter maybe perhaps prostitute possible victim depravity certainly uninhibited force unconstrained sexuality attract woman responsible meet visit father nervous breakdown previous unhappy love affair treat hypnotism calm forget past get flashback cause extreme anxiety also see ghostly vision haunt house true haunt undependable narrator come read date lot take place story see everything eye impossible know much happen real life occur wake dream state appear dream vision story nothing silent film version animate man clay superbly write dream dream reading easy story move forward quickly good write translated german boggle end trip buy want review say better half way disappoint many way meyrink fun enjoy word fine job translate interesting fear review go overly insightful lot remain opaque say part reason enjoy much lot occult symbolism always bad symbolism become transparent avoids become transparent symbolism lend mystical aura feel limitless depth always feel hidden meaning lie grasp conscious mostly story old gem engraver name story intertwines number interesting story revenge story tale adultery poverty stricken deeply religious experience many hallucinatory vision involve figure give really succeed create atmosphere early lot interest idea believe work religion use term sense psychologist use character express creed late say sacred thing imaginable allow step guide spirit blindly wholly trust path poverty rich gallows throne follow inner spirit sense difficult character mention letter human impure race often take week fast wake understand whispering soul therefore mere hedonism matter follow superficial whim follow deepest urge accord religious devotion duty arcane sense word theme ordinary sensory world merely veil hide spiritual world law world reside depth soul hidden knowledge contain soul leaf vision feel search brain voice say carry life obscure forgotten see kind epistemology work knowledge recollection opposition dominant empiricist epistemology time sense kind dream write men arise bed think shake sleep know fall victim sens grip much deeper sleep leave expect spiritual knowledge come character give beautiful analogy think express limitation sens hide efficacy spiritual world character describe way inanimate object blow say scrap paper whirl chase sworn kill others wind invisible tendency ascribe emotion volition inanimate object really see move position relation fellow human being write interesting compel story think express mystery quite well know motivate go follow deep inner urge sure drag towards perdition know clay feel chain world also feel time belong world sure vision world reality merely dream fog manage capture entertain time definitely", "genres": ["Fiction & Literature"], "summary": "\"A superbly atmospheric story set in the old Prague ghetto featuring The Golem, a kind of rabbinical Frankenstein's monster, which manifests iitself every 33 years in a room without a door. Stranger still, it seems to have the same face as the narrator. Made into a film in 1920, this extraordinary book combines uncanny psychology of doppelganger stories with expressionism and more than a little melodrama... Meyrink's old Prague - like Dicken's London - is one of the great creations of City writing, an eerie, claustrophobic and fantastical underworld where anything can happen.\" The Sunday Times", "asin": "1873982917", "rank": "969308", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/41wjShy8OtL.jpg", "country": "Czechia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}