{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": -27.4689682, "ratings": {"num_ratings": 26, "rating": 3.7, "reviews": [{"review_sentiment": 1.0, "review_text": "I didn't finish it, it was too lame."}, {"review_sentiment": 5.0, "review_text": "Love it!"}, {"review_sentiment": 3.0, "review_text": "a little all over the place. for once, the movie was better than the book. it gave me a headache to read because I can hear his fast paced talking. for sure more of a book for young men not ladies in their 40s like me. But again loved the film."}, {"review_sentiment": 1.0, "review_text": "I'll never get the time back that I wasted reading that book!"}, {"review_sentiment": 5.0, "review_text": "As a poor worker, I have lived in houses like the one this writer lived in. But my experience PALES in the face of what this man saw.I need only say - they were young Australians.This book is a must read for any poor working stiff, who has lived in cramped, filthy shared housing."}, {"review_sentiment": 5.0, "review_text": "Got this for my son when he first moved into a roommate-filled bachelor pad. It's a definite recommend of the true story of fun, painful, funny talesof a bunch of blokes and shielas who lived in an aussie pad."}, {"review_sentiment": 5.0, "review_text": "I enjoyed this book."}, {"review_sentiment": 5.0, "review_text": "Ordered this for my son as he told me he liked Birmingham's books... He totally loved this one!"}, {"review_sentiment": 4.0, "review_text": "If you want to have a light hearted read then this is a book to do it for you, a good laugh at what some people will do in shared accommodation."}, {"review_sentiment": 4.0, "review_text": "I liked the movie better. Still good though. Very different from the movie. They must have got some killer writers to create the screen play."}]}, "authors": ["John Birmingham"], "isbn": "1875989218", "longitude": 153.0234991, "periods": ["1900s"], "title": "He Died With a Felafel in His Hand", "word_cloud": "finish lame little place movie better give headache hear fast paced talk sure young men lady love film never get time waste read poor worker live house writer live experience face man need say young poor work stiff live cramped filthy share housing son first move bachelor pad definite recommend true story fun painful funny tales of bunch bloke sheilas live aussie pad enjoy son tell liked totally love want light heat good laugh people share accommodation like movie better still good very different movie killer writer create screen play", "genres": ["Memoir", "Fiction & Literature", "Humour"], "summary": "John Birmingham has lived with eighty-nine people and kept notes on all of them. This is their story.\r\n\r\nThese hilarious tales of urban terror reveal the dark truth hidden behind three seemingly innocent words―a phrase that you have seen a hundred times before but will never view in the same light again: \"Wanted to Share\".\r\n\r\nJohn Birmingham's rendering of a life in share houses will leave you laughing, cringing and reminiscing about your own brushes with the mad, bad residents of flat mate hell.\r\n\r\n'This is the grunge version of Melrose – the characters move speedily from one bed to another in Birmingham's share-house hell ... Not recommended for landlords'. \r\nRolling Stone", "asin": "1875989218", "rank": "868175", "city": "Brisbane", "image": "https://images-na.ssl-images-amazon.com/images/I/41CZA2123VL.jpg", "country": "Australia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}