{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 9, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "This is an overlooked classic. Aragon challenges our ideas of the novel without getting to over-the-top. It's an intense memoir that takes place in a very small area of Paris."}, {"review_sentiment": 5.0, "review_text": "A+"}, {"review_sentiment": 5.0, "review_text": "http://PayRefe.net/index.php?ref=274920"}, {"review_sentiment": 5.0, "review_text": "good book"}, {"review_sentiment": 5.0, "review_text": "Beyond surrealism. Aragon knew too well of the pitfalls associated with surrealist writings, and here offers up an extremely lucid portrait of the minutia of Parisian life, only acquired through intense observation, keen understanding, imagination, and a sense of humor."}, {"review_sentiment": 3.0, "review_text": "This book is good, but it's not that good. It's a nice little time capsule. Someone who is not interested in turn of the century Paris or surrealism probably wouldn't enjoy it that much."}, {"review_sentiment": 3.0, "review_text": "Louis Aragon, Paris Peasant (Gallimard, 1926)Aragon, one of the people at the core of the dada, and later the surrealist, movements in France, is a fantastic poet, like most of them were. However, I'm finding, as I move out to explore the prose of the movements after twenty years of enjoying (and being influenced by) the poetry, that most of them were far better poets than they were novelists. There are exceptions, of course (Rene Daumal's unfinished Mount Analogue and Breton/Eluard's Les Champs Magnetiques both made my best-reads-of-the-year list in the early nineties), but Paris Peasant isn't one of them.The book's not bad, for what it is, but it could have been so much more. It encompasses three prose works of Aragon's, two of which seem to be that curious mixture of fiction and nonfiction which has become so popular in recent years, and the third of which is indescribable by normal means other than to say it's prose. The first is a travelogue of sorts, a kind of gutter-level guidebook to an area of Paris that most tourists likely stayed well away from. At a hundred twelve pages, it's by far the longest piece in the book. It's also written in almost stream-of-consciousness style, with no real attempt at coherence or flow, making it a more difficult read than it needed to be. The second details an evening Aragon spent with Breton and Marcel Noll strolling through Paris; it's the strongest of the three, the only one where Aragon's long diversions (which are likely to put one in mind of James or Joyce, though Aragon lacks the command of language of either; that, however, could easily be the fault of the translator rather than Aragon himself) really seem as if they're contributing to the piece, rather than distracting. The third, \"The Peasant's Dream,\" doesn't really seem to fit into the short story or memoir categories; it's tempting to hang the godawful \"flash fiction\" moniker on it, or it would be were it not fifteen pages long. It's not bad, really, but it's not all that great, either; it's just there.A minor, at best, work in the surrealist catalogue. There are many other things that belong in your collection before you set your sights on this one. ** ½"}, {"review_sentiment": 5.0, "review_text": "Often considered one of the definitive surrealist novels (along with Andre Breton's NADJA), Paris Peasant is an exhilarating read. Aragon takes us through a special guided tour of Paris--not the Paris as we know it with  its Eiffel Tower and other famous landmarks, but a Paris of crumbling  arcades, dilapidated shopfronts and suburban parks. Aragon imbues the  detritus of the city with poetry and magic, and shows us how the surrealist  spirit lives in the outmoded structures of civilization. His ode to the  Passage de l'Opera, at that time threatened by Baron Haussmann's plans for  the redevelopment of the city, is a tacit challenge to the rapaciousness of  capitalism and modernization, with its quest for the ever-new and its  destruction of the past. Every urbanite will find something to identify  with in this marvellous portrait of Paris in the 1920s."}, {"review_sentiment": 5.0, "review_text": "This new edition of a scare work is welcome notonly for the exposure it provides to Aragon and his work (if it can be called that), but for the loving manner in which it is produced. From the covers to the typeface to the translation of newspaper column margins, editor Damon Krukowski and designer Naomi Yang, known more for their musical than literary endevours, have brought attention to the smallest detail, the kind of attention that is the substance of the text itself. The translation, from a 1971 edition, flows perfectly; just alien enough from standard English to draw attention to Aragon's linguistic differences, but not a characature of French style. It would be hard to imagine a better English edition of this work. James L. Wolf"}]}, "authors": ["Louis Aragon"], "isbn": "1878972103", "longitude": 2.3514992, "periods": ["1900s"], "title": "Paris Peasant", "word_cloud": "overlook classic challenge idea get intense memoir take place small area http good surrealism know well pitfall associate surrealist writing offer extremely lucid portrait minutia parisian life acquire intense observation keen understanding imagination sense humor good good nice little time capsule interested turn century surrealism probably much people core dada later surrealist movement fantastic poet however find move explore prose movement year enjoy influenced poetry far better poet novelists exception course unfinished make list early ninety bad encompass prose work seem curious mixture fiction nonfiction popular recent year third indescribable normal mean say first travelogue sort kind guidebook area tourist likely stay well away hundred twelve page far longest piece also write almost style real attempt coherence flow make difficult need second detail even spend stroll strongest long diversion likely put mind lack command language however easily translator rather really seem contribute piece rather distract third really seem fit short story memoir category tempt hang godawful flash fiction moniker page long bad really great minor best work surrealist catalogue many thing belong collection set sight often consider definitive surrealist novel exhilarate take special guide tour know famous landmark crumble arcade dilapidate shopfront suburban park imbues detritus city poetry magic show surrealist spirit life outmode structure ode time threaten plan redevelopment city tacit challenge rapaciousness capitalism modernization quest destruction urbanity find something identify marvelous portrait new edition scare work welcome not only exposure provide work call loving manner produce cover typeface translation newspaper column margin editor designer know musical literary en devours bring attention smallest detail kind attention substance translation edition flow perfectly alien enough standard draw attention linguistic difference caricature french style hard better edition work", "genres": ["Fiction & Literature"], "summary": "Paris Peasant (1926) is one of the central works of Surrealism, yet Exact Change's edition is the first U.S. publication of Simon Watson Taylor's authoritative translation, completed after consultations with the author. \r\n\r\nUnconventional in form--Aragon consciously avoided recognizable narration or character development--Paris Peasant is, in the author's words, “a mythology of the modern.” The book uses the city of Paris as a stage or framework, and Aragon interweaves his text with images of related ephemera: café menus, maps, inscriptions on monuments and newspaper clippings. \r\n\r\nA detailed description of a Parisian arcade (nineteenth-century precursor to the mini-mall) and another of the Buttes-Chaumont park, are among the great set pieces within Aragon's swirling prose of philosophy, dream and satire. \r\n\r\nAndré Breton wrote of this work: “no one could have been a more astute detector of the unwonted in all its forms; no one else could have been carried away by such intoxicating reveries about a sort of secret life of the city. . . .”", "asin": "1878972103", "rank": "244849", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/518GPKjuXEL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}