{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 21, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book!!!!!!!"}, {"review_sentiment": 4.0, "review_text": "Beautifully written novel detailing the life of a prostitute during the Fascist government of Mussolini."}, {"review_sentiment": 5.0, "review_text": "I enjoid reading this book it was very amusing and interesting"}, {"review_sentiment": 2.0, "review_text": "Either the famous author, Mr.Moravia just doesn't know how to write from a woman's perspective or he just wanted to create a simple minded person. This book was tedious. The plot sounded interesting: a poor but beautiful Italian girl is dreaming of a husband, children and a simple life in a modest but pretty little house. Instead, she becomes, first a model and then a prostitute. An old story but with tons of potential for \"from rags to riches\" tale. Unfortunately, it was plain boring."}, {"review_sentiment": 5.0, "review_text": "This book is an amazing read in terms of style and plot. The themes it speaks about made me think a lot about mother-daughter relationship, the role of mother in a girl's life, poverty and wealth, various expressions of love, the concept of intellect and many more. The events were described so intensely that I always wanted to check what was going to happen because I got frustrated with my predictions. I loved this book."}, {"review_sentiment": 3.0, "review_text": "I can't say that I liked this novel though it was interesting to the end. Very old fashioned view of women coming from a man from the bourgeoisie. It could have been written by Dostoyevsky. The pure woman with impure life because born poor. The unhappy student with confused ideas about life and himself. Very melodramatic and finally there is no truth or anything to learn from it. Not very realistic about the life of a prostitute and not very informing about how one can become so cut off from reality as Mino  was.....apart his at times grandiosity betrayed then by his acts. One finishes this novel by wondering why this was thought to be one of the best books of Moravia."}, {"review_sentiment": 3.0, "review_text": "The main character in this novel is a young girl who progresses into prostitution but does not end there. Moravia's telling of her reactions to her various 'lovers' and their relationships to each other is strained and simple minded."}, {"review_sentiment": 5.0, "review_text": "You really understand the feelings of the main character....and probably typical of her upbringing in those times"}, {"review_sentiment": 2.0, "review_text": "After wading through this evidently much-appreciated book, I was left with the idea that for me it finally is nothing more nor less than what I might call a restatement of an old theme that goes: \"Disadvantaged people have terribly difficult lives, are vastly unreflective probably owing to their socio-economic status, and no matter what they try, they prove to us once again that it is almost, if not entirely, impossible for a person such as Adriana to change one whit of her life.\"The characters, although not well developed, are almost stereotypes and none of them is really very interesting. If you can't really feel anything about a character you can't learn much and you certainly find it hard to keep reading.  This story is legion and has been part of human existence for probably a zillion years.  If you're trapped, you're trapped, and incapable of thinking in any way that we might today call \"out of the box.\"  You can't even see the box, much less spell it."}, {"review_sentiment": 5.0, "review_text": "So much better than Boredom. This book, besides being a \"good read\" gives the reader much to think about. It is not outdated and makes you understand why Moravia is so well thought of as an author."}]}, "authors": ["Alberto Moravia"], "isbn": "1883642809", "longitude": 12.4829321, "periods": ["1900s"], "title": "The Woman of Rome: A Novel", "word_cloud": "great beautifully write detail life prostitute fascist government enjoin read amuse interest famous author know write perspective want create simple mind person tedious plot sound interesting poor beautiful italian girl dream husband child simple life modest pretty little house instead become first model prostitute old story ton potential rag rich tale unfortunately plain boring amazing term style plot theme speak make think lot relationship role mother girl life poverty wealth various expression love concept intellect many event describe intensely always want check go happen get frustrated prediction love like interesting end old fashion view woman come man bourgeoisie write pure impure life bear poor unhappy student confuse idea life melodramatic finally truth anything learn not realistic life prostitute inform become cut reality time grandiosity betray act finish wonder think best moravia main character young girl progress prostitution end tell reaction various relationship strain simple mind really feeling main character probably typical upbringing time wad evidently leave idea finally nothing le restatement old theme go disadvantage people terribly difficult life vastly reflective probably owe status matter almost entirely impossible person change life character well develop almost stereotype none really interesting really anything character much certainly find hard keep reading story legion part human existence probably year trap trap incapable think way today box even box much le spell so much better besides good give much outdated make understand well think author", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "The glitter and cynicism of Rome under Mussolini provide the background of what is probably Alberto Moravia’s best and best-known novel — The Woman of Rome. \r\n\r\nIt’s the story of Adriana, a simple girl with no fortune but her beauty who models naked for a painter, accepts gifts from men, and could never quite identify the moment when she traded her private dream of home and children for the life of a prostitute.\r\n\r\nOne of the very few novels of the twentieth century which can be ranked with the work of Dostoevsky, The Woman of Rome also tells the stories of the tortured university student Giacomo, a failed revolutionary who refuses to admit his love for Adriana; of the sinister figure of Astarita, the Secret Police officer obsessed with Adriana; and of the coarse and brutal criminal Sonzogno, who treats Adriana as his private property. \r\n\r\nWithin this story of passion and betrayal, Moravia calmly strips away the pride and arrogance hiding the corrupt heart of Italian Fascism.", "asin": "1883642809", "rank": "1147107", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/41uXGxHbCrL.jpg", "country": "Italy", "story_arc": ["Tragedy", "Things only get worse"]}