{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 9, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "Interesting!"}, {"review_sentiment": 5.0, "review_text": "The book contains a series of fictional short stories which are original and creatively written.  I thought the imagery of Vietnam to be stimulating.  As a resident of Hanoi and two year traveler through North Vietnam I found themes to be interesting from a historical perspective as well as culturally to know and understand what the writers considered important in their day to day lives.  All of the writers were Vietnamese.  I would highly recommend this book to anyone, but most of all to readers who have an interest in Asian studies generally or Vietnam in particular.  I haven't often read fictional short stories, but it reading this book I am a convert to read more, particularly about Southeast Asia."}, {"review_sentiment": 4.0, "review_text": "I bought this book as a travel companion on my trip to Vietnam.  The book is very appropriate for that purpose, but as a literary collection, the stories are of varying quality.  My guess is that a lot gets lost in translation.  I wish there were more footnotes or some sidebar to give context to some cultural issues that I'm not aware of or to just give me basic info about the other singers, poets, authors, etc. mentioned in the stories.  Additionally, some of the stories felt like they had interesting themes but were poorly written, and I wonder if the translations have something to do with that.  Overall though, I think it's great book to read before or during a trip to Vietnam."}, {"review_sentiment": 4.0, "review_text": "But on the whole, it gave me a good look into the people of Vietnam and what they are like.  I didn't expect a \"kinder, more gentler country\" for my trip but based on theses stories, that is indeed what I will find when I get there."}, {"review_sentiment": 5.0, "review_text": "Book is in excellent condition and arrived quickly.  Sadly, I didn't get to go to Vietnam to teach as planned so I guess I erally should resell it."}, {"review_sentiment": 5.0, "review_text": "I've been reading many books in preparation for a three week trip to Vietnam in May.  I've intentionaly stayed away from books about the war in favor of snapshots of everyday life.  Vietnam:A Treveler's Literary Compananion, provides a very initimate look into the everyday lives of Vietnamese from all strata of society.  The collection of stories provides insights into how the Vietnamese view their lives, country and relationships.  This is a perfect compliment to travel guides."}, {"review_sentiment": 5.0, "review_text": "This was a perfect book to bring along , while traveling in Vietnam. The stories was from different times and very varied.It was a great introduction to this wonderful country."}, {"review_sentiment": 5.0, "review_text": "Deeper understanding through a perfectly weighted selection of short stories.In the three days I took to leisurely read these short stories I have gained greater insight into, and connection with, the people of Viet Nam than the couple of months living in sai gon, riding a 50cc honda in the mental traffic and taking language classes five days a week.To set this in perspective, after living in Sai Gon for a couple of months and struggling with many of the Viet ways, I really needed a break and took off to the Island of Phu Quoc in the gulf of Thailand with my wife.  I found this book in the hotel bookshelf.  No electricity 10-18hrs a day and idyllic beach island long weekend.  This book gave me something really worthwhile to take away - deeper understanding beyond even the content of the pages themselves.  I have thought of these stories many times in the week since I read them as they resonate with life in modern Viet Nam."}, {"review_sentiment": 3.0, "review_text": "This book was published in 1996 and contained 14 writers, who contributed 16 short stories and one excerpt from a novel. Eight authors were from the north, including one who was living abroad, and six were from the south, all but one of whom had emigrated to the United States. Two contributors, the Vietnamese-Americans Nguyen Qui Duc and Andrew Lam, wrote originally in English, the others were translated from Vietnamese.The oldest writers were Doan Quoc Sy (1923-), a northerner who fled to the south in 1954, was imprisoned from 1976-91 and permitted to leave for the United States in 1995; Linh Bao (1926-), a southerner who emigrated to the United States; and Vu Bao (1931-), who fought for the north against the French and then the Americans. Most of the other writers were born between 1945 and 1960. These included the popular Duong Thu Huong and Bao Ninh, as well as Nguyen Huy Thiep. Nguyen has been called particularly influential for his choice of subject matter and use of language, and four works by him were included. Of all the authors, four were women.With a few exceptions, the anthology sought to avoid stories that touched directly on war, and focused instead on other concerns -- among them, the relations between people as they struggled to get along in postwar Vietnam or reconcile with loss and memories of the past; the remembrance of family; and relationships. Many of the stories were set among peasants in the countryside or the urbanites of Hanoi and Ho Chi Minh City, and also included a Vietnamese-American returnee as well as an émigré in Southern California. Most of the works were written in the 1990s. The earliest story was Doan's, dating from the 1970s, a parable-like piece involving a soldier in the jungle and a fish stranded in a stream. The compilers said it referred to a century-old folk poem.A very brief introduction by the compilers mentioned that although literary expression in Vietnam dates back 2,000 years, mainly involving oral and written poetry, the Western-style novel was introduced only in the early 20th century and Western-style short stories date to the late 1800s. Together with diverse literary influences from China, French romanticism and naturalism and the later Soviet socialist realism, they mentioned the continued hold of Taoism, Buddhism and Confucianism on the culture.For me, the most interesting works in the collection were a story by Nguyen Huy Thiep in which a man went hunting in the jungle, encountered wild monkeys and had a series of quixotic adventures. Maybe he gained an awareness of the worth of nonhuman life, maybe he remained a fool. Although the piece was interesting just for its surface description, I couldn't help feeling I was missing things on a symbolic level. The events seemed to be leading up to some revelation that never quite came.Another of his stories, \"Fired Gold,\" involved figures from Vietnamese history of 200 years ago and offered three conclusions, so that each reader could choose the one \"most suitable.\" This story's been called important, among other things, for using history to comment obliquely on present political circumstances, while putting many of the comments in the mouth of a foreign character who may be considered untrustworthy or even insane: \"Decrepit Confucian practices and political masturbation will never result in pure or wholesome relations. A time will come when the worldwide polity will seem like an exotic mixed salad, and the very concept of moral purity will possess no significance.\"The literary style was mixed, describing events of long ago in rhetorical phrases typically found in bureaucratic jargon or Communist Party speeches: \"The beauty and glory of a people are based on neither revolution nor war, on neither ideologists nor emperors. In grasping this, people can live more simply, reach their full potential, and be in greater accordance with nature.\" It was the most formally experimental piece by far in the collection and the most difficult to interpret.Another story of his put passengers from different walks of life -- a Buddhist monk, a poet, a teacher, two merchants, a mother and child, two lovers, a robber -- on a ferry crossing a river. Various small dramas occurred to illustrate how each approached life. The teacher recited the words of an 18th century national poet: \"Heels muddied in the pursuit of wealth and fame, Weather-beaten faces revealing life's cataclysms, Thoughts of helping the world bring pain. Bubbles in the ocean of misery, duckweed at the dark shore's edge, The taste of the world's troubles numbs the tongue, fills the body with misery, The journey through this world is bruising, full of obstacles. Waves in the mouth of the river rise and fall. The boat of illusion pitches and rolls at the edge of the waterfall.\"At the end, the boat reached shore, discharging the passengers, while the monk remained on board, whispering a line from a sutra on \"crossing to the other side\": \"Going. Going. Thoroughly gone. Awakened!\"Another, by Ho Anh Thai, introduced a narrator who saw his boss transformed into a goat, while one of the other characters in the story claimed that all she saw around her was a society of such beasts driving bicycles, motorcycles and cars.The longest story, by Le Minh Khue, was also one of the more complex, told by a narrator who linked a retired party member of high rank with several tragedies in his past; a young couple in love, whose fate was tied to the party member through incredible coincidence; and a man who'd murdered his father.The piece by one of the compilers, Nguyen Qui Duc, described a brief near-romance between a Vietnamese-American returnee and a woman marrying a foreigner she didn't love in order to get out of the country. It combined a focus on the sadness of feelings that had to be denied for the sake of obligation -- something that felt characteristically Vietnamese -- with phrases that could've come from an American yuppie (\"She had feet to die for.\" \"I lost it.\")I finished this varied collection thinking how many of the stories were concerned with memory, sacrifice, sorrow and loss -- sometimes powerfully, sometimes melodramatically -- and with melancholy resignation, very occasionally with a sly sense of humor. And how others were too cryptic and unfamiliar to clearly understand.Other English-language anthologies for Vietnam include Vietnamese Short Stories: An Introduction (1986), The Other Side of Heaven: Postwar Fiction from Vietnamese and American Writers (1995), Night, Again: Contemporary Fiction from Vietnam (1996, revised edition 2006), and Love after War: Contemporary Fiction from Vietnam (2003). An anthology for Southeast Asia that contains four good stories by Vietnamese writers is Virtual Lotus: Modern Fiction of Southeast Asia (2002)."}]}, "authors": ["John Balaban", "Nguyen Qui Duc"], "isbn": "1883513022", "longitude": 0.0, "periods": ["1900s"], "title": "Vietnam: A Traveler's Literary Companion", "word_cloud": "interest contains series fictional short story original creatively write think imagery stimulate resident year traveler find theme interesting historical perspective well culturally know understand writer consider important day day live writer vietnamese highly anyone reader interest asian study generally particular often fictional short story read convert particularly southeast buy travel trip appropriate purpose collection story vary quality guess lot get lose translation wish footnote sidebar give context cultural issue aware give basic info singer poets author etc mention story story felt interest theme poorly write wonder translation something overall think great trip whole give good look people expect gentler country trip base thesis story indeed find get excellent condition arrive quickly get teach plan guess really resell read many preparation week trip intentional stay war favor snapshot everyday life provide initiate look everyday live vietnamese stratum society collection story provide insight vietnamese view life country relationships perfect compliment travel guide perfect bring travel story different time great introduction wonderful country understand perfectly weight selection short day take leisurely short story gain greater insight connection people couple month live sari hon rid honda mental traffic take language class day set perspective living couple month struggle many way really need break take gulf wife find hotel bookshelf electricity day idyllic beach island long weekend give something really worthwhile deeper understand even content page think story many time week resonate life modern publish contain writer contribute short story excerpt author north include living abroad south emigrate contributor write originally english others translate oldest writer northerner flee south imprison permit leave southerner emigrate fight north french most writer bear include popular well call particularly influential choice subject matter use language work include author exception anthology seek avoid story touch directly war focus instead concern relation people struggle postwar reconcile loss memory remembrance family relationships many story set peasant countryside urbanize also include returnee well work write earliest story date piece involve soldier jungle fish strand compiler say referred folk brief introduction compiler mention expression date back year mainly involve oral write poetry introduce early century short story date late diverse influence french romanticism naturalism later soviet socialist realism mention continue hold interest work collection story man go hunt jungle encounter wild monkey series quixotic adventure maybe gain awareness worth nonhuman life maybe remain fool piece interesting surface description feel miss thing symbolic level event seem lead revelation never quite story involve figure vietnamese history year ago offer conclusion suitable story call important thing use history comment obliquely present political circumstance put many comment mouth foreign character untrustworthy even insane confucian practice political masturbation never result pure wholesome relation time come worldwide polity seem exotic mixed salad concept moral purity posse significance style mixed describe event long ago rhetorical phrase typically find bureaucratic jargon speeches beauty glory people base revolution war ideologist emperor grasp people live simply full potential greater accordance nature formally experimental piece far collection difficult story put passenger different walk life monk poet teacher merchant child lover robber ferry cross river small drama occur illustrate approach life teacher recite word century national poet muddy pursuit wealth fame face reveal life cataclysm help world bring pain ocean misery duckweed dark shore edge taste world trouble numbs tongue fill body misery journey world bruise full obstacle wave mouth river rise fall boat illusion pitch roll edge waterfall end boat reach shore discharge passenger monk remain board whisper line supra cross side go go go introduce narrator saw bos transform goat character story claim saw society beast drive bicycle motorcycle longest story also complex tell narrator link retired party member high rank several tragedy young couple love fate tie party member incredible coincidence man murder piece compiler describe brief returnee woman marry foreigner love order get country combine focus sadness feeling deny sake obligation something felt characteristically vietnamese phrase american yuppie foot die lose finish varied collection think many story concerned memory sacrifice sorrow loss sometimes powerfully sometimes melodramatically melancholy resignation occasionally sly sense humor others cryptic unfamiliar clearly anthology include other vietnamese american revise edition anthology contain good story vietnamese writer", "genres": ["Fiction & Literature"], "summary": "Since relations between the U.S. and Vietnam have normalized, many more people are traveling to this exotic country, previously closed to a generation of Western visitors. Vietnam provides one of the first chances for Americans to know the Vietnamese outside the context of war. \r\n\r\nVietnamese have been telling stories for thousands of years, in poetry and in song, in Chinese script and then in Vietnamese nôm, and more recently, in novels and short stories. \r\n\r\nThese 17 stories, from contemporary Vietnamese writers living in Vietnam and abroad, take the literary traveler to extraordinary places: from the jungle-clad mountain ranges of the North to the mysterious silence of the old capital along the Perfume River. Proximity of the spirit world, love of family, exhaustion from war, one's Confucian, Taoist, and Buddhist obligations, social protest, and the hunger for a better life — these are some of the concerns to be encountered in these thrilling landscapes. \r\n\r\nContributors include Nguyen Huy Thiep, Linh Bao, Nguyen Ba Trac, Thich Duc Thien, Ho Anh Thai, Le Minh Khue, Doan Quoc Sy, Vu Bao, Duong Thu Huong, Andrew Q. Lam, Nguyen Qui Duc, Qui The, Bao Ninh, and Pham Thi Hoai.", "asin": "1883513022", "rank": "180383", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/51h42nQ0wLL.jpg", "country": "Hanoi", "story_arc": ["Tragedy", "Things only get worse"]}