{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 24.5895489, "ratings": {"num_ratings": 32, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Great  condition for a book billed as \"Good\""}, {"review_sentiment": 1.0, "review_text": "Good way to learn about the culture of Costa Rica...The stories stay in my head and make me want more"}, {"review_sentiment": 3.0, "review_text": "Interesting stories but great literature it is not."}, {"review_sentiment": 5.0, "review_text": "Sent to my Dad to read because he wants to move there , and he loves it.!"}, {"review_sentiment": 4.0, "review_text": "If you're looking for travel writings or light beach reading, forget it.  But if you want thoughtful short fiction, it's great."}, {"review_sentiment": 4.0, "review_text": "I read this book while I was on a tour in Costa Rica.  I enjoyed doing it that way.  The chapters (stories) are relatively short so I could read them in small windows of time.  They illustrated aspects of the culture and attitudes of the native peoples."}, {"review_sentiment": 4.0, "review_text": "Integrering to read Nobels, not only guidebooks."}, {"review_sentiment": 4.0, "review_text": "Very clean, nice copy."}, {"review_sentiment": 5.0, "review_text": "I read this book before traveling to Costa Rica. I think the book gives much insight into the social and economic realities of the country, which can be especially important for tourists. Definitely recommend reading this before traveling -"}, {"review_sentiment": 5.0, "review_text": "PPP=Perfectly pleasing purchase"}]}, "authors": ["Barbara Ras", "Oscar Arias"], "isbn": "1883513006", "longitude": -107.3920441, "periods": ["1900s"], "title": "Costa Rica: A Traveler's Literary Companion", "word_cloud": "condition bill good good way learn culture story stay head make want interest story great literature want move love look travel writing light beach read forget want thoughtful short fiction great tour enjoy way chapter story relatively short small window time illustrate aspect culture attitude native people interfere guidebook very clean nice copy travel think give much insight social economic reality country especially important tourist definitely recommend read travel please purchase", "genres": ["Fiction & Literature"], "summary": "Journey into the Costa Rican imagination through twenty-six remarkable stories, selected and organized regionally for the curious traveler. Here, for the first time in English, the best of Costa Rica's writers conjure the country's allure and vitality, its coffee fields and palm groves, cicadas and songbirds, shrouded mountains and blazing savannas, while telling stories unique to Costa Rican life.\r\n\r\nContributors include Alfredo Aguilar, Fernando Durán Ayanegui, Alfonso Chase, Quince Duncan, Fabián Dobles, Louis Ducoudray, Carlos Luis Fallas, Mario Gonzáles Feo, Joaquín Gutiérrez, Carlos Salazar Herrera, Max Jiménez, Carmen Lyra, Carmen Naranjo, Yolanda Oreamuno, Abel Pacheco, Julieta Pinto, Uriel Quesada, Samuel Rovinski, José León Sánchez, and Rima de Vallbona.", "asin": "1883513006", "rank": "187709", "city": "Costa Rica", "image": "https://images-na.ssl-images-amazon.com/images/I/51XzhHo7esL.jpg", "country": "Mexico", "story_arc": ["Tragedy", "Things only get worse"]}