{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 38, "rating": 4.3, "reviews": [{"review_sentiment": 3.0, "review_text": "the author uses a lot of mispelled words to help denote an accent- but it was way too distracting.  I'm sure some people will love it. But I hoped for better."}, {"review_sentiment": 5.0, "review_text": "another good read"}, {"review_sentiment": 5.0, "review_text": "Nelson Algren, are  you kidding he's the best."}, {"review_sentiment": 5.0, "review_text": "I had the opportunity to watch a new documentary film, \"Nelson Algren: The End is Nothing, the Road is All\" in which one of the interviewees refers to Algren (1909 -- 1981) as the \"poet of the lost\".  The film moved me to revisit Algren, a writer I don't know well, and to read his best-known novel, \"The Man With The Golden Arm\".  Algren received the first National Book Award for this novel in 1950 -- an outstanding initial choice for a premiere literary award.  In the novel, Algren tells the story of lost, lonely individuals. He writes with a harsh beauty amply justifying the film's reference to him as the \"poet of the lost\".  The novelist Kurt Vonnegut who knew Algren refers to him near the end of the film as \"the loneliest man I ever met\", a description that would apply to many of the characters in Algren's award-winning novel.The novel is set in the bars, cheap apartments, prisons, and streets frequented by the Chicago underclass in 1947- 1948.  The novel's main character, who goes by the name of Frankie Machine, has acquired the nickname of the \"man with the golden arm\" due in part to his steadiness in dealing cards. Frankie aspires to put his steadiness of arm, wrist and hand to use by becoming a jazz drummer. Characters in this novel often are called by their roles, and Frankie is known as \"Dealer\". Frankie served in the Army in WW II, took a severe wound to the stomach, and became a morphine addict. Algren's novel is one of the first to explore seriously and realistically the use of drugs.The novel is filled with low life, highly differentiated characters, including Frankie's friend Solly, a mildly-retarded petty thief who usually is called Sparrow, or \"punk\".  Frankie is unhappily married to Sophie, called \"Zosh\" who is bitter and confined to a wheelchair after an accident with Frankie driving the car. Frankie has a mistress, Mollie, a stripper and bar maid; Sparrow has a mistress, Violet, whom he sees when her husband, the Old Man is asleep or in his cups.  The book is replete with shady, colorful characters, including the bar owner, the keeper of the fixed card games that uses Frankie as the dealer, crooked lawyers, quack doctors, gamblers, drunks, petty criminals, and fixers.The plot develops slowly and involves Frankie and Sparrow's relationship and the accidental killing of the fixer, Louis, which results in Frankie's attempt to evade the law. The novel is in two lengthy sections with most of the action and plot development taking place in the second section. Most of the book consists of a lengthy series of vignettes of varying lengths separated by paragraph breaks. These small sections each focus on a particular scene and a small group of individuals.  They develop character and settings. Aspects of the story get foretold in each of the settings but dimly so with the overall focus of the story becoming clear only as it proceeds. The scenes are often not chronological and sometimes tend to run into each other with an almost surrealistic effect.Much of the novel is in dialogue and full of the slang of the late 1940s.  The book is replete with religious, racial, and national derogatory terms that would not meet contemporary standards  The book is full of quotations from billboards, ads, and popular songs.  The omniscient narrator's voice is, in contrast to the dialogue, poetic and rhythmical. With its lyricism, the novel concludes fittingly with a poem. Throughout the book,  the narrator describes and comments on the characters and their actions with a mix of compassion and irony.  In this passage early in the novel, the narrator comments on the American dream through Frankie's eyes.\"The great, secret and special American guilt of owning nothing, nothing at all, in the one land where ownership and virtue are one.  Guilt that lay crouched behind every billboard which gave each man his commandments; for each man here had failed the billboards all down the line.  No Ford in this one's future nor ever any place all his own.  Had failed before the radio commercials, by the street car plugs and by the standards of every self-respecting magazine.  With his own eyes he had seen the truer Americans mount the broad stone stairways to success surely and swiftly and unaided by others; he was always the one left alone, it seemed at last, without enough sense of honor to climb off a West Madison Street Keep-Our-City-Clean box and not enough ambition to raise his eyes back to the billboards.\"The following passage describes a nightly gathering of suspects in a local police station.\" Yet they come on and come on, and where they come from no captain knows and where they go no captain goes: mush workers and lush workers, catamites and sodomites, bucket workers and bail jumpers, till tappers and assistant pickpockets, square johns and copper johns; lamisters and hallroom boys, ancient pious perverts and old blown parolees, rapoes and record-men; the damned and the undaunted, the jaunty and condemned.\"The novel starts slowly and with some rough edges gathers in force and conviction. The reader gradually gets drawn into the settings and develops a feeling for the characters and their struggles and failings without romanticizing them. \"We are all members of one another\" is a theme driven home in the work through all the stories of isolation, frustration and loneliness.  \"The Man With The Golden Arm\" is slow and difficult; but it is an American masterwork.  I am grateful to the documentary I saw for getting me to read this novel at last.Robin Friedman"}, {"review_sentiment": 5.0, "review_text": "First Algren novel I've read.  He was recommended to me by someone and I've seen the movie based on *Requiem for a Dream* and think it's great, so I gave this a shot.  I wasn't disappointed - Algren is a great writer and this story, these characters, get into your bones and won't go away.  The humanity and loss and desperation and grace jump out off the page.  He has to be one of the best post-WWII American authors, and no one even talks about him anymore.  Why is that?"}, {"review_sentiment": 5.0, "review_text": "This is a classic novel and the kind of writing you don't see much of any more. It perfectly captures life in the Northside ethnic neighborhoods of Chicago during the immediate post-World War II era."}, {"review_sentiment": 4.0, "review_text": "This is an oldie but goodie.  The language is dated but the message is not.If you like Jack Kerouac, Neal Cassidy, William Burroughs, you will like this."}, {"review_sentiment": 2.0, "review_text": "This story begins somewhat darkly. Our friends are in the slammer, and they are getting little respect from the orderlies.After release, we get a look at their lives, and the lives of their buddies and women. And the picture is bleak.I thought this was going to be an adventure/drama type story. Now I wonder what the point is. Is this a comedy? Because there are funny angles. Is it a commentary on society? Or is it a glimpse at how some pathetic souls live? Are we supposed to do something? How can we do anything?It is a dark story for sure. Frank and Sophia. Violet and Stash.Smoky, rank poker halls, where the fix is always in. All live in misery, the hustled and the hustlers.This is a book I did not want to pick up again. A bad choice for the first award. A bit like 'them' from Joyce Carroll Oates. A terrifically sad, depressing story about the lost souls humanity may always have.Glad to be done with it. Now on to a good story."}, {"review_sentiment": 5.0, "review_text": "I was introduced to Nelson Algren while reading \"The Third Coast\", by Thomas Dyja.  So I looked up the Frank Sinatra movie on Youtube.  Being still unsatisfied I decided to go to the source.  Where might one find a reasonably priced hardcover edition to add to his library?  Amazon partners of course.  \"The Man with the Golden Arm\" is essential reading for anyone with a connection to or affinity for Chicago.  Or for that matter, anyone who prizes authenticity and grit along with prose that are every bit the equal of Faulkner."}, {"review_sentiment": 5.0, "review_text": "Prompt, condition was as described. Book was packaged well and enveloped in plastic and this was purchased after staying in a cottage Mr. Algren briefly owned and in which he entertained his lover, Simone de Bouviour"}]}, "authors": ["Nelson Algren"], "isbn": "1888363185", "longitude": -87.6244212, "periods": ["1900s"], "title": "The Man with the Golden Arm", "word_cloud": "author use lot misspell word way distract sure people love hop better good kid best opportunity watch new documentary film end interviewees refers poet lose film move revisit writer know well receive first outstanding initial choice premiere literary award tell story lose lonely individual write harsh beauty amply justify film reference poet lose novelist know refers end film loneliest ever meet description many character set bar cheap apartment prison street frequent underclass main character go name acquire nickname due part steadiness deal card aspire put steadiness wrist hand use become jazz drummer often call role know serve take severe wound stomach become morphine addict first explore seriously realistically fill low life highly differentiated character include friend petty thief usually call punk unhappily marry call bitter confine wheelchair accident driving car mistress stripper bar maid mistress see husband asleep cup replete shady colorful character include bar owner keeper fix card game use dealer crook lawyer quack doctor gambler drunks petty criminal plot develop slowly involve relationship accidental kill fixer result attempt evade law lengthy section action plot development take place second section most consist lengthy series vignette vary length separate paragraph small section focus particular scene small group individual develop character setting story foretold setting dimly overall focus story become clear proceeds scene often chronological sometimes tend almost surrealistic dialogue full slang late replete religious racial national derogatory term contemporary standard full quotation billboard ad popular song omniscient narrator voice contrast dialogue poetic rhythmical lyricism concludes fittingly poem narrator describe comment character action mix compassion irony passage early narrator comment american dream eye great secret special american guilt own nothing nothing land ownership lay crouch billboard give commandment fail billboard line future ever place fail radio commercial street car plug standard magazine eye see truer mount broad stone stairways success surely swiftly unaided others always leave alone seem last enough sense honor climb box enough ambition eye back following passage describe nightly gathering suspect local police station yet come come come captain know go captain go mush worker lush worker catamite sodomite bucket worker bail jumper till tapper assistant pickpocket square john copper john la misters ballroom boy ancient pious pervert old blown parolee rape damn undaunted jaunty condemn start slowly rough edge gather force conviction gradually get drawn setting develop feel character struggle failing romanticize member theme drive home work story isolation frustration loneliness slow difficult american masterwork grateful documentary saw get recommend someone see movie base think great give shot disappoint great writer story character get bone humanity loss desperation grace jump page best american author even talk anymore classic kind write see much perfectly capture life ethnic neighborhood immediate era oldie foodie language date message story begin somewhat darkly friend slammer get little respect release look live life buddy woman picture think go type story now wonder point be comedy funny angle be commentary society glimpse pathetic soul live suppose something anything dark story sure rank poker halls fix always live misery hustle want bad choice first award bit oates terrifically sad depress story lose soul humanity always do now good story introduce read look movie still unsatisfied decide source find reasonably price hardcover edition add library partner course essential reading anyone connection affinity matter anyone prize authenticity grit prose bit equal prompt condition describe package well envelop plastic purchase stay cottage briefly own entertain lover", "genres": ["Fiction & Literature"], "summary": "A novel of rare genius, The Man with the Golden Arm describes the dissolution of a card-dealing WWII veteran named Frankie Machine, caught in the act of slowly cutting his own heart into wafer-thin slices. For Frankie, a murder committed may be the least of his problems.\r\n\r\nThe literary critic Malcolm Cowley called The Man with the Golden Arm \"Algren's defense of the individual,\" while Carl Sandburg wrote of its \"strange midnight dignity.\" \r\n\r\nA literary tour de force, here is a novel unlike any other, one in which drug addiction, poverty, and human failure somehow suggest a defense of human dignity and a reason for hope.", "asin": "1888363185", "rank": "312653", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/51ig3mp5SjL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}