{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 43, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "Thought-provoking both as an historical chronicle of a place and time that isn't necessarily described often within mainstream historical discussions and also as a coming-of-age story of the main character, who is learning about herself, her family, their world and how it is also hers.Very effective in setting a context that is not today's world but that clearly shaped today's world, including the people living in that context, whether they realize it or not.Recommend it for those who are willing to look beneath the surface and invest something of themselves into a less-than-easy life experience."}, {"review_sentiment": 3.0, "review_text": "Luke Warm read."}, {"review_sentiment": 5.0, "review_text": "I got this book for my class on Los Angeles history, and I really enjoyed it. The book flowed well and had a very entertaining storyline. This was one book that I actually took the time to read cover to cover rather than skim through. Though its been a while since I read this book, this book makes me smile whenever I think about it. I really appreciated following the narrator's path to self-discovery while she is seeking to unveil the truth about this history. I would recommend this book to anyone who is interested."}, {"review_sentiment": 5.0, "review_text": "There are not enough good things to say about Revoyr's Southland. The novel is beyond incredible and dare I say that Ms. Revoyr is perhaps one of the best contemporary authors of our time. It is a gripping and wonderful novel about tough times in Los Angeles county. Those who have lived through the era following WWII will relate to the heated, racial tensions between that erupted during the Watts riots. If you are part of the latter generation, you will experience a harsh dose of reality as you move with the main character in her search for the killer of four young African American men. The book is extremely realistic, staying true to the time period but also being captivating in that Revoyr's writing style is both creative and engaging.  This novel will speak most heavily to native Angelinos but is transcendent and makes a terrific read for anyone attempting to understand the fabric of the star-studded town of L.A"}, {"review_sentiment": 4.0, "review_text": "well written historical picture of LA as it was"}, {"review_sentiment": 5.0, "review_text": "A good mysterious crime theme to read over summer or just for fun. A lot of racial/segregation of color people are brought up in the story. Overall, very interesting piece."}, {"review_sentiment": 5.0, "review_text": "What a great read - perfect balance of mystery, suspense, and tragedy.  The characters are so diverse, yet still very familiar.  My only gripe is the cast - it took me a few chapters (& a side note) to get familiar with this sizable group of characters that span across different families and decades. Regardless, this book was *not* disappointing, at all."}, {"review_sentiment": 4.0, "review_text": "A mystery rolled into history."}, {"review_sentiment": 5.0, "review_text": "I lived through the Watts Riots in LA  so this book confirmed a number of \"suspicions\".Nina's description of Lanier fits my husband in many respects. He also told me of his experience as a soldier in an all Black unit in Korea--the story about the Korean child is almost the same as he told it to me.This was a re-read for me as I first read the book when it came out."}, {"review_sentiment": 5.0, "review_text": "gr8"}]}, "authors": ["Nina Revoyr"], "isbn": "1888451416", "longitude": -118.244476, "periods": ["1900s", "Recent Releases"], "title": "Southland", "word_cloud": "historical chronicle place time necessarily describe often mainstream historical discussion also story main character learn family world also effective set context today world clearly shape today world include people live context realize willing look beneath surface invest something life experience get class history really enjoy flow well entertaining story line actually take time cover cover rather skim make smile think really appreciate follow narrator path seek unveil truth history anyone interested enough good thing say incredible dare say perhaps best contemporary author time grip wonderful tough time county live era follow relate heat racial tension erupt riot part latter generation experience harsh dose reality move main character search young african american men extremely realistic stay true time period also captivate write style creative engaging speak heavily native transcendent make terrific anyone attempt understand fabric town well write historical picture good mysterious crime theme summer fun lot color people bring story interesting piece great perfect balance mystery suspense character diverse yet still familiar gripe cast take chapter side note get familiar sizable group character span different family decade regardless disappoint mystery roll history live confirm number suspicion description fit husband many respect also tell experience soldier unit story child almost tell first come", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Southland brings us a fascinating story of race, love, murder and history, against the backdrop of an ever-changing Los Angeles. A young Japanese-American woman, Jackie Ishida, is in her last semester of law school when her grandfather, Frank Sakai, dies unexpectedly. \r\n\r\nWhile trying to fulfill a request from his will, Jackie discovers that four African-American boys were killed in the store Frank owned during the Watts Riots of 1965. Along with James Lanier, a cousin of one of the victims, Jackie tries to piece together the story of the boys’ deaths. In the process, she unearths the long-held secrets of her family’s history.\r\n\r\nSouthland depicts a young woman in the process of learning that her own history has bestowed upon her a deep obligation to be engaged in the larger world. And in Frank Sakai and his African-American friends, it presents characters who find significant common ground in their struggles, but who also engage each other across grounds—historical and cultural—that are still very much in dispute.\r\n\r\nMoving in and out of the past—from the internment camps of World War II, to the barley fields of the Crenshaw District in the 1930s, to the streets of Watts in the 1960s, to the night spots and garment factories of the 1990s—Southland weaves a tale of Los Angeles in all of its faces and forms.\r\n\r\nNina Revoyr was born in Japan, raised in Tokyo and Los Angeles, and is of Japanese and Polish-American descent. She lives and works in Los Angeles.", "asin": "1888451416", "rank": "369194", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/513lM%2Bc9mWL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}