{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 31, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "I really enjoyed the read. This story reminds us of the many that have had to live in unsavory conditions in the country."}, {"review_sentiment": 5.0, "review_text": "I really enjoy Steinbeck literature."}, {"review_sentiment": 3.0, "review_text": "Good couple of articles but not enough to really dig into the heart of the matter. Wish it was more thorough"}, {"review_sentiment": 5.0, "review_text": "A must if you have ever read The Grapes of Wrath.  Steinbeck does a great job describing life for agricultural workers in 1930's California."}, {"review_sentiment": 5.0, "review_text": "Interesting book by a great writer."}, {"review_sentiment": 5.0, "review_text": "Part of my family is in this and this is the way I grew up. This is some good reading and tells the story of truth. Must read!"}, {"review_sentiment": 5.0, "review_text": "As fine a novelist as he was, Steinbeck was an engaging journalist. In these reports on the migrants who appear in Grapes of Wrath, the effects are no less moving than in the novel."}, {"review_sentiment": 5.0, "review_text": "Perfect condition & a great insight to the mind of Steinbeck's Grapes of Wrath Novel"}, {"review_sentiment": 5.0, "review_text": "Good book"}, {"review_sentiment": 3.0, "review_text": "I haven't read it yet, but I'm sure it'll be Interesting reading."}]}, "authors": ["John Steinbeck"], "isbn": "1890771619", "longitude": -118.244476, "periods": ["1900s"], "title": "The Harvest Gypsies", "word_cloud": "really enjoy story remind many live unsavory condition country really literature good couple article enough really dig heart matter ever great job describe life agricultural worker interest great writer family way grow good reading tell story truth fine novelist engage journalist report migrant appear effect le move perfect condition great insight mind good yet sure interest reading", "genres": ["Essay", "Social & Cultural Studies", "Photography"], "summary": "Gathered in this volume are seven long-form articles that John Steinbeck wrote in 1936 about the plight of migrant farmworkers during the Dust Bowl, accompanied by photographs by Dorothea Lange and others. \r\n\r\nSteinbeck toured the squatters' camps and Hoovervilles of California, creating unforgettable portraits of once strong, independent farmers reduced to misery. \r\n\r\nThe inquisitiveness and outrage of an investigative reporter combined with the expressive powers of a novelist in his prime fueled The Harvest Gypsies, which in turn furnished the factual and emotional roots for The Grapes of Wrath and has long been hailed as an American classic in its own right.", "asin": "1890771619", "rank": "192969", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/51DlLJn0s0L.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}