{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 10, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "Interesting book for San Francisco Noir fans. The preface is horrible, it reads like the author is trying to write a novel, but he's trying way too hard.  My recommendation ?  Skip the preface, and enjoy the following pages."}, {"review_sentiment": 4.0, "review_text": "Concise description of locations used in films noir shot in and around San Francisco, about three dozen films all together, with a decent bibliography and a brief guide to festivals and tours devoted to the subject.It's not as thorough as it might be.  Take \"Dirty Harry,\" shot in various place in the city as well as on the studio back lot in Hollywood.  And what does Rich describe?  Kezar Stadium, the place where Clint Eastwood stomps on Andy Robinson's wounded leg.  Nothing about the final shoot out at the gravel mine or whatever it is, just across the bridge in Marin County.  (It's now gone.)  \"The Black Bird\" isn't included in the list of films being discussed.To make up for any inadequacies along that line, Rich does a very neat and perceptive analysis of each of the films themselves.  He's perfectly candid, unkind where unkindness seems justified.At 167 pages it's a short book with lots of white space but it makes interesting reading, leaving some readers, myself included, wanting more."}, {"review_sentiment": 5.0, "review_text": "captures all noir in authentic and complete way."}, {"review_sentiment": 4.0, "review_text": "Interesting guide to movie locations in San Francisco.  If you're a movie buff, and like films like \"Dark Passage,\" you will find this useful."}, {"review_sentiment": 5.0, "review_text": "An excellent little guide not only to some great film noirs, but a very interesting guide to one of my favourite cities.  San Francisco is one of the cleanest cities I have ever visited, but this book shows a grimy, gritty side that I'm sure exists somewhere out of sight of the tourist.  If She does have a nasty side, I like to think it's hidden in the world of film noir.  And yes, I've stood at the corner of Bush and Stockton and wondered why Sam Spade didn't go down to take a look at Miles Archers' body.  And I've got the pictures to prove it!  A very interesting little book that should interest both the film buff and the tourist.  Give it a try."}, {"review_sentiment": 4.0, "review_text": "The premise of the Noir series is to sample writers from each of the cities as they present stories that deal with areas with the city.  This San Francisco edition is no exception.  Sure some are much better than others but this is a wonderful way to sample authors you may not have tried.  RECOMMENDED"}, {"review_sentiment": 5.0, "review_text": "Rich works any number of variations on a theme, and at first what seemed like a liability (the designer's rigid graphic scheme followed by what feels like an exact word count for every entry, no matter if the film is a great one or a lousy one) and makes it into a virtue.  He is a skillful and persuasive prose writer, and his knowledge of these films is profound.  Ok, there may be incidental errors here and there, as the other reviewers have indicated, but when you're reading his book you don't feel it.What's amazing is the strength of his central argument, that San Francisco is such a haunted place that right away it became one of the chief noir sites--early on, in 1940, during the so-called \"gateway period,\" and even more astonishing, that despite the general death of noir when color took over general release in the late 1950s, noir has never really died in San Francisco, and the movies keep getting made on a regular basis.  Noir experts may scoff at the idea of Schlesinger's PACIFIC HEIGHTS as a noir, but Rich shows us how it fits into the old \"real estate noir\" category of THE HOUSE ON TELEGRAPH HILL.  Or David Fincher's THE GAME, or that crazy Richard Gere-Kim Basinger thriller FINAL ANALYSIS.  Who knew?  Yet somehow Nathanial Rich, with his quiet, insistent exegesis, makes you believe.I haven't seen all of the films listed here, nor even seen all the locations, though I plan to take this book on my fist and make a tour soon of the ones I've missed.  There are buildings we go by here in San Francisco, like that huge Art Deco pink marble slab up by Buena Vista Terrace, and we tell each other they were in this or that movie, VERTIGO or DARK PASSAGE, and yet is this a way of reassuring each other, or unsettling each other?  Can't find that building in this book by the way.  Maybe it was just an \"urban\" legend.  If ever I meet Nathaniel Rich, I'll tug at his sleeve till he's by my side on top of that hill and I'll point to it."}, {"review_sentiment": 4.0, "review_text": "This book is very handy, but the author shows his disdain for movies he does not like, which causes him to miss the boat on a few. I feel obliged to say (beforehand) that his writing on the two movies I list has enlightened me on things I did not know, though I have studied these movies for years. I am not from SF, so I can only remark on what I have seen, and what I know.The movie \"Hammett\" may have been shot (mostly) on sound stage, but it does make use of a few real buildings that are still in existence today. He criticizes the stars acting abilities, though the actor was chosen to play Hammett in two different films - a rarity.In \"Impact\" there are a lot more bits of San Francisco that he fails to mention. There was Anna May Wong's running down the alley in Chinatown, views of the Ferry Building that were taken before the Embarcadero hid the view. Street corners and views of bridges abound.All of that said, I look at the book a lot. I consider it more valuable to my collection than \"Footsteps in the Fog.\" which is about Hitchcock's SF and N. Cal."}, {"review_sentiment": 5.0, "review_text": "This is far more valuable than any travel guide I've read -- and most movie guides, for that matter.  We all read novels or see movies set in particular cities and then find our hopes dashed when we go visit them.  For instance: ever read The Fortress of Solitude and then book a hotel room in Times Square?  Doesn't match up.Luckily, the author has collected all the bits and pieces of the film noir canon so that when you go to San Francisco you won't be running around confused.  More than any other major American city, SF seems to have one dominant mood, one overarching spirit.  These films embody that spirit, and by knowing them, you'll know the city.  (Trust me, I grew up there.)On top of this, the book is well-written and entertaining, even if you have no immediate travel plans.  Highly recommended."}, {"review_sentiment": 2.0, "review_text": "The premise and format of this book are unique, but there are some major bits of misinformation in it which should have been looked over by the editor and/or the writer himself before the book was published. #1: the \"Kezar Stadium\" entry: \"Dirty Harry\" shot \"Scorpio\" in the LEG not the chest. #2:the \"Flood Building\" entry:stated that Dashiell Hammett was working for Pinkerton's, in the Flood Building, when he wrote \"The Maltese Falcon\" which is NOT TRUE. He had quit Pinkerton's long before he wrote the book(1922);\"Red Harvest\" and \"The Dain Curse\" both 1929 then \"The Maltese Falcon\" which was published in 1930. #3: the \"Bullitt\" entry:the author describes the chase scene and where it took place but when describing the end of the chase scene, the author flubs BIG TIME! McQueen DID NOT return to the police station in the Mustang as the author states. The Mustang was disabled when the car spun out on a dirt shoulder, opposite the explosion, the front end winding up in a \"ditch\" thereby breaking the front axel. Evidently the publisher/editor whizzed this book thru publication before checking it for major flaws!"}]}, "authors": ["Nathaniel Rich"], "isbn": "1892145308", "longitude": -122.4192363, "periods": ["1900s", "2000s", "Recent Releases"], "title": "San Francisco Noir", "word_cloud": "interesting fan preface horrible read author try write try way hard recommendation preface enjoy follow page description location use film shot dozen film together decent bibliography brief guide festival tour devote thorough shoot various place city well studio lot describe place stomp wound leg final shoot gravel mine bridge go include list film make inadequacy line neat perceptive analysis film perfectly candid unkind unkindness seem page short lot white space make interest read leave reader include want capture authentic complete way guide movie location movie buff film find useful excellent little guide great film noirs interest guide favorite city cleanest city ever visit show grimy gritty side sure exist somewhere sight tourist nasty side like hidden world film yes stand corner wonder go look body get picture interesting little interest film tourist try premise series sample writer city present story deal area city edition exception much better others wonderful way sample author rich work number variation theme first seem liability designer rigid graphic scheme follow feel exact word count entry matter film great lousy make virtue skillful persuasive prose writer knowledge film error reviewer indicate read feel amazing strength central argument haunt place right away become chief sit early gateway period even astonish general death color take general release late never really died movie keep get make regular basis expert idea show fit old real estate category crazy thriller know somehow quiet insistent exegesis make see film list even see location plan take fist tour soon one miss building go huge pink marble slab tell movie yet way reassure unsettling find build way urban legend ever meet tug sleeve till side top hill point handy author show disdain movie cause miss boat feel oblige say beforehand write movie list enlightened thing know study movie year sf remark see movie mostly sound stage make use real building still existence today criticize star act ability actor choose play different film lot bit fail mention run alley view take hid view corner view bridge say look lot consider valuable collection far valuable travel guide movie guide matter novel see movie set particular city find hope dash go visit instance ever hotel room author collect bit piece film canon go run around confuse more major american city seem dominant mood overarch spirit film embody spirit knowing know city grow top entertain even travel plan recommend premise format unique major bit misinformation look editor writer publish entry shoot chest entry state work write maltese quit long write maltese publish entry author describe chase scene take place describe end chase scene author flub police station author state disable car spun dirt shoulder opposite explosion front end wind ditch thereby break front axle evidently whiz thru publication check major flaw", "genres": ["History", "Film"], "summary": "All cities have their secrets, but none are so dark as San Francisco's, the city that Ambrose Bierce famously described as \"a point upon a map of fog.\" With its reputation as a shadowy land of easy vice and hard virtue, San Francisco provided the ideal setting for many of the greatest films noir, from classics like The Maltese Falcon and Dark Passage to obscure treasures like Woman on the Run and D.O.A., and neo-noirs like Point Blank and The Conversation. \r\n\r\nReaders visit the Mission Dolores cemetery where James Stewart spied Kim Novak visiting Carlotta's grave in Vertigo; the Steinhart Aquarium, where a steamy love scene unfolded between Orson Welles and Rita Hayworth in The Lady from Shanghai; and the Kezar Stadium, where Clint Eastwood captures the serial killer, Scorpio, in a blaze of ghastly white light in Dirty Harry. In this guide to the great films noir and the locations where they were shot, the mythic noir city meets San Francisco's own dark past. With period film stills.\r\n\r\n\"A smart, highly readable critical overview of some of the most interesting movies in the noir tradition.\" Richard Schickel\r\n", "asin": "1892145308", "rank": "889534", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/41v3Vq9ynNL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}