{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 124, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "E. B. White is an icon.  Strunk and White taught me to write.  Charlotte’s Web taught my children to love books.  Here is a stroll around Manhattan from a man who loves it with all its flaws. I knew a New York forty years later than Mr White’s, all changed, yet all the same.  And for its soul I loved it too."}, {"review_sentiment": 4.0, "review_text": "A beautiful book about one man's nostalgic walk through New York City that makes you nostalgic for an era when a man like White was walking nostalgically through the streets of New York. To be read with Colson Whitehead, with a break to listen to some Talking Heads and Blondie."}, {"review_sentiment": 4.0, "review_text": "Thus is a good but short essay and not really worth 9.99.  I was able to check this out through overdrive, a service you get through your library which allows you to check out books to your kindle, which is how I'd recommend reading it.  But it was very good and if you love New York I think you should definitely read it at some point."}, {"review_sentiment": 5.0, "review_text": "Beautifully written and enjoyable read. Can be read in one sitting."}, {"review_sentiment": 5.0, "review_text": "Love New York? Fall in love all over again with New York when you view it from his perspective."}, {"review_sentiment": 1.0, "review_text": "This is not a book, it's an essay. It takes 25 minutes to read. Just a lot of wandering thoughts. No real observations."}, {"review_sentiment": 4.0, "review_text": "Makes you wish it were the 40s again.  Excellent writer.  also, his views of certain areas and places are very original."}, {"review_sentiment": 4.0, "review_text": "GOOD !"}, {"review_sentiment": 5.0, "review_text": "EB Whites book is a long reflective essay about New York.  While a short book a touching reflective book of observations about the people and the city.  There are still many truths to this essay today."}, {"review_sentiment": 3.0, "review_text": "Not exactly what I thought.  Added it to my book collection."}]}, "authors": ["E.B. White"], "isbn": "1892145022", "longitude": 0.0, "periods": ["1900s"], "title": "Here is New York", "word_cloud": "icon teach write teach child stroll man love flaw know forty year later change yet love beautiful man nostalgic walk make nostalgic era man walk nostalgically streets break listen thus good short essay really worth able overdrive service get library allows check recommend read good think definitely point beautifully write enjoyable sit love view perspective essay take minute lot wander thought real observation make wish writer also view certain area place original good long reflective essay short touch reflective observation people city still many truth essay today not exactly think collection", "genres": ["Memoir", "Essay", "History", "Travel Writing"], "summary": "Perceptive, funny, and nostalgic, E.B. White's stroll around Manhattan remains the quintessential love letter to the city, written by one of America's foremost literary figures.\r\n\r\nThe New York Times has named Here is New York one of the ten best books ever written about the metropolis, and The New Yorker calls it \"the wittiest essay, and one of the most perceptive, ever done on the city.", "asin": "1892145022", "rank": "14514", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/517xO2vNQRL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}