{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 37, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Guy Delisle is a master storyteller. This book (and series) is highly recommended for all who like to travel or have been expats before"}, {"review_sentiment": 1.0, "review_text": "Honestly? This book was offensive. I like the idea of a graphic novel travelogue and I really wanted to like this—but Chinese people are drawn as slant-eyed, wide-smiling caricatures. At one point, Guy literally expresses his bafflement about how \"Chinese people can't draw slanty eyes, even though they *have* slanty eyes\" (image attached). Shenzhen is depicted as some kind of nightmare and the locals are demure and submissive—it didn't seem like he tried at all to experience or see anything beyond his myopic western perspective. There was little investigation or research into the rich inner lives and complex dynamics within Shenzhen, which was honestly a fascinating place in the 90s—with its rapid industrialization abutting cultural traditions and recent political turmoil. The storytelling was bland and overwhelmingly one of a complacent, confused white man who has no interest in honest or authentic interaction with an 'exotic' place—because we need more stories like this right?At some point, Guy compares himself to Tintin, which I guess is accurate if you're talking about neo-colonial attitudes and racial insensitivity. I can't believe this was published in 2006 and not 1896.To his credit, the art is good—but the content is cheap."}, {"review_sentiment": 3.0, "review_text": "Amusing time capsule graphic novel. It was from his experiences in the late 1990's - the equivalent would be doing a graphic novel of Silicon Valley/San Jose in 1962 when it mostly up and coming but still a small town in the sticks - amusing but seriously outdated if you intend to gleam any useful information (Shenzhen is the sort of the equivalent of Silicon valley but sort of like Silicon Valley in the early 1970's where you could drive down the street to find a manufacturer which you can really no longer do). So, an amusing illustrated tale that is more like a fictional graphic novel in 2017. Cute but seriously outdated."}, {"review_sentiment": 4.0, "review_text": "The book is a quick read. I don't think every body would enjoy or understand reading about other cultures this way, but I was entertained. I, probably, will purchase another one of these light reads. Anyone who has ever traveled to China would understand what the author is stating in his pictures. I plan to share my purchase with other friends who travel."}, {"review_sentiment": 3.0, "review_text": "Nice but not as fun to read as Pyongyang. In some parts I actually yawned of boredom."}, {"review_sentiment": 2.0, "review_text": "Very disappointing, particularly compared to his great \"PyongYang\" and \"Burma\", and light years from his master piece \"Jerusalem\".PS This is coming from a huge fan of his work."}, {"review_sentiment": 5.0, "review_text": "It's almost twenty years ago (when the story takes place), but feels a lot like the China today..."}, {"review_sentiment": 2.0, "review_text": "Depressing. I have read 'Pyongyang' and really wanted to like this book. Instead, what I got was a snide, one-sided portrayal of Chinese life in an admittedly depressing, industrial city. The author doesn't speak a word of Chinese, and is obviously not interested enough to write anything apart from gobbledygook in the speech balloons of his Chinese-speaking characters. It is clear that the book is targeted at a Western audience who don't really want to learn anything about Chinese culture apart from how 'strange and alien' it all is, and how funny!! How did he expect to convey anything but a very crass and superficial impression of his time in China without even knowing how to communicate with his co-workers and anyone else he encounters? Is it really that funny to poke fun at how badly some Chinese speak English when you can't speak a word of their language? It is really too bad that Mr Delisle had such a boring time in Shenzhen but at least he got a book out of it....written primarily for expats like himself who wish to giggle about how weird and incomprehensible the locals are."}, {"review_sentiment": 5.0, "review_text": "I hadn't read a comic since i was a kid and had never read a graphic novel before picking up Shenzhen while in a comic book store with my kids.  I noticed it because I had visited China and was interested in the subject.  This is the funniest and most spot-on description of China I've seen.  Nothing else conveys the weirdness and funny scenes you encounter there."}, {"review_sentiment": 2.0, "review_text": "If you've spent an extended period of time in China, or especially if you know the language, don't buy this book. You will be annoyed by the author's depictions of this \"mystical land of intrigue and oriental mystery\". Also, the parts where people speak Chinese use random characters instead of letting those in the know see what people are talking about. Bleh."}]}, "authors": ["Guy Delisle"], "isbn": "1894937791", "longitude": 0.0, "periods": ["2000s"], "title": "Shenzhen: A Travelogue from China", "word_cloud": "master storyteller series highly recommend travel expat honestly offensive like idea graphic really want chinese people draw caricature point literally express bafflement chinese people slant eye even slant eye image attach depict kind nightmare local demure seem tried experience see anything myopic western perspective little investigation research rich inner life complex dynamic honestly fascinate place rapid industrialization abut cultural tradition recent political turmoil storytelling bland overwhelmingly complacent confuse white man interest honest authentic interaction need story right point compare guess accurate talk attitude racial insensitivity publish credit art content cheap amusing time capsule graphic experience late equivalent mostly come still small town stick amuse seriously outdated intend gleam useful information sort equivalent valley sort early street manufacturer really longer so amuse illustrated tale fictional graphic seriously outdated quick think body understand reading culture way entertain probably purchase light read ever travel author state picture plan share purchase friend travel fun part actually yawn boredom very disappointing particularly compare great light year master piece come huge fan work almost year ago story take place feel lot today depress really want instead get snide portrayal chinese life admittedly depressing industrial city author speak word obviously interested enough write anything apart speech balloon character clear targeted western audience really learn anything chinese culture apart alien funny expect convey anything crass superficial impression time even know communicate anyone else encounter be really funny poke fun badly speak word language really bad boring time least get primarily expat wish giggle weird incomprehensible local comic kid never graphic pick comic store kid notice visit interested subject funniest description see nothing else conveys weirdness funny scene encounter spend extended period time especially know language annoyed author depiction mystical land intrigue oriental mystery also part people speak chinese use random character instead let know see people talk", "genres": ["Comics & Graphic Novels", "Travel Writing"], "summary": "The follow-up graphic novel to the acclaimed Pyongyang: A Journey to North Korea\r\n\r\nShenzhen is entertainingly compact, with Guy Delisle's observations of life in a cold urban city in southern China that is sealed off from the rest of the country by electric fences and armed guards. With a dry wit and a clean line, Delisle makes the most of his time spent in Asia overseeing outsourced production for a French animation company. \r\n\r\nBy translating his fish-out-of-water experiences into accessible graphic novels,Delisle is quick to find the humor and point out the differences between Western and Eastern cultures. Yet he never forgets to relay his compassion for the simple freedoms that escape his colleagues by virtue of living in a Communist state.", "asin": "1894937791", "rank": "1642508", "city": "Shenzhen", "image": "https://images-na.ssl-images-amazon.com/images/I/511RNX7cJRL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}