{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 4, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Great read.Good character development.LBGT try to live,a normal,simple life,but of course  have to expend so much more effort because of society's oppression."}, {"review_sentiment": 5.0, "review_text": "Do not be fooled by this slender novel because Whittall packs in quite a punch! Set against the backdrop of Montreal's 1995 referendum, Whittall brings the reader into a world where rebellion is the norm and assimilation is not a guarantee. It is here that the reader meets Eve who is young and naive in this changing city. She wants more than anything to move out of her parents' house and start a life of her own. When she meets Della, Eve thinks that she has found the answer to her prayers. Della is older, experienced, and wild. While Eve learns a great deal from Della's antics, she learns even more from herself and her reactions to life with Della. In a roundabout way, she is finally able to accept herself and gain confidence in her decisions.The turmoil of the 1990s in Montreal is a fantastic setting for this novel in which all of the main characters are in emotional flux. Whittall's writing is refreshing and a delight to read. Her characters have great depth and even those who are antagonizing someone find a way to win your heart. Overall, this is well-worth a read and a re-read."}, {"review_sentiment": 5.0, "review_text": "If I were to describe Bottle Rocket Hearts as a sort of creative autobiography replete with journal excerpts and a first person narrator, which also reads like a queer coming of age novel, you probably wouldn't want to read it. But for anyone who has ever tried to align their politics with their personal life and discovered a plethora of limits and contradictions, this book will be a fun, fast-paced read. And it has punk rock bulging from the seams and postmodern emotional conundrums that will resonate with those who have tried to live in uncharted territory. Having read Zoe Whittal's tightly crafted tale, I've had to reassess my position on the idea that diaries are cheesy and coming of age novels are boring. Bottle Rocket Hearts suggests otherwise.The narrative follows Eve - an eighteen-year-old lesbian living in the suburbs of Montreal - through her first \"Revolutionary Relationship\" with Della who thinks Eve is older than she is. We witness Eve's multifarious developments: her attempt to forge a new community of \"queers and artists and adulthood;\" get an apartment downtown; make mixed tapes; do drugs; get and lose a job, friends and a girlfriend. She becomes an activist and has ridiculous pangs of jealousy when the girlfriend's ex (aptly named XXXX because \"her name is too evil to write or say out loud\") makes an appearance to narrator Eve's \"most insecure moments.\"I found Whittal's descriptions of the latter to be refreshingly bang-on, treated with a fantastic sense of humour and the distinct awareness of the ironies at play: \"intellectually non-monogamy made complete sense; emotionally it felt like sand-paper across my eyelids.\" And this is one of my favorite lines: \"The trouble with deciding not to define anything is that it usually means you have to talk a lot more about what you're not defining than you would if you employed the time-honoured grade nine approach to Going Steady.\"We find out early on that for the narrator \"people who journal always seem more grounded\" and, later on, \"the difference between fiction and non is almost arbitrary.\" In a sense, the changes found in the narrator's attitudes towards writing, starting from a position where the diary represents a space for grounding thoughts (i.e., transparency, honesty) to the realization that truth and fiction are (unfortunately) difficult to discern, also marks out the space of her coming of age, personally and as an author. And coming of age is probably a convenient misnomer in this case, because Bottle Rocket Hearts is more about the negotiations involved in coming into an identity, a process that is arguably endless and nuanced rather than fixed and simple.\"'Femme.' I mouthed it to myself, giggling. 'Okay.' For some reason this sounded good, like it fit more than any other moniker hoisted on me like queer, lesbian, bi, whatever. None of those felt right. Femme. Okay, that works.\""}, {"review_sentiment": 4.0, "review_text": "An original tale written in a unique voice.  Eve is a young woman coming of age and coming out at the same time, the results of which are well explored in this beautifully written narrative.  Eve meets Della, an older lesbian whom charms her young self into a passionate love affair, Eve's first.  Issues like homophobia and jealousy are explored in detail amid a backdrop of an alternative lifestyle set in 90's Montreal, complete with rallies and murder, music and art.The main character is fully realized and completely lovable with her lethal combination of vulnerability and strength.  The other characters too, read real and alive, especially her roomate Seven, a gay struggling with his HIV status and joie de vivre.Through tragedy and love,  Eve comes to learn that everyone is in possession of a \"bottle rocket heart\"...\"common, sturdy, but still potentially explosive\".An amazing talent."}]}, "authors": ["Zoe Whittall"], "isbn": "1897151063", "longitude": -73.6103642, "periods": ["1900s", "Recent Releases"], "title": "Bottle Rocket Hearts", "word_cloud": "character try live normal simple life course expend much effort society oppression fool pack quite punch backdrop referendum bring world rebellion assimilation guarantee meet young naive change city want anything move parent house start life meet think find answer prayer older experience wild learn great deal antic learn even reaction life roundabout way finally able accept gain confidence turmoil fantastic setting main character emotional flux write refresh delight character great depth even antagonize someone way win heart describe sort creative autobiography replete journal excerpt first person narrator also read queer come age probably anyone ever try align politics personal life discover plethora limit contradiction fun punk rock bulge seam postmodern emotional conundrum resonate try live uncharted territory tightly craft tale reassess position idea diary cheesy come age novel bore suggest narrative follow lesbian living suburb first think older witness multifarious development forge new community queer artists adulthood apartment downtown make mixed tape drug get lose job friend girlfriend become activist ridiculous pang jealousy girlfriend aptly name name evil write say loud make appearance narrator insecure moment find description latter refreshingly treat fantastic sense humor distinct awareness irony play intellectually make complete sense emotionally felt eyelid favorite line trouble decide define anything usually mean talk lot define approach go steady find early narrator people journal always seem ground later difference fiction non almost arbitrary sense change find narrator attitude write start position diary represent space ground thought transparency honesty realization truth fiction unfortunately difficult discern also mark space come age personally author coming age probably convenient misnomer case negotiation involve come identity process arguably endless nuanced rather fix mouth giggle reason sound good fit moniker hoist queer lesbian bi felt right work original tale write unique voice young woman come age come time result well explore beautifully write narrative meet older lesbian charm young self passionate love affair first issue homophobia jealousy explore detail backdrop alternative lifestyle set complete rally murder music main character fully realize completely lovable lethal combination vulnerability strength character real alive especially roommate gay struggle status join tragedy love come learn everyone possession heart common sturdy still potentially explosive amazing talent", "genres": ["Fiction & Literature", "LGBT", "Young Adult"], "summary": "Winner of the 2008 Dayne Ogilvie Grant \r\n\r\nWelcome to Montreal in the months before the 1995 referendum. Riot Grrl gets bought out and mass marketed as the Spice Girls, and gays are gaining some legitimacy, but the queers are rioting against assimilation, cocktail AIDS drugs are starting to work, and the city walls on either side of the Main are spray-painted with the words YES or NO. It's been five years since the OKA crisis and the sex garage riots; revolution seems possible, when you're 18, like Eve. \r\n\r\nEve is pining to get out of her parent's house in Dorval and find a girl who wants to kiss her back. She meets Della - mysterious, defiantly non-monogamous, an avid separatist and ten years older. Initially taken in by a mutual other-worldly sense of rapture, they hole up in Della's apartment trying to navigate spaces of jealousy when a biker bomb goes off down the street. Their explosive beginning makes way for an even more volatile relationship that spans the following two years. Answering an ad for a roommate at the gay bookstore, Eve meets a new family of friends: Seven, homo-core sweetheart who defies all clichés, and Rachael, type-A activist and motivated poet. On the night of the 1995 referendum politics and romance come to a head and Eve's naiveté begins to fade. From naïve teenager to hot shot tough girl, Eve decides her own fate.  ", "asin": "1897151063", "rank": "2135190", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/51dTFc9ol4L.jpg", "country": "Canada", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}