{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 2, "rating": 2.9, "reviews": [{"review_sentiment": 2.0, "review_text": "i agree that the writing is good, but this novel is not that interesting and is certainly not compelling.  maybe i have outgrown this \"anita brookner\"-type of novel?"}, {"review_sentiment": 4.0, "review_text": "The editors at persephone Books in London have done a tremendous service by reissuing these terrific and beautiful editions of neglected twentieth-century women's classics; it's a true shame these books aren't more available in the United States in affordable editions. EVERY EYE is one of the most beautifully written books in their series; Isobel English's gift for narrative description (particularly for landscape and for fabrics) is superb. The story initially seems to be out of Caroline Blackwood territory, with its heroine's repeating complaints about the maternal figures in her life (particularly her aunt); but as the novel unfolds it moves far beyond that, and its deft shuttlings back between the heroine's present (her honeymoon in Ibiza) and her past seem miraculous. Cinema is one of the places where we are best used to such shifts, but there's little filmic in English's technique--her talents are thoroughly those of the novelistic. The gorgeousness of the prose and narrative drive allow you to overlook the conventionality of the very guessable \"surprise ending.\""}]}, "authors": ["Isobel English"], "isbn": "1903155061", "longitude": 0.0, "periods": ["1900s"], "title": "Every Eye", "word_cloud": "agree write good interesting certainly compel maybe outgrow anita brookner editor persephone do tremendous service reissue terrific beautiful edition neglect woman classic true shame available affordable edition beautifully write series gift narrative description particularly landscape fabric superb story initially seem territory heroine repeat complaint maternal figure life particularly aunt unfolds move far deft shuttling back heroine present honeymoon past seem miraculous place best used shift little filmic technique talent thoroughly novelist gorgeousness prose narrative drive allow overlook conventionality guessable surprise end", "genres": ["Fiction & Literature"], "summary": "Isobel English, a novelist of the 1950s, wrote three brief books about adultery and damnation admired today by Muriel Spark and Beryl Bainbridge. \r\n\r\nEvery Eye concerns Hattie, a woman not really at home anywhere, least of all among her manipulative family, which has assigned her the role of shabby-genteel London spinster. She has understood little about her existence, and about her strange, aborted love affair with a much older man the central mystery of her life. \r\n\r\nNow, while in Ibiza with her new young husband, the meaning of her past is becoming clear, its hidden patterns emerging from gray English shadows into the blazing Mediterranean sun. \r\n\r\n\"It is in Ibiza that the story breaks free from its resentments,\" said Anita Brookner in praise of this remarkable neglected novel, \"a lucidly written account of various kinds of confusion ... and a valuable lesson in where to look for freedom.\"", "asin": "1903155061", "rank": "2997917", "city": "Ibiza", "image": "https://images-na.ssl-images-amazon.com/images/I/313MHwAcAkL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}