{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 1, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "I ordered this by chance, to read during a holiday in Lisbon. What a revelation! This is a great late XIX Century novel about bourgeois adultery. It belongs on the same shelf as Madame Bovary and Anna Karenina, but it is even closer to Emile Zola's \"La Curee.\" Luiza, a lovely young wife, is led into temptation by her worldly cousin Bazilio, an awful rake. Consequently, Luiza is blackmailed by her ghastly maid Juliana. The struggle between the two women goes ever deeper. I won't betray any more of the plot, except to say that there are many wonderful secondary characters, several hilarious moments (although the whole novel is built toward a tragic ending), and a lot of political subtext. Reading it in Lisbon was a extra-special treat, as I carried the book through the very streets where it takes place.Once I was done with it, I picked up another Queiroz at the Lisbon FNAC for the flight back, translated in French this time. Wow! What a letdown: all choppy and strangely overdone. That proved to me - a contrario - that Margaret Jull Costa did a fantastic job translating Cousin Bazilio. I never was conscious I was reading a translation. I will read more novels by Queiroz, but only if translated by Margaret Jull Costa."}]}, "authors": ["Eca de Queiroz"], "isbn": "1903517087", "longitude": -9.1365061, "periods": ["1800s"], "title": "Cousin Bazilio: A Domestic Episode", "word_cloud": "order chance holiday revelation great late xix bourgeois adultery belong shelf even closer lovely young wife lead temptation worldly awful rake consequently blackmail ghastly maid struggle woman go ever deeper plot say many wonderful secondary character several hilarious moment whole build tragic end lot political subtext treat carry street take do pick flight back translate french time letdown choppy strangely overdo prove contrarian fantastic job translate never conscious read translation novels translate", "genres": ["Fiction & Literature"], "summary": "Cousin Bazilio is a tale of sexual folly and hypocrisy and vividly depicts bourgeois life in 19th-century Lisbon. \r\n\r\n\"Sauciness and scandal come as part of the enticing package in this 1878 European classic by Portugal's most celebrated 19th century writer. Cousin Bazilio might not be his best work, but it certainly drew the most attention when it was originally published, for all the wrong reasons;specifically deceitful lusts, a series of characters - some aristocratic hedonistic socialites, others colourful aspiring servants, but all connected by a string of naughty secrets. \r\n\r\nThe tale rips along at a pace that could outdo any modern soap, while the social realist side of de Queiroz shows up the hypocritical limitations laid down by society, particularly on female morality. A classic then, but distinctly alternative in every way.\" The Scotsman", "asin": "1903517087", "rank": "2598863", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/51olCwNfmaL.jpg", "country": "Portugal", "story_arc": ["Tragedy", "Things only get worse"]}