{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 38, "rating": 3.5, "reviews": [{"review_sentiment": 4.0, "review_text": "Nothing else to say, it's good."}, {"review_sentiment": 1.0, "review_text": "Disappointing. Lengthy but fails to give accurate picture of Cuba. Michael lewis"}, {"review_sentiment": 5.0, "review_text": "If you haven't read Padura, you are missing out."}, {"review_sentiment": 3.0, "review_text": "Good read, but wanted moire of the flavor of Cuba.  The TV series was very good based on the quartet of books."}, {"review_sentiment": 3.0, "review_text": "Three quarters of the way into the novel I stopped. Too wordy. Lost interest in the so-called mystery."}, {"review_sentiment": 5.0, "review_text": "After reading \"Havana Red\" I must read \"Havana Blue\". Great writer . A must for all travelers to Cuba."}, {"review_sentiment": 3.0, "review_text": "I bought this novel for a Cuban literature class. It's not my favorite kind of book but I feel a lot gets lost in translation and that could be why. I'd like to maybe read this in Spanish one day. This novel has lots of social significance in terms of when it was written and the content of the book for LGBTQ Cubans, so that's a cool lens to look at it through!"}, {"review_sentiment": 5.0, "review_text": "One of the ways that I prepare for a trip to a country where I have never been before is to read some good fiction based in that country.  In the late 1990's, for example, in getting ready for a trip to Russia, I read Gorky Park and several of the other police novels of Martin Cruz Smith.  Smith's descriptions of contemporary Moscow provided far more accurate glimpses of the people and the culture than could have been obtained from any guidebook.  The streets of Moscow seemed a little less foreign to me because I had already experienced them through the eyes of Detective Arkady Renko.This past spring I had a sudden opportunity to visit Cuba, a country that had been essentially closed to America for more than half a century.  My own view of Cuban culture through literature was limited to Dirty Havana Trilogy:  A Novel in Stories by Cuban author Pedro Juan Gutierrez which I had read several years earlier.  Gutierrez told darkly humorous tales of street people and prostitutes as they scratched for a living along the impoverished edges of Havana society.  I would have liked to have had a more rounded view of Cuba through its literature prior to my trip there, but time did not cooperate.One of the Cuban authors that I would have liked to have read before traveling to the island nation was Leonardo Padura, a novelist and short story writer.  Padura is best known for the Havana Quartet, a set of four novels (Havana Red, Havana Black, Havana Blue, and Havana Gold) focusing on a fictional police detective by the name of Mario Conde, a frustrated writer who has spent so many years with the police that he now bemoans the fact that he looks like a policeman.  Conde, whose friends call him The Count, is also a philosopher and former athlete who would rather be playing sandlot baseball with the neighborhood kids that wading through urban crime life.The first book in the Havana Quartet, Havana Red, is set in the 1980's, a time when no one doubted the ultimate control of Fidel Castro and the Revolution.The presenting crime in Havana Red is the strangulation death of a transvestite in a wooded area of Havana.  The young adult, dressed in a beautiful red dress, was the son of a prominent political family in Cuba.  His death is intriguing because there are no signs that the victim tried to fight off his attacker, and two Cuban pesos had been inserted into his anus.  As the philosopher/detective is drawn into the case, he becomes fascinated with the transvestite and gay subcultures of Havana.  While the Count is learning hidden truths about the city in which he has always lived, so are Padura's readers.This book illuminates the lives of ordinary (and some not so ordinary) Cubans as they struggle to survive and achieve a certain amount of personal satisfaction in a state that places the needs of society well above those of the individual.  I hope to be able to explore the works of Leon Padura more thoroughly in the future - as well as the city that has always been his home.Havana Red is a captivating work by a very talented author."}, {"review_sentiment": 2.0, "review_text": "first half of book was more engaging than the second half......and the religious gobbleygook was irritating and long winded...the tranlation was lively and amusing....very literal as the english copied the spanish in such a way that the sentence structure was more spanish than english....loved that part!and always enjoy reading about havana...."}, {"review_sentiment": 3.0, "review_text": "I have to say I was quite disappointed with this. Perhaps I just wasn't comfortable with the community which the victim and many of the early suspects frequent. I also thought that the pace was too slow and there was a bit too much philosophical bullsh1t. However it did serve to establish the main characters and I did really enjoy the other three books in the quartet especially Havana Black. Great irony and humour."}]}, "authors": ["Leonardo Padura"], "isbn": "1904738095", "longitude": -82.3658671, "periods": null, "title": "Havana Red", "word_cloud": "nothing else say good disappoint fails give accurate picture lewis miss good want moire flavor tv series good base quartet quarter way stop wordy interest mystery read writer traveler buy literature class favorite kind feel lot get lose translation maybe spanish day lot social significance term write content cool lens look way prepare trip country never good fiction base country late example get ready trip several police novel description contemporary provide far accurate glimpse people culture street seem little le foreign already experience eye spring sudden opportunity visit country essentially close half century view culture literature limit author several year earlier tell darkly humorous tale street people prostitute scratch live along impoverish edge society rounded view literature prior trip time author travel island nation novelist short story writer best know set novel focus fictional police detective name frustrate writer spend many year police bemoans fact look policeman friend call also philosopher former athlete rather play baseball neighborhood kid wad urban crime first set time doubt ultimate control present crime strangulation death transvestite wooded area young adult dress beautiful dress son prominent political family death intriguing sign victim try fight attacker peso insert drawn case become fascinate transvestite gay subculture learn hidden truth city always live illuminate life ordinary ordinary struggle survive achieve certain amount personal satisfaction state place need society well individual hope able explore work thoroughly future well city always captivate work talented author first half engage second half religious gobbledygook irritate long wind translation lively amuse literal english copy spanish way sentence structure spanish english part always read say quite disappointed perhaps comfortable community victim many early suspect frequent also think pace bit much philosophical however serve main character really quartet especially irony humor", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "“<i>Havana Red</i>, another winner from Bitter Lemon Press.”—<i>The New York Times</i>\r\n\r\nThe first of the Havana quartet featuring Inspector Mario Conde, a tropical Marlowe. A young transvestite in a beautiful red dress is found strangled in a Havana park. Conde’s investigation into a violent murder exposes a stifling, corrupt society, a Cuban reality where nothing is what it seems.\r\n\r\nA dark and fascinating world of men and women born in the revolution who live without dreaming of exile and seek their identity in the midst of disaster.\r\n\r\nLeonardo Padura lives in Cuba. He is a novelist, essayist, journalist and scriptwriter. Havana Red has won numerous literary prizes, including the Hammett prize in Spain.", "asin": "1904738095", "rank": "595935", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/41IYKbB06-L.jpg", "country": "Cuba", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}