{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 11, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "This is an amazing story told by a most remarkable individual.  Mukamet Shayakhmetov lived through turbulent times and had heavy responsibilities thrust on him at a very young age, yet he records his survival through harrowing experiences with total equanimity.  He bears no resentment against those who wronged him and writes with no bitterness of the massive policy blunders which resulted in the deaths of hundreds of thousands of his country men and women.  Life for the nomadic Kazakh people at the dawn of the twentieth century was always going to change, but the transition could have been far less ruthless than the collectivisation and punitive treatment of successful village communities pushed through by the Bolsheviks.  \"Silent Steppe\" is an evocative account of a young man's journey to adulthood through tragedy, suffering and war.  What a life and what a testament."}, {"review_sentiment": 5.0, "review_text": "Fascinating story of growing up in central Asia as the Communist system nearly destroys the Kazakh way of life. You have to admire the Kazakhs as they try to retain their customs and their benevolent attitudes toward their fellow man. In particular, the book shows how the Soviets treated a non-Russian minority in a far flung  region of the USSR. I read the follow-on memoir of the author's later years which is not as interesting but shows how badly flawed Communism was and how difficult it was for him to work within the system."}, {"review_sentiment": 3.0, "review_text": "Until reading this work, I had never thought of how Stalin's policies impinged on the nomadic peoples of Central Asia. In this memoir, written by the son of a traditional Kazakh herding 'aul' (community), we follow his life from childhood in the 20s - a life of migration, of clan solidarity and traditional ways, to Stalin's disastrous enforced collectivisation in the early 30s. With a combination of corruption, ill-management and and drought, there was a mass famine, which the author only survived by the skin of his teeth.\"Three years earlier, my mother had ridden a white horse along this same route, sitting astride her silver-edged saddle studded with precious gems, with a child in a travel-cradle fastened to the front of her swaddle, leading a camel by a long rein attached to her left wrist. It was impossible to know what she was thinking now as she traipsed along in a state of semi-starvation.\"He writes of being banned from school as the son of a 'kulyk' (wealthy peasant), of homelessness, of the freezing winters ...and at last of the onset of World War 2. We know he went on to do well in his chosen career of teaching, becoming a headmaster, and living into old age (this book was written in early 2000s.)As another reviewer states, this is a 'flat', factual recounting of events, rather than an emotional or literary work, but informative, covering a place about which we hear little in the West. The introduction tells us that only \"a fragment - perhaps some 5% of the stock-rearing population - has to this day survived.\"Several pages of b/w photos."}, {"review_sentiment": 5.0, "review_text": "It was a beautiful story written with a restrained hand documenting the resilience and charitable culture of the nomadic people of Kazakhstan.  Each generation needs to read this testament and remember what was.  The heavy hand of the Soviet government is a caution to all peoples of the world.  The means don't justify the ends."}, {"review_sentiment": 5.0, "review_text": "Great book. I lived in Kazakhstan for 10 years and learned to love the Kazakh people. This book gives important insight into Kazakh culture and the momentous impact of the early Soviet years. But it does so in a very personal narrative, told without a political point of view or polemic, but just a matter-of-fact recounting from the perspective of personal experience. Yet his experience is representative of an entire culture. A must-read for anyone who desires to understand better appreciate Kazakh culture."}, {"review_sentiment": 5.0, "review_text": "In accordance with Amber Whittley who has written a review above, I fully agree that \"the Silent Steppe: The Memoir of a Kazakh Nomad Under Stalin, is perhaps one of the best books I have read detailing the plight of the Kazakh nomads under Stalin's rule. A smooth read, the narration is crisp and engaging and pulls the reader into the story.\" I felt like I was living in the auls with Shayakhmetov and his family doing duties such as learning how to ride horses and experience the pastoral nomadic life on the Steppes. I have a great interest in Kazakhstan and this book helped me delve deeper into Kazakh culture, the struggles and persecutions they faced under Soviet rule and the meaning of Kazakh resilience/spirit. If you are interested in Central Asia, I thoroughly recommend you read this book."}, {"review_sentiment": 4.0, "review_text": "There aren't very many books in English that come out of Central Asia, particularly from this period. Mukhamet Shayakhmetov is one of the very few people still alive who are old enough to remember Stalin's Great Terror of the mid-thirties, as well as what life was like for the Kazakhs before the unending march of Soviet progress ended their way of life forever.Shayakhmetov writes clearly and plainly, without pretensions or self-pity, almost in a journalistic fashion. I learned a lot from his story. History needs more books like this."}, {"review_sentiment": 4.0, "review_text": "This is a very interesting picture of how it was for the Kazakhs during the time of Stalin, and how their culture was all but destroyed. The successful were reduced to poverty, having everything they valued taken away from them. This book shows how the former clan / family system was replaced by suspicion, lies, and terror, brother against brother. Very sad and enlightening."}, {"review_sentiment": 5.0, "review_text": "The Silent Steppe is perhaps the best book I've read detailing the plight of the Kazakh nomads under Stalin's rule.  Shayakhmetov gives a heart breaking account of the famine, discrimination, and suffering of the 1930s.  A smooth read, the narration is crisp and engaging and pulls the reader into the story. I served as a Peace Corps Volunteer in Kazakhstan, and this book has gone a long way to helping me understand where the people came from and what they lived through.  I would recommened this without reservation to anyone interested in learning more about Kazakhstan or the devestation caused by the former Soviet Union."}, {"review_sentiment": 4.0, "review_text": "This book was a welcome eye witness account; well organized, poignant.  My understanding of the Kazakh people has grown, as has my thankfulness to God for his mercy in preserving a nation amidst such suffering."}]}, "authors": ["Mukhamet Shayakhmetov"], "isbn": "1905299125", "longitude": 0.0, "periods": ["1900s"], "title": "The Silent Steppe: The Story of a Kazakh Nomad Under Stalin", "word_cloud": "amazing tell remarkable individual live turbulent time heavy responsibility thrust young age yet record survival harrow experience total equanimity bear resentment wrong writes bitterness massive policy blunder result death hundred thousand country men woman nomadic people dawn twentieth century always go change transition far le ruthless collectivization punitive treatment successful village community push evocative account young man journey adulthood tragedy suffer war life testament fascinate grow central system nearly destroy way life admire try retain custom benevolent attitude fellow man particular show treat minority far flung region memoir author later year interest show badly flaw difficult work system read work never think policy impinge nomadic people write son traditional herding community follow life childhood life migration clan traditional way disastrous enforce collectivization early combination corruption drought mass famine author survive skin teeth year earlier mother ridden white horse route sit saddle stud precious gem child fasten front swaddle lead camel long rein attach leave wrist impossible know think traipse state write banned school son wealthy peasant homelessness freeze winter last onset know go well choose career teach become headmaster live old age write early reviewer state factual recount event rather emotional literary work informative cover place hear little introduction tell fragment perhaps population day survive several page photo beautiful write restrained hand document resilience charitable culture nomadic people generation need testament heavy hand soviet government caution people world justify end live year learn people give important insight culture momentous impact early soviet year personal narrative tell political point view recount perspective personal experience experience representative entire culture anyone desire understand better appreciate culture accordance write review fully agree perhaps best detail plight nomad rule narration crisp engage pull felt live ail family duty learn ride horse experience pastoral nomadic life great interest help deeper culture struggle persecution face soviet rule meaning interested thoroughly recommend many come particularly period people still alive old enough remember well life unending march soviet progress end way life write clearly plainly pretension almost journalistic fashion learn lot need interesting picture time culture destroy successful reduced poverty everything value take show former clan family system replace suspicion lie brother very sad enlightening perhaps best detail plight nomad rule give heart break account famine discrimination suffer smooth narration crisp engage pull serve go long way help understand people come lived reservation anyone interested learn devastation cause former welcome eye witness account well organize poignant understanding people grown thankfulness mercy preserve nation midst suffering", "genres": ["History"], "summary": "Born into a family of nomadic Kazakh herdsmen in 1922, Mukhamet Shayakhmetov's father was imprisoned as an 'enemy of the people' as Soviet rule spread across his people's vast steppe-land in central Asia. In this book, Shayakhmetov recalls the scale of suffering in his homeland under Stalin's rule.\r\n\r\nWhile the devastating famine in Ukraine is fairly well-known, the death and displacement of millions of Kazakhs in the same period of Stalin’s reign is almost forgotten in the West. This first-hand account of a survivor tells the story of the bloody end to the nomadic lifestyle of Kazakhs. Besides a lesson in the history of 1920-1930’s Kazakhstan, it’s also a dignified and inspiring tale of survival against a cruel oppressor.\r\n\r\nYou are guaranteed to understand Kazakhs better after this read.", "asin": "1905299125", "rank": "2019155", "city": "Kazakhstan", "image": "https://images-na.ssl-images-amazon.com/images/I/51lXBZ7U3fL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}