{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 6.2443382, "ratings": {"num_ratings": 22, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Intimate and emotional without being corny. Also a document of the injustice that still prevails in my country Venezuela, great reading"}, {"review_sentiment": 4.0, "review_text": "professional service. i think it is very good , great. would purchase again. Good product and good service."}, {"review_sentiment": 5.0, "review_text": "Excellent novel giving one a glimpse of life in Colombia.  This book is well written and would recommend to others."}, {"review_sentiment": 5.0, "review_text": "This is a great book!  Very interesting story and well told."}, {"review_sentiment": 5.0, "review_text": "I truely enjoyed this book, not only a memoir, but also provided great incites on life, violence, social activism, and human rights struggles in Medellin, Colombia. Oblivian, really helped me reconnect with whats important in the world, which I sometimes lose sight of becuase of materialistic pleasures. Most importantly, it helped me understand the importance of really enjoying the experience of loved ones while they are still alive, because life is truely finite, and we only get one shot. Great read by a gifted Colombian writer."}, {"review_sentiment": 2.0, "review_text": "This author was interviewed on Bourdain's show, and so I bought the book based on Bourdain's recommendation.  I wanted to read a great memoir, to learn about recent Colombian history and this book did not deliver, I am sorry to say.  The beginning parts were OK, the family life, living with a nun, the great love between father and son.  And the rest?  It is the son carrying a torch for his dad.  It falls flat.  It seemed like a big complaint about the state of affairs in Colombia.  Of course I have compassion for the author's loss.  But the last third of the book seemed maudlin, and I could barely keep reading.  It seemed like an angry rant rather than something generative.  The book seems to be more of a biography of his father than a memoir.  Way, way too much telling, rather than showing and it left me rather bored."}, {"review_sentiment": 5.0, "review_text": "Although titled Oblivion: A Memoir, this book is much more than just a son’s reflections about his father. Through it, Héctor Abad Faciolince provides the reader with an intimate portrait of the human rights’ struggle in Colombia over his father’s lifetime, as well as, a wake-up call to a world wracked by violence.Written some twenty years after his father’s assassination on the streets of Medellín, Colombia, Oblivion is without a doubt one of the most transformative books that I have read in the past twenty years. Upon finishing it, I realized, perhaps for the first time in my life, that I have not done enough to ease the suffering of others. Truly, as I read the story of this positive, loving father, I was humbled not only by his unconditional love for his son, but for the people of Colombia and indeed the world.My full review is available on my blog at https://readingwritingreacting.wordpress.com/2015/12/23/book-review-oblivion-by-hector-abad/"}, {"review_sentiment": 5.0, "review_text": "Amazing"}, {"review_sentiment": 5.0, "review_text": "This memoir is the fascinating, beautifully written coming of age story of Hector Abad, the son of Hector Abad Gomez.  Gomez was no ordinary man; he was a towering presence in his son’s life and throughout Colombia.  He was a professor, a doctor, and an international health care advocate who worked tirelessly to help Colombia’s poor.  An enlightened man living in a not so enlightened time, he fought old world thinking while dodging Colombia’s deadly warring political factions.  Ultimately, he paid for his passions with his life.This book provided me a glimpse into Colombia, the real Colombia, which unfortunately has had a tendency to be reduced by the western media as a land of violent drug cartels and coffee beans.  But there is a complicated and beautiful history contained in this book that was a pleasure (and a horror) to discover.I thoroughly enjoyed this immensely personal, bittersweet tale of a father’s unconditional devotion to his son and would highly recommend it.  It is often dark, and more often painful, but well worth the read."}, {"review_sentiment": 5.0, "review_text": "FARC and cocaine cartels get the majority of international attention to Colombia. Oblivion captures the terror of right-wing paramilitary violence. Political assassinations en masse, and plenty of paisa culture. But the most beautiful part of this book for me is the love and affection the author feels for his father. I'd implore this book for every father, every son."}]}, "authors": ["Hector Joaquin Abad Faciolince"], "isbn": "190696422X", "longitude": -75.573553, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Oblivion: A Memoir", "word_cloud": "emotional corny also document injustice still prevail country great reading professional service think good great good product good service excellent give glimpse life well write others great interesting story well tell truly enjoy also provide great incites life violence social activism human right struggle really help whats important world sometimes lose sight because materialistic pleasure most importantly help importance really enjoy experience love one still alive life truly finite shot gift colombian writer author interview show buy base recommendation want great learn recent colombian history deliver sorry say beginning part ok family life live nun great love father son son carry torch dad fall flat seem big complaint state affair course compassion author loss last third seem maudlin barely read seem angry rant rather something generative seem biography father way much tell rather show leave rather bored title much son reflection father provide intimate portrait human right struggle father lifetime well world wrack year father assassination street doubt trans formative past year finish realize perhaps first time life do enough ease suffer others story positive loving father humble unconditional love son people indeed full review available blog http amaze fascinate beautifully write coming age story son ordinary man tower presence son life professor doctor international health care advocate work tirelessly help poor enlightened man live enlightened time fight old world think dodge deadly war political faction ultimately pay passion provide glimpse real unfortunately tendency reduce western medium land violent drug cartel coffee bean complicate beautiful history contain pleasure horror thoroughly enjoy immensely personal bittersweet tale father unconditional devotion son highly often dark often painful well cocaine cartel get majority international attention capture terror paramilitary violence assassination en plenty paisa culture beautiful part affection author feel father implore father son", "genres": ["Memoir", "History"], "summary": "Oblivion is a heartbreaking, exquisitely written memorial to the author’s father, Héctor Abad Gómez, whose criticism of the Colombian regime led to his murder by paramilitaries in 1987. Twenty years in the writing, it paints an unforgettable picture of a man who followed his conscience and paid for it with his life during one of the darkest periods in Latin America’s recent history.\r\n\r\n“It is very difficult to summarize Oblivion without betraying it, because, like all great works, it is many things at once. To say that it is a heartrending memoir of the author's family and father--who was murdered by a hired assassin--is true, but paltry and infinitesimal, because the book is also a moving immersion into the inferno of Colombian political violence, into the life and soul of the city of Medellín, into the private life and public courage of a family, a true story that is also a superb fiction due to the way it is written and constructed, and one of the most eloquent arguments written in our time or any time against terror as an instrument of political action.” Mario Vargas Llosa", "asin": "190696422X", "rank": "3434149", "city": "Medellin", "image": "https://images-na.ssl-images-amazon.com/images/I/51FgL5lzR7L.jpg", "country": "Colombia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}