{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 22.5677459, "ratings": {"num_ratings": 5, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "This book is a miracle.  Someone WANTED to write it and then actually DID.  Then someone else decided to PUBLISH it!  Who?  Why?  No money was made here and my hat is off to all concerned. Thank you.  If you're one of the half dozen or so out there in Amazon-review land who might read this, it made my visit to Kolkata so much better, as it MAY make yours, BUT ...It is probably the most frustrating guidebook I have ever come to depend on!  The descriptions are unique, way better than good enough but the maps will make you crazy.  Some of this is unavoidable:  many roads change names every few blocks and others have their names changed for political purposes, while the old names linger in common usage.  There is virtually no signage.After all the effort that went into this, the publisher and/or editor couldn't spring for a few more bucks?  The maps suck!  The worst thing is that there is no overall map of the city that links them together and the chapters are NOT presented so you will be easily able to figure out linkages.  I wish that were all.  There is more than one map per walk. On facing pages, some are placed 90 degrees to each other; make sure you check the directional arrow.  On others, the two maps are reversed so the area of the right hand map is in reality west of the left hand map.  On all, the edge just stops, like a pre-scientific rendering of the edge of the world, but it is NOT contiguous with its chapter mate(s).  There's more, but you get he picture.On a side note, the metro IS mostly jammed but the middle of each car is demarcated for unaccompanied women.  I felt zero threat on the streets and there is almost no street hassle, so don't be afraid of this spectacular place.Enough.  If you're anything like me, craving detail and local experience and willing to be uncomfortable as hell In your quest, do yourself a favor and get this.  Oh, and make sure you get it before you go.  I have yet to see a single Kolkata guide for sale and that includes the top hotel and the top bookstore."}, {"review_sentiment": 4.0, "review_text": "After arriving in Calcutta, I realized that these walks were highly impractical for a visit of only five days, and would be dreadful in anything but the best weather.  Starting and ending points of the walks are miles apart, and none of the walks seem to tie in with another, so that you could spend a whole day without backtracking.  The author claims that each walk would take two and a half or three hours, so it would be most practical if they ran into one another.  One could stop for lunch, rest and recovery, and head out again.  The author refers the walker to the subway stops closest to the start and stop of each tour, but if the subway looks anything like the trains and buses, I don't think that's a very attractive option.The hand-drawn maps are difficult to reconcile with each other, further making continuation of a tour hard to devise.  The best map of Calcutta is one available from the official tourist office, which every hotel should have by the boxful, but mine didn't and I got it from another (top-tier) hotel.  After driving along some of the routes, one realizes the distances are much greater than they appear, and I don't know that 2-3 hours is realistic for any of these treks.The descriptions and history are excellent, however, and I do recommend the book to anyone who will be staying in Calcutta for a week or more, and who can either bear the heat and humidity, or who is there in December, as I was, and even then it was hot."}, {"review_sentiment": 3.0, "review_text": "This book takes you to the streets of Calcutta -- what they were in the days of Raj, what they are now. Most travelers stay in cabs to avoid meeting Calcutta (now Kolkata) to closely. It can be scary, the first time, but if you get out of the cab, and walk the streets of Kolkata, you'll find so many fascinating things up close. The writing, at least for me, is a little academic. But it is a fresh look at Walking Calcutta."}, {"review_sentiment": 5.0, "review_text": "I wish there were similar writings for other interesting cities. Good balance of practical guide, history and general interest. Some photos would have enhanced the book a great deal."}, {"review_sentiment": 5.0, "review_text": "Calcutta can be an overwhelming, chaotic, and confusing city for the Westerner, particularly if in India for the first time.  And compared to Delhi and Mumbai, it is more difficult to navigate for travelers.  I have purchased many a walking guide to various cities around the world as I prefer to discover a city by foot.  This is one of the very best.  It takes you to the city's historical highlights, but also off the beaten track to real neighborhoods where you see how Calcuttans live.  The book leaves you with a true feeling for the city and is full of interesting stories behind the sights.  You feel as if you are being escorted by a personal guide.  During these walks you will be approached by and brought into conversation, and into the lives, even if only superficially, of the very friendly locals.  They will be just as curious about you as you are about their city and lives.  This book is indispensible for any visitor to Calcutta, particularly for those fortunate enough to stay a few days in this fascinating city."}]}, "authors": ["Keith Humphrey"], "isbn": "1907211047", "longitude": 88.3476023, "periods": ["1900s"], "title": "Walking Calcutta", "word_cloud": "miracle write actually then someone else decide money make concerned half dozen land visit much better probably frustrate guidebook ever come depend description unique way better good enough map make crazy unavoidable many road change name block others name change political purpose old name linger common usage virtually effort go publisher editor map suck worst thing overall map city link together chapter present easily able figure linkages wish map walk face page place degree make sure directional arrow others map reverse area right hand map reality west leave hand map edge stop render edge world contiguous chapter mate side note metro mostly jam middle car demarcate unaccompanied woman felt threat street almost street hassle afraid spectacular anything crave detail local experience willing uncomfortable hell quest favor get make sure yet see single guide sale include top hotel top bookstore arrive realize walk highly impractical visit day anything best weather start end point walk mile apart none walk seem whole day backtrack author claim walk half hour one lunch rest recovery head author refers walker subway stop closest start tour subway look anything like train bus think attractive map difficult reconcile make continuation hard devise best map available official tourist office hotel bowlful mine get hotel drive along rout realizes distance much greater appear know hour realistic description history excellent however recommend anyone stay week either bear heat humidity even hot take street day most traveler stay cab avoid meeting closely scary first time cab walk street find many fascinating thing close writing least little academic fresh look wish similar writing interesting city good balance practical guide history general interest photo great deal overwhelming chaotic confuse city particularly first time compare difficult navigate traveler purchase many guide various city world prefer discover city foot best take city historical highlight also beat track real neighborhood see live leaf true feel city full interesting story sight feel escorted personal guide walk approach brought conversation life even superficially friendly local curious city live indispensable visitor particularly fortunate enough stay day fascinate city", "genres": ["Travel Writing"], "summary": "This wandering odyssey through the City's pullulating backstreets and serpentine byways reveals a Calcutta rarely glimpsed by western travellers. \r\n\r\nArranged as a series of journeys on foot through the older quarters of the City seldom trod by outsiders, the narrative chronicles the topography, social and historical background and the vibrant street life and characters which give Calcutta its uniqueness. \r\n\r\nComplete with detailed directions and street maps for the areas explored, the book provides a storehouse of indispensable information for the intrepid traveller.", "asin": "1907211047", "rank": "1198759", "city": "Calcutta", "image": "https://images-na.ssl-images-amazon.com/images/I/51CeCI1dH2L.jpg", "country": "India", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}