{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 4, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "This is a very original book! I love the experimental style which may not be to everybody's taste. Unlike some experimental books, this is very readable and easy to get into. It is really out there, but it makes sense.I probably couldn't give something like this the review it deserves. This is poetry! This is art! Sometimes disturbing, but beautiful throughout. Lots of quotable lines such as this:\"I want to be promoted to someone's hallucination, please!\""}, {"review_sentiment": 5.0, "review_text": "remarkable. sad that the writer died."}, {"review_sentiment": 5.0, "review_text": "I absolutely love this book. It was the first one I received as a part of my AndOtherStories subscription, and it didn't disappoint - from the first page you are dragged into an intensely creative and compelling portrait of madness.I must make the proviso that I really love experimental literature. Not the kind of experimentalism that is self-aware and insincere, but the kind that makes us feel that writing is a craft, and some people are truly masters of it. The kind that breaks moulds and makes literature feel like an achievement.In All Dogs Are Blue, the stylistic elements of the story are just what experimental literature should be - vibrant and pulsing with life and purpose, making you feel the story physically as well as mentally. I loved the fresh words, the way it bounced from idea to idea, and all against the surreal backdrop of a Rio de Janeiro mental institution and the author's own mind-state.To me, this novel is like a bright sun against all the middling novels to be found about life and illness. The fact that this book was written as a reflection of the author's actual inner world makes this story all the more powerful. It is a tragedy that he passed away, on so many levels. From an artistic one, we have lost a great contribution to writing barely before it begun."}, {"review_sentiment": 4.0, "review_text": "But I’m fragile and delicate like anyone who feels life. Not everybody knows what they want out of life. If you do know, you live life. If you don’t, you feel life.As I’ve mentioned with other works that have come my way from “& Other Stories”, their pursuit of “collaborative, imaginative and ‘shamelessly literary’” works fits nicely with my own philosophies of independence and pushing the boundaries. And in “All Dogs Are Blue” I’ve come across something which is shamelessly BOLD, a work that you wouldn’t ordinarily come across in your day to day reading.Rodrigo De Souze Leao died aged 43 in a psychiatric hospital in Rio de Janeiro in 2008. A schizophrenic, his fragile mental state had him rarely leaving his home and it is through his poetry and, more importantly, this novel that he was held in high regard by a large number of Brazilian writers and poets.Here we have a novel written in broken thoughts, fragments of sentences, visions and musings. But one that shows such complexity and a vivid understanding of narrative style that you cannot help but be dragged along with the author’s torment.Set in a psychiatric ward our narrator is attached to the memories of his childhood toy blue dog, memories of a more stable time before he swallows a cockroach at age 15. His “friends” in the ward are Baudelaire (a Nineteenth Century French poet who’s most famous works draw heavily on the themes of sex and death) and Rimbaud (another Nineteenth Century French poet who was part of the “decadent movement”). A misunderstood genius is our man….For my full review go to[...]"}]}, "authors": ["Rodrigo de Souza Leão"], "isbn": "1908276207", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "All Dogs Are Blue", "word_cloud": "original love experimental style taste experimental readable easy really make probably something review deserve poetry art sometimes disturb beautiful quotable line want promote someone hallucination please remarkable sad writer die absolutely love first receive part subscription disappoint first drag intensely creative compelling portrait proviso really experimental literature not kind experimental ism insincere kind make write craft people truly master kind break mold make literature stylistic element story experimental literature vibrant pulse life purpose make feel story physically well mentally love fresh word way bounce idea idea surreal backdrop mental institution author bright sun middling novel find life illness fact write reflection author actual inner world make story powerful tragedy pass away many level artistic lose great contribution write barely begin fragile delicate anyone feel life not everybody know want life know live life feel mention work come way other pursuit collaborative imaginative shamelessly literary work fit nicely philosophy independence push boundary come something shamelessly work ordinarily come day day die age psychiatric hospital schizophrenic fragile mental state rarely leave home poetry importantly hold high regard large number brazilian writer write broken thought fragment sentence vision musing show complexity vivid understand narrative style help drag along author psychiatric ward narrator attach memory childhood toy dog memory stable time swallow cockroach age friend ward poet famous work draw heavily theme sex death nineteenth poet part decadent movement misunderstood genius full review go", "genres": ["Fiction & Literature", "Mystery & Suspense", "Humour"], "summary": "\"Rodrigo de Souza Leão is an exceptional author and has had a major impact on contemporary Brazilian literature.\"—Paulo Scott\r\n\r\nAll Dogs are Blue is a scurrilously funny tale of life in a Rio insane asylum. Its raw style and comic inventiveness signal a major voice in Brazilian literature. Sadly the author died, aged forty-three, soon after it was published in 2008.\r\n\r\nDue to his mental fragility, Rodrigo de Souza Leão rarely left his house and yet, through social media, blogging, and e-mail, he became close to many Brazilian writers and poets and remains highly regarded today.", "asin": "1908276207", "rank": "1962302", "city": "Rio de Janeiro", "image": "https://images-na.ssl-images-amazon.com/images/I/41TSr9rEmgL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}