{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 9, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Amazingly funny, clever, intellectual barbs flying. Took me away from our dismal political situation!"}, {"review_sentiment": 1.0, "review_text": "I would give it 1/2 star if I could."}, {"review_sentiment": 5.0, "review_text": "A great read filled with Juan Pablo Villalobos' typical cast of characters that began with Down the Rabbit Hole and continued with Quesadillas. Teo lives in a retirement home and gets involved with CIA agents, an innocent Mormon missionary, a government agent and his literary salon neighbors in a way only a drunk ex-taco seller/disgruntled artist can. Absurdism, intrigue and reality blended perfectly."}, {"review_sentiment": 1.0, "review_text": "Rambling story with no point."}, {"review_sentiment": 4.0, "review_text": "This was my first exposure to Juan Villalobos and will not be my last.  Light human and easy read"}, {"review_sentiment": 5.0, "review_text": "I love this book.  It is fascinating in its exploration though a wonderfully rueful narrator of a weird little boarding house, its manners and mores, as well as absolutely hilarious.  The explosively comic ending is. . .but I don't want to spoil it for anybody.  If you ever got involved with a Reading Club that seemed increasingly crazy, this book is for you."}, {"review_sentiment": 5.0, "review_text": "Delightful writing. A memorable story from a great writer."}, {"review_sentiment": 5.0, "review_text": "The book is delightfuly translated from Spanish to British English. As a Texan, I found the setting in Mexico near and dear to my heart. The book is funny, clever and captivating. Reader's will enjoy."}, {"review_sentiment": 5.0, "review_text": "Villalobos creates a compelling view into the entropic life of a former taco vendor whose life has been a series of disappointments, hovering on the periphery of art. He uses a volume of Aesthetic Theory as if it were a Holy talisman to disperse unwanted influences. I'd always thought writing was basically about getting laid. Villalobos' 80 year-old protagonist proves that point. He'll go to almost any lengths to get his equally aged neighbor and sometime Nemesis in the sack. This book joins the ranks of absurdist fiction alongside the works of Vonnegut and Heller (at least in my opinion!)"}]}, "authors": ["Juan Pablo Villalobos"], "isbn": "1908276746", "longitude": -99.1333416, "periods": ["2000s", "Recent Releases"], "title": "I'll Sell You a Dog", "word_cloud": "amazingly funny clever intellectual barb fly away dismal political situation star great filled typical cast character begin continue live retirement home get involve agent innocent missionary government agent literary salon neighbor way drunk artist intrigue reality blend perfectly ramble story point first exposure last human easy love fascinating exploration wonderfully rueful narrator weird little boarding house manner mores well absolutely hilarious explosively comic end want spoil anybody ever get involved seem increasingly crazy write memorable story great writer delightful translate spanish british find set dear heart funny clever captivate enjoy create compel view en tropic life former taco vendor life series disappointment hover periphery art use volume talisman disperse unwanted influence always think write basically get lay protagonist prof point go almost length equally age neighbor sometime sack join rank absurdist fiction alongside work least opinion", "genres": ["Fiction & Literature", "Humour"], "summary": "Long before he was the taco seller whose ‘Gringo Dog’ recipe made him famous throughout Mexico City, our hero was an aspiring artist: an artist, that is, till his would-be girlfriend was stolen by Diego Rivera, and his dreams snuffed out by his hypochondriac mother. Now our hero is resident in a retirement home, where fending off boredom is far more grueling than making tacos. Plagued by the literary salon that bumps about his building’s lobby and haunted by the self-pitying ghost of a neglected artist, Villalobos’s old man can’t help but misbehave: he antagonises his neighbors, tortures American missionaries with passages from Adorno, and flirts with the revolutionary greengrocer. \r\n\r\nA delicious take-down of pretensions to cultural posterity, I’ll Sell You a Dog is a comic novel whose absurd inventions, scurrilous antics and oddball characters are vintage Villalobos.", "asin": "1908276746", "rank": "515815", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/61-RjToIuCL.jpg", "country": "Mexico", "story_arc": ["Tragedy", "Things only get worse"]}