{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 64, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Easy to do recipes"}, {"review_sentiment": 5.0, "review_text": "Lesley does a wonderful job at truly capturing Mexico City's authentic food scene through mouth-watering recipes and beautifully photographed dishes. Her cookbook is a must read for anyone genuinely interested in one of the world's most fascinating cuisines!"}, {"review_sentiment": 5.0, "review_text": "Great recipes"}, {"review_sentiment": 5.0, "review_text": "AMAZING!"}, {"review_sentiment": 5.0, "review_text": "Easy recipes. Tasty."}, {"review_sentiment": 5.0, "review_text": "As advertised, no problems"}, {"review_sentiment": 3.0, "review_text": "its ok not my idea of great"}, {"review_sentiment": 5.0, "review_text": "good book condition as advertised"}, {"review_sentiment": 5.0, "review_text": "Very good info and Recipies"}, {"review_sentiment": 5.0, "review_text": "This is an awesome book. It has great recipes of different types of Mexican food in here. My mom knew most of the recipes in here but didn't know how to make some and now she knows! She enjoyed this book!"}]}, "authors": ["Lesley Téllez"], "isbn": "1909487279", "longitude": -99.1333416, "periods": ["Recent Releases"], "title": "Eat Mexico: Recipes from Mexico City's Streets, Markets & Fondas", "word_cloud": "wonderful job truly capture authentic food scene beautifully photographed dish cookbook anyone genuinely interested world fascinating cuisine amazing easy tasty advertised problem ok idea great good condition advertise very good info recopies awesome great different type mexican food mom know know make know enjoy", "genres": ["Food and Wine"], "summary": "Eat Mexico is a culinary love letter to one of the biggest cities in the world—a chaotic, vibrant place where residents eat from sidewalk grills and stands, and markets and casual restaurants serve up fresh, hot food daily. In this book, journalist Lesley Téllez—who also runs her own food tour company in Mexico City—takes you through the city's most classic dishes, offering recipes from her favorite haunts on the streets, in city markets, and in small, homestyle fondas. \r\n\r\nMany of these dishes are items Americans may not recognize: the football-shaped, bean-stuffed corn tlacoyo, topped with cactus and salsa; the tortas bulging with turkey confit and a peppery herb called pápalo; beer-braised rabbit, slow-cooked until tender. The book ends on a personal note, highlighting the creative, Mexican-inspired dishes—like roasted poblano oatmeal—that Lesley cooks at home in New York with ingredients she came to know in Mexico.\r\n\r\nWith more than 100 recipes, on-location photography and text written in a friendly, personal tone, Eat Mexico is a must for anyone who loves Mexico, its food and unique urban culture.", "asin": "1909487279", "rank": "57986", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/51MmeJkG5ZL.jpg", "country": "Mexico", "story_arc": ["Tragedy", "Things only get worse"]}