{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 64.145981, "ratings": {"num_ratings": 43, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Siglufjörður: an idyllically quiet fishing village in Northern Iceland, where no one locks their doors – accessible only via a small mountain tunnel. Ari Thór Arason: a rookie policeman on his first posting, far from his girlfriend in Reykjavik – with a past that he’s unable to leave behind. When a young woman is found lying half-naked in the snow, bleeding and unconscious, and a highly esteemed, elderly writer falls to his death in the local theatre, Ari is dragged straight into the heart of a community where he can trust no one, and secrets and lies are a way of life. An avalanche and unremitting snowstorms close the mountain pass, and the 24-hour darkness threatens to push Ari over the edge, as curtains begin to twitch, and his investigation becomes increasingly complex, chilling and personal. Past plays tag with the present and the claustrophobic tension mounts, while Ari is thrust ever deeper into his own darkness – blinded by snow, and with a killer on the loose.I have never read a book quite like this one. I loved the descriptive writing of this book. I almost felt like I lived at Siglufjorour. I could also feel the frustration and dread of Ari as the endless night continued and made worse by the blockage of the tunnel by an avalanche; the feeling of being trapped. I would highly recommend this book and will be looking for more books by this author."}, {"review_sentiment": 2.0, "review_text": "I must be missing something here. \"Snowblind\" attracts lots of four and five-star reviews and is the first book in the best-selling \"Dark Iceland\" quintet, yet I found it fundamentally unsatisfying.I'm told the language is poetic. I can see that it's trying to be. I quite liked the way in which Jonasson expresses the soft oppression of never-ending snow in phrases like  \"The freezing darkness swallowed him up.\"and  \"He had tried to listen to classical music to drown out the deafening silence of the incessant snowfall, but it was as if the music magnified the gloom.\"It works but it's not exceptional.I'm familiar with snow and deep cold and the claustrophobia that living beneath a mountain can bring. They're well captured here but not well enough to sustain the book.The plot stretches my willingness to suspend disbelief and the way in which our young policeman unravelled the secrets seemed to me too hard to swallow. The man isn't just intuitive, he's psychic.I think the heart of my dissatisfaction with this book is the policeman Ari Thor. I could not find a reason to care for him. He seems an empty man. He starts many things but finishes none. He ties himself in knots about integrity and gets indignant about love and yet is too weak to live to either standard. I know he's young but if he's that callow, where's the interest?If you fancy a Miss Marple in the snow, set around an Icelandic village drama society rather than an English one and with modern accents, local colour and the occasional stab at the lyrical, then this is the book for you.I'm sure it would make great television. All the moody camera work and mournful atonal music could fill the gaps where the rest of the novel should be.I had a similar reaction to Ann Cleaves' \"Raven Black\" and that made great television and has a huge fan base so perhaps I'm just not equipped to savour this kind of book.I don't think that's going to change so I'll pass on the rest of the \"Dark Iceland\" quintet."}, {"review_sentiment": 5.0, "review_text": "Am reading it now and have a new author to follow!"}, {"review_sentiment": 3.0, "review_text": "I found this disappointing, given the hype offered by so many crime writing luminaries.  I much prefer Yrsa Sigurdardottir and Arnaldur Idridason."}, {"review_sentiment": 4.0, "review_text": "Starts slowly and innocent but gradually it is building up to a chilling point. Strange story with strange turns.  Worth reading and I will read the next one too"}, {"review_sentiment": 3.0, "review_text": "This is a typical mystery plot, except that it is set in Iceland, which was the most interesting thing about it.  The more I read, the less interesting it got.  The author needs to push him/herself to be more imaginative and creative and not rely on formulas."}, {"review_sentiment": 4.0, "review_text": "“I was blinded”, a review of the coldly brilliant debut by Ragnar JónassonI was blinded by the snow, slippery roads, heavy coat of winter, and the freezing temperature. Opening the book felt like opening your door and being swept away by a white storm. Everything sounded different. I do admit I had issues remembering names, especially cities’ ones. Thankfully the author took pity on me on Twitter and sent a pronunciation guide for … the city I cannot write the name of. But what I thought would be a distraction to the story in fact heightened my experience. I was out in a country I had no knowledge of. Literally. And here I was walking streets with enough information to allow me to see everything clearly but enough freedom to make those images mine too and let my mind take me to places I would never have imagined on my own. This book is a treasure of beautiful descriptions which make you shiver along with the characters while taking in the breathtaking views of a place that feels so foreign on the first page and so weirdly familiar on the last page. It envelops you in a blanket of claustrophobic uneasiness with a chilling hug. By the last page, I did not want it to release me.I was blinded by the characters. Human beings, with a better resistance than me to the cold, but real people you meet at the bakery (if you are brave enough to go out with that weather!!!). I was amused by the enthusiasm around Ari Thor before meeting him. I wondered what made him so special and endearing to so many readers (you cannot always blame the ovaries for women’s love for a man in books.) Now that I spent some time with him, I understand. He is a guy who wants to do the right thing, he is a young man with principles and morals and good manners. He is a lost guy trying to find himself. I loved that he wasn’t sure of anything, that his status of newbie left him singled out and that only his willingness and determination helped him make room for himself in the police force.You cannot help warming to him, and not just to fight the cold the book puts you in! He is like many people his age, trying to figure out his place in the world, and making the best of what’s given to him. His decision at the beginning of the book to accept a job offer so far away was the moment I decided I wanted to follow him. I took the same decision once, leaving behind a very special someone, but knowing I had to do this for myself. From this point onward, I was 100% in. Far from any police officer cliché, Ari Thor is welcome fresh blood and a new favorite of mine, despite my rolling of eyes regarding the women in his life.We are given impressions of every other character from Ari Thor, and that made things a lot more interesting in my opinion. The eyes of a foreigner are more likely to be sharp and offer you a portray that influences the way you see and react to the setting. Again, the foreign-sounding names had me reading twice or even three times to make sure I knew who was what, but that is just me being fed English names all the time.The magic of Ragnar Jonasson’s writing is that he drowns you into a pool of Nordic population with no map and no way out, and what starts as scary and uncomfortable slowly turns into a world you get acquainted with, a world you discover the rules of, a world of people no so different after all, and suddenly you realize you’re swimming in their icy water and you’re not struggling as much, you just follow the flow and keep your head out of the water. My feelings mirrored Ari Thor’s with such intensity I was left afraid but eager to know what the next page would bring.I was blinded by the realism, authenticity and real voice of the story. Never are we told anything directly in a forced way, feelings are shown, actions and words are interpreted, the whole book feels like watching a play, with every character ready to deliver the performance of their life. They all felt true, with their flaws, habits, motives and lives. Normal lives in a quiet place not so quiet when blood gets spilled. They are quite a fascinating lot, and I loved just how easy the writing made it to picture them.Another thing I loved was the small community feeling associated with the remoteness of the place. The tiny snowflakes recovered houses and people, the building up of the thick coat of white reflecting the slow pace of the investigation. Just like Ari Thor, I was eager to act, to dig both in the snow and into the case, to get to the bottom of everything. It was a special feeling, as if time worked differently there, and it reinforced my feeling of a glass door between me and that town, despite my banging on it with a shovel to get in, I felt Ari Thor was in the same position. One step forward, two steps back. Even the tension felt frozen all along. Oh you are in for an oppressive and compelling investigation, and you find tension all the way, but it is tricky kind of tension. One that starts in the toes; something is wrong, then it attacks the legs; who can you trust? When the upper body goes numb; time to question everything and take the leap in search for the truth. And then all is exposed and the pieces of the puzzle fall into place in an astonishing silence.The poetic writing transported me, the characters warmed me, the investigation made me feel alive. I loved it!I would like to thank Quentin Bates for his fantastic and smooth translation of Snowblind which allows the book to reach a wider audience.Chilling and raw, Snowblind introduces you to one of the most interesting main characters in crime fiction and throws you with him into a riveting police investigation that won’t leave you cold."}, {"review_sentiment": 4.0, "review_text": "Ari Thor is just starting out in his career as a policeman. He is living in Reykjavik Iceland with his girlfriend. He is applying for a job and is offered a position in Siglufjordur which is a northern fishing village 50 miles from the Artic Circle. He takes this position with hope that his girlfriend Kirstin will move with him.  Kirsten is put out by Ari accepting this northern most position without discussing it with her and stays in Reykjavik.I really liked this book a lot. The location was one of the most fascinating locations that I have read about. Siglufjordur is an actual village in Iceland. It is very difficult to travel to in the winter and was actually cut off by an avalanche in this book. The weather is claustrophobic to Ari with all the constant snow and darkness.Ari is a likeable protagonist who is learning on the job. He is honest and fair. He is treated as an outsider from the south. It seemed so many of the characters were born in Siglufjordur and had left for awhile to go to Denmark. Upon retirement, they returned home. The plotting was very good and I did not have it solved until the author revealed it. The book was translated and flowed well. I am going to continue with this author and series. I thought the book was intriguing. ."}, {"review_sentiment": 3.0, "review_text": "Most of the action in Ragnar Jónasson's thriller, \"Snowblind,\" takes place in Siglufjördur, Iceland, a dreary town in the northern part of the country where winters are particularly brutal.  The novel opens with the death of an unidentified woman who lies in a pool of blood.  Meanwhile, in Reykjavík, twenty-four year old policeman-in-training Ari Thór Arason tells his live-in girlfriend, Kristín, that he has taken a job in Siglufjördur, \"a place closer to the Arctic Circle than to Reykjavík.\" She is stunned and dismayed that the man she loves would choose to move to this remote locale.After he settles in, Ari Thór discovers that in Siglufjördur, everyone knows everyone else's business.  His superior officer, Tómas, is a loud but decent sort, and little by little, Ari Thór settles into his new position.  When a well-known local figure dies suddenly, Tómas is content to declare it an accident and move on, but against orders, Ari Thór makes further inquiries on his own.  A later assault leaves someone in critical condition, and it is not clear whether the two incidents are related.\"Snowblind,\" blandly translated by Quentin Bates, is a mishmash with too many frustrated and unhappy characters, most of whom have a secret, grudge, or stain in their past.  The protagonist, Ari Thór, is difficult to like, since he is immature, impulsive, and lacks warmth.  The author overwhelms us with red herrings, revelations, and contrived twists.  His premise is that people who pretend to be goodhearted and charming may be clever frauds, and that the criminal justice system is seriously flawed. Too often, felons escape punishment and move on to wreak further havoc.  This is a bleak and unsatisfying work of fiction that has little to recommend it. The plot is turgid and melodramatic; the prose and dialogue are lackluster; and the men and women who populate the book are not particularly appealing.  At least Jónasson makes excellent use of his setting.  We feel the claustrophobia, freezing cold, and dismal atmosphere that casts a pall over this village in the middle of nowhere."}, {"review_sentiment": 4.0, "review_text": "Another Scandi noir addition I couldn't put down.  A bit of a slow start soon took me to a wonderfully atmospheric world, with a highly likeable rookie policeman, Ari Thor, who has moved to a new job from Southern Iceland to the very north, close to the Arctic. The tightly knit community will not accept there is a murderer amongst them, despite two deaths and even Ari's boss warns him off.  Lonely, missing the girlfriend he left behind, caught in a mental and physical claustrophobic nughtrnughtrmare, Ari doggedly works his way to the surprising solution.  Highly recommended, I will definitely read the rest of the series!"}]}, "authors": ["Ragnar Jónasson"], "isbn": "1910633038", "longitude": -21.9422367, "periods": ["2000s", "Recent Releases"], "title": "Snowblind", "word_cloud": "idyllically quiet fishing village lock door accessible small mountain tunnel rookie policeman first post far girlfriend past unable leave young woman find lie snow bleed unconscious highly esteem elderly writer fall death local theater drag straight heart community trust secret lie way life avalanche unremitting snowstorm close mountain pas darkness threaten push edge curtain begin investigation become increasingly complex chill personal play tag present claustrophobic tension mount thrust ever deeper darkness blind snow killer never quite love descriptive writing almost felt live also frustration dread endless night continue make worse blockage tunnel avalanche feeling trap highly look author miss something attract lot review first quintet yet find fundamentally told language poetic see try quite like way express soft oppression snow phrase freezing darkness swallow try listen classical music deafen silence incessant snowfall music magnify gloom work familiar snow deep cold claustrophobia live beneath mountain bring well capture well enough sustain plot stretch willingness suspend disbelief way young policeman unraveled secret seem hard man intuitive think heart dissatisfaction policeman reason care seem empty man start many thing finish none tie knot integrity get indignant love yet weak live standard know young callow interest fancy snow set village drama society rather modern accent local color occasional stab lyrical sure great television moody camera work mournful atonal music similar reaction make great television huge fan base perhaps equip kind think go change pass rest quintet read new author follow find disappoint give hype offer many crime write luminary much prefer start slowly innocent gradually build chill point story strange turn read next one typical mystery plot set interesting thing le interesting get author need push imaginative creative rely formula blind review coldly brilliant debut blind snow slippery road heavy coat winter freeze temperature felt open door sweep away white storm everything sound different admit issue remember name especially city one thankfully author take pity send pronunciation city write name think story fact heighten experience country knowledge literally walk street enough information see everything clearly enough freedom make image let place never treasure beautiful description make shiver character take breathtaking view place feel foreign first page weirdly familiar last page envelop blanket claustrophobic uneasiness chill hug last page want release blind character being better resistance cold real people meet bakery brave enough go weather amuse enthusiasm meeting wonder make special endear many reader always blame ovary woman love man now spend time understand guy want right thing young man principle moral good manner lose guy try find love sure anything status newbie leave singled willingness determination help room police help warm fight cold put many people age try figure place world make best give decision begin accept job offer far away moment decide want follow take decision leave special someone know point onward police officer cliche welcome fresh blood new favorite mine roll eye regard woman give impression character make thing lot interesting opinion eye foreigner likely sharp offer portray influence way react set name read twice even time make sure know fed name magic write drowns pool population map way start scary uncomfortable slowly turn world get acquaint world discover rule world people different suddenly realize swim icy water struggle much follow flow head water feeling mirror intensity leave afraid eager know next page realism authenticity real voice story tell anything directly force way feeling show action word interpret whole feel watch play character ready deliver performance life felt true flaw habit motif live live quiet place quiet blood get spill quite fascinate lot love easy write make picture thing love small community feeling associate remoteness place tiny snowflake recover house people build thick coat white reflect slow pace investigation eager act dig snow case everything special feeling time work differently reinforce feeling glass door town bang shovel get felt position step forward step back even tension felt frozen oppressive compelling investigation tension way tricky kind tension start toe something wrong attack legs trust upper body go numb time question everything leap search truth expose piece puzzle fall place astonish poetic writing transport character warm investigation make feel alive love thank fantastic smooth translation allow reach wider raw introduce interesting main character crime fiction throw rivet police investigation leave cold start career policeman live girlfriend apply job offer position northern fishing village mile take position hope girlfriend move put accept northern position discuss stay really like lot location fascinating location siglufjordur actual village difficult travel winter actually cut weather claustrophobic constant snow likable protagonist learn job honest fair treat outsider south seem many character bear leave retirement return plot good solve author reveal translate flow well go continue author series think intrigue most action thriller take place dreary town northern part country winter particularly brutal open death unidentified woman lie pool blood meanwhile year old tell girlfriend take job place closer stun dismayed man love remote settle discover everyone know everyone else business superior officer loud decent sort little little settle new position local figure die suddenly content declare accident move order make inquiry later assault leave someone critical condition clear incident related blandly translate mishmash many frustrate unhappy character secret grudge stain protagonist difficult immature impulsive lack warmth author overwhelm red herring revelation contrive twist premise people pretend goodhearted charming fraud criminal justice system seriously flaw often felons escape punishment move wreak havoc bleak unsatisfying work fiction little recommend plot turgid melodramatic prose dialogue lackluster men woman populate particularly appeal least make excellent use set feel claustrophobia freeze cold dismal atmosphere cast pall village middle nowhere addition bit slow start soon take wonderfully atmospheric world highly likable rookie policeman move new job north close tightly knit community accept murderer among st death even bos warn lonely miss girlfriend leave caught mental physical claustrophobic nughtrnughtrmare doggedly work way surprising solution recommend definitely rest series", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Taut and terrifying, a startling debut from an extraordinary new talent, taking Nordic Noir to soaring new heights\r\n\r\nSiglufjörður: an idyllically quiet fishing village in Northern Iceland, where no one locks their doors, and which is accessible only via a small mountain tunnel. Ari Thór Arason: a rookie policeman on his first posting, far from his girlfriend in Reykjavik, with a past that he’s unable to leave behind. When a young woman is found lying half-naked in the snow, bleeding and unconscious, and a highly esteemed, elderly writer falls to his death in the local theater, Ari is dragged straight into the heart of a community where he can trust no one, and where secrets and lies are a way of life. \r\n\r\nAn avalanche and unremitting snowstorms close the mountain pass, and the 24-hour darkness threatens to push Ari over the edge, as curtains begin to twitch, and his investigation becomes increasingly complex, chilling, and personal. Past plays tag with the present and the claustrophobic tension mounts, while Ari is thrust ever deeper into his own darkness—blinded by snow, and with a killer on the loose.", "asin": "1910633038", "rank": "69678", "city": "Reykjavik", "image": "https://images-na.ssl-images-amazon.com/images/I/51rXfLsiNKL.jpg", "country": "Iceland", "story_arc": ["Tragedy", "Things only get worse"]}