{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": -33.928992, "ratings": {"num_ratings": 2, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Though I’m a born-and-bred Capetonian, and reckoned I was au fait with everything I thought I knew about the Mother City, Nechama Brodie opened my eyes to quite a lot about my stomping ground that was fresh. This is a big book in more than one way – not only considering its physical dimensions but also the depth and breadth of its content. The Cape Town Book covers not only the city’s natural history and geography, but also tells the story of the many people who have lived around the slopes of Table Mountain.Cape Town’s history stretches much further back than that of the refreshment station established by the Dutch back in the 1600s, and as such, the city has been shaped by the devastating effects of colonialism. Cape Town is thus a melting pot where Africa meets Asia and Europe, and though many of its people’s stories bear testimony to a legacy of inequalities, they are nonetheless fascinating and I feel enriched by having discovered them.For me, in particular, this book filled many gaps that were omitted from my history lessons during my school days. In particular, I found the history of Islam in Cape Town fascinating – I really had no idea so many Muslim saints were buried here. The realisation of exactly how intrinsic the slave trade was to the city during its early days was also a revelation – much of this had been glossed over me. Brodie goes in depth with apartheid history, and the section about Robben Island in particular is both terrible and fascinating.The Cape Town Book is jam packed with information and illustrated in full colour with plenty of visuals, including photos and reproductions of historical prints, as well as helpful suggestions for further reading. Scattered throughout is advice on places to visit and supplementary information panels. Not only is this a great book for visitors to the Mother City, but with its stunning layout and well-planned format, it’s exactly the kind of hefty tome that deserves a permanent place in my collection."}, {"review_sentiment": 5.0, "review_text": "Excellent source of info for my research! Provides historical context, practical details, all presented clearly."}]}, "authors": ["Nechama Brodie"], "isbn": "1920545980", "longitude": 18.417396, "periods": ["Recent Releases"], "title": "The Cape Town Book: A Guide to the City's History, People and Places", "word_cloud": "capetian reckon au fiat everything think know open eye quite lot stomp ground fresh big way consider physical dimension also depth breadth content cover city natural history geography also tell story many live slope table history stretch much back refreshment station establish back city shape devastate effect colonialism thus melt pot meet many story bear testimony legacy inequality nonetheless fascinate feel enriched discover particular fill many gap omit history lesson school day particular find history fascinate really idea many saint bury realization exactly intrinsic slave trade city early day also revelation much gloss go depth apartheid history section particular terrible jam pack information illustrate full color plenty visuals include photo reproduction historical print well helpful suggestion read advice visit supplementary information panel not great visitor stun layout format exactly kind hefty tome deserves permanent place collection source info research historical context practical detail present clearly", "genres": ["History"], "summary": "The Cape Town Book presents a fresh picture of the Mother City, one that brings together all its stories. From geology and beaches to forced removals and hip-hop, Nechama Brodie, author of the best-selling The Joburg Book, has delved deeply into the hidden past of Cape Town to emerge with a lucid and compelling account of South Africa’s fi rst city, its landscape and its people.\r\n\r\nThe book’s 14 chapters trace the origins and expansion of Cape Town – from the City Bowl to the southern and coastal suburbs, the vast expanse of the Cape Flats and the sprawling northern areas.\r\n\r\nOffering a nuanced, yet balanced, perspective on Cape Town, the book includes familiar attractions like Table Mountain, Kirstenbosch and the Company’s Garden, while also giving a voice to marginalised communities in areas such as Athlone, Langa, Mitchells Plain and Khayelitsha.\r\nMany of the images in the book have never been published before, and are drawn from the archives of museums, universities and public institutions. \r\n\r\nThis beautifully illustrated, information-rich book is the defi nitive portrait of the wind-blown, contradictory city at the southern tip of Africa that more than three million people call home", "asin": "1920545980", "rank": "736645", "city": "Cape Town", "image": "https://images-na.ssl-images-amazon.com/images/I/615CChpydtL.jpg", "country": "RSA", "story_arc": ["Tragedy", "Things only get worse"]}