{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": -37.8142176, "ratings": {"num_ratings": 97, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "I have read three of Temple's books in a row.  They are very well written, entertaining, have good plots and character development.  Lots of characters, almost to the point that I wished I had written them down as the appeared.  Occasionally, the Australian slang will be a little confusing, but everything else about his books is so good that it's easy to overlook this, and lots of time it adds to the allure of Australia (which is a super place!).  I heartily recommend Temple's books."}, {"review_sentiment": 5.0, "review_text": "Best dialog from Down Under, ever!  Always a treat."}, {"review_sentiment": 5.0, "review_text": "Received item quickly in condition that seemed better than advertised. A pleasure doin the biz."}, {"review_sentiment": 3.0, "review_text": "Once again I had difficulty getting into this author's book.  Although I made myself finish it about two months ago, I can't remember any details. I hate to admit it but guess age is a factor."}, {"review_sentiment": 4.0, "review_text": "Great characters, suspenseful, intelligent....and horses! What's not to like. I look forward to reading more from Peter Temple and learning where he takes Jack Irish in the future."}, {"review_sentiment": 5.0, "review_text": "Jack Irish is a great Aussie character with a life of hurt buried deep in his soul. But Jack is a fighter. Jack is a Fitzroy Boy. Make some noise. The story is complex but it roils and boils and the pace toward the end is electric. An old client, Jack being a lawyer, leaves him a message asking for help. jack doesn't get the message until it is too late. And from that point the story goes underground. There is violence, intrigue and a whole lot of bad guys waiting for Jack to find them out. I love this story and this was after having seen Guy Pearce playing him on tv. Here is an actor who represents the fictional character truly. Take note Lee Child and Mr. Cruise."}, {"review_sentiment": 5.0, "review_text": "A noir novel with all the traditional elements, a multi-faceted, flawed but likable main character with a tragic backstory, a borderline-criminal best friend, a romantic interest with her own agenda and a bit of a mercenary heart, a humorous, ragtag collection of misfits and criminals, the obligatory comic relief, and a well defined sense of place. I caught the first movie and immediately bought the book and have been making my way through the series over the past few weeks. The plot lines are a little convoluted but that's a minor flaw here. Great books!"}, {"review_sentiment": 4.0, "review_text": "A easy enjoyable book to read."}, {"review_sentiment": 4.0, "review_text": "A good Aussie detective story - plenty of wry Aussie humour from the eponymous anti-hero. Watched the TV movie too: follows the book fairly closely, but the book still beats the movie. Fills up a rainy afternoon very well indeed - nice, refreshing example of the genre - looking forward to the next one."}, {"review_sentiment": 5.0, "review_text": "I enjoyed this book from start to finish.  Spooner's life is very much like Pete Dexter's so I think that made even the craziest parts feel real.  Be ready for lots of humor and some insights into human development. The influence of one very fine step-father is a lesson for all of us.  Spooner is quite a man's man and presented a real challenge for the woman he married, so I'd like to know more about how she managed.  Next book might be Wife of Spooner,"}]}, "authors": ["Peter Temple"], "isbn": "1921758813", "longitude": 144.9631608, "periods": ["1900s"], "title": "Bad Debts: The First Jack Irish Thriller", "word_cloud": "row well write entertain good plot character development character almost point wish write appear slang little confuse everything else good easy lot time add allure super place heartily recommend temple best dialog ever treat receive item quickly condition seem better advertise pleasure don biz once difficulty get author make finish month detail hate admit guess age factor great character suspenseful intelligent horse look forward read learn take future great character life hurt buried deep soul fighter noise story complex roils boil pace end electric old client lawyer leave message ask help message late point story go violence intrigue whole lot guy wait find love story see play tv here actor represent fictional character truly note nor traditional element flaw likable main character tragic backstory best friend romantic interest agenda bit mercenary heart humorous ragtag collection misfit criminal obligatory comic relief well define sense place catch movie immediately buy make way series week plot line little convolute minor flaw great easy enjoyable good detective story plenty wry humor eponymous tv movie follow fairly closely still beat movie rainy afternoon well indeed nice refresh example genre look forward next one enjoy start finish life much think make even craziest part real ready lot humor insight human development influence fine lesson quite man man present real challenge woman marry like know manage next", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Meet Jack Irish, criminal lawyer, debt collector, football lover, turf watcher, trainee cabinetmaker, and one of the best crime characters ever created.\r\n\r\nWhen Jack receives a puzzling message from a jailed ex-client he’s too deep in misery over his football team’s latest loss to take much notice. Next thing Jack knows, the ex-client’s dead and he’s been drawn into a life-threatening investigation involving high-level corruption, dark sexual secrets, shonky property deals, and murder. With hitmen after him, shady ex-policemen at every turn, and the body count rising, Jack needs to find out what’s going on—and fast.\r\n\r\nThe first novel in the iconic Jack Irish series, Bad Debts was first published in 1996 and won the Australia's crime writing prize, the Ned Kelly Award, for Best First Novel. \r\n\r\nPeter Temple went on to win Australia's highest literary honor, the Miles Franklin Award, in 2010 for Truth as well many other awards and accolades both in Australia and internationally.", "asin": "1921758813", "rank": "398454", "city": "Melbourne", "image": "https://images-na.ssl-images-amazon.com/images/I/51gOsQK8R0L.jpg", "country": "Australia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}