{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 24, "rating": 3.6, "reviews": [{"review_sentiment": 3.0, "review_text": "I somewhat enjoyed this book but feel ripped off over the ending, too many questions left unanswered made the book a lot less enjoyable."}, {"review_sentiment": 5.0, "review_text": "This is incredible Australian literary fiction, I can't believe I did not read it earlier, it is entirely worthy of all the awards it won. Indelible Ink has flawed yet likeable characters, and several unexpected twists and turns. I'm always looking for Australian novels that accurately depict the Australia of today and this does, very well. McGregor has a magnificent ability to write so that her characters seem like people I know. The wealthy, greedy father, the children who can't live up to their father's career goals but need to find themselves in other ways, the family conflict where adults become children again and lastly the mother who holds them all together but is on her own personal journey of discovery. Set in Sydney, shifting between Mosman and Surry Hills, this is the story of a segment of Marie King’s life. Marie, aged 59 and divorced, has lost herself. She lives in a beautiful home in Mosman, and appears to have led a relatively privileged life however somewhere along the way, Marie seems to have lost her sense of self. One day, bolstered by the bravery of alcohol, Marie wanders into a tattoo parlour. Her first tattoo leads to others, and introduces Marie or sometimes reminds her of other aspects of life. Marie’s friends, and her children Clark, Blanche and Leon do not understand Marie’s need for tattoos. I found the novel fascinating because of the way Fiona McGregor depicts Marie’s search for her own sense of life and what is important to her.There is no happy ending in this novel, no chance for a happy new beginning. But, the Marie with whom we end the novel is a more fulfilled woman than the Marie with whom we commenced it. A gripping book that squeezes your heart. 5 + stars."}, {"review_sentiment": 4.0, "review_text": "Indelible Ink is a frank and honest look at family life. The main character Marie is at cross roads and seems to have lost a sense of self. In my opinion her life is full of superficial relationships that parallel the drought Sydney is going through in the book. Most of the characters are shallow and therefore difficult to like.This would have been a 3 star review except for the fact that it’s set in Sydney - a city I know well which helped me enjoy the story."}, {"review_sentiment": 4.0, "review_text": "Set in Sydney, shifting between Mosman and Surry Hills, this is the story of a segment of Marie King’s life.  Marie, aged 59 and divorced, is unsatisfied with aspects of her life.  Sure, she lives in a beautiful home in Mosman, and appears to have led a relatively privileged life.  But somewhere along the way, Marie seems to have lost her sense of self.  Increasingly, she is aware that she can no longer support the lifestyle she’s become used to on the allowance her ex-husband Ross pays. One day, bolstered by the bravery bestowed by alcohol, Marie wanders into a tattoo parlour.  Her first tattoo leads to others, and introduces Marie (or sometimes reminds her) of other aspects of life.Marie’s friends, and her children Clark, Blanche and Leon do not understand Marie’s need for (or is it an obsession with?) tattoos.  For a while, it seems as though Marie is in control of her life, but is she?I found this novel challenging, and interesting.  Challenging because I found it very difficult to feel much sympathy for any of the characters.  I don’t recognise much of the world that Marie, her friends and children inhabit.  And yet, despite the privilege and opportunity conferred by wealth, few of the characters seemed comfortable or happy either with themselves or the world.  I found the novel interesting because of the way Ms McGregor depicts Marie’s search for her own sense of life and what is important to her.  There’s something about Marie’s desire to define herself separate from her family and her environment, about her appreciation of beauty in nature which held my attention.  It is mid-summer, and Sydney is in drought.  Many of the lives of those in the novel are also ‘in drought’, needing nourishment to meet their potential.There is no happy ending in this novel, no chance for a happy new beginning.  Life is often like that.  But, to me at least, the Marie with whom we end the novel is a more fulfilled woman than the Marie with whom we commenced it.Jennifer Cameron-Smith"}, {"review_sentiment": 1.0, "review_text": "It is very seldom that I cannot finish a novel once started, but this one I could not persevere with.  I found the characters hard to like, the storyline mundane,  All in all, not my cup of tea."}, {"review_sentiment": 1.0, "review_text": "Shallow story and clumsy writing style."}, {"review_sentiment": 4.0, "review_text": "For a while I wondered where the story was leading, but thoroughly enjoyed following gutsy lady Marie through her final months.  Very poignant and honest."}, {"review_sentiment": 4.0, "review_text": "Good read. Life brings change and opportunity."}, {"review_sentiment": 4.0, "review_text": "If I were to score this book just on the standard of the writing, it would easily get a 5. The story flowed well, despite moving between the perspective of the main 4 family members - and all the characters, and their surrounds, were beautifully drawn. I identified with the location as I have spent most of my adult life in this area, including 19 years in a neighbouring suburb.  However I couldn't identify with the characters, particularly the 3 adult children.  I found them to be terribly self indulgent.  I did not like some of the language and could not imagine the Mosman matrons (Marie's generation) that I knew, using it.  I also did not like the ending.  Although there was some hope that the 'children' were resolving some of their issues, I felt left up in the air.  However, if you like to read something different that may also challenge some of your perceptions, then I recommend this book."}, {"review_sentiment": 5.0, "review_text": "Anyone who loves ink, anyone who enjoys reading of another human being breaking out, will take to this book. Well written and good to read."}]}, "authors": ["Fiona McGregor"], "isbn": "1922070629", "longitude": 151.2164539, "periods": ["2000s", "Recent Releases"], "title": "Indelible Ink", "word_cloud": "somewhat enjoyed feel rip end many question leave unanswered make lot le enjoyable incredible australian literary fiction earlier entirely worthy award flaw yet likable character several unexpected twist turn always look australian novel accurately depict today well magnificent ability write character seem people know wealthy greedy father child father career goal need find way family conflict adult become child lastly mother hold together personal journey discovery shift story segment life age divorce live beautiful home appear lead relatively privileged life however somewhere along way seem lose sense day bolster bravery alcohol wanders tattoo first tattoo lead others introduces sometimes remind aspect life friends child understand need tattoo find fascinate way depict search sense life important happy end chance happy new begin end fulfil woman commence gripping squeeze heart star frank honest look family life main character cross road seem lose sense self opinion life full superficial relationship parallel drought go most character shallow therefore difficult fact set city know well help story shift story segment life age divorce unsatisfied aspect life live beautiful home appear lead relatively privileged life somewhere along way seem lose sense self aware longer support lifestyle become used allowance pay day bolster bravery bestow alcohol wanders tattoo first tattoo lead others introduces sometimes remind aspect friends child understand need obsession tattoo seem control life find challenge interest challenge find difficult feel much sympathy character recognize much world friends child inhabit yet privilege opportunity confer wealth character seem comfortable happy world find interest way depict search sense life important something desire define separate family environment appreciation beauty nature hold attention drought life also drought need nourishment meet happy end chance happy new begin often least end fulfil woman commence seldom finish start find character hard story line mundane cup tea story clumsy write style wonder story lead thoroughly enjoy follow gutsy lady final month very poignant honest good brings change opportunity score standard writing easily story flow well move perspective main family member character surround beautifully draw identify location spend adult life area include year neighbor suburb however character particularly adult child find terribly self indulgent like language matron generation know use also end hope resolve issue felt leave air however something different also perception recommend anyone love anyone enjoy read human break take write good", "genres": ["Fiction & Literature"], "summary": "A novel about connections in a changing world of friends, lovers, family, illness, and death, this unique narrative tells the story of Marie King—a 59-year-old divorcée from Sydney’s affluent north shore. Having devoted her rather conventional life to looking after her husband and three children, Marie is experiencing an identity crisis. Forced to sell the family home now that her children have moved out, Marie expresses herself by getting a tattoo and, consequently, forges a friendship with tattoo artist Rhys. As Rhys introduces Marie to an alternative side of Sydney, friction erupts between Marie’s social spheres—the affluent middle class and the tattoo subculture. A multi-layered examination of how we live now, this account positions one family as a microcosm for the modifications operating in society at large.", "asin": "1922070629", "rank": "4874745", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51cVWRqdOaL.jpg", "country": "Australia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}