{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 161, "rating": 4.5, "reviews": [{"review_sentiment": 4.0, "review_text": "Arrived on time, but had some minimal wear."}, {"review_sentiment": 4.0, "review_text": "I'm not a big graphic novel person.I feel like graphic novels are usually too quick, and they leave me wanting more.  I can appreciate the effort that goes into the artwork and what not, I've just never really connected with this.  But I really wanted to read the Scott Pilgrims graphic novels.  I love this franchise and I needed to see how it compared to the movie.  Hey guys guess what?  Scott Pilgrim is pretty fantastic.The dialogue is basically what you would expect.Scott's life is massively not-put-together.  He's dating a high schooler (he's 23), he lives with his best friend (who owns everything in their apartment except one \"lame poster\").  His little sister has a better job than him (Scott is \"between jobs\").  Scott's life just isn't going well.  There's a lot of conversation about how Scott's life seems to be derailed.  Scott, unsurprisingly, sees nothing wrong with the way things are going.  In the discussion of Scott's utter failure to LIFE, I really like Kim.  Kim is the band's drummer (\"WE ARE SEX BA-BOMBS!\") and she has no problem telling it like it is.This book isn't going to win any brownie points for intriguing philosophical discussion.  But it's fun.  And also Scott is so stupid you have to feel a bit anxious for him.The artwork is simple and subtly clever.One thing I really appreciated about this novel is that the artwork isn't overwhelming.  You get some graphic novels with all sorts of shading and line art and it's really difficult to focus because chaos surrounds you.  With Scott Pilgrim's Precious Little Life, that's not a concern.Additionally, I really enjoyed the subtle nuances that Bryan Lee O'Malley included in the artwork?  In-drawing footnotes and even chords to the Sex Ba-Bomb's first song can be found if you search hard enough.  And, of course, he's constantly making fun of the lameness of Scott's existence.This book is short and quick.Scott Pilgrim's Precious Little Life definitely did not satiate my need for a bigger, deeper book.  The story line ends right after Scott fights Matthew Patel - the first evil ex.  The closest thing we get to closure is Ramona explaining herself.  I wanted more.  Fortunately I have all the books, so I can plug on, but I think I would have been massively frustrated if I had to wait a year for volume two."}, {"review_sentiment": 4.0, "review_text": "Why I Think Boys May Enjoy ThisWell, it's a graphic novel (the first I've reviewed here on the #BooksForBoys review blog) so that's a start. Also, I enjoyed the movie and never read the graphics. /endexplanationTo start, if you've seen the movie starring Michael Cera, it almost feels like you don't even need to read the graphic novel (or at least volume one so far). I'm not sure how fans of the comic responded to the movie, but I don't think I've ever seen a movie adaptation that so *precisely* mirrored the source material. I'm assuming this will continue as I read the rest of the series, but the movie literally feels like a shot-for-shot reproduction of the comic (which is good in some ways but adaptations really should add their own stamp - but that's a Catch 22 situation).That all being said and necessary, it's still an enjoyable read for an older teen looking for a quick and easy graphic novel focusing on relationships from the perspective of a (kind of) dumb and bumbling boy. Usually, \"romance\" books are targeted to young girls but the heart of Scott Pilgrim ultimately is about Scott's \"love triangle\" with Knives and Ramona. Everything else in the story follows from there.It's nice and refreshing to see classic romance tropes being flipped around a bit in this story (1 boy, 2 girls instead of the reverse) and, of course, the obvious and repeated references to geeky stuff (Scott's band being named after a bad guy in Super Mario, the X-Men logo on his jacket, etc.) is fun and even a modern kid will get the references since they are timeless geek allusions and not niche stuff (which, you know, is funny because a lot of the Scott Pilgrim hype I recall from when this first came out was very hipster-ish in nature).I kinda had trouble classifying this book other than \"Graphic Novel\" but decided on Urban Fantasy due to the sometimes-magical elements (Ramona literally traveling through Scott's head, the first evil ex-boyfriend's Bollywood demon summoning powers, etc.) and, I'm assuming based on the movie, the continuation of similar \"gaming\" style elements incorporated into the story that makes it more fantasy than pure reality.All in all, it's a fun and quick read and I expect to devour the other five books in quick succession. Any teen could read it without issue (see Content section below) and enjoy it. The art style is simple and O'Malley is clearly influenced by Japanese Manga in his illustrations and format (even the story-telling, to be truthful). The heavy use of blackspace in the black and white drawings allows the characters to pop out nicely and nothing interrupts a quick and easy flow for the reader.Content/AppropriatenessTechnically, Scott is outside the \"YA\" range (he is 23) I normally look for. However, like other books I've read with older protagonists, the content of the book and his motivations are very much younger in nature and not really classifiable as Young Adult. Even the first (and running) gag is Scott's relationship with Knives Chau, a 17-year old Chinese school girl (and yeah, his friends and sister immediately point out how cliche that is). The relationships throughout Volume 1 are definitely more juvenile and high school-ish in nature, even Scott's obsession with Ramona.There are direct references to sex, especially when Scott goes to Ramona's house after their first date. No nudity is shown (Ramona is seen in bra/panties), but there is a GREAT lesson in this first \"adult\" interaction about consent that I think is done nicely and with subtlety. It looks as though they will have sex (after kissing and being near-naked) but Ramona tells him that he's changed her mind. Scott makes no move to pressure or argue against this. This is an \"adult\" situation that would do well to be demonstrated to anyone in high school.In the first book, there are no other content concerns about language or violence (seriously, the first \"mini-boss\" literally turns into coins like in a video game, it's that tame). Other than the sexual conversation, especially coming from Scott's \"very gay\" roommate Wallace, there's nothing to stop a mature-enough 15+ (maybe even younger pending parental veto) from enjoying this book.Rating4/5 Giant Cartoon Mallets from Toonopolis, The Blog's Books for Boys Review"}, {"review_sentiment": 5.0, "review_text": "Fun read."}, {"review_sentiment": 4.0, "review_text": "Although not in great shape, it was used and for the price, a great deal"}, {"review_sentiment": 5.0, "review_text": "good"}, {"review_sentiment": 1.0, "review_text": "bad"}, {"review_sentiment": 2.0, "review_text": "This is black and white and cheaply printed (story is great, buy the color version)"}, {"review_sentiment": 4.0, "review_text": "I love this! I've never read them before, but it's just very adorable and funny."}, {"review_sentiment": 5.0, "review_text": "Great book. Arrived without damage."}]}, "authors": ["Bryan Lee O'Malley"], "isbn": "1932664084", "longitude": -79.387207, "periods": ["1900s"], "title": "Scott Pilgrim, Vol. 1: Scott Pilgrim's Precious Little Life", "word_cloud": "arrived time minimal wear big graphic feel graphic novel usually quick leave want appreciate effort go artwork never really connect really want graphic novel love franchise need see compare movie guy guess pretty dialogue basically massively date high schooner live best friend own everything apartment lame poster sister better job job go well lot conversation seem derail unsurprisingly see nothing wrong way thing go discussion utter failure really band drummer problem tell go win brownie point intrigue philosophical discussion fun also stupid feel bit anxious artwork simple subtly thing really appreciate artwork overwhelm get graphic novel sort shade line art really difficult focus chaos surround really enjoy subtle nuance include artwork footnote even chord first song find search hard enough course constantly make fun lameness short definitely satiate need bigger story line end right fight first evil closest thing get closure explain want fortunately plug think massively frustrate wait year volume think graphic first review review blog start also enjoy movie never graphic start see movie star almost feel even graphic least volume far sure fan comic respond movie think ever see movie adaptation mirror source material assume continue rest series movie literally feel reproduction comic good way adaptation really stamp situation say necessary still enjoyable older teen look quick easy graphic focus relationship perspective kind dumb bumbling boy romance target young girl heart ultimately triangle else story follow nice refresh see classic romance trope flip bit story boy girl instead course obvious repeat reference geeky stuff band name bad guy logo jacket etc fun even modern kid get reference timeless geek allusion niche stuff know funny lot hype recall first come nature kinda trouble classify decide due element literally travel head first evil demon summon power etc assume base movie continuation similar gaming style element incorporated story make fantasy pure fun quick expect devour quick succession teen see section enjoy art style simple clearly influenced japanese illustration format even truthful heavy use backspace black white drawing allow character pop nicely nothing interrupt quick easy flow range normally look however older protagonist content motivation much younger nature really classifiable first run gag relationship old chinese school girl yeah friend sister immediately cliche relationship volume definitely juvenile high nature even obsession direct reference sex especially go house first date nudity show see lesson first adult interaction consent think do nicely subtlety look sex kiss tell change mind make move pressure argue adult situation well anyone high first content concern language violence seriously first literally turn coin video game tame other sexual conversation especially come gay roommate nothing stop maybe even younger pending parental veto enjoy fun great shape use price great deal good bad black white cheaply print story great buy color version love never adorable funny arrive damage", "genres": ["Comics & Graphic Novels"], "summary": "Scott Pilgrim's life is totally sweet. He's 23 years old, he's in a rock band, he's \"between jobs,\" and he's dating a cute high school girl. Nothing could possibly go wrong, unless a seriously mind-blowing, dangerously fashionable, rollerblading delivery girl named Ramona Flowers starts cruising through his dreams and sailing by him at parties. Will Scott's awesome life get turned upside-down? Will he have to face Ramona's seven evil ex-boyfriends in battle? The short answer is yes. The long answer is Scott Pilgrim, Volume 1: Scott Pilgrim's Precious Little Life.", "asin": "B004YUA19C", "rank": "3868911", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51oDpXe20RL.jpg", "country": "Canada", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}