{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 46, "rating": 4.4, "reviews": [{"review_sentiment": 3.0, "review_text": "A nice look into daily life in ancient Rome. However, the translation is often frustratingly poor, especially when the author refers to names: for example, the Roman consul Sulla is called \"Silla\", which is the current Italian spelling, but for an English speaker it makes no sense, especially since the classical latin spelling of this consul's name is the same as it is in English. Sulla was a rather famous (or infamous) dictator in ancient Rome, so the error is quite confusing for those of us unaware of the modern Italian translation. I had to look the name up online to figure out who the author was talking about. One or two references to somewhat well-known latin quotes are also mistranslated (or poorly translated). This sort of clunky translation happens a number of times, and it tends to halt the flow of the book, as the reader tries to figure out what the author means. With a better translation, this book would have easily got 4 or 5 stars from me, as it is very informative."}, {"review_sentiment": 4.0, "review_text": "That's the first sentence and the mission of this book.  Alberto Angela takes the reader through a typical day, from pre-dawn to midnight, in the year 115 CE, during the reign of Trajan.  Arguably, that was when Rome reached the height of its power and when it achieved the greatest expression of its beauty.We visit a house of the elite and a typical apartment building, stores and shops, a temple, court chambers, the public baths, and the Colosseum.  We learn about a typical breakfast and lunch, and we sit in on an extended, elaborate evening banquet.  We see how Romans dress and do their laundry (often using human urine).  We visit the cattle market and abattoir, the slave market, and the public latrines (which were not free).  And much more, including a fair amount about Roman cuisine (including several recipes) and a section on sexual customs and practices in Rome.Along the way I learned many interesting things.  One had to do with the acceptance of children in what was a very masculine society.  A newborn babe would be placed at the feet of the man of the house.  If the man bent down to pick it up and then raised it high showing it to all, that constituted acknowledgement of his paternity and the babe would be accepted into the family.  If, on the other hand, the man remained impassive, refusing to pick up and raise the baby, it would not be accepted into the family.  Reasons for rejection might be the wrong sex, too many children to support already, rape, or suspicion that the child is the product of betrayal or is affected by malformation or defects.  A rejected babe was then picked up by whoever had set it on the floor, usually a midwife, and taken to one of several designated locations on the streets of Rome and placed into a sordid system of infant trafficking.Another aspect of the more ghastly side of Roman life was the public display of violence at the Colosseum.  For example, as part of the celebrations for Trajan's victory over the Dacians (inhabitants of present-day Romania), the Colosseum held performances for 120 straight days, featuring the killing of 11,000 animals and 10,000 gladiators.  Over four and a half centuries of productions of bloodlust, the Colosseum became the place of the highest concentration of human death known to history; in the central arena of little more than one acre, hundreds of thousands of people went to their death.The prose (translated from the original Italian) is informal and straightforward.  The author was a producer and director of television shows, and in many ways A DAY IN THE LIFE OF ANCIENT ROME reads like the script of a television documentary.  In a few instances, the writing is a little over the top, cheesy even (such as the account of the fight to the death in the Colosseum between a hunter and a leopard).  But it makes for an easy read.  In addition, there are a few helpful drawings, such as ones illustrating male and female garb and one on the elaborate positions of the hands indicating different numbers (up to 10,000).I recently read a scholarly account of ancient Rome, \"SPQR: A History of Ancient Rome\", by Mary Beard.  A DAY IN THE LIFE OF ANCIENT ROME is a good companion to such a history.  It also would be a good book to read and take with you on a sightseeing trip to Rome, especially since it includes a fair amount about buildings or ruins that still exist."}, {"review_sentiment": 4.0, "review_text": "Alberto Angela is the \"Bill Nye the Science Guy\" of ancient Rome. In this book he takes the reader on an imaginary day-long stroll through the ancient city, occasionally stopping to recount the greatest monuments to the smallest details. His text is engrossing - makes you feel like you're watching a TV documentary. Don't want to provide any spoilers about the itinerary, but this is a tour that aficionados of classical history wont want to miss. Gregory Conti provides a commendable English translation from the original Italian. Bravo!"}, {"review_sentiment": 4.0, "review_text": "A Day in the Life of Ancient Rome can be taken essentially as a written TV documentary. In fact, author Alberto Angela is in the television business which takes him around the world, making him a very cosmopolitan tour guide. He brings his skills to this interesting day-long trip through Trajan’s Rome at the height of the empire, c.115 CE (AD is no longer politically correct). Alberto takes an unusual approach, but it really worked for me. We are strangers—almost ghosts—who start walking through the city at dawn, peeking into private houses, strolling through public buildings, checking out the forums, attending the games and later a Senator’s banquet. All the while the author describes details to us that are usually left out of our basic education. For instance, we watch a woman in the marketplace so the author can describe how Romans count: “The woman makes the horns sign with her thumb, index, and little finger. But the customer doesn’t get flustered; evidently it’s not an insult. What does it mean? Our curiosity piqued, we walk over to get closer. ‘Four,’ she says. The horn sign must mean four.” And so on. The next page, we get a chart showing the different hand positions and what they (probably) mean. Frankly I never thought about how Romans count, so this was quite useful to me. Later on, Alberto gives us a lesson about the value of money in terms we can relate to today: “In contemporary terms, a sestertius is worth about two Euros, or two and a half dollars…1 quart of olive oil = 3 sestertii = $7.50…1 admission to the baths = ¼ sestertius (1 as) = $0.65…1 slave = 1200-2500 sestertii = $3,150 - $6,300.”Of course, no discussion about Rome would be complete without the baths: “Come to think of it, all our imagined reconstructions of ancient Rome are ‘clean’. In reality, they are missing an important detail: smoke… wood is the fuel of the great public baths, ecological monsters that burn trees nonstop, day after day, month after month, year after year—For centuries, almost without interruption.” That certainly puts things into perspective! Of course, the baths are a thing of beauty and a major part of the daily routine. They are also more than just a series of rooms; you get “gardens, woods, statues, and fountains…The only places you can enjoy this type of atmosphere today are the parks of big modern cities.” This book is full of such anecdotes which makes ancient Rome resound with images (both in words and in drawings) that bring everyday people closer to our points of view and make them something we can relate to. Although to me it seemed like the book was written in one draft, I found it very enjoyable and learned much I will find useful in the future."}, {"review_sentiment": 5.0, "review_text": "Very informative and interesting."}, {"review_sentiment": 3.0, "review_text": "The details in this book are entertaining, but often they disagree with scholars such as Mary Beard.  When I compared some of his statement to hers, it made his work look sloppy.  Also, especially near the end, the book appears to have not been proofread at all in some places.  It looks like the editor just stopped reading!"}, {"review_sentiment": 5.0, "review_text": "This book is very interesting and easy to read. I can't wait to go back to Rome!"}, {"review_sentiment": 5.0, "review_text": "Reading this book is like being with a tour guide who has taken you back in time, and is giving you a day's guided tour of 115 CE Rome, and what it is like to live there, bringing it all to life by describing the people and activities  you are passing as you wander around.The day starts before dawn when you observe the slaves preparing the house for the owners, right through every aspect of the day, up to midnight.Our chatty guide, who occasionally asks rhetorical questions, takes us from the home, onto the streets, into different living quarters, shops, the baths, the Colosseum (bit gory) etc. etc., giving us fascinating insights along the way - for example, some Romans wore wrist timepieces!  - and offering comparisons with current day Rome.  It is a work of imagination of what life was like then, based on historical fact, research and artefacts found.  Many times the author refers to a gravestone that has been found, after talking about a person you have observed on your tour.Chapters are short - divided into short segments of the day, and there is a great list of Contents if you want to return to sections (there is no index).  There are some very helpful illustrations.I thought this would be the sort of book that I would skip over some chapters,  but I didn't miss a page.  It is so well written that every page is fascinating.  No dry historical lectures here.  I have never been to Rome, but that was no hindrance to enjoying  this insight into the lives people led in those days.  If you are about to visit Rome, this book would be a fantastic pre-visit read, so you can really understand what you are seeing.There are also references to Pompeii and other Roman sites, so this book, though based in Rome, is really a guide to life at that time, not just in Rome.I shall definitely be tipping the Tour Guide! , and recommending this book to everyone who has any interest in the lives of the Ancient Romans."}, {"review_sentiment": 5.0, "review_text": "I read this before a recent trip to Rome and found it fascinating.  It added a lot of dimension to my touring but would be very interesting for anyone who is interested in daily life through the ages.  Also cleared up a lot of misconceptions about ancient Roman life."}, {"review_sentiment": 5.0, "review_text": "Let me just add to all the praise for Angela on this book, which is a thoroughly fun read.  He really breathes life into theYou get to spy on Tacitus as he submits his 'Annals' to the book publisher.  To feel the dread of a dishonest tax collector as he faces his fate in the coliseum:  a lion attacks him, ripping off part of his face on the first attack.  It's grisly, horrifying, but truly provides a glimpse of what really happened in ancient Rome.  And you follow a 12-year-old girl, a slave, as she \"starts climbing wearily back up the stairs\" (p 89), part of her tragic life after being captured by slavers in Germany.Angela is adept at bringing to life every part of the city - he makes you see the curls of smoke pouring out from the wood fires that heat the baths, he points out the unpleasant stink of urine in the which was collected everywhere to be used in the cleaning of clothes, and he makes you hear the sh sh sh of silk as the wealthy Roman patrician strolls into a banquet.Highly enjoyable.."}]}, "authors": ["Alberto Angela"], "isbn": "1933372710", "longitude": 12.4829321, "periods": ["0-500s"], "title": "A Day in the Life of Ancient Rome: Daily Life, Mysteries, and Curiosities", "word_cloud": "nice look however translation often frustratingly poor especially author refers name example consul call current italian spell english speaker make sense especially classical latin spell consul name rather famous infamous dictator error quite confuse unaware modern italian translation look name online figure author talk reference somewhat latin quote also mistranslate poorly translate sort clunky translation happen number time tend halt flow try figure author mean better translation easily star informative first sentence mission take typical midnight year reign reach height power achieve greatest expression visit house elite typical apartment building store shop temple court chamber public bath learn typical breakfast lunch sit extend elaborate evening banquet see dress laundry often use human urine visit cattle market abattoir slave market public latrine free much include fair amount cuisine include several recipe section sexual custom practice way learn many interesting thing acceptance child masculine society newborn babe foot man house man bent pick raise high showing constitute acknowledgment paternity babe family hand man remain impassive refusing pick raise baby family rejection sex many child support already suspicion child product betrayal affect malformation defect reject babe pick set floor usually midwife take several designate location street place sordid system infant aspect ghastly side public display violence example part celebration victory inhabitant hold performance straight day feature kill animal gladiator half century production blood lust become place highest concentration human death know history central arena little acre hundreds thousand people go prose translate original informal straightforward author producer director television show many way read script television documentary instance write little top cheesy even account fight death hunter leopard make easy addition helpful drawing one illustrate male female garb elaborate position hand indicate different number recently scholarly account good companion history also sightsee trip especially include fair amount building ruin still exist take imaginary stroll city occasionally stop recount greatest monument smallest detail text engrossing make feel watch tv documentary spoiler itinerary tour aficionado classical history wont want miss provide commendable english translation original italian take essentially write tv documentary fact author television business take world make cosmopolitan tour guide bring skill interest trip height empire longer politically correct take unusual approach really work start walk city dawn peek private house stroll public building check forum attend game later author describes detail usually leave basic education instance watch woman marketplace author describe count woman make horn thumb index little finger customer get fluster evidently curiosity pique walk closer say horn sign next page chart show different hand position probably mean never think count quite useful give lesson value money term relate today contemporary term sestertius worth euro half quart olive oil sestertii admission bath sestertius slave sestertii course discussion bath think imagined reconstruction clean reality miss important detail wood fuel great public bath ecological monster burn tree nonstop month month year centuries almost certainly put thing perspective course bath thing beauty major part routine also series room get garden wood statue place enjoy type atmosphere today park big modern full anecdotes make resound image word drawing bring everyday people closer point view make something relate seem write draft find enjoyable learned much find useful future very informative interesting detail entertain often disagree scholar compare statement make work look sloppy also especially near end appear proofread place look editor stop read interesting easy back read tour guide take time give guide tour live bring describe people activity pass wander start dawn observe slave prepare house owner right aspect chatty guide occasionally asks rhetorical question take home street different live quarter shop bath bit gory give fascinate insight way example wear wrist timepiece offer comparison current imagination base historical fact research artifacts find time author refers gravestone find talk person observe short divide short segment great list want return section index helpful thought chapter miss page well write page fascinate dry historical lecture never hindrance enjoy insight life people lead day visit really also reference sit base really time definitely tip recommend everyone interest live recent trip find fascinate add lot dimension tour interest anyone interested age also clear lot misconception thoroughly fun really breathe the you get spy submit publisher dread dishonest tax collector face fate coliseum lion attack rip part face first attack grisly horrify truly provide glimpse really happen girl slave start climb wearily back stair p part tragic capture slaver bring part city make see curl smoke pour wood fire heat bath point unpleasant stink urine collect everywhere use cleaning clothes make hear sh sh sh silk wealthy patrician stroll", "genres": ["History", "Social & Cultural Studies", "Ancient Rome"], "summary": "The roar of frenzied spectators inside the Coliseum during a battle between gladiators. A crowd of onlookers gathered around a slave driver. The wondrous plenty of banquets where flamingos are roasted whole and wine flows like rivers. The silence of the baths and the boisterous taverns . . . Many books have dealt with the history of ancient Rome, but none has been able to bring its readers so near to daily life in the Imperial capital. \r\n\r\nThis extraordinary voyage of exploration, guided by Alberto Angela with the charm of a born story- teller, lasts twenty- four hours, beginning at dawn on an ordinary day in the year 115 A.D., with Imperial Rome at the height of its power. The reader wakes in a rich patrician home and discovers frescoes, opulent furnishings and richly appointed boudoirs. Strolling though the splendors of the Roman Forum, one overhears both erudite opinions from learned orators and local ribaldry floating out from the public latrines. One meets the intense gazes of Roman matriarchs strolling the streets, looks on as a banquet is prepared, and is afforded a peek into the sexual habits and fetishes of Roman patricians and plebs. \r\n\r\nFor all those who have ever dreamed of traveling back in time, Alberto Angela's narrative style will come as a welcome change to dry historical tomes. Rich in atmosphere and historical information, A Day in Ancient Rome is a voyage into a world both distant to us in time and surprisingly near in its habits, mores, and passions.", "asin": "B0092G7GBE", "rank": "3279773", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51JzodgydML.jpg", "country": "Italy", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}