{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": -23.5506507, "ratings": {"num_ratings": 10, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "Different kind of tale. Fast-paced. Well written."}, {"review_sentiment": 5.0, "review_text": "A real atmospheric tale. Made you feel the heat on every level"}, {"review_sentiment": 5.0, "review_text": "This is a brilliant book : I loved the names of the chapters and the involvement (though not obsession) with cooking. The characters of the book are very well drawn against the background of the city of São Paulo, a place of stark contrasts and bitter reckonings. The further contrast of the lush Brazilian jungle and the bleak concrete jungle of the city is also very well managed. Lastly, James Scudamore's book is very exciting with unexpected twists in the plot. Scudamore has the amazing technique of making insignificant-seeming characters central to the various turning points, not allowing the reader to forget a character once introduced.  This is very highly recommended reading whether or not you have visited São Paulo! Bravo!"}, {"review_sentiment": 5.0, "review_text": "The title Heliopolis is both a metaphor for the action of the book and gives you perspective on where the characters are placed.  The lead character, through whose voice we view the various scenes and people, was born in the Heliopolis favela, which by virtue of its name places it close to the sun (helios).  That he has come to this place in his life is very logical and understood through the circumstances that unfold before us.  The interactions between the classes is dramatic and really drives how the main characters operate.Lots of dramatic pull between the haves and have-nots; lots of commentary by each group toward themselves as well as the other sector.  Scudamore is a gifted storyteller who presents a whole host of surprises here."}, {"review_sentiment": 3.0, "review_text": "Read this book, it was good, not the greatest book I ever read, but a good read of fiction that doesn't require a lot of thinking."}, {"review_sentiment": 4.0, "review_text": "I am not good at writing reviews. I am good at telling you if the book was good or not. This was a GREAT book. I enjoyed it from the first paragraphs till the end. I am not going to tell you what it is about or not, there are 5 reviews that are explicit in that sense. I WILL tell you though, that I feel this is one of those books that can be enjoyed by many different people, I can't tink of someone not liking it.It is well written, the flow of the story is perfect, neither too fast nor too slow. It is not pretentious literature, yet the quality of the prose is of the highest level.Cahracter development is focused in the main cahracter, Ludinho (for us who know him better, Ludo for you who are yet to meet him), and it is a strong suit of the book. The inner workings of our friend are exposed page by page, chapter by chapter. I think it is a character that most of us can relate to in a certain way, I won't go into details, read and judge by yourself.The story itself is magnificent. It is foreign enough to peak our curiosity, yet Ludo makes it feel familiar. It seems a simple story, yet Ludo's own understanding of himself is what is at stake, which makes it a HUGE deal.I wanted to give it 5 stars, I think it almost got there. The truth is this book will be read again, probably several times, and is one of those I am saving for my future descendants, but it is gonna be in the second eschelon right below the all time greats I have up at the top. If things change after my second serving, I will come back and adjust the rating appropriately.Buy it, read it, enjoy it.David"}, {"review_sentiment": 4.0, "review_text": "Heliopolis is a satirical novel about capitalism, class structure and finding your place amid the cruelty and chaos of third world urban life, the city in this case being Sao Paulo, Brazil.  The story is narrated in the first person by Ludo, who is plucked from a hopeless life in one of the city's largest slums by supermarket magnate Ze Carnicelli and his magnanimous wife Rebecca.  Ludo's mother is set up as the cook on Ze's country estate, while Ludo is educated and eventually adopted by the Carnicellis.  After the adoption, Ludo moves from the bucolic simplicity of his mother's kitchen to Ze's heavily guarded msnsion in Sao Paulo.The adolescent Ludo develops extremely close ties with Ze's daughter Melissa, a relationship that carries into adulthood and threatens his peace of mind and her marriage.  Through Ze's connections, Ludo gets hired as an advertising executive.  Disaffected at his day job, Ludo is increasingly drawn to the street life of the slums adjacent to his office.  He's struggling to reconcile how the place he has arrived at connects with the place he came from.  When Ze decides to build budget supermarkets to sell meat and produce to the poor, Ludo gets assigned to put the correct advertising spin on the project.  As he ponders the project, and his history with Ze, Ludo can't sort out the big-hearted philanthropy from base opportunism.The head of Ludo's agency decides to invite the occupants of the surrounding slum to a launch party for the new supermarkets.  Worlds collide, but the fireworks Scudamore has built toward fizzle somewhat at the end.  But even if the climax is slightly flat, the novel shows us a place we tend to ignore or experience only through the caricature of newspaper headlines.  Like Pip in Dickens' Great Expectations, Ludo is a clear-eyed, engaging narrator, even when he's experiencing vertigo caused by clambering up and down the class ladder.Ludo's Sao Paulo comes across as dirty, decadent and dangerous for all except the privileged few at the top of the pile, who live high in the air and flit over the mess below in their personal helicopters.  Capitalism excels at creating wealth and then at concentrating it.  Since it's now the global economic system of choice, the disparity between rich and poor is widening around the world.  The genius of capitalism is that it beckons as it excludes, creating the illusion that anyone get get into that penthouse and ride in those helicopters.  But Ludo knows better than most that opportunism, luck and, most importantly, the accident of your birth determine whether you're buried in the teeming favelas or soaring high above them."}, {"review_sentiment": 4.0, "review_text": "Raised in Brazil, Japan, and the UK, author James Scudamore sets this novel in Sao Paulo, a city he obviously knows well, revealing his youthful enthusiasm for life, his sharp eye for injustice, and his hope for the future in a tale which follows the life of Ludo dos Santos from his childhood till about age twenty-seven.  Ludo and his mother, a cook, were plucked from Heliopolis, the largest favela (slum) in Sao Paulo, and established permanently at the weekend farm belonging to Zeno \"Ze\" Generoso, the fabulously wealthy owner of a chain of supermarkets, his British wife Rebecca, and their daughter Melissa.  As we know from the opening pages, Ze eventually adopts Ludo, schools him, and makes him a part of the high life.Telling Ludo's story through flashbacks and foreshadowings of things to come in the future, Scudamore quickly establishes the atmosphere and the dramatic contrasts between the lives of the poor and those of the rich in a city with virtually no middle class.  In a touching and revealing scene at the opening of the novel, Ludo, in his twenties, is killing time during a traffic jam before work, exploring a neighborhood in the process of redevelopment.  A fifteen-year-old boy, a grifter, is begging for money from two women in the square.  Egged on by Ludo, the boy then approaches the wrong person to ask for money, and disaster strikes.  Though Ludo blames himself for what happens, the event is ultimately \"just one more frenzied city drama in a thousand, to be forgotten and absorbed into the oozing traffic, and perhaps mentioned in passing over lunch.\"Caught between the world of the favela, which he does not remember, and the world of the rich, to which he feels he does not really belong, Ludo is unsure of his place in the world.  More sensitive than the bosses at the ad agency for which he works and infinitely more socially aware than Ze, his step-father, he admits that \"Sometimes I want to run away from this life to which I have been promoted.\"  A crisis erupts when Ze decides to create a whole new type of supermarket chain-MaxiBudget-to appeal to the poor in the favelas, taking the food to them for the first time. Ze, of course, will make a great deal of money selling to a huge new population, an effort which Ludo believes is made primarily to \"stop [the poor] from staring hungrily through the windows of our own [regular] supermarkets,\" rather than it is from any sense of improving their welfare.Ludo is especially conflicted about his love for his step-sister Melissa, and he has spent numerous nights with her.  Married to Ernesto, Ludo's only friend, Melissa returns Ludo's love-but she also loves Ernesto.  As all these issues, both personal and social, come together, Ludo experiences a belated and unusual coming-of-age.  The novel is filled with life, dramatic scenes, and revelations about individual and social responsibility, though it verges on melodrama in a number of places, and some coincidences are disappointingly unrealistic.  Overall, the novel has direction and a strong sense of purpose, despite the somewhat enigmatic and \"thin\" ending.  Even as people live and die in poverty, often seeing little change and less hope, the author, Ludo's alter-ego, refuses to accept the status quo-\"Everything will be different tomorrow,\" he believes."}, {"review_sentiment": 5.0, "review_text": "The setting for this novel is 21st century São Paulo, a dual city defined by its massive skyscrapers and squalid favelas (shanty towns), personal helicopters overhead and horribly congested roads below, wealthy white and poor (mostly) black citizens, and its tightly packed center city surrounded by heavily guarded neighborhoods with European styled mansions and heliports for the country's elite.Ludo is a boy who was born to a single mother in a favela, where the only opportunities available to escape soul crushing poverty are in the illegal drug trade or prostitution. He and his mother are discovered by a wealthy businessman, Zé Generoso, who controls his family, employees and associates with a ready smile and an iron will, and his philanthropic but detached wife Rebecca. The couple bring Ludo and his mother to their suburban mansion, which serves as their weekend getaway. Ludo is befriended by their beautiful daughter Melissa, and is provided with every opportunity to succeed by Zé, who recognizes his drive and intelligence. He \"works\" for one of his father's friends in a marketing firm during the day, spending much of his time sleeping off hangovers or thinking about Melissa, who shares her bed with him when her idealistic but neglectful husband is out of town. Despite his success Ludo is restless and unsatisfied, as he repeatedly takes personal and professional risks that threaten to unravel his playboy lifestyle -- or endanger his life.Heliopolis was a far better read than I originally expected it to be. It is taut and fast paced, but also lush and well written, with excellent character development, and there are enough twists and turns to keep the reader fully engaged. It deserves its place amongst this year's Booker Prize longlisted novels, and is highly recommended."}, {"review_sentiment": 5.0, "review_text": "I first heard about this book when I read that it was on the long list for Man Booker prize.  I can see why it was nominated, since it was an excellent read.  There is much to enjoy here, starting with the exotic locale of São Paulo, where the divide between rich and poor is incredibly stark. This is a world where the ultra-rich fly (commute, really)  in helicopters between their penthouses, their office buildings and their private villas outside of the city.  But what makes this story so fun to read is the richly drawn character of Ludo, the central figure. I found that I felt I could understand him, and get to know him (and his inner struggles) throughout the course of the story.  Overall, the author conveys a sense of realism that is unique and creates an immersive effect. This is one of those books that you are disappointed to finish because you could go on and on. Also - there is a mystery that builds throughout the tale, only revealed at the very end - and that also will pull you through the pages, as you seek to find out the answers.  I really enjoyed this book by Mr. Scudamore, and I will now read his first novel - The Amnesia Clinic."}]}, "authors": ["James Scudamore"], "isbn": "1933372737", "longitude": -46.6333824, "periods": ["2000s", "Recent Releases"], "title": "Heliopolis", "word_cloud": "kind tale write real atmospheric tale feel heat level brilliant love name chapter involvement obsession cook character well draw city place stark contrast bitter reckon contrast lush brazilian jungle bleak concrete jungle city also well manage excite unexpected twist plot amazing technique make character central various turn point allow forget character introduce highly recommended reading visited title metaphor action give perspective character place lead character voice view various scene people bear fa vela virtue name place close sun helios come place life logical understood circumstance unfold interaction class dramatic really drive main character dramatic pull have lot commentary group well sector gift storyteller present whole host surprise read good greatest ever good fiction require lot think good write review good tell good great enjoy first paragraph till end go tell review explicit sense feel enjoy many different people someone like well write flow story perfect fast pretentious literature yet quality prose highest development focus main character know better yet strong suit inner working friend expose page page chapter chapter think character relate certain way detail judge story magnificent foreign enough peak curiosity yet make feel familiar seem simple story yet understand stake make want give star think almost get truth probably several time save future descendant hon second echelon right time great top thing change second serving come back adjust rating enjoy satirical capitalism class structure find place cruelty chaos third world urban life city case story narrate first person pluck hopeless life city largest slum supermarket magnate magnanimous wife mother set cook country estate educate eventually adopt adoption move bucolic simplicity mother kitchen heavily guard mansion adolescent develop extremely close tie daughter relationship carry adulthood threatens peace mind marriage connection get hire advertising executive day job increasingly draw street life slum adjacent office struggle reconcile place arrive connects place come decide build budget supermarket sell meat produce poor get assign put correct advertising spin project ponders project history philanthropy base head agency decide invite occupant surround slum launch party new supermarket collide firework scudamore build fizzle somewhat end even climax slightly flat show place tend ignore experience caricature newspaper headline engage narrator even experience vertigo cause clamber class come dirty decadent dangerous privileged top pile live high air flit mess personal helicopter excels create wealth concentrate global economic system choice disparity rich poor widen world genius capitalism beckons exclude create illusion anyone penthouse ride helicopter know better opportunism luck importantly accident birth determine bury teem faves soar high raise author set city obviously know well reveal youthful enthusiasm life sharp eye injustice hope future tale follow life do childhood till age mother cook pluck largest fa vela slum establish permanently weekend farm belong fabulously wealthy owner chain supermarket british wife daughter know opening page eventually adopt school make part high story flashback foreshadowing thing come future quickly establish atmosphere dramatic contrast live poor rich city virtually middle class touch reveal scene open twenty kill time traffic jam work explore neighborhood process redevelopment boy grafter beg money woman square boy approach wrong person money disaster strike blame happens event ultimately frenzied city drama forgotten absorb ooze traffic perhaps mention pass lunch world fa vela world rich feel really belong unsure place world more sensitive boss ad agency work infinitely socially aware admit sometimes want life promote crisis erupt decide create whole new type supermarket appeal poor faves take food first time course make great deal money sell huge new population effort believe make primarily poor star hungrily windows regular supermarket rather sense improve especially conflict love spend numerous night friend return also love issue personal social come together experience belated unusual filled life dramatic scene revelation individual social responsibility verge melodrama number place coincidence disappointingly unrealistic direction strong sense purpose somewhat enigmatic end even people live die poverty often seeing little change le hope author refuse accept status different tomorrow believe setting century dual city define massive skyscraper squalid faves shanty town personal helicopter overhead horribly congest road wealthy white poor mostly black citizen tightly pack center city surround heavily guard neighborhood european style mansion heliport country boy bear single mother fa vela opportunity available escape soul crush poverty illegal drug trade prostitution mother discover wealthy businessman control family employee associate ready smile iron philanthropic detach wife couple bring mother suburban mansion serf weekend getaway befriend beautiful daughter provide opportunity recognize drive intelligence work father friends marketing firm day spend much time sleep hangover think share bed idealistic neglectful husband town success restless unsatisfied repeatedly take personal professional risk threaten unravel playboy lifestyle endanger far better originally expect taut fast pace also lush well write excellent character development enough twist turn fully engage deserve place among st year long listed novel highly recommend first hear long list see nominated excellent much enjoy start exotic locale divide rich poor incredibly stark world fly commute really helicopter penthouse office building private villa outside city make story fun richly draw character central figure find felt know inner struggle course story author conveys sense realism unique create immersive effect disappointed finish also mystery build tale reveal end also pull page seek find answer really enjoy first", "genres": ["Fiction & Literature"], "summary": "As a child, Ludo was plucked out of the shantytown where he was born and transported to a world of languid, cosseted luxury. Now twenty-seven, he works high above the sprawling metropolis of Sao Paulo for a vacuous “communications company.”\r\n\r\nBut this is not his world, and this is not a simple ragsto-riches story: Ludo’s destiny moves him around like a chess piece, showing him extremes of opulent excess and abject poverty, taking him to the brink of madness and brutality.", "asin": "B006J3X0JA", "rank": "878379", "city": "Sao Paolo", "image": "https://images-na.ssl-images-amazon.com/images/I/516rHxh71vL.jpg", "country": "Brazil", "story_arc": ["Tragedy", "Things only get worse"]}