{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 139, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Don’t grow any older without reading this classic and inspiring story. One of my favorites..."}, {"review_sentiment": 5.0, "review_text": "Everyone should read this book; whether to read as a warning, as a hope, as a perfect fiction."}, {"review_sentiment": 5.0, "review_text": "A shepherd plants a hundred acorns a day for thirty years. He continues in the face of bureaucratic indifference. His groves restore a barren corner of France. The shade restores streams and soil. People notice. Farmers return, villages flourish.This well-known French fable has inspired green belt movements everywhere, from the arid Sahel in Africa, to the dust bowls of the United States. This is a short story, taking only an hour to read. The edition I read is beautifully illustrated with wood engravings. It contains a Foreword from Angari Maathai, 2004 Nobel Prize winner for her green belt work in Kenya; and an Afterword from Andy Lipkis, founder of Tree People in the Los Angeles area. An extensive reference list of groups that promote tree planting is included at the end.Read more at bookmanreader.blogspot.com ."}, {"review_sentiment": 3.0, "review_text": "A parable in the form of a sweet, simple novella, in which a hermit shepherd spends years planting hundreds of thousands of tree seeds, in the process rejuvenating an entire ecosystem."}, {"review_sentiment": 5.0, "review_text": "Am sending it to my son to read to HIS sons for Fathers' Day."}, {"review_sentiment": 5.0, "review_text": "Fascinating."}, {"review_sentiment": 5.0, "review_text": "TY. Tear jerk-er."}, {"review_sentiment": 4.0, "review_text": "The book is good,but not a true story; none the less it shows how one person can make a difference to benefit the earth."}, {"review_sentiment": 5.0, "review_text": "I was searching for this book for a long time!The idea  is fabulous and great inspiration for saving this planet and find happiness for all lost soul in this world."}, {"review_sentiment": 5.0, "review_text": "Awesome"}]}, "authors": ["Jean Giono"], "isbn": "1933392819", "longitude": 0.0, "periods": ["1900s"], "title": "The Man Who Planted Trees", "word_cloud": "grow older read classic inspire story favorite everyone warn hope perfect fiction shepherd plant hundred acorn day year continue face bureaucratic indifference grove restore barren corner shade restores stream soil notice return village fable inspire green belt movement everywhere arid dust bowl short story take hour edition beautifully illustrate wood engraving contain winner green belt work founder area extensive reference list group promote tree planting include parable form sweet simple novella hermit shepherd spend year plant hundred thousand tree seed process rejuvenate entire ecosystem send son son father fascinate good true story none le show person difference benefit earth search long time idea fabulous great inspiration save planet happiness lose soul world", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Jean Giono's beautiful allegorical tale is legendary. Written in the 1950s, its message was ahead of its time, inspiring readers to rediscover the harmonies of the countryside and prevent its wilful destruction.\r\n\r\nThe narrator, journeying by foot across the barren plains of the lower Alps, has his thirst assuaged by the well water drawn by the shepherd Elzéard Bouffier. Here begins the subtle parable which Giono weaves of the life-giving shepherd who chooses to live alone and carry out the work of God. Over forty years the desolate hills and lifeless villages which so oppressed the traveller are transformed by the dedication of one man. All with the help of a few acorns. \r\n\r\nGiono's hope was to set in motion a worldwide reforestation programme that would rejuvenate the earth. The Man who Planted Trees is a hymn to creation and a purveyor of confidence in man's ability to change his – indeed the world's – lot.\r\n\r\n\"In Giono's work what every sensitive, full-blooded individual ought to be able to recognize at once is 'the song of the world.'\"Henry Miller\r\n", "asin": "1933392819", "rank": "145848", "city": "Provence", "image": "https://images-na.ssl-images-amazon.com/images/I/51aj43xJVvL.jpg", "country": "FR", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}