{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": -33.928992, "ratings": {"num_ratings": 19, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "I have read a number of SA mystery writers. This author is very good, with interesting references to past history. The book is very graphic, with  disturbing violence. There is an overall sadness to the book"}, {"review_sentiment": 2.0, "review_text": "The story of South Africa after Mandela, but before the Great football game. It appears that Cape Town in South Africa is at least three stories. The first is the beautiful landscape.  The second is the tourist version. \"Take care, there is criminality, but you are safe». The third is the setting of Ferey’s thriller; Cape Town is filled with bestial murders and corruption. You are never safe.  The hero, Ari Newman is a Zulu, as in the title, and this is the story of the transformation and the contribution of what was the Zulu culture into what becomes the South African culture. It is also the story of how people of the apartheid regime is transformed into people of the new south Africa, but with their luggage hidden not far inside their fashionable houses.This is not really a crime story. We know beforehand who is going to be the forefront culprit and who is going to be the background culprit. There are almost no funny sentences, no funny sequences.  No sections that make you think that this was exceptionally well said, only said. In addition, sometimes a little too educational. However, many sections describe bestiality. They may be required, but they end up being \"yes, and so what?\" .To me the story becomes a “yes, and so what” story."}, {"review_sentiment": 5.0, "review_text": "I purchased this book for my husband, who loves the suspense / thriller / spy genre. I chose it based on reviews and the fact that he had never read this author prior to this. His comments were very positive and he has been on the search for other books by Ferey."}, {"review_sentiment": 1.0, "review_text": "I cannot recommend this novel."}, {"review_sentiment": 4.0, "review_text": "Graphically  violent to a fault. Probably more accurately a depiction of post apartheid South Africa than most but a truly disturbing novel. Aids, murder, rape, mutilation, drugs and brutality are all par for the course. The tenuous relations between and amongst blacks, white and coloreds makes one wonder how South Africa survives. Yet one cannot put it down. So caveat emptor."}, {"review_sentiment": 5.0, "review_text": "it was really difficult to get through it. very violent and graphic. but isnt this the world we are living in? someone had to document it in a way that doesnt decide who the winners and losers are... just the facts, and the price we pay for justice. we equate truth with conspiracy theories but the reality is usually harder to take than a lie. we ease our minds with lies... its just a way to navigate chaos. but we wont get far if we dont address situations for what they are."}, {"review_sentiment": 3.0, "review_text": "Intriguing perspective but this novel is too long and too labored. That is, it is very French in its style."}, {"review_sentiment": 4.0, "review_text": "This is a great novel about the new South Africa, where the Crimes of the Past have the power to still bring evil. I look forward to seeing the planned film.  However, the author's 1st novel Mapuche was one of the best books  Ihave ever read and Icannot give this effort another 5 star rating.  I sorry, to say if you read HUCK FINN before TOM SAWYER you would have the same problem.  I  am looking forward to more from Caryl Ferey."}, {"review_sentiment": 5.0, "review_text": "Combining the dark visceral look at south Africa's criminal underbelly akin to Roger Smith novels with  a John Lecarre like focus on the corporate and governmental forces that abet street level crime, this book is a timely sobering and terribly exciting portrayal of the real people representing and victimized by these modern urban forces.Although it's a translated book, one is with very rare exceptions unaware of it. Among the best of its kind."}, {"review_sentiment": 5.0, "review_text": "I've watched French crime movies for years.  There is nothing like a French crime movie done in the States.I'll say the same for their crime literature.  Nothing like it here or even in England.  Ferey seems to go deeper and darker.That's ZULU.  Deeper and darker.Notice there is no second book about Ali Neuman.  There's a reason, which I wont divulge. But for Caryl Ferey, ZULU is the only Ali Neuman detective procedural.He (Ferey) goes deep into the dark underbelly of South Africa, into its Black townships and their gangs.  There are no winners.So get your favorite beverage, settle down and begin to read.  I'm betting you'll finish ZULU before you finish your drink."}]}, "authors": ["Caryl Férey"], "isbn": "1933372885", "longitude": 18.417396, "periods": ["2000s", "Recent Releases"], "title": "Zulu", "word_cloud": "number mystery writer author good interesting reference past history graphic disturb violence overall sadness story football game appear least story first beautiful landscape second tourist version care criminality safe third setting thriller fill bestial murder corruption never safe hero title story transformation contribution culture become south african culture also story people apartheid regime transform people new south luggage hidden far inside fashionable really crime story know beforehand go forefront culprit go culprit almost funny sentence funny sequence section make exceptionally well say say addition sometimes little educational however many section describe bestiality yes story become yes story purchase husband love suspense thriller spy genre choose base review fact never author prior comment positive search recommend graphically violent fault accurately depiction post apartheid truly disturb murder rape mutilation drug brutality par course tenuous relation among st black white colored make wonder survive put so caveat emptor really difficult violent graphic inst world live someone document way doesn't decide winner loser fact price pay justice equate truth conspiracy theory reality usually harder lie ease mind lie way navigate chaos wont get far font address situation intrigue perspective long labor french style great new power still bring evil look forward see plan film however author best ever effort star rating sorry say problem look forward combine dark visceral look south criminal underbelly akin novel focus corporate governmental force abet street level crime timely sober terribly excite portrayal real people represent victimized modern urban translate rare exception unaware best kind watch french crime movie year nothing french crime movie do say crime literature even seem go second reason wont divulge detective go deep dark underbelly townships gang favorite beverage begin bet finish finish drink", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "As a child, Ali Neuman ran away from home to escape the Inkatha, a militant political party at war with the then-underground African National Congress. He and his mother are the only members of his family that survived the carnage of those years and the psychological scars remain. \r\n\r\nToday, Neuman is chief of the homicide branch of the Cape Town police, a job in which he must do battle with South Africa’s two scourges: widespread violence and AIDS. When the mutilated corpse of a young white woman is found in the city’s botanical gardens, Neuman’s job gets even more difficult. He is chasing one false lead after another when a second corpse, again that of a white woman, is found. This time, the body bears signs of a Zulu ritual. A new evil has insinuated itself into this recently integrated city. And a new drug: traces of an unknown narcotic have been found in the blood of both victims. The investigation will take Neuman back to his homeland, where he will discover that the once bloody killing fields have become the ideal no-man’s land for unscrupulous multinationals, and that the apparatchiks of apartheid still lurk in the shadows and the back rooms of a society struggling toward reconciliation. ", "asin": "B005GKBZ5I", "rank": "948175", "city": "Cape Town", "image": "https://images-na.ssl-images-amazon.com/images/I/519xICfy6tL.jpg", "country": "RSA", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}