{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 6, "rating": 3.3, "reviews": [{"review_sentiment": 4.0, "review_text": "I read this some time ago but the story Hitching in the Lodos by Feryal Tilmac has stuck in my mind & will continue to do so indefinitely."}, {"review_sentiment": 5.0, "review_text": "It is dark, heavy, heady. It is quite a smorgasboard, has something for every noir fan. (BTW, Murat Somer or Agatha Christie do not count as noir!) It has a story about a guy who becomes increasingly obsessed with fire, another one that comes with its own wind and soundtrack. I was lucky to see it mentioned (next to \"Istanbul\" by Orhan Pamuk) in \"10 of the best books set in Istanbul\" in The Guardian. I loved it!"}, {"review_sentiment": 5.0, "review_text": "If you like plot-driven, sanitized, scrubbed, polished mysteries with a neatly tied-up, twist ending, with faux-outrageousness, or if you like orientalist fluff, you may not like this book that much.But, if you like gritty narratives with a strong sense of location and sociopolitical context, if you like, say, Derek Raymond or James Sallis, you may enjoy this book.This could be the book that identifies and fertilizes a Turkish kind of noir.Give it a chance.I'm glad I did."}, {"review_sentiment": 2.0, "review_text": "Other than Nobel Prize-winner Orhan Pamuk, Turkish literature isn't widely known or readily available in the U.S., so I was pleased to see this latest entry in Akashic's Noir series. Fourteen of the sixteen stories are by established Turkish writers, none of whom have never had their work translated into English before. As in the other books in this series, the stories are divided into four sections (\"Lust & Vengeance\", \" Pushing Limits, Crossing Lines\", \"In the Dark Recesses\", \"Grief * Grievances\") to no obvious purpose or effect.While I more or less enjoyed most of the stories as I read them, by the end they had mostly run together in a blur of typical noir tropes, and I was left with more of a mood or tone than anything else. When I went back to read the introduction, I saw that the mood had a name: \"huzun\" -- and connotes a kind of melancholy heaviness of spirit. That struck me as a rare case of an introduction actually being quite accurate in defining the underlying spirit of the book. I suppose my problem was that there wasn't enough variation in that tone between stories. Unlike most anthologies, I couldn't, at the end, point at two or three authors whose voice caught my attention and made me want to seek out more of their work.The two stories that did stick out were the two by non-Turks: Jessica Lutz's \"All Quiet\" and Lydia Lunch's \"The Spirit of Philosophical Vitriol.\" The former is a well-done fictionalization of a real-life underground Islamic group, the latter is a terrible waste of time and space. It's a totally gratuitous, obvious, lame pseudo-feminist revenge fantasy with zero connection to Istanbul and I have no idea how it made it into this collection. Another factor that might explain the relative similarity is that the Turkish authors being pretty much all belong the same generation (I think all except one were born within the same mid-1960s to mid-1970s span), and thus sharing a great deal of the same history and experience. So, on the whole, I'd suggest dipping into this for a taste of Turkey, but don't expect to much.Readers interested in modern Turkish crime novels should check out Mehmet Murat Somer's three books: The Prophet Murders,The Kiss Murder, and The Gigolo Murder. Other new writing from Turkey available in English includes Selcuk Altun's Istanbul-set Songs My Mother Never Taught Me and Emine Sevgi Özdamar's Berlin-set The Bridge of the Golden Horn and Moris Farhi's A Designated Man."}, {"review_sentiment": 1.0, "review_text": "well, if you expect a high level of crime writing from a city like Istanbul (see Mehmet Murat Somer's Kiss Murder or imagine My Name is Red of Orhan Pamuk)you will be disappointed! Try other books and writers as the so called anthology is missing the best (even the essential) of crime writers from Turkey. What a pity... a second class job with the 2nd cast..."}, {"review_sentiment": 2.0, "review_text": "The writing quality is excellent in most of the texts. Next to suspense, space description (Towns, neighborhoods) is up to literary expectation.Josaphat-Robert Large"}]}, "authors": null, "isbn": "1933354623", "longitude": 28.9651646, "periods": ["1900s"], "title": "Istanbul Noir", "word_cloud": "time ago story stick mind continue indefinitely dark heavy heady quite smorgasbord something fan count story guy become increasingly obsessed fire come soundtrack lucky see mention next best set love sanitize scrubbed polished mystery neatly twist end orientalist fluff gritty narrative strong sense location sociopolitical context say fertilizes kind glad other literature widely know readily available please latest entry series sixteen story establish turkish writer none never work translated series story divide section obvious purpose le enjoyed story end mostly run together blur typical trope leave mood tone anything else go back introduction saw mood name huzun connote kind melancholy heaviness spirit strike rare case introduction actually quite accurate define underlying spirit suppose problem enough variation tone story anthology point author voice catch attention make want seek story stick former fictionalization group latter terrible waste time space totally gratuitous obvious lame revenge fantasy connection idea make collection factor relative similarity author pretty much generation think born span thus share great deal history experience whole suggest dip taste expect interested modern crime novel check other new write available include özdamar man well high level crime write city see imagine disappoint writer call anthology miss best even essential crime writer turkey pity second class job cast writing quality excellent text suspense space description neighborhood literary large", "genres": ["Fiction & Literature"], "summary": "For those fascinated by the darker side of cities, this collection of 16 stories gives some unexpected insights into the people and places – and even the weather – of Istanbul.", "asin": "1933354623", "rank": "1532673", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/41NR4Phs4-L.jpg", "country": "Turkey", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}