{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 1234, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "One of the best books I have ever read. Life from the perspectives of a building concierge and the daughter of one of the families living in it. Fantastic."}, {"review_sentiment": 3.0, "review_text": "A very promising start gets turned into something rather nasty.The first half is quite funny and a pleasure to read.The second half decides that we now know the good guys from the bad guys, and it spends its time applauding the heroes and making up more smut on the villains.  This may fit the ideology of the writer, but it comes across as a pointless ego exercise."}, {"review_sentiment": 3.0, "review_text": "I had read such positive reviews of this novel that I really looked forward to reading it.  On the positive side, the writing, or perhaps I should say the translation, was beautiful.The two main characters Renee, the concierge of an apartment building for wealthy tenants, and Paloma, the younger daughter of a couple of married tenants, were much alike.  Both were extremely intelligent but had negative self images and thought others looked down upon them.  At the same time each was critical of the very people they thought looked down on them.Another trait the woman and girl had in common was dwelling on philosophy.  At times I felt as if I were being lectured to by one or the other.  Each seemed to spend almost all of their time in their heads.  It got tedious.The last third more or less was better after a new tenant arrived and was friendly with both Paloma and Renee.  He redeemed the book to some degree."}, {"review_sentiment": 5.0, "review_text": "Some choose to live in invisibility, because the world won't bother to understand the beauty under an \"odd\" exterior. Mme. Michel, Paloma and Kakuro discover their own beauty as they honor and value one another. Just lovely."}, {"review_sentiment": 4.0, "review_text": "Great read"}, {"review_sentiment": 5.0, "review_text": "I laughed, cried, and at times I related. You never know"}, {"review_sentiment": 4.0, "review_text": "First and foremost it is a French novel written by a French author, Muriel Barbery,  and mostly about French people involved, except of course of Ozu, the new and rich Japanese proprietor of one of the posh apartments.It is absolutely French in spirit and in its content. It was quite a difficult task for me to read it in the original - I had to look up a lot of quite eccentric , rare words - because Renée and Pamola are both top intellectuals and love writing in their particular style. T hey are far beyond the power and scope of ordinary Frenchmen and let the reader know about their superiority. This idea of belonging to a cultural elite and look down on the common people is quite an old phenomenon in French culture, which they think is more refined than any others - with the exception (again) of the Japanese culture, which probably has the same intellectual stance about its own value with regard to other less fortunate civilizations.  I personally  find this attitude a bit old-fashioned and amusing as long as it is not reflected and used ironically with a grain of salt, which here is not the case unfortunately since the author is herself a philosophy teacher born and bred in French, apparently the origin and source of a concept of civilization, apart from the ancient Greeks and Romans, and of course from the Japanese culture. Renée and Paloma are both identically snobs cynically and sarcastically comment on the mores and habits of all the other inhabitants (with very few exceptions, like Manuela the cleaner,  Ozu of course, and all the pet cats.The motivation of the reader to read both diaries and personal  intellectual ruminations and thoughts is of course the fact that both first person narrators, Renée and Paloma, have a secret that only the reader shares with them. In fact the reader, who is personally addressed as \"vous\" (you) is even in a better position, a vantage point that the two first person narrators do not reach as they are at first ignorant of each other method of observation and comment. In this sense the reader is a real voyeur, who can read between the lines and who knows about their respective secret. The first (Renée's) is that of an ugly, poor, vulgar, plain, thick hedgehog and the second (Paloma's) her secret plan of committing suicide and setting fire to her family's flat after saving the two  innocent cats. The reader as voyeur - that is the first and foremost motivation of reading the first part of the novel, who gets to know a lot of (common) people through the critical eyes of the two top intellectual women apart from philosophical excursions into medieval disputes like Occam's razor and the conflict between so-called Realists and Universalists (the famous universality conflict( (sic), Marxism, Husserl's phenomenology, etc.  The author's hobby horse or profession  is of course philosophy. So she had quite a good opportunity to rise and shine, and she obviously did not put her glaring light under a bushel so to speak.So the two first person narrators lead the reader into the superficial and obviously ignorant world of the very and snobbish  rich in Paris. The reader can't help identifying himself with the (disguised) view of Renée and Paloma unless he gives up reading and puts the book away. Well, I only partly enjoyed this clandestine cynical vitriolic voyeurism because I thought about my own position vis-à-vis my fellow (Swiss) citizens. Am I as bitingly critical and ungracious about other people's way of life even if they are well-to-do hypocrites and snobs at the top of the social pyramid?Well, luckily one of the owners of a flat has a heart attack and dies at quite an early age. The widow sells her flat and the new owner now brings a new dynamic and energy, a fresh outlook and perspective into the novel, which it badly needs. Now a triangle relations starts building up and the novel picks up pace. Renée starts a new lease on her dreary life and Paloma revises more and more her firm resolution of  ending here young life on her 13th birthday.Till here the novel reminds me very much of the famous fairytale \"Cindarella\". In fact Renée is  very much the despised, unrecognized Cindarella, who is patiently waiting for Prince Charming to marry her.  (Here the love affair is only Platonic, but still very real and spectacular as she dons a new dress and goes to the hairdresser. And the same is true for Paloma, who has previously giving up all hope of a future life as a metaphorical gold fish in a round, tiny (social) aquarium.  She is reformed at the end. She has experienced the ephemeral beauty of life  and she writes at the end that she sees \"le toujours dans le jamais\", in short transiency.Unfortunately this new triangle relationship has hardly time of growing, deepening and developing. The author seems to have had enough of her novel and ends it abruptly and swiftly with Renée's fatal car accident, which I think is not really well  motivated. Of course people can die in fiction and they must die anyway sooner or later in real life as we are all mortal. But fiction is not a mirror of reality. It is or should be a work of art (The concept of what art may represent is  frequently and extensively being discussed in this novel) In fiction as a work of art I expect a certain consistency,  lucidity and logic and not mere chance or accident. When Othello dies  in one of the last scenes of the tragedy with the same name we are absolutely convinced  that he could not possibly gone on living after murdering his young,  good, innocent and loyal wife Desdemona ; when Gregor Samsa in Kafka's narration \"Die Verwandlung\" dies, we understand why this must happens inexorably; and when Romeo and Juliet commit suicide in the common tomb in Verona we think that this is proper and right in their particular straight circumstances, etc. But here Renée's premature and sudden death just shortens the novel and leaves the reader somehow frustrated and irritated behind.  It is neither remediated nor motivated according to my personal view at least.Only one  last word about the death scene told by Renée herself at the  end of the novel. In French Renée writes in the very last few paragraphs of her diary: \"Je meure\", (I am dying). This is of course an almost unforgivable breach in the law (observation; regulation) by Coleridge for the reader, namely his or her \"willing suspension of disbelief\". This sentence \"I'm dying\" is at least beyond my willing suspension of disbelief, because it is obviously not possible to be used in any given situation like for instance the sentence \"I am sleeping\". I am sure the author must have thought quite a lot about that problem. But I can only guess what motivated her to keep letting Renée writing her diary while letting (or rather making) her die.I know very few examples of that kind, one by Patricia Highsmith in one of her short stories (The Glass) about on old and frail man who was so courageous as to withstand an resist the terrorizing strategy of a street gang. And then the very short  novel \"Indignation\" by Philip Roth uses very effectively the device of the prolonged  flashback of a dying soldier in the Korean War."}, {"review_sentiment": 5.0, "review_text": "Wonderfully thoughtful and intriguing.  Takes you on a journey that seems rather magical.  So many profound \"messages\" to ponder and consider."}, {"review_sentiment": 5.0, "review_text": "Beautiful prose, and an elegant narrative. The language and syntax dance across each page. I couldn't put it down."}, {"review_sentiment": 5.0, "review_text": "I have rarely given a book five stars...in fact I can't honesty remember ever doing it. But, this book was incredible to read and to savor. This book is a feast for those who love and treasure language. It is a book that having finished it makes me feel sad, and a part of me wants to read it again and again. It was a literary treasure, beauty in a moment."}]}, "authors": ["Muriel Barbery"], "isbn": "1933372605", "longitude": 2.3514992, "periods": ["2000s", "Recent Releases"], "title": "The Elegance of the Hedgehog", "word_cloud": "best ever perspective build concierge daughter family live fantastic promising start get turned something rather first half quite funny pleasure second half decides know good guy bad guy spends time applaud hero make smut villain ideology writer come pointless ego exercise positive review really look forward read positive side write perhaps say translation main character concierge apartment build wealthy tenant younger daughter couple marry tenant much extremely intelligent negative self image think others look time critical people think looked trait woman girl common dwell philosophy time felt lecture seem spend almost time head get last third le better new tenant arrive friendly redeem degree choose live invisibility world understand beauty odd exterior discover beauty honor value lovely great laugh cried time relate never know first foremost french write french author mostly french people involve course new rich japanese proprietor posh absolutely french spirit content quite difficult task original look lot quite eccentric rare word top intellectual love write particular style hey far power scope ordinary let superiority idea belong cultural elite look common people quite old phenomenon french culture think refine others exception japanese culture probably intellectual stance value regard le fortunate civilization personally find attitude bit amuse long reflect use ironically grain salt case unfortunately author philosophy teacher bear breed apparently origin source concept civilization apart ancient course japanese culture identically snobs cynically sarcastically comment mores habit inhabitant exception cleaner course pet motivation diary personal intellectual rumination thought course fact first person narrator secret share fact personally address vouch even better position vantage point first person narrator reach first ignorant method observation comment sense real voyeur line know respective first ugly poor vulgar plain thick second secret plan commit suicide set fire family flat save innocent cat voyeur first foremost motivation read first part get know lot common people critical eye top intellectual woman apart philosophical excursion medieval dispute razor conflict realist universality famous universality conflict sic phenomenology etc author hobby horse profession course philosophy quite good opportunity rise shine obviously put glare light bushel first person narrator lead superficial obviously ignorant world snobbish rich identify disguised view give read put away partly enjoy clandestine cynical vitriolic voyeurism think position fellow swiss citizen be bitingly critical ungracious people way life even hypocrites snob top social pyramid luckily owner flat heart attack die quite early age widow sell flat new owner bring new dynamic energy fresh outlook perspective badly need now triangle relation start building pick pace start new lease dreary life revise firm resolution end young life reminds much famous fairy tale fact much despise unrecognized patiently wait marry here affair still real spectacular don new dress go hairdresser true previously give hope future life metaphorical gold fish round tiny social aquarium reform end experience ephemeral beauty life write end see le toujours sand le jamais short new triangle relationship hardly time grow deepen develop author seem enough end abruptly swiftly fatal car accident think really well motivate course people die fiction anyway sooner later real life mortal fiction mirror reality art concept art frequently extensively discuss fiction work art expect certain consistency lucidity logic mere chance accident die last scene tragedy name absolutely convince possibly go live murder young good innocent loyal wife narration die understand inexorably commit suicide common tomb think proper right particular straight circumstance etc premature sudden death shortens leave somehow frustrate irritate neither re mediated motivated accord personal view last word death scene tell end french write last paragraph diary mere die course almost unforgivable breach law observation regulation namely willing suspension disbelief sentence die least willing suspension disbelief obviously possible use give situation instance sentence sleep sure author quite lot problem guess motivated keep let write diary let rather make example kind short stories old frail man courageous withstand resist terrorize strategy street gang short use effectively device prolong flashback die soldier wonderfully thoughtful intrigue journey seem rather magical many profound message ponder prose elegant language syntax dance page rarely give star fact ever incredible savor feast treasure language finish make feel sad part want literary treasure beauty moment", "genres": ["Fiction & Literature"], "summary": "We are in the center of Paris, in an elegant apartment building inhabited by bourgeois families. Renée, the concierge, is witness to the lavish but vacuous lives of her numerous employers. Outwardly she conforms to every stereotype of the concierge: fat, cantankerous, addicted to television. Yet, unbeknownst to her employers, Renée is a cultured autodidact who adores art, philosophy, music, and Japanese culture. With humor and intelligence she scrutinizes the lives of the building's tenants, who for their part are barely aware of her existence. \r\n\r\nThen there's Paloma, a twelve-year-old genius. She is the daughter of a tedious parliamentarian, a talented and startlingly lucid child who has decided to end her life on the sixteenth of June, her thirteenth birthday. Until then she will continue behaving as everyone expects her to behave: a mediocre pre-teen high on adolescent subculture, a good but not an outstanding student, an obedient if obstinate daughter. \r\n\r\n\r\nPaloma and Renée hide both their true talents and their finest qualities from a world they suspect cannot or will not appreciate them. They discover their kindred souls when a wealthy Japanese man named Ozu arrives in the building. Only he is able to gain Paloma's trust and to see through Renée's timeworn disguise to the secret that haunts her. This is a moving, funny, triumphant novel that exalts the quiet victories of the inconspicuous among us.", "asin": "1933372605", "rank": "14711", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51Sxk-xPxYL.jpg", "country": "France", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}