{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 22, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "The Weimar Republic, rampant inflation, unemployed starving destitute ex service-men, roaming the countryside fomenting Nationalist Patriotic Racist Revolution. Coming to a Western Bourgeois Liberal Mall near you, soon."}, {"review_sentiment": 5.0, "review_text": "Excellent depiction of various German characteristics and the effect of the post WW1 conditions. Fallacy at his descriptive best. Compejjing reading."}, {"review_sentiment": 5.0, "review_text": "Fallada is not for everyone."}, {"review_sentiment": 3.0, "review_text": "This lengthy novel was Fallada’s magnum opus, published during the Nazi era, 1937. Having read all of his major works, I can list my ratings as follows. Individual critiques have been posted for each title.“Little Man, What Now?” 4 stars. The futility of the hand-to-mouth existence of a white-collar worker and his wife in early 1930s Germany.“The Drinker” 4 stars. An intense account of a successful, happily married businessman’s downward spiral into alcohol addiction, drunken altercations, infidelity, adultery, delusional episodes, leading to his arrest and eventual confinement to merciless penal institution.“Small Circus” 2 stars. A confusing, ponderous, bloated, provincial novel. Factions, political intrigue, rivalries involving about seventy characters.“Every Man Dies Alone” 5 stars.  Grounded in the author's own experiences living under the heel of Hitler's divisively oppressive regime. This is fiction steeped in legitimate historical relevance. Published after WW2.“Wolf Among Wolves” 3.5 stars. A tortuous tapestry of urban and rural life in post-war Germany, 1923-24. Economic realities are chaotic with inflation having gone out of control. The social fabric is disintegrating. The plot revolves around about a dozen characters, the chief one being Wolfgang Pagel, a young former soldier who survives by gambling. Later circumstances bring him to a rural estate where he becomes the financial manager of farm, forest and livestock operations.Most of Fallada’s works follow the ‘new objectivity’ literary style represented by detailed accounts akin to journalistic reportage. Dozens of characters are introduced in the first half of the book. I found myself making notes to keep track of who was related to whom and what. It does take a bit of work to keep track since most are referred to by titles or positions and other times by their names. The second half introduces some interesting new characters as they are joined by those of the main ones from the first half. There is no tranquility in this novel. Conflicts, rivalries, intrigues and deceptions abound. Somehow it felt devoid of emotional drama.Having great admiration for Fallada’s other works, I loyally continued reading but frankly much of it was a slog. I hoped things would sort themselves out. Mostly they did albeit some of them tragically. Was it worth it? I would only recommend this book to devout Fallada devotees or to history buffs interested in the German social and economic chaos of the 1920s, which engendered the appeal of the Nazi ideology and the rise of its despotic strongman Adolph Hitler in the 30s."}, {"review_sentiment": 5.0, "review_text": "Beautiful"}, {"review_sentiment": 5.0, "review_text": "Great book"}, {"review_sentiment": 5.0, "review_text": "What a terrific book.  I found this book in a bookstore a couple of years back and even though I had purchased the book, kept putting off the book in view of its sheer volume (It is about 800 pages).  As an economist by profession, I knew about the hyper inflation and the daily depreciation of the currency during the inter war period in Germany but to bring the pain brought by the change in the value of currency, through about a dozen characters was truly amazing and once having started reading the book, I just could not put down the book and finished the book in about a fortnight (which is a record by my standards).  I highly recommend this book and have just started reading another of Fallada's books."}, {"review_sentiment": 4.0, "review_text": "Nice to read something with a true foreign perspective"}, {"review_sentiment": 4.0, "review_text": "Great insight into a tragic period in European history."}, {"review_sentiment": 5.0, "review_text": "Although I am pleased with Hans Fallada's book, it is a paperback & was bound with the first 24 pages, title page & any forward, missing.  I did not discover this until 3+ months after delivery while on a river cruise in Russia."}]}, "authors": ["Hans Fallada"], "isbn": "1933633921", "longitude": 13.3888599, "periods": ["1900s"], "title": "Wolf Among Wolves", "word_cloud": "rampant inflation unemployed starve destitute ex roam countryside foment soon excellent depiction various german characteristic effect post condition descriptive best compere reading everyone lengthy magnum opus publish era have major work list rating follow critique post little now star futility existence worker wife early star intense account successful happily married businessman downward spiral alcohol addiction drunken altercation infidelity adultery delusional episode lead arrest eventual confinement merciless penal star confuse ponderous bloat provincial political intrigue rivalry involve seventy man die star ground author experience live heel divisively oppressive regime fiction steep legitimate historical relevance publish star tortuous tapestry urban rural life reality chaotic inflation go social fabric disintegrate plot revolve dozen character chief young former soldier survive gamble circumstance bring rural estate become financial manager farm forest livestock work follow new objectivity literary style represent detailed account akin journalistic reportage dozens character introduce first half find make note track related bit work track refer title position time name second half introduces interest new character join main one first half tranquility rivalries intrigue deception abound felt devoid emotional great admiration work loyally continue read frankly much slog hop thing tragically worth devote history buff interested social economic chaos engender appeal ideology rise despotic strongman beautiful great terrific find bookstore couple year back even purchase kept put view sheer volume page economist profession know hyper inflation daily depreciation currency inter war period bring pain bring change value currency dozen character truly amaze start read finish fortnight record standard highly recommend start read nice something true foreign perspective insight tragic period european history please paperback bound first page title page forward miss discover month delivery river cruise russia", "genres": ["Fiction & Literature"], "summary": "Wolf Among Wolves is a sprawling saga of the collapse of a culture--its economy and government--and the common man's struggle to survive it all. Set in Weimar Germany soon after Germany's catastrophic loss of World War I, the story follows a young gambler who loses all in Berlin, then flees the chaotic city, where worthless money and shortages are causing pandemonium. Once in the countryside, however, he finds a defeated German army that has deamped there to foment insurrection. Somehow, amidst it all, he finds romance--it's The Year of Living Dangerously in a European setting.\r\n\r\nFast-moving as a thriller, fascinating as the best historical fiction, and with lyrical prose that packs a powerful emotional punch, Wolf Among Wolves is the equal of Fallada's acclaimed Every Man Dies Alone as an immensely absorbing work of important literature.", "asin": "1933633921", "rank": "478536", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51CS7y%2BrNIL.jpg", "country": "Germany", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}