{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 35, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "What the heck was that ending. So weird. And the wailing throughout the book was also really odd. Poor Amedeo"}, {"review_sentiment": 1.0, "review_text": "Don't get me wrong its a great book but I ordered a paperback of it and never got it so I had to download it on my kindle"}, {"review_sentiment": 4.0, "review_text": "I love the characters on the cover and Amara has a brilliant talent for creating people that feel like they are talking/yelling right at you. A murder mystery, political commentary and social miasma on the Piazza!"}, {"review_sentiment": 3.0, "review_text": "Felt it might have lacked a good translation, as did not live up to my expectations.  Such a timely topic, should have been more interesting and humorous."}, {"review_sentiment": 5.0, "review_text": "Very interesting book and so well written. The story is told from the perspective of all those involved."}, {"review_sentiment": 4.0, "review_text": "No Comments"}, {"review_sentiment": 4.0, "review_text": "A funny, insightful, thoughtful, and human book that manages to cover the intense topic of racism while remaining a light read.  The book is told as a series of interviews with the inhabitants of an apartment building where a man was murdered. Each chapter is an interview with another character and each character is helplessly and humanly limited in their scope.  Every one is so self involved that each could be describing a separate planet. The seeds of racism are exposed as each character hilariously misinterprets the other's actions to fit with their view of the world. The misinterpretations are so hilarious and careless that the reader can't help but notice and laugh at his or her own tendencies.TLDR; a quick and light read that will make you think more about the 'strange' person living next to you."}, {"review_sentiment": 5.0, "review_text": "Arrived safely and on time.  A very fun, illuminating read."}, {"review_sentiment": 4.0, "review_text": "Interesting read, though not inspiring.  It's a somewhat light and enjoyable take on a serious theme."}, {"review_sentiment": 4.0, "review_text": "A murder mystery in the form of dueling monologues by unreliable narrators—not a formula attempted all that frequently.  But Amara Lakhous scores ten for ten in this original social satire about the inability of disparate Roman neighbors to melt in the pot.  A body lying dead in an apartment building elevator evokes impassioned testimony by a dozen people who know some of the story of the crime but have wildly varying interpretations of what happened.  Most of the “Romans” are not even countrymen, coming from places as foreign as Iran, Bangladesh, North Africa and even Naples, original home of the most virulent hater in Piazza Vittorio.  “Amadeo” is the only speaker who embodies all the ancient virtues of the place all roads lead to, but of course his Italian identity is assumed, not inborn.  It’s a short book with a lot to say, so don’t attempt to speed-read it."}]}, "authors": ["Amara Lakhous"], "isbn": "1933372613", "longitude": 12.4829321, "periods": ["2000s", "Recent Releases"], "title": "Clash of Civilizations Over an Elevator in Piazza Vittorio", "word_cloud": "heck end weird wail also really odd wrong great order paperback never get download love character cover brilliant talent create people feel right murder mystery political commentary social miasma good translation live expectation such timely topic interest humorous very interesting well write story tell perspective involve comment funny insightful thoughtful human manage cover intense topic racism remain light told series interview inhabitant apartment build man murder chapter interview character character helplessly humanly limited scope self involve describe separate planet seed racism expose character hilariously misinterprets action fit view world misinterpretation hilarious careless notice laugh quick light make person live next safely time fun illuminating interest inspire somewhat light enjoyable take serious theme murder mystery form duel monologue unreliable formula attempt frequently score ten ten original social satire inability disparate neighbor melt pot body lie dead apartment building evokes impassioned testimony dozen people know story crime wildly vary interpretation happen most even countryman come place foreign even original home virulent hater speaker embodies ancient virtue place road lead course italian identity assume inborn short lot say attempt", "genres": ["Fiction & Literature", "Mystery & Suspense", "Satire"], "summary": "A compelling mix of social satire and murder mystery. \r\n\r\nA small culturally mixed community living in an apartment building in the center of Rome is thrown into disarray when one of the neighbors is murdered. An investigation ensues and as each of the victim's neighbors is questioned, the reader is offered an all-access pass into the most colorful neighborhood in contemporary Rome. Each character takes his or her turn center-stage, giving evidence, recounting his or her story the dramas of racial identity, the anxieties and misunderstandings born of a life spent on society's margins, the daily humiliations provoked by mainstream culture's fears and indifference, preconceptions and insensitivity. What emerges is a moving story that is common to us all, whether we live in Italy or Los Angeles. \r\n\r\nThis novel is animated by a style that is as colorful as the neighborhood it describes and is characterized by seemingly effortless equipoise that borrows from the cinematic tradition of the Commedia all Italiana as exemplified by directors such as Federico Fellini. \r\n\r\nAt the heart of this bittersweet comedy told with affection and sensitivity is a social reality that we often tend to ignore and an anthropological analysis, refreshing in its generosity, that cannot fail to fascinate.", "asin": "1933372613", "rank": "328332", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/519yfpTK6WL.jpg", "country": "Italy", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}