{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 50, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "My wife (who is not much of a reader) and I both really like this book  Engagingly written.  Really informative.  At times quirky -- an interview with the Kazakh Beatle (a tribute band member), the story of Dostoevsky in Kazakhstan, apple growing in Almaty -- and other times a lot of substantive information such as about the death of the Aral sea -- a massive and largely unknown ecological disaster during Soviet times.  The author spent quite a bit of time with and interviewing the President of Kazakhstan who turns out to be an excellent politician who is extremely intelligent.  Fascinating background on the creation of the new capital Astana and the secret launch of the Kazakh currency.  I highly recommend this as the one book to read on Kazakhstan."}, {"review_sentiment": 5.0, "review_text": "This book is a lovely read about a nation dear to my heart. This story is about the sovereign nation of Kazakhstan. The place of apples, tulips and horses. The book covered much of what I already knew, but also I learned new history and stories about the past that defines people's experience and the landscape. The stories are heartbreaking and are crucial to remember. The author shares an outsider experience to a nation, he hardly knows anything about. The story delivery was given unique occasions and tidbits of important historical figures. I would recommended this book to all who know nothing of my country or want to understand where I come from and who are Kazakhs.  5/5 stars"}, {"review_sentiment": 5.0, "review_text": "Engaging!  Tells a great deal about Kazakhstan and the people--Kazakhs, Volga Germans, Crimean Tatars, etc.--who have made their homes there through history.  Makes me want to visit"}, {"review_sentiment": 5.0, "review_text": "Very interesting book to read. Keeps going itself effortlessly."}, {"review_sentiment": 5.0, "review_text": "I got this book from the library, hoping to read through it to kill some time during a long car ride, but this turned out to be an amazing book.  I simply could not put it down and ended up reading through it much faster than I had ever anticipated.  Robbins' depictions of Kazakhstan and its people are both heartfelt and astute.  He blends the nation's history perfectly with his own adventures in the country, and the story moves along very swiftly.  I would strongly recommend this book to anyone interested in far-flung lands and the fascinating story of a nation and a people that few in the West will ever know."}, {"review_sentiment": 5.0, "review_text": "Always enjoy these books"}, {"review_sentiment": 5.0, "review_text": "my cousin who's lived there for years says its a must-read"}, {"review_sentiment": 5.0, "review_text": "One of the best book. Informative and well written. Emotional and precise!"}, {"review_sentiment": 5.0, "review_text": "I got this book for my boyfriend and he read it in one night. It really gave a lot of insight about how important Kazakhstan was historically"}, {"review_sentiment": 4.0, "review_text": "Rarely know facts of where apples actually came from and the types of apples that have been developed from the originals that were grown in Almaty."}]}, "authors": ["Christopher Robbins"], "isbn": "1934633933", "longitude": 0.0, "periods": ["1900s"], "title": "Apples Are from Kazakhstan: The Land that Disappeared", "word_cloud": "wife much really write informative time quirky interview tribute band member story apple grow time lot substantive information death sea massive largely unknown ecological disaster time author spend quite bit time interview turn excellent politician extremely intelligent fascinate background creation new capital secret launch currency highly recommend lovely nation dear heart story sovereign nation place tulip horse covered much already know also learn new history story defines people experience landscape story heartbreaking crucial author share outsider experience nation hardly know anything story delivery give unique occasion tidbit important historical figure know nothing country want understand come star engage great deal people make home history want visit very interesting go effortlessly get library hoping kill time long car ride turn amazing simply end reading much faster ever anticipate depiction people heartfelt blend nation history perfectly adventure country story move swiftly strongly anyone interested land fascinating story nation people ever know always enjoy cousin live year say best well write precise get boyfriend night really give lot insight important historically rarely know fact actually come type develop original grow", "genres": ["History", "Travel Writing"], "summary": "\"A captivating read notable for off-the-cuff candor and measured, eloquent prose.\"—Kirkus Reviews, starred review\r\n\r\nA funny and revealing travelogue of Kazakhstan, a country rich with wild tulips, oil, nomads who hunt with golden eagles, and a disappearing landlocked sea. \r\n\r\nClosed to foreigners under Tsar and Soviet rule, Kazakhstan has remained largely hidden from the world, a remarkable feat for a country the size of Western Europe. Few would guess that Kazakhstan—a blank in Westerners' collective geography—turns out to be diverse, tolerant, and surprisingly modern, the country that gave the world apples, trousers, and even, perhaps, King Arthur. \r\n\r\nChristopher Robbins enjoyed unprecedented access to the Kazakh president while crafting this travelogue, and he relates a story by turns hilarious and grim. He finds Eminem-worship by a shrinking Aral Sea, hears the Kazakh John Lennon play in a dusty desert town, joins nomads hunting eagles, eats boiled sheep's head (a delicacy), and explores some of the most beautiful, unspoiled places on earth. Observant and culturally attuned, Robbins is a master stylist in the tradition of travel writing as literature, a companion to V. S. Naipaul and Paul Theroux. 39 black-and-white illustrations", "asin": "1934633933", "rank": "242440", "city": "Kazakhstan", "image": "https://images-na.ssl-images-amazon.com/images/I/51iLH3koZRL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}