{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 275, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "4 1/2 stars .Brilliantly written novel of life under Nazi control. Grim, yes, but outside of \"Hogan's Heroes, what wouldn't be!"}, {"review_sentiment": 5.0, "review_text": "This book gives great insight on what people are capable of when living in fear."}, {"review_sentiment": 5.0, "review_text": "Excellent treatment of lives of two ordinary people in Nazi Germany."}, {"review_sentiment": 5.0, "review_text": "Arrived in perfect condition"}, {"review_sentiment": 5.0, "review_text": "Excellent story and the reader is expressive but not too much so.Recommended by Ben Shapiro and I wasn't disappointed."}, {"review_sentiment": 4.0, "review_text": "A beautiful, gripping account of middle-aged, working-class German couple Otto and Anna Quangel, who, after learning of their son's death at the front decide to appose Hitler - in the form of tyrannous postcards! Based on the true story of Otto and Elise Hampel. Not recommended for everyone as the cussing was quite profane, but ignoring certain words it was one of the best books I've ever read!"}, {"review_sentiment": 3.0, "review_text": "This book was represented as \"new\" and it was not!"}, {"review_sentiment": 5.0, "review_text": "Strange this has never been translated before."}, {"review_sentiment": 5.0, "review_text": "A book that though written a while back is timeless. An exciting look into a part of Nazi Germany often missed."}, {"review_sentiment": 5.0, "review_text": "Excellent writing and character development"}]}, "authors": ["Hans Fallada"], "isbn": "1935554042", "longitude": 13.3888599, "periods": ["1900s"], "title": "Every Man Dies Alone: A Novel", "word_cloud": "star write life control yes give great insight people capable live fear excellent treatment live ordinary people perfect condition excellent story expressive much disappoint beautiful gripping account german couple learn son death front decide appose form tyrannous postcard base true story not recommend everyone cuss quite profane ignore certain word best ever represent new strange never translate though write timeless exciting look part often miss excellent write character development", "genres": ["Fiction & Literature", "WWII"], "summary": "Based on a true story, this never-before-translated masterpiece was overlooked for years after its author—a bestselling writer before World War II who found himself in a Nazi insane asylum at war’s end—died just before it was published.\r\n\r\nIn a richly detailed portrait of life in Berlin under the Nazis, it tells the sweeping saga of one working-class couple who decides to take a stand when their only son is killed at the front. With nothing but their grief and each other against the awesome power of the Third Reich, Otto and Anna Quangel launch a simple, clandestine resistance campaign that soon has an enraged Gestapo on their trail, and a world of terrified neighbors and cynical snitches ready to turn them in.\r\n\r\nIn the end, Every Man Dies Alone is more than an edge-of-your-seat thriller, more than a moving romance, even more than literature of the highest order—it’s a deeply stirring story of two people standing up for what’s right, and for each other.\r\n\r\nThis edition includes an afterword detailing the gripping history of the book and its author, including excerpts from the Gestapo file on the real-life couple that inspired it.", "asin": "1935554042", "rank": "21078", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51DaTZLqlrL.jpg", "country": "Germany", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}