{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 236, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Our book club loved the book and plan on reading more from G. Quinn.  Loved the historical information on Hawaii and the Royal family, especially since I am going to Hawaii in a couple months.  Had action, love, tragedy, etc., etc. -- something for everyone."}, {"review_sentiment": 5.0, "review_text": "If you are at all interested in Hawaiian history or like to travel to Hawaii you shouldread this book to understand what happened to the native Hawaiians. Seemssimilar to the Native Americans in some ways. Take it first then explain.l"}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 5.0, "review_text": "Can't recommend this book enough"}, {"review_sentiment": 5.0, "review_text": "This was a great historical book that really transported you back to the time when Hawaii was on its own and the annexed to America.  Well done!"}, {"review_sentiment": 5.0, "review_text": "I am a frequent visitor to Hawaii and love the state.  It is appalling what has been done to them in their history by haoles.  Nothing brings it home quite as poignantly as this book does. A must read for any visitor or US citizen."}, {"review_sentiment": 5.0, "review_text": "My daughter read this book for her summer reading assignment and she liked it so much that she told me to read it.  I was immediately drawn in and didn't want to put it down.  Growing up in Hawaii and being of Hawaiian descent, I learned about the history of the overthrow in school.  Not only did Ms. Quinn do an excellent job with portraying the events that led to the overthrow but she gave a voice to all of our beloved ali'i during that difficult time in our history.  I know I will read this book again and again. I highly recommend that you do the same."}, {"review_sentiment": 3.0, "review_text": "It seemed to be missing part of the story. She went to school and years later she has a husband and kids but no mention of when thathappened. The book story was alright. But the shipper sent a much used book that had printed on it that it was a free copy. What's that supposed to me."}, {"review_sentiment": 5.0, "review_text": "Excellent read as it is fiction based on facts that keeps you wanting to learn what really happened to Queen Liliuokalani and her Hawaiian kingdom..yes..I am american but........I  am a Hawaiian first and foremost.......and as I.'ve gotten older I realize this.  What a shame for me that I never appreciated my very rich Hawaiian culture nor was interested in even learning our language that my ancestors were forbidden to speak..but all is not lost....my grandchildren have embraced their true heritage and will go forward with much Aloha for their ancestors."}, {"review_sentiment": 5.0, "review_text": "I read this while on Maui.  I love the history of the Islands and this book  helped me to better understand how the \"revolt\" occurred.  I was able to \"picture\" each person and event that took place.  Easy reading.  I recommend this book to anyone who enjoys the Hawaiian Islands.....so much history."}]}, "authors": ["Gaellen Quinn"], "isbn": "1935448005", "longitude": -157.8556764, "periods": ["1800s", "Recent Releases"], "title": "The Last Aloha", "word_cloud": "club love plan read historical information family especially go couple month have action love tragedy something everyone interested hawaiian history travel should read understand happen native seems similar way take first excellent recommend enough great historical really transport time annex do frequent visitor love state appal do history hale bring home quite poignantly daughter summer read assignment like much told immediately draw want put grow hawaiian descent learn history overthrow school not excellent job portray event lead overthrow give voice beloved difficult time history know highly recommend seem miss part story go school year later husband kid mention that happened story alright shipper sent much use print free copy suppose excellent fiction base fact keep want learn really happen hawaiian american first foremost get older realize shame never appreciate rich hawaiian culture interest even learn language ancestor forbid lose grandchild embrace true heritage forward much ancestor maui love history help better understand revolt occur able picture person event take place reading recommend anyone enjoy hawaiian much history", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "How did Hawaii become part of America? This story, inspired by true events suppressed for nearly 100 years, is the one James Michener never wrote. \r\n\r\nIn 1886, Laura Jennings travels to Hawaii to live with missionary relatives. She imagines she'll live in a grass hut, ministering to savages. When she arrives in Honolulu, she's surprised to find her relatives are among the wealthy elite plotting to overthrow the Hawaiian monarchy. And, far from being savages, the Hawaiians have developed a charming and prosperous Victorian kingdom. \r\n\r\nTo avoid her conniving uncle's control, Laura leaves to work for the royal family and learns her family's prejudices against them are false. The last Queen, Lili-uokalani, wages a tragic struggle to save the Kingdom. Through choices she makes when every avenue is blocked, Laura sees the power that can restore the spirit of a people caught in a turbulent world and discovers how long-hidden secrets of her own family lead the way to reunion.", "asin": "1935448005", "rank": "146017", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/51K5hp5xnWL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}