{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 7, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Really good book, common situations in Mexico City interpreted with fresh eyes of another cultural background context. Great work friends."}, {"review_sentiment": 4.0, "review_text": "I bought this book to learn about Mexico.  It certainly meets my expectations on that point.  Easy to read and packed with interesting, historic, social and scientific details, the author is clearly passionate about Mexico City and provides vivid first hand accounts of life, love and suffering in his adopted megalopolis.  While the fixation on death is a tad depressing, reality is not always uplifting."}, {"review_sentiment": 4.0, "review_text": "I thought of moving to Mexico City while living nearby. After reading this I decided to pass. A real-life horror story, at least health wise."}, {"review_sentiment": 5.0, "review_text": "Just returned from a trip to Mexico City and I must say that had I read this before the trip, I may have thought twice about going! After reading this, I want to go back; there are so many things about Mexico City that are so scary and wonderful at the same time and this book really brings it all into perspective!  Viva la Vida!!"}, {"review_sentiment": 5.0, "review_text": "Hollander makes an awesome journey throughout the formation of Mexico City, from precolonial times to modern days, he brings an outsiders look to the development of one of the worlds biggest cities, and indubitably one of the most complex sociological structures in latin america."}, {"review_sentiment": 5.0, "review_text": "Five stars for anyone interested in Mexico city especially if you have spent Time there or planning to. I also love Mexico city"}, {"review_sentiment": 4.0, "review_text": "...who pioneered the \"essay,\" or attempt, is this book-length attempt to understand not only a city, but its effect on the writer and others who live there. The cool, and difficult, thing about nonfiction is that there is a person behind it, and the author's quirks, obsessions, research patterns, and personal history combine to build the engine that drives this collection. People who like bow-decorated epiphanies or have a set idea about how a nonfiction narrative should work may get impatient, and the final draft could have benefitted from a copy editor, but anyone curious about the world and ready to spend a couple of afternoons in good company will love this book. What's unresolved at the center of the book is not the writer's fate (everyone dies, he admits), but his role in the changing neighborhood and city he loves. When the kind of people who patronized his nightclub (and who will probably buy his book) start moving into a neighborhood, rents rise and the \"authentic\" culture he admires is threatened. There is so much to think about surrounding this issue! I went straight from this book back to my copy of Yi-Fu Tuan's \"Morality and Imagination.\" It would be great to lock these two writers in an elevator and record the conversation..."}]}, "authors": ["Kurt Hollander"], "isbn": "1936239485", "longitude": -99.1333416, "periods": ["1900s"], "title": "Several Ways to Die in Mexico City: An Autobiography of Death in Mexico City", "word_cloud": "really good common situation interpret fresh eye cultural background context work friend buy certainly meet expectation point pack interesting historic social scientific detail author clearly passionate provide first hand account life suffer adopt megalopolis fixation tad depress reality always uplift think move living nearby read decide pas horror story least health wise just return trip trip twice go read want back many thing scary wonderful time really bring perspective la make awesome journey formation precolonial time modern day bring outsider look development world biggest city indubitably complex sociological structure latin america star anyone interested especially spent planning also love pioneer essay attempt attempt understand effect writer others live cool difficult thing nonfiction person author quirk obsession research pattern personal history combine build engine drive collection people epiphany set idea nonfiction narrative work impatient final draft copy editor anyone curious world ready spend couple afternoon good company unresolved center writer fate everyone die admit role change neighborhood love kind people patronize nightclub probably start move neighborhood rent rise authentic culture admires threaten much think surround issue go straight back copy great writer elevator record conversation", "genres": ["Memoir", "Travel Writing"], "summary": "In the '80s, when author/photographer Kurt Hollander lived in New York and published The Portable Lower East, life there was particularly rough, and cops often drove yellow cabs as a method to surprise and roust its residents. Before the decade ended, Hollander moved to the equally rough climes of Mexico City, making his living writing and photographing for The Guardian, The New York Times, Los Angeles Times, and many other publications.\r\n\r\nHollander's visual and textual extravaganza, Several Ways to Die in Mexico City, provides a perspective of this extraordinary city that could only have been caught by an observant outsider who lived in all its nooks and crannies for over two decades.\r\n\r\nCrammed with caustic but fair observations of the city's history, food, cults, drugs, and buildings, Hollander proves that he can love a city and culture that also kills its inhabitants softly. The book contains dozens of extraordinary photographs.\r\n\r\nWhile living high in Mexico City, Kurt Hollander edited poliester, the renowned bilingual art magazine about the Americas. He also directed the feature film Carambola and wrote a successful series of children's books. Grove Press published the Portable Lower East Side anthology in 1994.", "asin": "1936239485", "rank": "1121494", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/41bbC0UxFGL.jpg", "country": "Mexico", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}