{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 235, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "I loved this book."}, {"review_sentiment": 5.0, "review_text": "A friend chose this book for our book club, or I don't think I would have read it. Thank you, my friend! It is now one of my all time favorite novels. One would not think a book about suicide would be laugh out loud funny. But it is, over and over again. It is also incredibly insightful, well-written, tragic and beautiful. AMPS resonates with some of my personal history, so it might not ring as true for everyone as it does for me, but I still think it would be a worthwhile read for almost anyone. Thank you Miriam Toews."}, {"review_sentiment": 5.0, "review_text": "This woman is the best writer in the whole freakin' world! I'll finish a section or a group of paragraphs, and I want to cry, it's so perfect. I completely love this book."}, {"review_sentiment": 4.0, "review_text": "This story really got to me. It's a heartbreaking story, told with a sensitive touch and quite a bit of humor. Not for Mennonites, who don't come off looking very good.  Thought provoking -- one of those books where you don't know the right thing to do -- and neither do the characters."}, {"review_sentiment": 5.0, "review_text": "This book is so honest and intimate - as a reader you live through the eyes and mind of the protagonist.  Just enough laugh out loud moments to keep it from being soul-crushing.  And sprinkled with enough literary references that it feels more intellectual than indulgent.  This is a great read."}, {"review_sentiment": 1.0, "review_text": "I gave up quickly.  I never cared about the sisters or their love for each other."}, {"review_sentiment": 3.0, "review_text": "Interesting perspective on a person suffering bi-polar disease and her desire to die."}, {"review_sentiment": 3.0, "review_text": "Rambling writing-not my favorite book."}, {"review_sentiment": 3.0, "review_text": "Sad novel about a woman dealing with a suicidal family member.  I enjoyed the flashbacks to the sisters growing up in a Mennonite community in Canada."}, {"review_sentiment": 5.0, "review_text": "This book gives an excellent portrait of what it is like to live with a suicidal loved one. Honest, heartbreaking, sad but often funny too. It is so well written and not too sentimental. I lived through the exact situation beautiful, smart talented sister who ultimately killed herself. Like the characters in the book, it is a lifetime of sadness building to the suicide, it unfolds in the book much like in real life. People who have not been through it may not feel parts are realistic or believable but the book captures the feeling, the desperation, the helplessness the ultimate inability to give your loved one a reason to go on.It is hard to put into words how this book made me feel. It was a comfort after the passing of my sister to know it is what it is, this is just how people feel."}]}, "authors": ["Miriam Toews"], "isbn": "1940450713", "longitude": -79.387207, "periods": ["2000s", "Recent Releases"], "title": "All My Puny Sorrows", "word_cloud": "love friend chose club think time favorite novel suicide loud funny also incredibly insightful tragic beautiful resonate personal history true everyone still think almost anyone woman best writer whole freaking world finish section group paragraph want cry perfect completely love story really get heartbreaking story tell sensitive touch quite bit humor not come look good provoke know right thing character honest intimate live eye mind protagonist enough laugh loud moment enough literary reference feel intellectual indulgent great give quickly never care sister interest perspective person suffer disease desire die ramble favorite woman deal suicidal family member enjoy flashback sister grow community give excellent portrait live suicidal love heartbreaking sad often funny well write sentimental live exact situation beautiful smart talented sister ultimately kill character lifetime sadness building suicide unfolds much real life people part realistic believable capture feel desperation helplessness ultimate inability give love reason hard put word make feel comfort pass sister know people feel", "genres": ["Fiction & Literature"], "summary": "Elf and Yoli are sisters. While on the surface Elfrieda's is an enviable life (she's a world-renowned pianist, glamorous, wealthy, and happily married) and Yolandi's a mess (she's divorced and broke, with two teenagers growing up too quickly), they are fiercely close—raised in a Mennonite household and sharing the hardship of Elf's desire to end her own life. After Elf's latest attempt, Yoli must quickly determine how to keep her family from falling apart, how to keep her own heart from breaking, and what it means to love someone who wants to die.\r\n\r\nAll My Puny Sorrows is the latest novel from Miriam Toews, one of Canada's most beloved authors not only because her work is rich with deep human feeling and compassion, but because her observations are knife-sharp and her books wickedly funny. And this is Toews at her finest: a story that is as much comedy as it is tragedy, a goodbye grin from the friend who taught you how to live.", "asin": "1940450713", "rank": "168460", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51md-KVjU1L.jpg", "country": "Canada", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}