{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 6.2443382, "ratings": {"num_ratings": 74, "rating": 4.7, "reviews": [{"review_sentiment": 4.0, "review_text": "This book is a true thriller.  It has all the elements of suspense and intrigue that I look for with the added bonus of an appealing female protagonist.  The setting in Columbia sets it apart from other thrillers. And it's well-written.  Kathryn's description of Cartagena makes me want to book the next flight for a vacation."}, {"review_sentiment": 5.0, "review_text": "A satisfying romantic suspense novel set in an exotic location.Nikki Garcia, a corporate auditor with Globan International, headquartered in Minneapolis, has been sent to Medellin, Columbia, to investigate employee allegations of fraud and mismanagement at Amazonia Steel, one of Globan's subsidiaries. Corporate policy dictates that Nikki must advise Amazonia's top executive, Manuel Del Campo, a fencing enthusiast with a lifestyle that far exceeds what his salary should cover, that he is under investigation. Right away, she's on dangerous footing as Manuel plays his cat-and-mouse game with her.Nikki soon learns about two recent \"accidental\" employee deaths that involve too many coincidences not to be suspicious. As she strives to get closer to the truth, two more would-be whistleblowers meet mysterious ends.A handsome philanthropist doctor begins to court Nikki, and despite her cautious nature, she finds herself falling in love. But can he be trusted, or is he part of the scheme to squelch her investigation?Nikki--and the reader--can trust no one. Determined to uncover the wrongdoing and bring the guilty to justice, Nikki jeopardizes her own safety and that of those who are trying to protect her.Like many first novels, there are missed opportunities in this book to strengthen the writing and suspense. But the structure is excellent, the background authentic, the ending satisfying, and in fact, Waking Up in Medellin won the Silver Falchion award for best mystery novel at the Killer Nashville conference.Readers of the mystery/thriller/suspense genre will enjoy this page-turner."}, {"review_sentiment": 5.0, "review_text": "Waking Up in Medellin is an exciting debut novel by Kathryn Lane. In a first novel there are often problems in content or grammar but I read through this well-written and plotted, fast paced mystery without noticing any.Lane’s experience as an international finance executive and her knowledge of the Latin American culture, are perfect backdrops for this intriguing suspense. As a multinational auditing executive, the protagonist Nikki is assigned to investigate a Columbian corporation due to anonymous allegations of the corporation's mismanagement. Expecting a routine analysis, she is instead thrown into a world of corruption, murder, and theft where her own life is threatened.The story is written in first person, so we are there with Nikki as she tries to navigate through the twists and turns of her complicated and dangerous assignment. With just enough introspection and narrative, she becomes a believable and likeable character who is grieving the loss of her son, yet possesses a good sense of humor, is skilled in her profession, and who isn’t looking for romance, although it might find her. I’ve read many mystery/thrillers and can usually figure out the mastermind early on, but was completely surprised at this one. I look forward to visiting with Nikki again and would recommend this novel to anyone wanting to read a good suspense story."}, {"review_sentiment": 5.0, "review_text": "I loved the way the author described the surroundings in Columbia. The narrative and dialog made me feel like I was actually there. This is an interesting story that I might buy later. I met Mrs. Lane in Tuscon and found her background fascinating."}, {"review_sentiment": 5.0, "review_text": "Really enjoyed the book! Looking forward to Nikki's next adventure as your character development was so good. As a mid age career professional I found the character easy to relate to and yet inspiring. We can have it all - through hard work, tragedy, and perseverance!"}, {"review_sentiment": 5.0, "review_text": "I don't get a lot of time to read fiction. I was recommended this book by a friend who found it to be interesting and I was pleasantly taken into a South American adventure. I enjoyed how the author painted the setting of Columbia and developed her characters, especially Nikki the heroine. Although the entire read was well written, the last chapters really pick up speed and are gripping. An enjoyable read with intrigue and mystery. I would recommend it!"}, {"review_sentiment": 4.0, "review_text": "I thoroughly enjoyed Waking Up in Medellin. The story draws you in immediately and keeps you. The details and background of the country were interwoven with the plot to make it much more enjoyable than your typical big American city type suspense story. Looking forward to her next adventure!"}, {"review_sentiment": 5.0, "review_text": "Suspense, mystery, romance.  This book has it all.  Read \"Waking Up in Medellin\" for our last book club.  We all agreed that it was an enjoyable book.  Loved the strength & courage of, Nikki, the heroine.  Kathryn Lane, the author, agreed to come & do a presentation on the book.  We learned about the culture, people & about the beauty of Columbia from her.  Highly recommend this book."}, {"review_sentiment": 5.0, "review_text": "Loved it!  Even better, was that I was in Peru when I started it. Great read!"}, {"review_sentiment": 5.0, "review_text": "Waking Up in Medellin is a well-written novel with characters that come alive.  Their motives and passions are those we find in the best and worst of mankind.  Kathryn's writing draws the reader in so I began trusting no one, as does Nikki, the main character.  The realistic style and setting of the novel led me into a corrupt world of drug deals, money laundering, and silencing witnesses, and the into the minds of people who will do anything to further their personal agendas.  However, Nikki's determination to right the world of these wrongs keeps the suspense intense, but hopeful.  My connection was even stronger after hearing Kathryn speak about Columbia and Medellin prior to reading.  I travelled with Nikki through the tunnels and searched with her for terror waitng within the lush growth of the landscape. This is a novel that will keep you reading, and I anxiously await the next Nikki novel."}]}, "authors": ["Kathryn Lane"], "isbn": "1942428944", "longitude": -75.573553, "periods": ["2000s", "Recent Releases"], "title": "Waking Up in Medellin: Intrigue, Romance, and Suspense in Colombia", "word_cloud": "true thriller elements intrigue look added bonus appeal female protagonist set set apart thriller description make want next flight vacation satisfying romantic set exotic corporate auditor headquarter send employee allegation fraud mismanagement subsidiary policy dictate top executive fence enthusiast lifestyle far exceed salary cover investigation away dangerous foot play game soon learn recent accidental employee death involve many coincidence suspicious strives get closer truth whistle blowers meet mysterious handsome philanthropist doctor begin court cautious nature find fall trust part scheme squelch investigation trust determine wrongdoing bring guilty justice jeopardize safety try protect many first novel miss opportunity strengthen write structure excellent background authentic end satisfy fact award best mystery genre enjoy excite debut first often problem content grammar plot fast paced mystery notice experience international finance executive knowledge latin american culture perfect backdrop intrigue multinational audit executive protagonist assign investigate columbia corporation due anonymous allegation corporation mismanagement routine analysis instead thrown world corruption murder theft life story write first person try navigate twist turn complicate dangerous assignment enough introspection narrative becomes believable likable character grieve loss son yet possess good sense humor skilled profession look romance many usually figure early completely surprise look forward visit anyone want good story love way author describe surroundings narrative dialog make feel actually interesting story later meet find fascinate really enjoy look forward next adventure character development good mid age career professional find character easy relate yet inspire hard work tragedy perseverance get lot time fiction recommend friend find interesting pleasantly take south american adventure enjoy author paint set develop character especially heroine entire well write last chapter really pick speed grip enjoyable intrigue mystery thoroughly enjoy story draw immediately keep detail country interwoven plot much enjoyable typical big american city type story look forward next adventure mystery romance last club agree enjoyable strength courage heroine author agree come presentation learn culture people beauty recommend love even better peru start character come alive motif passion find best worst write draw begin trust main character realistic style set lead corrupt world drug deal money launder silence witness mind people anything personal agenda however determination right world wrong keep intense hopeful connection even stronger hear speak prior read travel tunnel search terror waiting lush growth landscape keep reading anxiously await next", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Handsome Colombian men and life-threatening danger were not normally a part of Nikki's auditing job, but this assignment was anything but normal. Despite her emotional wounds, she accepts the challenge as a way to overcome the loss of her young son in a tragic event.\r\n\r\nIn the midst of the male-dominated business world in Colombia, she investigates mismanagement allegations and uncovers a sinister plot involving fraud . . . and possibly murder. She also discovers an attractive man who seems to have feelings for her. As her relationship with him grows deeper, so does the level of danger she finds herself in. When the guns come out, Nikki realizes it will be up to her to find a way to survive . . . but is she up to the task?", "asin": "1942428944", "rank": "2423366", "city": "Medellin", "image": "https://images-na.ssl-images-amazon.com/images/I/513AH4rpLCL.jpg", "country": "Colombia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}