{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 2, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Good read."}, {"review_sentiment": 5.0, "review_text": "This book is really very interesting.  The angle the author takes on Goya's works is refreshing as the focus these days tends to be his etchings of war scenes.  The text is well written and the paintings are gorgeous.  Anyone interested in the story of a painter living in a turbulent time, a  man tangled up in all sorts of intrigues, as well as an artist without  compare would love this book!"}]}, "authors": ["Susann Waldmann"], "isbn": "3791319841", "longitude": -3.7035825, "periods": ["1700s", "1800s"], "title": "Goya and the Duchess of Alba", "word_cloud": "good really interest angle author take work refreshing focus day tend etching war scenes text well write painting gorgeous interested story painter live turbulent time man tangle sort intrigue well artist compare", "genres": ["Biography", "Art & Architecture", "History"], "summary": "The story of the relationship between Goya and the Duchess of Alba is shrouded in mystery and secrecy, and has captured the imaginations of authors since the middle of the 19th century. It is not only Goya's artistic crisis, which began with his traumatic illness in 1792-93 in Cadiz, and the creation of his famous \"Caprichos\" series , but also his affair with the Duchess of Alba that make the period in Goya's life between 1790 and 1800 so intriguing. \r\n\r\nBut what do we know about this love affair, which continues to fascinate us today? Did it actually take place or was it a rumour? And what sort of woman was the Duchess of Alba, who, according to a romatic version of the story, nearly drove Goya out of his senses. We would know very litle about this woman today had she not encounterted Francisco de Goya. \r\n\r\nIn this book the author investigates these and other events by examining various contemporary documents, letters from Goya to his friends, and numerous anecdotes, unfolding a sensational turn of events full of suspense.", "asin": "3791319841", "rank": "2224106", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/515oV9DtnrL.jpg", "country": "Spain", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}