{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 93, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Thompson at his finest crazy......a surreal and unbelievable trip only surpassed by Fear and Loathing In Las Vegas......"}, {"review_sentiment": 4.0, "review_text": "Cool book."}, {"review_sentiment": 4.0, "review_text": "My boyfriend loved getting this gift. The book did arrive a bit beat up though."}, {"review_sentiment": 5.0, "review_text": "Our 23 year old is a Hunter Thompson reader and fan.  By far he said this is his favorite book of his, and enjoys reading the collaborations and background stories within these pages, about his many books written and adventures,not known before."}, {"review_sentiment": 5.0, "review_text": "A fun read. I have most of his books"}, {"review_sentiment": 1.0, "review_text": "This is not Hunter Thompson's book - this is a comic book."}, {"review_sentiment": 5.0, "review_text": "Another fantastic work by the Doctor. Well worth buying."}, {"review_sentiment": 5.0, "review_text": "The cover alone is worth 5 stars!"}, {"review_sentiment": 5.0, "review_text": "Brilliant!"}, {"review_sentiment": 1.0, "review_text": "Binding was in poor condition and book is missing over 30 pages. Would not consider \"good condition\" or worth the purchase price."}]}, "authors": ["Hunter S Thompson"], "isbn": "3836548968", "longitude": -157.8556764, "periods": ["1900s"], "title": "The Curse of Lono", "word_cloud": "finest crazy surreal unbelievable trip surpass cool boyfriend love get gift arrive bit beat year old fan far say favorite enjoys read collaboration story page many write adventure know fun comic fantastic work buy cover alone worth star brilliant bind poor condition miss page good condition purchase price", "genres": ["Memoir", "Art & Architecture", "Photography", "Pop Culture", "Journalism"], "summary": "A wild ride to dark Americana: Hunter S. Thompson’s and Ralph Steadman’s most eccentric book\r\n \r\nThe Curse of Lono is to Hawaii what Fear and Loathing was to Las Vegas: a journalist’s news event “coverage” that ends up an unclassifiable twist of fiction and reportage, myth and crazed surrealism. Featuring all of the zany, hallucinogenic wordplay and feral artwork for which the Hunter S. Thompson/Ralph Steadman duo became known and loved, the book was at once their exemplary and most eccentric output.\r\n\r\nThe original edition of The Curse of Lono, published 1983, had long been out of print when TASCHEN brought out a signed, limited re-edition almost a decade ago. The book sold out before it even hit the stores. Now available as a standard TASCHEN edition, this fresh, smaller format, makes the gonzo masterpiece accessible to everyone.", "asin": "3836548968", "rank": "568545", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/51hzuK8EVaL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}