{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 29.3797091, "ratings": {"num_ratings": 20, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Salgado is one of my favourite photographers. This is the 4th book I have of him. Photos are impactant.The printing quality is fantastic and I enjoy reading this book over and over again."}, {"review_sentiment": 5.0, "review_text": "Amazing work by Salgado- as usual!"}, {"review_sentiment": 5.0, "review_text": "Fantastic book because pictures of my husband in it!"}, {"review_sentiment": 4.0, "review_text": "The pictures are amazing, but horrible and terrifying. Our world. We need to take care of each other."}, {"review_sentiment": 5.0, "review_text": "Just got the bildband today (therefore only a first impression). As usual: Salgado is a warrant for the extraordinary. Everything which enters his exposure box is supreme: cryistallinilty and 'smoothness' combined (I know: a contradiction - but Salgado makes it to appear 'combined'). He's Herzog. Herzog is Salgado. I know this sounds simplistic. But in a land of small hands we have to point out the big hands - with verve. Some exposures in the bildband are also already published in \"Workers\". Nevertheless, this bildband rounds it up in regards to the power of fire and putting it under control by humankind (for the better or the worse). Enjoy!"}, {"review_sentiment": 2.0, "review_text": "Disappointed - the photographer is very famous, but the photos are not as my expected"}, {"review_sentiment": 3.0, "review_text": "The book is will done, photo reproductions are sharp..."}, {"review_sentiment": 5.0, "review_text": "Breathtaking , pure art , photography at its highest level."}, {"review_sentiment": 4.0, "review_text": "good!!"}, {"review_sentiment": 5.0, "review_text": "Extraordinary collection"}]}, "authors": ["Sebastião Salgado"], "isbn": "3836561255", "longitude": 47.9735629, "periods": ["1900s", "Recent Releases"], "title": "Sebastião Salgado: Kuwait, A Desert on Fire", "word_cloud": "favorite photographer print quality fantastic enjoy read amazing work usual fantastic picture husband picture amaze horrible terrify world need care just get bildband today first impression usual warrant extraordinary enters exposure box supreme cryistallinilty combine know contradiction make know sound simplistic land small hand point big hand verve exposure bildband also already publish bildband round regard power put control humankind better worse enjoy disappoint photographer famous photo expect do photo reproduction sharp breathtaking pure art photography highest level good extraordinary collection", "genres": ["Essay", "Photography"], "summary": "Desert aflame\r\nSebastião Salgado documents the torched Kuwaiti oil wells\r\n\r\nIn January and February 1991, as the United States-led coalition drove Iraqi forces out of Kuwait, Saddam Hussein’s troops retaliated with an inferno. At some 700 oil wells and an unspecified number of oil-filled low-lying areas they ignited vast, raging fires, sending billowing black clouds over the region and thousands of tons of nitrous oxide and carbon dioxide into the atmosphere.\r\n\r\nAs the desperate efforts to contain and extinguish the conflagration progressed, Sebastião Salgado traveled to Kuwait to witness the crisis firsthand. The conditions were excruciating. The heat was so vicious that Salgado’s smallest lens warped. A journalist and another photographer were killed when a slick ignited as they crossed it. Sticking close to the firefighters, and with characteristic sensitivity to both human and envrionmental impact, Salgado captured the terrifying scale of this “huge theater the size of the planet”: the ravaged landscape; the sweltering temperatures; the air choking on charred sand and soot; the blistered remains of camels; the sand still littered with cluster bombs; and the flames and smoke soaring to the skies, blocking out the sunlight, dwarfing the oil-coated firefighters.\r\n\r\nSalgado’s epic pictures first appeared in the New York Times Magazine in June 1991 and were subsequently widely published and awarded the Oskar Barnack Award, recognizing outstanding images on the relationship between man and the environment. Kuwait: A Desert on Fire is the first monograph of this astonishing series. Like Genesis, Exodus, and The Children, it is as much a major document of modern history as an extraordinary body of photographic work. \r\n\r\n“These images, many of which have never been published, demonstrate Salgado’s ability to go beyond the limits of news photography and create powerful and lasting artworks.” Royal Photographic Society, London", "asin": "3836561255", "rank": "901940", "city": "Kuwait", "image": "https://images-na.ssl-images-amazon.com/images/I/51jm5e8GUtL.jpg", "country": "Kuwait", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}