{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 48, "rating": 4.8, "reviews": [{"review_sentiment": 4.0, "review_text": "Such a great book! Interesting look back in time."}, {"review_sentiment": 5.0, "review_text": "THIS BOOK MAKES ME SO HAPPY"}, {"review_sentiment": 5.0, "review_text": "This was a gift for my husbands birthday.  We all love it. Excellent coffee table book"}, {"review_sentiment": 5.0, "review_text": "Recipient loved the book."}, {"review_sentiment": 5.0, "review_text": "What a terrific coffee table book.  It is a fantastic size (10.1 x 1.9 x 13.6 inches) and the quality is great.  Love all the photos - some of which bring back a lot of memories.  I've had fun turning the pages with my 18 year old daughter and talking about LA as it was.......back when."}, {"review_sentiment": 5.0, "review_text": "Great, great coffee table collectors book of LA. Big & heavy loaded with the history of a great city. I love this book. Give as a gift or keep, it;s awesome!"}, {"review_sentiment": 5.0, "review_text": "Ordered for my father, an avid LA history buff, he loves it, and even shows it off to his friends."}, {"review_sentiment": 5.0, "review_text": "Great pics at a great price"}, {"review_sentiment": 5.0, "review_text": "Beautiful, with thoughtful texts."}, {"review_sentiment": 5.0, "review_text": "This massive book is loaded with a pictorial history of LA that will keep you captivated for hours on end. Love this one!"}]}, "authors": null, "isbn": "3836502917", "longitude": -118.244476, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Los Angeles: Portrait of a City", "word_cloud": "such great time gift husband love excellent coffee table recipient love terrific coffee table fantastic size inch quality great photo bring back lot memory fun turn page year old daughter talk great coffee table collector heavy load history great love gift awesome father avid history buff love even show friend great pic great price beautiful thoughtful text massive loaded pictorial history captivate hour end one", "genres": ["Biography", "Art & Architecture", "Urbanism", "Photography"], "summary": "Rise and sprawl: how Los Angeles came to be\r\nA pictorial history of the City of Angels\r\n \r\nFrom the first known photograph taken in Los Angeles to its most recent sweeping vistas, this photographic tribute to the City of Angels provides a fascinating journey through the city’s cultural, political, industrial, and sociological history. It traces the city’s development from the 1880s’ real estate boom, through the early days of Hollywood and the urban sprawl of the late 20th century, right up to the present day. With over 500 images, L.A. is shown emerging from a desert wasteland to become a vast palm-studded urban metropolis.\r\n\r\nEvents that made world news—including two Olympics, Bobby Kennedy’s assassination, and the Rodney King riots—reveal a city of many dimensions. The entertainment capital of the world, Hollywood, and its celebrities are showcased along with many other notable residents, personalities, architects, artists, and musicians. The city’s pop cultural movements, its music, surfing, health food fads, gangs, and hot rods are included, as are its notorious crimes and criminals. This book depicts Los Angeles in all its glory and grit, via hundreds of freshly discovered images including those of Julius Shulman, Garry Winogrand, William Claxton and many other superb photographers, culled from major historical archives, museums, private collectors, and universities. These are given context and resonance through essays by renowned California historian Kevin Starr and Los Angeles literature expert David L. Ulin.", "asin": "3836502917", "rank": "32274", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/51BJNxZVtQL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}