{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 33, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "My husband and I recently moved to San Francisco for work and I have loved this book. It’s been a great way to learn about interesting places and history about our new home and has given us ideas on where to start exploring. San Francisco is so cool, but it’s also overwhelming with all it’s places and landmarks! I highly recommend this to anyone moving to SF or looking to plan a visit."}, {"review_sentiment": 3.0, "review_text": "Pretty good, but more for tourist"}, {"review_sentiment": 4.0, "review_text": "It's a great book! Some of the information is a bit outdated. But still interesting to read up on. It's definitely a great list of places to be seen in San Francisco, whether you're a native, a vacationer, or have just arrived!"}, {"review_sentiment": 2.0, "review_text": "Lightweight info"}, {"review_sentiment": 5.0, "review_text": "I've lived in the Bay Area for most of my life and purchased this book to learn about eccentric historical facts and locales within San Francisco, in preparation for a scavenger hunt in the city. I feel like this book is perfect for locals or people who are already VERY familiar with the major SF tourist sites AND city neighborhoods, and who will have many weeks/months/years/the time to explore the city's off-the-beaten-path sites. If you're looking for a visitor's guide book that will cover the major sightseeing attractions, this is NOT the book for you. For example, this book will does not cover the Golden Gate Bridge, the Palace of Fine Arts, Fisherman's Wharf, nor Coit Tower; nor does it give any high-level summary about the different neighborhoods within the city. This book is written with the assumption that you're already familiar with all of that already. If it's your first week (or even month) in SF, I would highly recommend going with a different city guide book first, so you can become better acquainted with San Francisco before coming to this book, as this one seems like it would be much better appreciated by those who are locals.From a Bay Area native's point of view- I really love this book! I like how there are pictures for every site mentioned (the picture page faces the page of each site's story), and I get a real kick reading up on the history of each site. The blurbs are memorable and well-written, and I like that they aren't too long to read. It's a nice plus that public transit lines are listed for each location. Additionally, the map at the back of the book, which includes markers for each of the places mentioned in the book, could be helpful to use for planning a trip around the city... or to plan a little fun sightseeing detour if you're, say, going out to dinner and happen to be close to some of the sites mentioned in the book."}, {"review_sentiment": 5.0, "review_text": "The photos are great and the blurbs about each place are helpful, entertaining and informative."}, {"review_sentiment": 3.0, "review_text": "Got this as a gift for father.  Was surprised to see that the \"vibrator museum\" was one of the places listed.  Something to consider if you are looking for the appropriateness as a gift."}, {"review_sentiment": 1.0, "review_text": "This is useless for both tourists and locals."}, {"review_sentiment": 2.0, "review_text": "I found the book to contain places I would definitely want to miss. For instance, the 6th out of 111th places is 'The Vibrator Museum'. Others include secretive gentlemen club, etc... No, they're not all sex stops, but this is not something I would expect to see in a tourist book.The book is well made and does have pictures for each stop. Yes, including a picture for #6."}, {"review_sentiment": 3.0, "review_text": "ok"}]}, "authors": ["Floriana Petersen"], "isbn": "3954516098", "longitude": -122.4192363, "periods": ["1800s", "1900s", "2000s", "Recent Releases"], "title": "111 Places in San Francisco That You Must Not Miss", "word_cloud": "husband recently move work love great way interesting history new home give idea start explore cool also overwhelming landmarks highly recommend anyone move look plan visit pretty good tourist great information bit outdated still interest definitely great list see native vacationer arrive info live life purchase learn eccentric historical fact locale preparation scavenger hunt city feel perfect local people already very familiar major tourist site city neighborhood many time explore city site look visitor guide cover major sightsee attraction example cover give summary different neighborhood city write assumption already familiar already first week even month highly go different city guide first become better acquainted come seem much better appreciated native point really love like picture site mention picture page face page site story get real kick read history site blurb memorable like long nice public transit line list location map back include marker mention use planning trip city plan little fun sightsee detour say go dinner close site mention photo great blurb place helpful entertaining informative gift father surprise see vibrator museum list something consider look appropriateness gift useless tourist local find contain definitely instance include secretive gentleman club etc sex stop something tourist well make picture include picture ok", "genres": ["History", "Travel Writing"], "summary": "Part of the international 111 Places/111 Shops series with over 150 titles and 1 million copies in print worldwide\r\n\r\nFully illustrated with 111 full-page color photographs\r\nSan Francisco: the home of hills and valleys, of dreamers and trailblazers, of hippies and hipsters. From the gold rush to the Golden Gate, the City by the Bay has always basked in the glow of its colorful and celebrated history and world-renowned landmarks. But for those who live and love on this compact seven-mile by seven-mile metropolis, San Francisco is a treasure trove of unusual neighborhood sights and places that sparkle with the allure of hidden pleasures and local lore. \r\n\r\nDiscover a stairway that transports you from the depths of the ocean to the heights of outer space; take a spin class amidst the grand elegance of a repurposed 1920s movie palace; or slide down a century-old sundial that sits at the center of what was once California's first racetrack for cars. \r\n\r\nThis is the real San Francisco. Strung together, the 111 experiences gathered here tell the B-side story of the city once romantically known as the Paris of the West. ", "asin": "3954516098", "rank": "43199", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/41l4DSYth6L.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}