{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 184, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Nathanael West is best known for his novel The Day of the Locust (1939) which shows the seedy side of trying to make it as an actor in LA. He wrote four short novels, all satirizing the American Dream, but died at age 37 when he ran a stop sign and an oncoming car killed him and his wife (F. Scott Fitzgerald had died just the day before). West penned Miss Lonelyhearts during the grip of the depression, which highlights the sadness and desperation of the times. The protagonist, which West only refers to as “Miss Lonelyhearts,” works as an advice columnist for a newspaper. He receives letters from people dealing with abuse, suicidal thoughts, and all kinds of grim realities he isn’t suited to provide advice for. He slips into a state of depression, has hallucinatory fantasies, and starts sleeping with a woman who writes to him for advice. West creates a gritty and raw world that is realistic yet fantastic, ending with a bang that makes the entire book feel like a dream.I love Nathanael West but feel like I missed something with The Day of the Locust. It's on many \"top books about Hollywood,\" and take place in the 30s, so of course I had to read it, but for as much as it was about the geography and architecture of the city it was also about things like cock fights (which I feel like I never need to read again). I think it does show the seedy underbelly of the city well but I just didn't feel like it really went anywhere.Overall West is worth reading. He gives an insight into 30s America and the bleakness of the depression."}, {"review_sentiment": 3.0, "review_text": "I read this book on recommendation from a radio personality.  The prose is well-written, but it is a rather bizarre story, which I rate as about a C."}, {"review_sentiment": 4.0, "review_text": "good condition"}, {"review_sentiment": 5.0, "review_text": "I read it thirty years ago and it still holds up. An American classic."}, {"review_sentiment": 5.0, "review_text": "Great"}, {"review_sentiment": 1.0, "review_text": "Review is for this version. It feels like it's an accident? Like typos on the first page, it almost seems intentional its so bad but what the intent is I have no idea."}, {"review_sentiment": 4.0, "review_text": "While I didn't read this specific edition, as I had a 1960s copy, I assume the story is the same. I listen to the podcast \"You Must Remember This\" and it was mentioned as a story about the pitfalls of Hollywood life - I was surprised that I hadn't heard of it before. This is a quick, easy read with strongly allegorical characters exploring the falsity and destructiveness inherent in each of us.  I think this is an important read in American literature because Nathaniel West believed the American Dream is a sham and I feel like this is how a lot of people in our country feel - cheated, bored, lonely with only the catharsis of violence to look forward to.  I would've liked to have read the edition that also has his other book, Miss Lonelyhearts, as I think the two together would've been interesting for comparing the arc of development in in West's theory of the American Dream, as he grew older."}, {"review_sentiment": 5.0, "review_text": "Saw this recommended by Paul Theroux and I am really glad I read it. Not a happy, feel-good read but a darn good book."}, {"review_sentiment": 5.0, "review_text": "Good deal! I would tell my friend about this, he need one. My daughter will love it!  Excellent experience fast shipping and the product is satisfactorily functional for it's intended purpose. great product,exceptional customer service"}, {"review_sentiment": 5.0, "review_text": "One of the few books I've ever read twice"}]}, "authors": ["Nathanael West"], "isbn": "8087830261", "longitude": -118.244476, "periods": ["1900s"], "title": "The Day of the Locust", "word_cloud": "best know show seedy side try actor write short novel satirize american die age run stop sign oncoming car kill wife die pen grip depression highlight sadness desperation time protagonist refers work advice columnist newspaper receive letter people deal abuse suicidal thought kind grim reality suit provide advice slip state depression hallucinatory fantasy start sleep woman write advice create gritty raw world realistic yet fantastic end bang make entire feel love feel miss something many top place course much geography architecture city also thing cock fight feel never need think show seedy underbelly city well feel really go read give insight bleakness depression recommendation radio personality prose rather bizarre story rate good condition thirty year ago still hold american classic great version feel accident typo first page almost seem intentional bad intent idea specific edition copy assume story listen must mentioned story pitfall life surprise hear quick easy strongly allegorical character explore falsity destructiveness inherent think important american literature believe american sham feel lot people country feel cheat bore lonely catharsis violence look forward edition also think together compare arc development theory american grow older recommend really glad not happy darn good good deal need daughter experience fast ship product satisfactorily functional intend purpose great product exceptional customer service ever twice", "genres": ["Fiction & Literature"], "summary": "\"The Day of the Locust\" is the celebrated 1939 novel about the Great Depression, set in Hollywood, California, its over-arching themes dealing with the alienation and desperation of a broad group of odd individuals who exist at the fringes of the Hollywood movie industry. \r\n\r\nIn 1998, the Modern Library ranked The Day of the Locust #73 on its list of the 100 best English-language novels of the 20th century. Time magazine included the novel in its list of 100 best English-language novels from 1923 to 2005.", "asin": "8087830261", "rank": "218247", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/51YhjsElnGL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}