{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1483, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "I did not serve in Vietnam nor did I support the war.... however, the reading of this journey by so many who did raked my skin raw.... with both guilt and admiration.  I know parts, if not all, of this story will stay with me for a lifetime."}, {"review_sentiment": 5.0, "review_text": "I read this 5-6 years ago and I still think of it."}, {"review_sentiment": 5.0, "review_text": "This is one of the best military themed books ever written.  I have read a couple of dozen books on the Vietnam War.  I had Staff NCOs who were there in places like Hue during the Tet Offensive but never really told their story in graphic detail.  This book allowed me to understand what it like being there similar to the only other book in its class which was James Webb's Fields of Fire.  Everything written in this book is honest, descriptive and painful at times.  Marines should feel right at home. ...there it is..."}, {"review_sentiment": 5.0, "review_text": "Fascinating read."}, {"review_sentiment": 3.0, "review_text": "Marlantes gave detailed illustrations of the Vietnam jungle from a grunts perspective. I respect his service and ability to complete an operation in spite of having to follow orders from an incompetent and usually drunk Commander that used Bravo Company casualties to build his resume. It was infuriating.The colorful illustrations and recollections behind the Thousand Yard Stare were memorable.The depiction of black soldiers was condescending and cliche. Every black soldier was gun smuggling, drug dealing, drug using, jive talking or murdering a fellow Marine in his sleep by “fragging”. Their  dialogue was difficult to read and even less believable. Some of the “you be”, “we be” dialogue was reminiscent of Mrs. Clever’s jive talking scene in the movie Airplane, less the humor.Compared to the very detailed descriptions of carnage, puss oozing jungle rot and dehydrated/starving Marines licking morning dew from their ponchos while manning their fighting holes, the black soldier character depiction was lost in Marlante’s translation. It looked conjured.Allowing the fragging Murder of a close friend  to go uninvestigated as an “accidental death”, I just don’t get. Maybe, Marlantes, I mean Mellas was worried that he would become an accidental death in Bravo company’s next operation. I’m still trying to figure it out.A very fictional sequel to Matterhorn, elaborating on a cold fragging Murder investigation  might make for an interesting read or movie."}, {"review_sentiment": 5.0, "review_text": "Great book, worth the time to read."}, {"review_sentiment": 4.0, "review_text": "The story of US Marines Bravo Company attack of (fictional) Matterhorn mountain, Eiger hill, and Sky Cap landing zone in 1967. Shows the lunacy of the attack orders based on commanders' ambition for career advancement (getting a higher body count of dead North Vietnamese soldiers than the body count of dead US Marines). The story ends in the \"fragging\" of the Bravo commanding officer and the murder gets treated by the military as an accidental death........"}, {"review_sentiment": 5.0, "review_text": "Our daughter bought this book for her dad.  He has yet to read it.  I chose it from the bookshelf a few days ago, and I was immediately transported back in time to 1966 when I was waiting on pins and needles for the next letter from my newlywed husband in Vietnam.  His letters would arrive covered in red dirt and would contain stories so like those in this book. Like Lt. Mellas, he spent his time in Vietnam in the \"bush.\"  No one who hasn't walked in their shoes can truly understand what these men (teens and early 20's) went through.Marlantes is an incredibly gifted writer.  Action just blasts off his pages.  He has introduced a remarkable hero, one who is flawed, terribly frightened, and yet is unwittingly courageous.  He is honest and compassionate.  Mellas's experiences will bring you both heartsickness and hilarity.  While I did not want to put it down, I did not want to end it.This book is one I will never forget.  It's a keeper.  I will reread it  in a few years.  Buy this book.  Once you open it, forget about any projects you have planned."}, {"review_sentiment": 5.0, "review_text": "Painful, beautiful, frightening all at the same time. Every word, every page skillfully depicts the unvarnished and unique experience of Marines, in and out of battle.  You are transported to a time and place few of us wish to remember, exposed to the raw terror, boredom, and the consequence of  battle decisions driven by ego and career advancement that defined this war, and likely every war."}, {"review_sentiment": 5.0, "review_text": "This is a moderately lengthy, but gripping, readable novel about the United States Marines In Viet Nam in the late 1960s.  The novel is semi biographical in that the author was a Marine platoon lieutenant in Viet Nam during the time frame of the novel.  There were times the action was quite intense and I could not put the book down until a chapter was over.In the past I had made a study of semi biographical novels written by American Veterans after World War II.  Some are well known, some, not so much.  I had read numerous such novels.  At this moment, I do have to say that I liked this novel more than any of them.  This may be because I am from the Viet Nam era.  However, I greatly admired the efforts and sacrifices of the so called \"greatest generation\".  I think it is simply that this is an extremely well written novel.The author attended Yale University and then served in the Marine Corps in Viet Nam.  Of the novels I alluded to above, this novel most put me in mind of \"The Naked And The Dead\" by Norman Mailer, who attended Harvard and then served in the Pacific Theater.  However I strongly preferred \"Matterhorn\" to the Mailer novel.  Neither of these novels involve unadulterated \"flag waving\".  However I found \"Matterhorn\" to be more balanced and the Mailer novel more dark.  Although celebrated, personally I did not care for \"The Naked And The Dead\".On the other hand, Leon Uris also wrote a semi biographical novel about the Marines in the Pacific in World War II, \"Battle Cry\".  While a good novel, Leon Uris was a much younger, less sophisticated writer when he wrote \"Battle Cry\".  Hence \"Battle Cry\" is a more positive, but less mature novel than \"Matterhorn\".  Of course Leon Uris went on to become an really excellent author.As is common for me, I read this novel on Kindle while simultaneously listening to this novel on audiobook.  The narrator was Bronson Pinchot.  Mister Pinchot's narration was excellent and added to my reading enjoyment.  However I also needed to read the novel visually due to a lot of scenic descriptions as well as the expected informal jargon that was used by the characters.In summary I found this to be an excellent reading experience.  As far as a semi autobiographical war novel by an American Service Veteran, this may be my favorite.  Thank You..."}]}, "authors": ["Karl Marlantes"], "isbn": "881706050X", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "Matterhorn: A Novel of the Vietnam War", "word_cloud": "serve support however read journey many rake skin raw guilt admiration know part story stay lifetime year ago still think best military theme ever write couple dozen place never really told story graphic detail allow understand similar class write honest descriptive painful time right home fascinate marl antes give detailed illustration jungle grunt perspective respect service ability complete operation spite follow order incompetent usually drunk use casualties build colorful illustration recollection depiction black soldier condescend cliche black soldier gun smuggle drug deal drug use jive talk murder fellow sleep drag dialogue difficult even le believable dialogue reminiscent jive talk scene movie detailed description carnage pus ooze jungle rot lick morning dew poncho man fight hole black soldier character depiction lose translation look drag close friend go investigated accidental death get maybe mean worry accidental death company next operation still try figure fictional sequel elaborate cold dragging investigation interesting movie worth time story attack fictional mountain hill land zone lunacy attack order base commander ambition career advancement get higher body count dead vietnamese soldier body count dead story end drag command officer murder get treated military accidental death daughter buy dad yet choose day ago immediately transport back time wait pin needle letter newlywed husband letter cover red dirt story spend time bush one walk shoe truly understand men teen early go incredibly gift writer blast page introduce remarkable hero flaw terribly frighten yet unwittingly courageous honest compassionate experience heartsickness hilarity want put want end never forget keeper reread year once open forget project plan painful beautiful frightening time word page skillfully depict unvarnished unique experience battle transport time place wish exposed raw terror boredom consequence battle decision drive ego career advancement define likely moderately lengthy grip readable late semi biographical author platoon lieutenant time frame time action quite intense chapter make study semi biographical novel write american well know much numerous novel moment say like era however greatly admire effort sacrifice call greatest generation think simply extremely well write author attend serve novel allude put attend serve however strongly prefer novel involve unadulterated flag wave however find balance dark celebrate personally care dead hand also write semi biographical good much younger le sophisticated writer write positive le mature course go become really excellent common simultaneously listen narrator narration excellent add reading enjoyment however also need visually due lot scenic description well expect informal jargon use summary find excellent read experience far semi autobiographical", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "An incredible publishing story—written over the course of thirty years by a highly decorated Vietnam veteran, a New York Times best seller for sixteen weeks, a National Indie Next and a USA Today best seller—Matterhorn has been hailed as a “brilliant account of war” (New York Times Book Review). \r\n\r\nMatterhorn is an epic war novel in the tradition of Norman Mailer’s The Naked and the Dead and James Jones’s The Thin Red Line. It is the timeless story of a young Marine lieutenant, Waino Mellas, and his comrades in Bravo Company, who are dropped into the mountain jungle of Vietnam as boys and forced to fight their way into manhood. \r\n\r\nStanding in their way are not merely the North Vietnamese but also monsoon rain and mud, leeches and tigers, disease and malnutrition. Almost as daunting, it turns out, are the obstacles they discover between each other: racial tension, competing ambitions, and duplicitous superior officers. But when the company finds itself surrounded and outnumbered by a massive enemy regiment, the Marines are thrust into the raw and all-consuming terror of combat. The experience will change them forever.\r\n\r\nMatterhorn is a visceral and spellbinding novel about what it is like to be a young man at war. It is an unforgettable novel that transforms the tragedy of Vietnam into a powerful and universal story of courage, camaraderie, and sacrifice: a parable not only of the war in Vietnam but of all war, and a testament to the redemptive power of literature.", "asin": "881706050X", "rank": 0, "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/41ywkakMdvL.jpg", "country": "Hanoi", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}