{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 3, "rating": 2.9, "reviews": [{"review_sentiment": 1.0, "review_text": "When I ordered this item, I ordered another item from another supplier. This one, wasn't received, however it is already paid."}, {"review_sentiment": 5.0, "review_text": "Wish I had this available on my 2008 trip.But, now I can retrace my steps."}, {"review_sentiment": 3.0, "review_text": "I wanted to really love this little journal.  It has a wealth of information including maps for the area (I bought Rome, too).  However, practically speaking, I found it difficult to keep a good journal on these small pages.  It was more useful as a trip planner to carry along for reference, although frankly, the maps are so small they were useless to me.  I would definitely consider it again, but only as a planner."}]}, "authors": ["Moleskine"], "isbn": "8883707362", "longitude": 12.3345898, "periods": ["Recent Releases"], "title": "Moleskine City Notebook Venezia (Venice)", "word_cloud": "order item order item supplier receive however already pay wish available retrace step want really love little journal wealth information include map area buy however practically speak find difficult good journal small page useful trip planner carry along reference frankly map small useless definitely planner", "genres": ["Guide Books"], "summary": "The first guidebook you write yourself.\r\n\r\nWhether traveling by foot, boat or gondola, you can trace your way through this historic city with the Moleskine City Notebook Venice, with the official trademark of the Municipality of Venice. The Key Map summarizes the overall city layout, showing the sequence and location of the 16 zone maps. Map of the waterbus system and list of stations, plus the alphabetical street index of the zone maps. Blank pages for jotting down notes and recording your thoughts, stories and memories. 32 removable sheets for loose notes and exchanging messages. 12 translucent sticky sheets for tracing your routes and sharing itineraries. A 96-page tabbed archive for collecting everything that matters most and keeping it at your fingertips. The first 6 tabs are printed; the others await your personalization with the enclosed adhesive labels. \r\n\r\nEach pocket sized Moleskine City Notebook is thread bound and has a cardboard bound cover with rounded corners, acid free paper, three bookmarks, an elastic closure and an expandable inner pocket that contains the Moleskine history.", "asin": "8883707362", "rank": "2064472", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/5108siWEOCL.jpg", "country": "Italy", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}