{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 6.2443382, "ratings": {"num_ratings": 5, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "I really liked this book, great short stories written by foreigners who have lived or visited Colombia, and their relationship with Gabo's writings. I enjoyed it very much."}, {"review_sentiment": 5.0, "review_text": "Excellent book."}, {"review_sentiment": 5.0, "review_text": "This is a book for every expat who lives in or has lived in Colombia and those who think they might. I'd include all Colombians in this recommendation as well but I think that while they'd find it interesting, they've long since understood the message. I initially started this book only for the subject matter and really didn't expect to like it, as I usually don't appreciate essays or short stories, they always seem to leave me wanting. But it has been only 6 months since my exodus from Bogota and this brought back so many memories and added an extra Gabo shine to them that I found myself wanting to go back immediately! I only wish I'd had this to read before living in Colombia. The accounts in this book really show the influence of magic realism in the everyday mundane. Sadly, though I'd read all of Gabo's works I suffer from a North American pragmatism that usually means I see things in the context of us versus them. In my \"us\" category we don't see magic, we see reasons, absurdity, and superstition. Magic belongs to \"them.\" Alas, after reading this book, I don't want to be a pragmatic North American anymore, I want to be Colombian!"}, {"review_sentiment": 5.0, "review_text": "I enjoyed reading this book as I had visited Colombia, and  reading the essays  brought all the magic  of the country back to me. I would highly recommend this book to anyone thinking of visiting Colombia. All the writers brought something different  of the country to the reader."}, {"review_sentiment": 5.0, "review_text": "A fascinating and very readable collection of essays about Colombia and Gabriel Garcia Marquez. Some of the essays here are really top-notch writing, others less so, but all of them contribute in some way, creating a wealth of different perspectives on the country and its celebrated author. Recommended not just for fans of Gabo, but also for those who want a deeper insight into Colombia."}]}, "authors": ["Caroline Doherty de Novoa"], "isbn": "9584662023", "longitude": -75.573553, "periods": ["2000s", "Recent Releases"], "title": "Was Gabo an Irishman?: Tales from Gabriel García Márquez's Colombia", "word_cloud": "really like great short story write foreigner live visited relationship writing enjoy much excellent expat live live include recommendation well think interest long understood message initially start subject matter really expect usually appreciate essay short story always seem leave wanting month exodus bring back many memory add extra shine find want back immediately wish live account really show influence magic realism everyday mundane sadly work suffer north american pragmatism usually mean see thing context versus category see magic see reason absurdity superstition belong read want pragmatic want colombian enjoy read visit read essay bring magic country highly anyone think visit writer bring something different country fascinating readable collection essay essay really write others le contribute way create wealth different perspective country celebrate author fan also want deeper insight", "genres": ["Essay", "Travel Writing"], "summary": "In Bogotá, a Spanish humanitarian worker attends a funeral without a body, as a storm of yellow butterflies swirls outside. In the jungle, an English anthropologist finds a tiny peace community fighting to preserve their way of life. And, somewhere in the Andes, an Australian coffee farmer confronts a guava-throwing witch in his tree. \r\n\r\nThis collection brings together 26 personal essays by writers from across the world, all of whom have lived in Gabriel García Márquez’s homeland. For some, his words are the key to unlocking the enigma of Colombia. For others, living in the land of magic realism brings them a new understanding of his works. \r\n\r\nWith magical rain, young lovers, grumpy old men, ghosts, conflict, politics, heartache, music, madness and more, these non-fiction stories are at once both singularly Colombian and universal in theme.", "asin": "9584662023", "rank": "513819", "city": "Medellin", "image": "https://images-na.ssl-images-amazon.com/images/I/51rLEnkoFSL.jpg", "country": "Colombia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}