{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 6.2443382, "ratings": {"num_ratings": 53, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "I truly enjoyed 'a comedy of errors'. Still, a month after reading it, I chuckleabout the 'Colombian time \"a dinner party\"'.I look forward to your next 'Banana Skin Flip Flops' posting and your nextbook(s)."}, {"review_sentiment": 5.0, "review_text": "Great book for anyone who has an interest in Colombia, is dating a Colombian, who has Colombian roots, who will be visiting Colombia, or who just wants a good laugh! As an American living in Colombia, it was great to learn some of the background on strange cultural phenomena I have encountered here, and to have put into words some of the most outrageous Colombianisms, but most of all, it's just very entertaining! I highly recommend it!"}, {"review_sentiment": 5.0, "review_text": "This book is a wonderful aproximation to colombian culture, it's witty, well written and insightful"}, {"review_sentiment": 5.0, "review_text": "Having just returned from Colombia and being married to a Colombian lady, I can honestly say this is a must read for anyone who is interested in contemporary Colombian culture.The book has great humor while also having a serious and informative side. Would highly recommend for travelers and locals alike"}, {"review_sentiment": 5.0, "review_text": "Funny and greatly illustrated, this little book is an essential read for lovers of Colombia!It has been a pure joy to read the authors’ serious “take” on all the little crazy traits of Colombian society that I used to boil over futilely. Now I know I wasn't being too sensitive - someone even wrote a book about it! I worked in Colombia for a few years and the place drove me crazy. It drove me crazy yet I fell in love with the place. This book – through a fine sense of humor and great illustrations -  provides serious answers enabling the reader to end any emotional contortions and embrace Colombia for all the good and the bad. So thank you for this precious little book. Muchisimas gracias!"}, {"review_sentiment": 5.0, "review_text": "While researching Colombia, I was incredibly excited to find this book and quickly ordered it. I was not disappointed. Victoria Kellaway and Sergio Lievano give an essential and light hearted primer to the people and land of this charmingly quirky country. It also does a good job of giving a person a sense of the breadth of this country: Colombia has everything from Caribbean beaches, snowy mountains and Amazonian rainforest, not to mention the Athens of South America- Bogotá. And lest we forget the real jewel of the country, los Colombianos. Do yourself a favor and get a copy of this book."}, {"review_sentiment": 5.0, "review_text": "Packed with insightful and humourous information about a country too long forgotten. An excellent resource for those looking to move to Colombia, but also clever enough that even critical Colombians (my partner) will have something new to learn. Finally a vindication for why this country is so hard to explain, so bereft of logic, and yet so charming that you find yourself bracing happily for more crazy.This book is a must for Colombians, expats, and Latinophiles. Enjoy!"}, {"review_sentiment": 5.0, "review_text": "Very entertaining"}, {"review_sentiment": 4.0, "review_text": "Nice book, fun."}, {"review_sentiment": 5.0, "review_text": "I purchased this book after being in Colombia for almost a year.  It is very funny, easy to read, light-hearted and right on point!  I wish I had known some of the \"customs\" described in the book earlier - it certainly would have made life a little less stressful! I have also sent the book to family in Australia who plan on visiting Colombia soon so they can arm themselves with some knowledge in advance."}]}, "authors": ["Victoria Kellaway and Sergio J Lievano"], "isbn": "9585835401", "longitude": -75.573553, "periods": ["2000s", "Recent Releases"], "title": "Colombia a Comedy of Errors", "word_cloud": "truly enjoy still month read chuckle about time dinner party look forward next post netbook anyone interest date colombian colombian root visit want good laugh american living great learn background strange cultural phenomenon encounter put word outrageous entertain highly recommend wonderful approximation colombian culture witty well write insightful have return marry colombian lady honestly say anyone interested contemporary colombian great humor also serious informative side highly recommend traveler local alike greatly illustrate little essential lover pure joy author serious little crazy trait colombian society use boil futilely now know sensitive someone even write work year place crazy drive crazy yet fell love place fine sense humor great illustration provide serious answer enable end emotional contortion embrace good bad precious little gracious research incredibly excite find quickly order disappoint give essential light heat primer people land charmingly quirky country also good job give person sense breadth country everything beach snowy mountain amazonian rain forest mention lest forget real jewel country loci copy pack insightful humorous information country long forget excellent resource look move also clever enough even critical partner something new learn vindication country hard explain bereft logic yet charm bracing happily expat very entertaining fun purchase almost year funny easy right point wish know custom describe earlier certainly life little le stressful also send family plan visit soon arm knowledge advance", "genres": ["Travel Writing"], "summary": "Colombia a comedy of errors tells the story of all forty-eight million Colombians, examining the country's history, people, culture, colombianomics and justice. It is a funny, full-colour book that became a bestseller in Colombia in the first month of its release. The book was written by British journalist Victoria Kellaway and Brit-Colombian artist and writer Sergio J. Lievano and reveals the secrets behind a nation that has drama and comedy seeped into its bloodstream. The pair study the country with an eye for detail that will surprise everyone, from the most knowledgeable reader to those who don't have a clue about the country.\r\n\r\nThis lively, humour-filled book has a serious heart and makes for an ideal gift or travel companion. It contains more than 160 illustrations, caricaturing famous faces (including Shakira, Bolivar, Botero and Uribe) as well as all those ordinary Colombians fighting to survive their country's daily contradictions. Colombia a comedy of errors is an inspiring journey into the very depths of the Colombian gene and what it means for Colombians everywhere.", "asin": "9585835401", "rank": "204324", "city": "Medellin", "image": "https://images-na.ssl-images-amazon.com/images/I/51FtSYJr40L.jpg", "country": "Colombia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}