{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 22.2793278, "ratings": {"num_ratings": 2, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Everything was great....the seller...the speed...and of course Paul French."}, {"review_sentiment": 4.0, "review_text": "Paul French's book has an excellent concept as a one-volume historical narrative of the immense subject of the foreign journalists who worked in China from the Opium Wars to the time of Mao. Clearly French knows a lot about China in general and this specialised subject in particular. He has researched the subject at length in many sources: his end notes and bibliography are good. The book is entertaining, interesting and insightful about a colourful swathe of journalistic personalities and their impact in Chinese politics and society, and in global perception of China through several periods. Colourful characters were so common among these journalists that many are full-length individual biographical subjects in their own right. Probably the most extraordinary of all: Emily Hahn 1905-1997 of The New Yorker. She was one of the most versatile, prolific and risk-taking authors of the 20th century. Hahn lived for six years in Shanghai's red light district, smoked opium, kept a largely uncontrollable pet gibbon she called Mr Mills, and variously \"lived in sin\" with the noted Shanghai poet/publisher Shao Xunmei 邵洵美 1906-1968 and the British intelligence officer and important author/scholar in his own right, Charles Boxer 1904-2000, who she eventually married after bearing him a daughter out of wedlock.Very reasonably, French at the beginning of his book explains that he has not attempted a complete directory of the foreign press corps in China. As this would be probably impossible and likely dreary, '...the characters represented in this book represent a selection of the major figures and those who piqued my interest for one reason or another.' Unsurprisingly, the author tends to view the experiences and attitudes of the imperialist generation of China correspondents, like G.E. Morrison 1862-1920 and H.G.W. Woodhead 1883-1959, somewhat superficially through the prism of current rather than contemporary values. French really gets into his stride, and his capacity to weave a coherent and engaging narrative history from many complex threads becomes most compelling with his telling of the story of the large international press corps that covered China through the 1930s and '40s.Given this demonstrated capacity to master complexity, it is surprising and disappointing to see simple errors which good research and editing should have eliminated.Surprising errors which have leapt off the page (or, more accurately, the Kindle screen) at me include:1. French refers to Bertram Lenox Simpson's memoir of the Siege of the Legations during the Boxer uprising in 1900 - 'Indiscreet Letters From Peking', under his pseudonym B. L. Putnam Weale - as \"a 1921 book\". In fact, it was first published in 1907.2. French refers to the co-founder of the South China Morning Post newspaper in Hong Kong as Arthur Cunningham. He was Alfred Cunningham (1870-1918).3. French says the Peking Post's editor, Gilbert Reid, was the only American wounded in the Siege of the Legations. This overlooks the wounding of Major John Twiggs Myers, who commanded the US Marine Corps detachment at the American Legation and was famously in the thick of fighting, and numerous other American casualties. For example, the most up-to-date casualty breakdown by nationality I can immediately find shows 7 American killed, 9 wounded by the end of July - with two more weeks left in the siege. ('The Siege of the Peking Legations: A Diary' by Lancelot Giles, ed. L. R. Marchant, University of Western Australia Press, 1970).4. Reference in chapter 8 to \"writing flare\".5. Reference in chapter 9 to Evans Fordyce Carlson, an ex-US Marine turned correspondent, having been \"in the army\". The US Marine Corps is a naval force as are most marines of any nation, part of the United States Navy, not the US Army.Such obvious simple errors as these are minor irritations that somewhat undermine confidence in the historical accuracy of the book, and in assertions or analysis of facts in which the reader may not be expert.  This is a pity because the overall concept and the scope of source material used are excellent, and the book is a good read. Paul French and his publishers need to be more rigorous in editing out these and presumably other as yet undetected errors in their next edition. Highly recommended subject to these cautions. The Kindle edition is well formatted and easy to read and use for reference."}]}, "authors": ["Paul French"], "isbn": "9622099823", "longitude": 114.1628131, "periods": ["1800s", "1900s", "Recent Releases"], "title": "Through the Looking Glass: China's Foreign Journalists from Opium Wars to Mao", "word_cloud": "everything great seller speed course excellent concept historical narrative immense subject work time french know lot general specialize subject particular research subject length many source end note bibliography good entertain interesting insightful colorful swathe journalistic personality impact chinese politics society global perception several period colorful character common many individual biographical subject right probably extraordinary emily versatile prolific author century live year red light district smoke kept largely uncontrollable pet gibbon call variously live sin note british intelligence officer important right eventually marry bear daughter reasonably french begin explains attempt complete directory press corp probably likely dreary character represent represent selection major figure pique interest reason author tend view experience attitude imperialist generation correspondent somewhat superficially prism current rather contemporary value french really get stride capacity weave coherent engage narrative history many complex thread become compel tell story large international press corp cover demonstrate capacity master complexity surprising disappointing see simple error good research edit error leap page accurately screen french refers uprise letter peking pseudonym fact first publish french refers newspaper alfred say editor wound overlook wound command detachment american famously thick fight numerous american casualty example casualty nationality immediately find show kill wounded end week leave siege chapter write flare chapter turn correspondent army naval force marine nation part obvious simple error minor irritation somewhat undermine confidence historical accuracy assertion analysis fact pity overall concept scope source material use excellent good publisher need rigorous edit presumably yet undetected error edition recommend subject caution edition well format easy use reference", "genres": ["History", "Journalism"], "summary": "The convulsive history of foreign journalists in China starts with the newspapers printed in the European Factories of Canton in the 1820s and ends with the Communist revolution in 1949. It also starts with a duel between two editors over the China’s future and ends with a fistfight in Shanghai over the revolution. \r\n\r\nThe men and women of the foreign press experienced China's history and development; its convulsions and upheavals; revolutions and wars. They had front row seats at every major twist and turn in China’s fortunes. They reported on the Opium Wars and the Taiping Rebellion; saw the Summer Palace burn; endured the Boxer Rebellion; witnessed the Qing Dynasty's death, the birth of a Nationalist China and its struggle for survival against rampant warlordism. They followed the rise of the Communists, total war and then revolution. \r\n\r\nWhen the Unequal Treaties were signed, the foreign press were there; when foreign troops occupied and looted Beijing in 1900 they were present too; they saw the Republic born in 1911 and an increasingly politically strident China assert itself on May Fourth 1919. Foreign journalists stood in the streets witnessing the blood letting of the First Shanghai War in 1932 and then were blown of their feet by the bombing of the Second Shanghai War in 1937. They tracked Japanese aggression from the annexation of Manchuria, the fall of Shanghai and the Rape of Nanjing through to the assault on the Nationalist wartime capital of Chongqing as they cowered in the same bomb shelters as everybody else. \r\n\r\nThey witnessed the fratricidal Civil War, the flight of Chiang Kai-shek to Taiwan and the early days of the People's Republic. The old China press corps were the witnesses and the primary interpreters to millions globally of the history of modern China and they were themselves a cast of fascinating characters. \r\n\r\nLike journalists everywhere they took sides, they brought their own assumptions and prejudices to China along with their hopes, dreams and fears. They weren't infallible; they got the story completely wrong as often as they got it partially right. They were a mixed bunch – from long timers such as George 'Morrison of Peking'; glamorous journalist-sojourners such as Peter Fleming and Emily Hahn; and reporter-tourists such as Ernest Hemingway and Martha Gellhorn along with numerous less celebrated, but no less interesting, members of the old China press corps. \r\n\r\nA fair few were drunks, philanderers and frauds; more than one was a spy – they changed sides, they lost their impartiality, they displayed bias and a few were downright scoundrels and liars. But most did their job ably and professionally, some passionately and a select few with rare flair and touches of genius.", "asin": "9622099823", "rank": "2992052", "city": "Hong Kong", "image": "https://images-na.ssl-images-amazon.com/images/I/51D7KwdKZtL.jpg", "country": "China", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}