{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 112, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "great book for those of us who are beginning the adventure of Turkish cuisine!  Even though the Turks don't really improvise much off their classics, the amount of classics that they have in their repertoire is amazing.  This books covers a lot of those bases."}, {"review_sentiment": 5.0, "review_text": "This book is great! It has the perfect compilation of Turkish recipes and it walks you through all the steps very easily. All dishes are extremely well classified. In addition, it tells you how to cook some sauces/broths/etc. for your other meals/dishes which I find very helpful and interesting."}, {"review_sentiment": 5.0, "review_text": "The recipies are great. So.e ingredients can be hard to find in the store, but Amazon has them."}, {"review_sentiment": 5.0, "review_text": "This is a wonderful cookbook in every way.  I went to Turkey hoping to find food as good.  With the exception of one small town on the coast I never did.  And the lentil soup is absolutely the best.I've had the book since it first came out, when the lentil soup was featured in Gourmet magazine.  I have given it to friends, on whose shelves I'm happy to say it looks as dog-eared as it does on mine.  So thanks Ozcan Ozan, for giving us such a wonderful opportunity to cook the foods of Turkey."}, {"review_sentiment": 5.0, "review_text": "Great place, great food, great prices !! Located  Iin Boston harbor area, best local Mediterranean cuisine.  Owner Ozcan is humble and friendly."}, {"review_sentiment": 5.0, "review_text": "Yummmii"}, {"review_sentiment": 5.0, "review_text": "Love it, the book came with the cutest note from the seller. Thanks for that. Made my day!"}, {"review_sentiment": 5.0, "review_text": "This is a beautiful book.  The instructions were very easy to follow and I loved the other information from the author.  I have made two recipes to rave reviews!  I purchased this book after it was recommended by in an article in the Food section of the Washington Post.  The hardest part of this was finding one or two of the specialty ingredients.  I look forward to making many more of the recipes from this book.  This is a great purchase!"}, {"review_sentiment": 5.0, "review_text": "It isn't often that I buy a cookbook where EVERY recipe is something I would make.  I bought this particular book because the author is Turkish and I wanted to cook Turkish food the way a Turk would cook it.  There were a couple of spices that my local grocery store doesn't carry (and never heard of) but Penzey's came to the rescue.  If you live in a large metropolitan area, you shouldn't have a problem finding everything.  In a smaller town, you may need to rely on an online source for some of those hard-to-find ingredients.  Well worth it.... I'd recommend it to anyone who wants to cook authentic Turkish food."}, {"review_sentiment": 4.0, "review_text": "I wanted an authentic Turkish cookbook. I purchased this due to numerous excellent reviews. Very good cookbook! I'm delighted o use this over holidays."}]}, "authors": ["Ozcan Ozan"], "isbn": "962593944X", "longitude": 28.9651646, "periods": ["1900s"], "title": "Sultan's Kitchen: A Turkish Cookbook", "word_cloud": "great begin adventure cuisine even really improvise much classic amount classic repertoire amaze cover lot base great perfect compilation recipes walk step easily dish extremely well classify addition tell cook find helpful interesting recopies great ingredient hard find store amazon wonderful way go hop find food good exception small town coast never lentil soup absolutely first come lentil soup feature magazine give friend shelf happy say look mine so thanks give wonderful opportunity cook food great place great food great price locate harbor area best local cuisine humble friendly yummmii come cutest note seller thanks make day beautiful instruction easy follow love information author make recipe rave review purchase recommended article section hardest part find specialty ingredient look forward make many recipe great purchase often buy recipe something buy particular author want cook food way couple spice local grocery store carry never hear come rescue live large metropolitan area problem find everything smaller town rely online source ingredient recommend anyone want authentic food want authentic purchase due numerous excellent review very good delight use holiday", "genres": ["Food and Wine"], "summary": "\"Not to be missed…a gem. This is real Old World cooking…devotees of Mediterranean cuisine would be remiss not to add this book to their collection.\"—Boston Globe\r\n\r\nRanging from favorites such as chickpea pilaf to richly stewed lamb on a bed of eggplant, today's Turkish cuisine is fresh, distinctive, and flavorful—the result of over five centuries of culinary tradition.\r\n\r\nWhether you want to warm up with a tangy Peasant Soup (a hearty chicken soup), or top off a meal with a mouthwatering Pistachio Seomina Cake, The Sultan's Kitchen will show you how to produce the exotic tastes and aromas of Turkish food in your own kitchen. It offers over 125 healthy, delicious recipes that are both easy to prepare and based on readily available ingredients.\r\n\r\nThe Sultan's Kitchen also shows you how to prepare a complete Turkish dinner, and features stunning images by photographer Carl Tremblay. This Turkish cookbook is sure to inspire you to create meals fit for a Sultan!", "asin": "962593944X", "rank": "71485", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51NdPf8jZXL.jpg", "country": "Turkey", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}