{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {}, "authors": ["Michael Chabon"], "isbn": "9780812983586", "longitude": 0.0, "periods": ["1900s"], "title": "The Amazing Adventures of Kavalier & Clay", "word_cloud": "", "genres": ["Comics & Graphic Novels"], "summary": "WINNER OF THE PULITZER PRIZE\r\n\r\nThe beloved, award-winning The Amazing Adventures of Kavalier &amp; Clay, a Michael Chabon masterwork, is the American epic of two boy geniuses named Joe Kavalier and Sammy Clay.\r\n\r\nA “towering, swash-buckling thrill of a book” (Newsweek), hailed as Chabon’s “magnum opus” (The New York Review of Books), The Amazing Adventures of Kavalier &amp; Clay is a triumph of originality, imagination, and storytelling, an exuberant, irresistible novel that begins in New York City in 1939.\r\n\r\nA young escape artist and budding magician named Joe Kavalier arrives on the doorstep of his cousin, Sammy Clay. While the long shadow of Hitler falls across Europe, America is happily in thrall to the Golden Age of comic books, and in a distant corner of Brooklyn, Sammy is looking for a way to cash in on the craze. He finds the ideal partner in the aloof, artistically gifted Joe, and together they embark on an adventure that takes them deep into the heart of Manhattan, and the heart of old-fashioned American ambition.\r\n\r\nFrom the shared fears, dreams, and desires of two teenage boys, they spin comic book tales of the heroic, fascist-fighting Escapist and the beautiful, mysterious Luna Moth, otherworldly mistress of the night. Climbing from the streets of Brooklyn to the top of the Empire State Building, Joe and Sammy carve out lives, and careers, as vivid as cyan and magenta ink.\r\n\r\nSpanning continents and eras, this superb book by one of America’s finest writers remains one of the defining novels of our modern American age.\r\n\r\nNEW YORK TIMES BESTSELLER", "asin": "0812983580", "rank": "9370", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/5125ypnkW9L.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}