{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 53.3497645, "ratings": {}, "authors": ["Edward Rutherfurd"], "isbn": "9780345472359", "longitude": -6.2602732, "periods": ["Recent Releases", "500-1400s"], "title": "The Princes of Ireland: The Dublin Saga", "word_cloud": "", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "From the internationally bestselling author of London and Sarum -- a magnificent epic about love and war, family life and political intrigue in Ireland over the course of seventeen centuries. Like the novels of James Michener, The Princes of Ireland brilliantly interweaves engrossing fiction and well-researched fact to capture the essence of a place.\r\n\r\nEdward Rutherfurd has introduced millions of readers to the human dramas that are the lifeblood of history. From his first bestseller, Sarum, to the #1 bestseller London, he has captivated audiences with gripping narratives that follow the fortunes of several fictional families down through the ages. The Princes of Ireland, a sweeping panorama steeped in the tragedy and glory that is Ireland, epitomizes the power and richness of Rutherfurd’s storytelling magic.\r\n\r\nThe saga begins in pre-Christian Ireland with a clever refashioning of the legend of Cuchulainn, and culminates in the dramatic founding of the Free Irish State in 1922. Through the interlocking stories of a wonderfully imagined cast of characters -- monks and noblemen, soldiers and rebels, craftswomen and writers -- Rutherfurd vividly conveys the personal passions and shared dreams that shaped the character of the country. He takes readers inside all the major events in Irish history: the reign of the fierce and mighty kings of Tara; the mission of Saint Patrick; the Viking invasion and the founding of Dublin; the trickery of Henry II, which gave England its foothold on the island in 1167; the plantations of the Tudors and the savagery of Cromwell; the flight of the “Wild Geese”; the failed rebellion of 1798; the Great Famine and the Easter Rebellion. With Rutherfurd’s well-crafted storytelling, readers witness the rise of the Fenians in the late nineteenth century, the splendours of the Irish cultural renaissance, and the bloody battles for Irish independence, as though experiencing their momentous impact firsthand.\r\n\r\nTens of millions of North Americans claim Irish descent. Generations of people have been enchanted by Irish literature, and visitors flock to Dublin and its environs year after year. The Princes of Ireland will appeal to all of them -- and to anyone who relishes epic entertainment spun by a master.", "asin": "0345472357", "rank": "48246", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/51umI96ADLL.jpg", "country": "Ireland", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}