{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 45.5202471, "ratings": {}, "authors": ["Colin Meloy"], "isbn": "9780062024701", "longitude": -122.6741949, "periods": ["2000s", "Recent Releases"], "title": "Wildwood", "word_cloud": "", "genres": ["Fiction & Literature", "Fantasy", "Action & Adventure"], "summary": "For fans of The Chronicles of Narnia comes the first book in the Wildwood Chronicles, the New York Times bestselling fantasy adventure series by Colin Meloy, lead singer of the Decemberists, and Carson Ellis, acclaimed illustrator of The Mysterious Benedict Society. Now in paperback!\r\n\r\nIn Wildwood, Prue and her friend Curtis uncover a secret world in the midst of violent upheaval—a world full of warring creatures, peaceable mystics, and powerful figures with the darkest intentions. And what begins as a rescue mission becomes something much greater as the two friends find themselves entwined in a struggle for the very freedom of this wilderness. A wilderness the locals call Wildwood.\r\n\r\nWildwood captivates readers with the wonder and thrill of a secret world within the landscape of a modern city. It feels at once firmly steeped in the classics of children's literature and completely fresh at the same time. The story is told from multiple points of view, and the book features more than eighty illustrations, including six full-color plates, making this an absolutely gorgeous object.\r\n\r\n\"Dark and whimsical, with a true and uncanny sense of otherworldliness, WILDWOOD is the heir to a great tradition of stories of wild childhood adventure. It snatched me up and carried me off into a world I didn’t want to leave.\" Michael Chabon", "asin": "0062024701", "rank": "33416", "city": "Portland", "image": "https://images-na.ssl-images-amazon.com/images/I/61h-DHwyNmL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}