{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 40.4167047, "ratings": {}, "authors": ["Julia Fox"], "isbn": "9780345516046", "longitude": -3.7035825, "periods": ["1500s"], "title": "Sister Queens: The Noble, Tragic Lives of Katherine of Aragon and Juana, Queen of Castile", "word_cloud": "", "genres": ["Biography", "History"], "summary": "NEW YORK TIMES BESTSELLER\r\n\r\nThe history books have cast Katherine of Aragon, the first queen of King Henry VIII of England, as the ultimate symbol of the Betrayed Woman, cruelly tossed aside in favor of her husband’s seductive mistress, Anne Boleyn. Katherine’s sister, Juana of Castile, wife of Philip of Burgundy and mother of the Holy Roman Emperor Charles V, is portrayed as “Juana the Mad,” whose erratic behavior included keeping her beloved late husband’s coffin beside her for years. But historian Julia Fox, whose previous work painted an unprecedented portrait of Jane Boleyn, Anne’s sister, offers deeper insight in this first dual biography of Katherine and Juana, the daughters of Spain’s Ferdinand and Isabella, whose family ties remained strong despite their separation. Looking through the lens of their Spanish origins, Fox reveals these queens as flesh-and-blood women—equipped with character, intelligence, and conviction—who are worthy historical figures in their own right. \r\n\r\nWhen they were young, Juana’s and Katherine’s futures appeared promising. They had secured politically advantageous marriages, but their dreams of love and power quickly dissolved, and the unions for which they’d spent their whole lives preparing were fraught with duplicity and betrayal. Juana, the elder sister, unexpectedly became Spain’s sovereign, but her authority was continually usurped, first by her husband and later by her son. Katherine, a young widow after the death of Prince Arthur of Wales, soon remarried his doting brother Henry and later became a key figure in a drama that altered England’s religious landscape. \r\n\r\nOusted from the positions of power and influence they had been groomed for and separated from their children, Katherine and Juana each turned to their rich and abiding faith and deep personal belief in their family’s dynastic legacy to cope with their enduring hardships. Sister Queens is a gripping tale of love, duty, and sacrifice—a remarkable reflection on the conflict between ambition and loyalty during an age when the greatest sin, it seems, was to have been born a woman.\r\n", "asin": "B0050DIWMA", "rank": "143594", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/51-OeFz%2BOOL.jpg", "country": "Spain", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}