{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 30.048819, "ratings": {}, "authors": ["Leila Aboulela"], "isbn": "9780802145758", "longitude": 31.243666, "periods": ["1900s", "Recent Releases"], "title": "Lyrics Alley", "word_cloud": "", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Lyrics Alley is the evocative story of an affluent Sudanese family shaken by the shifting powers in their country and the near-tragedy that threatens the legacy they've built for decades.\r\n\r\nIn 1950's Sudan, the powerful Abuzeid dynasty has amassed a fortune through their trading firm. With Mahmoud Bey at its helm, they can do no wrong. But when Mahmoud's son, Nur, the brilliant, handsome heir to the business empire, suffers a debilitating accident, the family stands divided in the face of an uncertain future. As British rule nears its end, the country is torn between modernizing influences and the call of traditions past—a conflict reflected in the growing tensions between Mahmoud's two wives: the younger, Nabilah, longs to return to Egypt and escape \"backward-looking\" Sudan; while Waheeba lives traditionally behind veils and closed doors. It's not until Nur asserts himself outside the cultural limits of his parents that his own spirit and the frayed bonds of his family begin to mend.\r\n\r\nMoving from Sudanese alleys to cosmopolitan Cairo and a decimated postcolonial Britain, this sweeping tale of desire, loss, despair, and reconciliation is one of the most accomplished portraits ever written about Sudanese society at the time of independence.\r\n\r\n“Beautifully rendered . . . The prose is smooth and clear. . . . As a tale of stricken love between two souls, Lyrics Alley is impressive.” The Guardian\r\n", "asin": "B004RPY4AG", "rank": "303070", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51Pbgfj8JaL.jpg", "country": "Egypt", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}