{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 40.4862174, "ratings": {}, "authors": ["David Adams Richards"], "isbn": "9781611457193", "longitude": -74.4518173, "periods": ["1900s"], "title": "Mercy Among the Children", "word_cloud": "", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Mercy Among the Children received effusive praise from the critics, was nominated for a Governor General’s Award and won the Giller Prize.\r\n\r\nIt is seen, however, as being at odds with literary fashion for concerning itself with good and evil and the human freedom to choose between them — an approach that puts Richards, as Maclean’s magazine says, firmly in the tradition of Tolstoy and Dostoevsky. \r\n\r\nAs a boy, Sydney Henderson thinks he has killed Connie Devlin when he pushes him from a roof for stealing his sandwich. He vows to God he will never again harm another if Connie survives. Connie walks away, laughing, and Sydney embarks upon a life of self-immolating goodness. In spite of having educated himself with such classics as Tolstoy and Marcus Aurelius, he is not taken seriously enough to enter university because of his background of dire poverty and abuse, which leads everyone to expect the worst of him. His saintly generosity of spirit is treated with suspicion and contempt, especially when he manages to win the love of beautiful Elly. Unwilling to harm another in thought or deed, or to defend himself against false accusations, he is exploited and tormented by others in this rural community, and finally implicated in the death of a 19-year-old boy.\r\n\r\nLyle Henderson knows his father is innocent, but is angry that the family has been ridiculed for years, and that his mother and sister suffer for it. He feels betrayed by his father’s passivity in the face of one blow after another, and unable to accept his belief in long-term salvation. Unlike his father, he cannot believe that evil will be punished in the end. While his father turns the other cheek, Lyle decides the right way is in fighting, and embarks on a morally empty life of stealing, drinking and violence.\r\n\r\nA compassionate, powerful story of humanity confronting inhumanity, it is a culmination of Richards’ last seven books, beginning with Road to the Stilt House. It takes place in New Brunswick’s Miramichi Valley, like all of his novels so far, which has led some urban critics to misjudge his work as regional. The setting is extremely important in Richards’ work, “because the characters come from the soil”.\r\n\r\n\"Astonishing... fiercely imagined and brilliantly rendered.\" The Globe and Mail", "asin": "161145719X", "rank": "688689", "city": "New Brunswick", "image": "https://images-na.ssl-images-amazon.com/images/I/41VBc9snMgL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}