{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 50.0874654, "ratings": {}, "authors": ["Patrick Leigh Fermor"], "isbn": "9781590171660", "longitude": 14.4212535, "periods": ["1900s"], "title": "Between the Woods and the Water", "word_cloud": "", "genres": ["Memoir", "Travel Writing"], "summary": "On Foot to Constantinople: From The Middle Danube to the Iron Gates \r\n\r\nContinuing the epic foot journey across Europe begun in \"A Time of Gifts\"\r\n\r\nThe journey that Patrick Leigh Fermor set out on in 1933—to cross Europe on foot with an emergency allowance of one pound a day—proved so rich in experiences that when much later he sat down to describe them, they overflowed into more than one volume. Undertaken as the storms of war gathered, and providing a background for the events that were beginning to unfold in Central Europe, Leigh Fermor’s still-unfinished account of his journey has established itself as a modern classic. Between the Woods and the Water, the second volume of a projected three, has garnered as many prizes as its celebrated predecessor, A Time of Gifts. \r\n\r\nThe opening of the book finds Leigh Fermor crossing the Danube—at the very moment where his first volume left off. A detour to the luminous splendors of Prague is followed by a trip downriver to Budapest, passage on horseback across the Great Hungarian Plain, and a crossing of the Romanian border into Transylvania. Remote castles, mountain villages, monasteries and towering ranges that are the haunt of bears, wolves, eagles, gypsies, and a variety of sects are all savored in the approach to the Iron Gates, the division between the Carpathian mountains and the Balkans, where, for now, the story ends.", "asin": "1590171667", "rank": "50205", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/51w43rFrKLL.jpg", "country": "Czechia", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}