{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 22.2793278, "ratings": {}, "authors": ["Jane Gardam"], "isbn": "9781933372136", "longitude": 114.1628131, "periods": ["1900s", "Recent Releases"], "title": "Old Filth (Old Filth Trilogy)", "word_cloud": "", "genres": ["Fiction & Literature", "Mystery & Suspense", "Satire"], "summary": "Book 1/3 in the Old Filth Trilogy\r\n\r\nSir Edward Feathers has had a brilliant career, from his early days as a lawyer in Southeast Asia, where he earned the nickname Old Filth (FILTH being an acronym for Failed In London Try Hong Kong) to his final working days as a respected judge at the English bar. Yet through it all he has carried with him the wounds of a difficult and emotionally hollow childhood. \r\n\r\nNow an eighty-year-old widower living in comfortable seclusion in Dorset, Feathers is finally free from the regimen of work and the sentimental scaffolding that has sustained him throughout his life. He slips back into the past with ever mounting frequency and intensity, and on the tide of these vivid, lyrical musings, Feathers approaches a reckoning with his own history. Not all the old filth, it seems, can be cleaned away.\r\n\r\nBorrowing from biography and history, Jane Gardam has written a literary masterpiece reminiscent of Rudyard Kipling's Baa Baa, Black Sheep that retraces much of the twentieth century's torrid and momentous history. Feathers' childhood in Malaya during the British Empire's heyday, his schooling in pre-war England, his professional success in Southeast Asia and his return to England toward the end of the millennium, are vantage points from which the reader can observe the march forward of an eventful era and the steady progress of that man, Sir Edward Feathers, Old Filth himself, who embodies the century's fate.\r\n\r\n\"This mordantly funny novel examines the life of Sir Edward Feathers, a desiccated barrister known to colleagues and friends as Old Filth. After a lucrative career in Asia, Filth settles into retirement in Dorset. With anatomical precision, Gardam reveals that, contrary to appearances, Sir Edward's life is seething with incident: a \"raj orphan,\" whose mother died when he was born and whose father took no notice of him, he was shipped from Malaysia to Wales (cheaper than England) and entrusted to a foster mother who was cruel to him. What happened in the years before he settled into school, and was casually adopted by his best friend's kindly English country family, haunts, corrodes, and quickens Filth's heart; Gardam's prose is so economical that no moment she describes is either gratuitous or wasted.\" The New Yorker", "asin": "1933372133", "rank": "61278", "city": "Hong Kong", "image": "https://images-na.ssl-images-amazon.com/images/I/51xesQsewvL.jpg", "country": "China", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}