{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 31.2253441, "ratings": {"num_ratings": 37, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent collection of short stories from people who understand China and who, more importantly, can write well."}, {"review_sentiment": 5.0, "review_text": "Very enjoyable read of the many varied experiences by ex-pats living in China."}, {"review_sentiment": 4.0, "review_text": "I love travel essays and I love China, so purchasing this book of essays by Chinese expats and long term travelers was a no-brainer.  Overall, I enjoyed the book.  It provided a glimpse into China I have not fully experienced in my travels to the country, it was mostly entertaining, and was an easy read.  I'm unwilling to give it 5 stars, however, as some essays were just poorly written, difficult to follow, and sometimes abruptly ending.  The final official chapter of the book was a disappointing chapter to end on, despite its humorous composition, as the subject matter was entirely centered on finding a prostitute for the author's friend.  I found this personally objectionable, especially given the extraordinary exploitation of women through the large and ever growing sex trade in China as well as southeast Asia."}, {"review_sentiment": 2.0, "review_text": "Very disappointing. The authors are not at their best."}, {"review_sentiment": 3.0, "review_text": "I'm not finished reading this, but it has not reached my excited expectations. I spent time in China, too, a long time ago - just a few years after the Cultural Revolution. I loved my time in China, it was life-changing for me. And I have many funny stories from my visits - as West meets East, differences in culture, society, really everything. I thought the stories in this book would be recounting such moments. But, and maybe I haven't read the truly good/great stories yet - so far, I'm not sure what I've read; postings in one's journal might come closest to describe what I've read. I keep waiting for the 'story' to begin, then the writing stops. I'm really disappointed. The writing itself was fine. But so far, the authors don't seem to have anything they want to say. This is a great idea for a book ...  Just not this book."}, {"review_sentiment": 4.0, "review_text": "I enjoyed reading this book. I have spent over five years living in the dongbei region of China. Most of these stories I experienced myself or knew someone who knew someone who had. I thought that it expressed the real China which can be difficult to do."}, {"review_sentiment": 4.0, "review_text": "From crazy to cynical to innocent..this book is not really about China. It's about the odd slice of humanity that calls China their home away from home."}, {"review_sentiment": 5.0, "review_text": "I wasn’t sure what to expect from a book titled ‘Unsavory Elements’, wondering if it was on a similar theme to the TV series ‘Banged Up Abroad’. What I found was that the majority of the stories in this anthology are non-controversial, where more often than not the moral compasses of the contributors are tested by the East-West conundrum, the ‘Red’ tape of Chinese bureaucracy, and the customs, etiquette and mindset of a diverse and hospitable population.That said, if you or someone you know have ever woken up in a hotel room to find a thief raking through your valuables and decided to tackle them (Peter Hessler), or as a first-time traveller to Asia checked out a go-go bar (Nury Vittachi) or more, then these lively additions to the book won’t shock you and you’ll appreciate the measured and well-intentioned way they are narrated.I particularly enjoyed reading about the love, life and loss in cross-cultural relationships, the simple yet eye-opening thrill of being on the road and sampling the unusual yet tempting platters offered up by this enigmatic land. Pete Spurrier’s train-hopping along the Silk Road with only a few yuan in his pocket is an excellent example of classic storytelling at its best.Simon Winchester capitalises on New China’s embracing of technology to exchange a breakdown in the Gobi desert for 5-star luxury. Dominic Stevenson turns the tables on the guards and avoids a brainwashing in a Shanghai prison. Kay Bratt unintentionally draws a crowd while shopping with the young Chinese orphan in her care. Susan Conley describes how relocating to Park Avenue in Beijing with her husband and two young boys is not quite the real estate its title initially suggests.Some memorable quotes in this book too, such as Graham Earnshaw’s ‘Push an issue into the Chinese gray, and it just meanders off course like a dud torpedo.’ And my particular favourite, Peter Hessler’s ‘The quail appeared to have fallen asleep.’ (You’ll see!)Editor Tom Carter scores another goal for China-themed literature with these insightful accounts from authors who have, for a variety of reasons, found themselves, heads spinning, in the Middle Kingdom.###Chris Thrall is the author of the memoir `Eating Smoke: One Man's Descent into Drug Psychosis in Hong Kong's Triad Heartland.'"}, {"review_sentiment": 4.0, "review_text": "This book is great on many levels.1. The variety of authors is just huge. I count no less than 28 different authors. There is no need to get tired of one author's writing style because you don't dwell on any one person long enough to have that problem.2. Each vignette is about 10 pages long and completely self-contained. (Don't you just hate it when an author takes several hundred pages to make a very few points? Ayn Rand, anyone?)3. The book can be read out of order.4. A lot of the stories are very accurate portrayals of real foreign people. (From the Tom Carter story, a particularly apt quote: \"New China:A refugee camp for the world's losers.\" Not particularly kind, but not inaccurate. I might also mention that 90% of the people who teach in China are men. There is no secret that most men go there for Asian women.)5. One can really appreciate the large amount of work that went into compiling so many stories-- and not just because of the number of names, but because of the heft of some of the authors. (Peter Hessler, for example, was included in the book.)6. The compilation also seems to give an introduction to all of the foreign characters you are likely to meet while working in China. The Volunteer. The Lovelorn Man. The Cultural Imbecile. He-Who-Either-Never-Got-Started-On-A-Career-or-Was-Downsized-Out-Of-A-Job. The \"Kingpin.\" And on and on and on.There was one bad point, and that is that some of the stories were not that great-- but they were tolerable owing to their brevity.This book works best when you have a few free minutes here or there and don't want to get too deeply enmeshed into a plot/ story.Verdict: This book is worth the time (about 2 afternoons of reading time) and worth the money ($9.99 on Kindle). I highly recommend it."}, {"review_sentiment": 4.0, "review_text": "I’m a newbie female expat in China (6 months and counting!) and was glad to have the kindle version of this book on hand during my “culture shock stage”, which served as a comforting host during my lowest moments of acclimation. The stories walk us through the lifecycle of expatriate life in China, from clumsy first arrivals to well-oiled “old China hands”. The only author I’d heard of before was Peter Hessler, but I more closely identify with the perspectives of Michael Levy and Matt Muller, who write about their difficulties adjusting to China’s casual adherence to ethics and standards. But at the rate I am currently making friends here, I can someday soon expect experiences similar to Susie Gordon’s Shanghai bender and, hopefully, Jocelyn Eikenburg’s inter-racial romance. Nice book, will turn to it often for insight, diversion and commiseration."}]}, "authors": null, "isbn": "9881616409", "longitude": 121.4888922, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Unsavory Elements: Stories of Foreigners on the Loose in China", "word_cloud": "excellent collection short people understand importantly write well very enjoyable many varied experience live love travel essay love purchasing essay chinese expat long term traveler overall enjoy provide glimpse fully experience travel country mostly entertaining easy unwilling give star however essay poorly write difficult follow sometimes abruptly end final official chapter disappoint chapter end humorous composition subject matter entirely center find prostitute author friend find personally objectionable especially give extraordinary exploitation woman large ever grow sex trade well southeast very disappoint author best finish read reach excited expectation spend time long time year cultural love time many funny visit meet difference culture society really everything think recount moment maybe truly yet far sure post journal closest describe keep wait begin write stop really disappoint write fine far author seem anything want say great idea enjoy read spend year live dongle region experience someone know someone think express real difficult crazy cynical really odd slice humanity call home away home sure titled element wonder similar theme tv series find majority anthology often moral compass contributor test conundrum tape bureaucracy custom etiquette mindset diverse hospitable say someone know ever woken hotel room find thief rake valuable decide tackle traveler check bar lively additions shock appreciate measure way particularly enjoy read love life loss relationship simple yet thrill road sample unusual yet tempt platter offer enigmatic land yuan pocket excellent example classic storytelling capitalists embrace technology exchange breakdown desert luxury turn table guard avoids brainwash prison unintentionally draw crowd shopping young describe relocate husband young boy quite real estate title initially memorable quote issue gray meander course dud particular favorite quail appear fall see editor score goal literature insightful account author variety reason find head spin author memoir great many variety author huge count le different author need tired author write style dwell person long enough vignette page long completely do author take several page make point anyone lot accurate portrayal real foreign people story particularly apt quote refugee camp world losers not particularly kind inaccurate also people teach men secret men asian really large amount work go compile many number name heft author example include compilation also seem give introduction foreign character likely meet work bad point great tolerable owe work best free minute want deeply enmesh worth time afternoon read time worth money highly recommend newbie female expat month count glad kindle version hand culture shock stage serve comfort host lowest moment acclimation walk expatriate life clumsy first arrival old hand author hear closely identify perspective write difficulty adjust casual adherence ethic standard rate currently make friend someday soon experience similar bender hopefully romance turn often insight diversion commiseration", "genres": ["Essay", "Travel Writing"], "summary": "Featuring entirely original writings written exclusively for this work, this anthology is filled with 28 essays from foreigners who live or have lived in China for a significant period of time. The book contains beautiful and enlightening stories about China from such noteworthy writers as Simon Winchester, Peter Hessler, Susan Conley, and Alan Paul, among others. Through their personal stories, they illustrate the many sides of Chinese life—the weird, the fascinating, and the appalling—and share what it’s like to live, learn, and love as an outsider in a land unlike any other in the world.\r\n\r\n\"Great vignettes from world class writers...a celebration of the outsider's experience in China, in all of its juiciness and fetid rancour.\" Time Out Shanghai ", "asin": "9881616409", "rank": "1556446", "city": "Shanghai", "image": "https://images-na.ssl-images-amazon.com/images/I/61YpNm33wsL.jpg", "country": "China", "story_arc": ["Tragedy", "Things only get worse"]}