{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 7, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "I met John Arthur Duff in Hong Kong in June of 1968.  My future brother-in-law, Lousis B. Miller sent me an envelop flap with Arther's brothers name and numner on it so if I ever made it to H.K. I could look him up.  In June. Just before I rotated back home from my tour of service, I contacted Charles Duff and, it so happened that J. A. Duff was visiting his brother.Arther gave us the grand tour of Hong Kong and the surrounding area and told us the history of the \"The escape from Hong Kong\".I visited him a few times when he lived in Pleasanton, California.An incretable human being and an incretable life.His papers are secures at Stanford University."}, {"review_sentiment": 5.0, "review_text": "I’ve been meaning to read this book since it first came out, and having finally read it, I wish I hadn’t waited so long. This is a gripping, fascinating tale, wonderfully told. It’s more than just a boys' adventure story, as some reviews suggest. It’s moving, funny, and exhilarating. This is nonfiction as it should be written. It’s an escape story full of great characters, each one painted as a real person, set against a dramatic background of super-interesting history. Of course, there's Chan Chak, the one-legged admiral. But there’s also the American woman journalist who keeps a pet gibbon and smokes cigars and opium. There’s the former cavalry officer who tried to shoot a cobra and missed, bringing down a local’s hut instead. There’s “Two-Gun Cohen,” son of a Polish Jew who was born in London, moved to Canada, became a general in the Chinese Army, and then moved on to arms-dealing, and poker-playing, while wearing a trademark white suit. These characters are made for a big Hollywood blockbuster. George Clooney, buy the rights to this immediately! It has all the makings of a fantastic, old-school buddy movie."}, {"review_sentiment": 4.0, "review_text": "It was a very interesting book. Good to hear exactly what happened to my father John Jacob Forster, in his last hours. We were interned at Stanley Camp but it took many years for my mother to learn much of what happened and we were never able to find his grave. Writing the book was a service to us and our children."}, {"review_sentiment": 5.0, "review_text": "ONE OF THE MOST DARING EXPLOITS OF WW2"}, {"review_sentiment": 5.0, "review_text": "Tim Luard ’s book brings this little known story of a Chinese-led British escape from the occupiying Japanese forces engulfing Hong Kong during the largest war in our history – World War II.Christmas Day 1941, Hong Kong’s Admiral Chan Chak, the Chinese government’s chief agent in Hong Kong surrendered to the invading Japanese army. He then led more than 60 Chinese, British and Danish intelligence, naval and marine personnel made a dramatic escape under fire as the Japanese Army engulfed Hong Kong. This story has been told in parts through individual diaries, letters and memoirs, but now Tim has a massed them into a well balanced and entrilling adventure story – that will interest military historians of all wars. WFAs reviewed in the July/August 2014 issue of An Cosantóir (The Defender) The Irish Defence Forces Magazine by Sgt Wayne Fitzgerald - dfmagazine.ie - military.ie"}, {"review_sentiment": 5.0, "review_text": "I found this to be an amazing read, one of those books that it really is hard to put down.Though it's almost ancient history, the author makes it feel totally contemporary and the reader experiences the fall of Hong Kong and the fear and tension of escape its horrors almost as if one were actually there.Rarely have I been so totally absorbed by a book as this one.  Its author has done a remarkable job."}, {"review_sentiment": 5.0, "review_text": "This is one of the most exciting stories to come out of the Pacific during WWII: a British Navy fleet, a one-legged Chinese Admiral, his 6 foot 3 Chinese aide-de-camp, and loyal bodyguard escaped Hong Kong as the Japanese invaded on Christmas Day. This group jumped ship at Apleichau, was rescued by five torpedo motor boats, and made its way to Mirs Bay up near the China border. From there, Chinese guerillas--who worshipped one-legged Admiral Chan Chak--helped the group move past Japanese-occupied China into Free China. Most of the British Navy group eventually made it to Burma, thousands of miles from southern China. Tim Luard writes in such a way that the book seems less than a history text and more like a spy thriller. What a story!"}]}, "authors": ["Tim Luard"], "isbn": "9888083767", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "Escape from Hong Kong: Admiral Chan Chak's Christmas Day Dash, 1941", "word_cloud": "meet future send envelop flap brother name number ever make rotate back home tour service contact happen visit give grand surround area tell history visit time lived inscrutable human inscrutable paper secures mean first come finally wish wait long grip fascinating tale wonderfully tell boys adventure story review suggest move funny exhilarate nonfiction write story full great character paint real person set dramatic background history course also woman journalist keep pet gibbon smoke cigars former cavalry officer try shoot cobra miss bring local hut instead son born move become general move wear trademark white suit character make big blockbuster right immediately make fantastic buddy movie interest good hear exactly happen father last hour intern take many year mother learn much happen never able find grave service child of bring little known story british occupy japanese force engulf largest war history chinese government chief agent surrender invade japanese army lead chinese british danish intelligence naval marine personnel make dramatic fire japanese engulf story tell part individual diary letter memoirs mass well balance en trilling adventure story interest military historian war review irish find amaze really hard put almost ancient history author make feel totally contemporary experience fall fear tension horror almost actually totally absorb author do remarkable job excite story come fleet chinese foot loyal bodyguard escape invade group jump ship rescue torpedo motor boat make way border chinese guerrilla worship help group move group eventually make thousand mile southern write way seem le history text spy thriller story", "genres": ["History", "WWII"], "summary": "On 25 December 1941, the day of Hong Kong’s surrender to the Japanese, Admiral Chan Chak – the Chinese government’s chief agent in Hong Kong – and more than 60 Chinese, British and Danish intelligence, naval and marine personnel made a dramatic escape from the invading army. They travelled on five small motor torpedo boats – all that remained of the Royal Navy in Hong Kong – across Mirs Bay, landing at a beach near Nan’ao. Then, guided by guerrillas and villagers, they walked for four days through enemy lines to Huizhou, before flying to Chongqingor travelling by land to Burma.\r\n\r\nThe breakout laid the foundations of an escape trail jointly used by the British Army Aid Group and the East River Column for the rest of the war. Chan Chak, the celebrated ‘one-legged admiral’, became Mayor of Canton after the war and was knighted by the British for his services to the Allied cause. His comrade in the escape, David MacDougall, became head of the civil administration of Hong Kong in 1945.\r\n\r\nThis gripping account of the escape draws on a wealth of primary sources in both English and Chinese and sheds new light on the role played by the Chinese in the defence of Hong Kong, on the diplomacy behind the escape, and on the guerillas who carried the Admiral in a sedan chair as they led his party over the rivers and mountains of enemy-occupied China.\r\n\r\nEscape from Hong Kong will appeal not just to military and other historians and those with a special interest in Hong Kong and China but also to anyone who appreciates a good old-fashioned adventure story.\r\n\r\nTim Luard is a former Beijing correspondent for the BBC World Service.", "asin": "9888083767", "rank": "3579900", "city": "", "image": "https://images-na.ssl-images-amazon.com/images/I/51GioCOR4xL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}