{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 29.3797091, "ratings": {"num_ratings": 12, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Even though I'm more into non-fiction, this book was a pleasure to read. It's one of those books where the plot hooks you right from the start. You quickly get attached to the characters and their struggles become your own struggles making this book hard to put down. Highly highly recommend."}, {"review_sentiment": 4.0, "review_text": "Read as part of a round-the-world challenge, this Kuwaiti novel was quite compelling, following the plight of Filipino immigrant workers in Kuwait.Narrator Jose/ Isa (his Filipino and Kuwaiti names) is the child of a poor Filipino maid by the son of the wealthy family she works for. Pressure from his scandalized grandmother means the maid is sent back home with her child ... but always the vague promise that he can return one day when the time is right.Brought up in poverty, with a horrible grandfather and prostitute aunt, Jose never quite knows who he is. \"I was more like a bamboo plant, which doesn't belong anywhere in particular. You can cut off a piece of the stalk and plant it without roots in any piece of ground...the stalk sprouts new roots and starts to grow again in thew new ground with no past, no memory.\"His mother doesn't press Catholicism on him, convinced he'll become a muslim one day. And then one day he gets to visit his father's homeland...A sad tale which brings out the prejudice and snobbishness of a supposedly religious country.Not the greatest literature, but quite a good read, maybe *3.5"}, {"review_sentiment": 3.0, "review_text": "This book has an interesting theme of a young man trying to find his place, caught between the worlds of his mother and father. From that perspective, it was an interesting theme, especially because these two worlds were places I am less familiar with, the Philippines and Kuwait. Like a method actor, Alsanousi had to immerse himself in the culture of the country to make himself first feel all its nuances before communicating them to his readers. It was interesting to explore those cultures with him, but I felt the story would have been more poignant with a little more angst and a little less verbiage. I know this book won an International Award for Arab Literature, and as I'm not familiar with the books it was competing against, it is difficult for me to comment here. I do think Alsanousi is a talented writer, so it will be interesting to follow his career as he matures.Lois W. SternAuthor/EditorCreator of Tales2Inspire (an Authors Helping Authors project)"}, {"review_sentiment": 5.0, "review_text": "I've just finished this and I was pretty impressed by the way the author managed to show the full extent of Jose's position as a Philippino/Kuwaiti, both in the Philippines and in Kuwait. I was also surprised to find that this is in fact a translation from Arabic, so full marks to Jonathan Wright, the translator.Jose's mother, Josephine, was a Philippina maid in the Al-Tarouf household in Kuwait, when she fell in love with Rashid, the wayward, only son. Rashid loved his baby son but his mother was horrified and turned him out of the house. Not surprisingly, Josephine lost her job and she and her son were deported back home.There is no news from Rashid for many years and Josephine's searches come back cold. But although Jose is raised in the Philippines, he always carries his father's promise that he will eventually return to be a son of Kuwait.The book description reveals that he does manage to return to Kuwait, as a young man, so I'm not giving away any spoilers there. What he finds though, is probably the book's strongest part - it shows how the people are not primarily Kuwaiti, nor from a particular sect or class, their strongest allegiance is to the family name and it is pride in this that rules all their actions. Nothing must bring shame on the family, and a half Philippino son is not something to be proud of.I can see why The Bamboo Stalk was winner of the 2013 International Prize for Arab Fiction - chosen both for its literary qualities and for “its social and humanitarian content.”It is an excellent insight into the issues behind the phenomenon of expat workers into wealthy GCC countries.Definitely recommended."}, {"review_sentiment": 5.0, "review_text": "Was highly recommended by a friend...I recommend it too!"}, {"review_sentiment": 5.0, "review_text": "The main character's mom leaves her homeland to work as a maid in a country with a different culture, different language. It's an act that many foreign workers do today.This was a compelling story of the son who grapples with having a Muslim name with a Filipino face. He often finds that he is accepted in neither his father's  or mother's homeland as he grows from child to young adult."}, {"review_sentiment": 2.0, "review_text": "Went on forever...only finished because it was for bookclub.  Redundant"}, {"review_sentiment": 5.0, "review_text": "Read this wonderful book"}, {"review_sentiment": 5.0, "review_text": "The wonderfully written novel tells the story of a young men trying to find his identity between two nations,two religions and two parents. It is also giving us an insider view of what it means to live in two countries, Philippines and Kuwait with a very fresh and original narrative. I loved it and ready it very fast."}, {"review_sentiment": 5.0, "review_text": "Great book, Amazing author, no one can describe such realities like him, if you want to know more about GCC societies then this book will take you beyond what you expect !"}]}, "authors": ["Saud Alsanousi"], "isbn": "9927101791", "longitude": 47.9735629, "periods": ["2000s", "Recent Releases"], "title": "The Bamboo Stalk", "word_cloud": "even pleasure plot hook right start quickly attached character struggle become struggle make hard put highly recommend part challenge quite compel follow plight immigrant worker name child poor son wealthy family work scandalize grandmother mean maid send back home child always vague promise day time poverty horrible grandfather prostitute aunt never quite know plant belong anywhere particular cut piece plant root piece ground sprout new root start grow thew new ground memory mother press convince become muslim day day get visit father homeland sad tale brings prejudice snobbishness supposedly religious greatest literature quite good maybe interesting theme young man try find place catch world mother father perspective interesting theme especially world place less familiar method actor immerse culture country make first feel nuance communicate reader interest culture felt story little angst little le verbiage know familiar compete difficult comment think talented writer interest follow career author help author project finish pretty impressed way author manage show full extent position also surprise fact translation full mark mother maid household fell son love baby son mother horrify turn house not surprisingly lose job son deport back news many year josephine search come back cold raise always carry father promise eventually son description reveals manage return young man give away spoiler find probably strongest part show people primarily particular sect class strongest allegiance family name pride rule action shame family half son something proud see winner choose literary quality social humanitarian excellent insight issue phenomenon expat worker wealthy recommend highly recommend friend recommend main character mom leave homeland work maid country different culture different language act many foreign worker compel story son grapple name face often find accepted father mother homeland grow child young adult went forever finish book club redundant read wonderful wonderfully write tell story young men try find identity nation religion parent also give insider view mean live country fresh original narrative love ready fast author describe reality want know society take expect", "genres": ["Fiction & Literature"], "summary": "\"Absorbing.\" THE NEW YORKER\r\n\r\nJosephine escapes poverty by coming to Kuwait from the Philippines to work as a maid, where she meets Rashid, an idealistic only son with literary aspirations. Josephine, with all the wide-eyed naivety of youth, believes she has found true love. But when she becomes pregnant, and with the rumble of war growing ever louder, Rashid bows to family and social pressure, and sends her back home with her baby son, José.\r\n\r\nBrought up struggling with his dual identity, José clings to the hope of returning to his father's country when he is eighteen. He is ill-prepared to plunge headfirst into a world where the fear of tyrants and dictators is nothing compared to the fear of 'what will people say'. And with a Filipino face, a Kuwaiti passport, an Arab surname and a Christian first name, will his father's country welcome him?\r\n\r\nThe Bamboo Stalk takes an unflinching look at the lives of foreign workers in Arab countries and confronts the universal problems of identity, race and religion.", "asin": "9927101791", "rank": "1230080", "city": "Kuwait", "image": "https://images-na.ssl-images-amazon.com/images/I/51G%2BztI0IwL.jpg", "country": "Kuwait", "story_arc": ["Tragedy", "Things only get worse"]}