{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 64.145981, "ratings": {"num_ratings": 21, "rating": 4.3, "reviews": [{"review_sentiment": 3.0, "review_text": "The book is super small, about 100 pages and smaller than my hand.  Would not have paid $12 if seen in person, maybe $5.  Haven't read it yet, will update when I do"}, {"review_sentiment": 4.0, "review_text": "Short and simple, but good."}, {"review_sentiment": 4.0, "review_text": "Very good prep for my trip."}, {"review_sentiment": 3.0, "review_text": "Ms. Sigmundsdóttir has done a good job of translating a few of the \"Icelandic Folk Legends: Tales of apparitions, outlaws and things unseen\" but she is of course not their author, as the title seems to indicate \"....by Alda Sigmundsdóttir (Author)\" - she is a translator, a big difference."}, {"review_sentiment": 4.0, "review_text": "I liked it well enough, but the stories all end sort of abruptly, which is the way they traditionally end according ot the author/translator."}, {"review_sentiment": 5.0, "review_text": "Good background for our trip!"}, {"review_sentiment": 5.0, "review_text": "Fantastic book--- just what I expected, thanks guys, very interesting about the hx of Icelands people in their past. Phil"}, {"review_sentiment": 4.0, "review_text": "good resource"}, {"review_sentiment": 5.0, "review_text": "Another fun book to read by Alda!  I love the old stories about trolls, ogres, witches and the sort.  Yea, the bull one is particularly weird.  :)"}, {"review_sentiment": 5.0, "review_text": "After I read “The Little Book of the Icelanders” & “The Little Book of the Icelanders in the Old Days” I was convinced of the wonderful writing skills of the author, so I also bought this book about the “Icelandic Folk Legends”. In return I got a wonderful trip through Icelandic culture and I was able to link some myths to places I visited which made the reading even more enjoyable. I highly recommend this book to everyone who is interested in some historical background about Iceland or just wants to be carried away by these well written folk tales."}]}, "authors": ["Alda Sigmundsdottir"], "isbn": "9935925994", "longitude": -21.9422367, "periods": ["Recent Releases"], "title": "Icelandic Folk Legends: Tales of apparitions, outlaws and things unseen", "word_cloud": "super small page smaller hand pay see person maybe update short simple good very good prep trip do good job translate apparition course author title seem indicate translator big difference like well enough story end sort abruptly way traditionally end accord ot good background trip fantastic expect thanks guy interest h people good resource fun love old story troll ogre witch sort bull particularly weird little convince wonderful write skill author also buy return get wonderful trip culture able link myth place visit make read even enjoyable highly recommend everyone interested historical background want carry away well write", "genres": ["History", "Folklore & Mythology"], "summary": "The Icelandic nation has a long and rich history of storytelling. Throughout centuries characterized by hardship, poverty and dark winters, the Icelanders kept their spirits high and moral values intact by telling each other stories. In this collection of 15 Icelandic folk legends, we get a glimpse of the world-view of the Icelanders in centuries past as they endeavored to understand and cope with the natural phenomena around them. \r\n\r\nThere are stories of malicious ghosts, outlaws living in carved-out boulders, hidden people residing in grassy knolls, trolls that are tripped up by their own stupidity, and much more. In addition, there is one story exemplifying a fairy tale motif that scholars have discovered to be unique to Iceland: that of the good stepmother (The Story of Himinbjörg). \r\n\r\nThroughout we get a powerful sense of the Icelanders' beliefs, values and fears, as well as their strong need to cling to all that was pure and good.", "asin": "9935925994", "rank": "421687", "city": "Reykjavik", "image": "https://images-na.ssl-images-amazon.com/images/I/51b8Fg62L2L.jpg", "country": "Iceland", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}